// тестовый комментарий костина    .
#Область СлужебныйИнтерфейс

// Процедура - Начислить
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура Начислить(Организация,ПериодНачисления,Район,Договор,Документ) Экспорт
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	ПериодНовогоТарифа 								= Константы.энргДеньНачалаПримененияНовогоТарифа.Получить();
	результатЗапроса 								= РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде,Документ<>Неопределено); 	
	КонецПериода  									= КонецМесяца(ПериодНачисления);
	Сч 												= 0;
	ТекДоговор  									= Неопределено;
	ТекОбъектРасчета 								= Неопределено;
	ТекТочкаУчета									= Неопределено;
	ТекНачалоПериода								= Неопределено;
	ТекУслуга 										= Неопределено;
	ТекШкала 										= Неопределено;
	ДокументОбъект									= Неопределено;
	Набор 											= Неопределено;
	ВидНачисления 									= Перечисления.энргВидыНачислений.Начисление;
	ФормулыРасчет 									= Неопределено;
	ПараметрыФормулы 								= Неопределено;
	ТекСпособНачисленияПоФормуле 					= Неопределено;
	СпособРасчетаПоФормуле 							= Неопределено;
	СтрокаОписания 									= Неопределено;
	ОписаниеУслуг 									= Неопределено;
	НормативыПоУслугам 								= Неопределено;
	НачисляемПоФормуле 								= Ложь;	
	СтрокиНабораДоЗаписи 							= Неопределено;	
	НачисленияПоУслугам 							= Новый Соответствие;
	НачисленияПоУслугамОбъекта						= Новый Соответствие;
	
	УслугаТН = Справочники.энргВидыУслуг.НайтиПоНаименованию("Горячее водоснабжение (теплоноситель)");
	УслугаТЭ = Справочники.энргВидыУслуг.НайтиПоНаименованию("Горячее водоснабжение (теплоэнергия)");

	
	ВыборкаДоговор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговор.Следующий() Цикл 
		
		ВыборкаДок = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ДокументСсылка 									= Неопределено;
		
		
		Пока ВыборкаДок.Следующий() Цикл
			
			Если Документ = Неопределено и ДокументСсылка = Неопределено Тогда					
				ДокументСсылка											= ВыборкаДок.ДокументНачисления;
				ДокументОбъект 											= Неопределено;
				ПометкаУдаления 										= ВыборкаДок.ДокументНачисления.ПометкаУдаления;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
					
					ДокументСсылка 										= Документы.бестНачислениеНП.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  									= Документы.бестНачислениеНП.СоздатьДокумент();
					ДокументОбъект.район  								= Район;
					ДокументОбъект.Дата									= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 							= Организация;
					ДокументОбъект.Договор	 							= ВыборкаДок.Договор;
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект										= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 						= Ложь;
				КонецЕсли;
				
				Набор 													= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				
				Если НЕ Договор = Неопределено Тогда
					Набор.ДополнительныеСвойства.Вставить("Договор",	Договор);
					Если ДокументОбъект = Неопределено Тогда
						Набор.Прочитать();
						СтрокиНабораДоЗаписи 							= Набор.Выгрузить();
						СтрокиУдалить 									= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Договор", Договор));
						Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
							СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						Набор.Очистить();
					КонецЕсли;
				КонецЕсли;	
				
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
				КонецЕсли;		
			ИначеЕсли Не Документ = Неопределено Тогда
				Набор 													= Документ.Движения.бестОбъемНачисленийНП;
			КонецЕсли;
			
			Выборка  										= ВыборкаДок.выбрать();
			
			Пока Выборка.следующий() цикл
				
				Если ТекОбъектРасчета <> Выборка.ОбъектРасчета Тогда
					НачисленияПоУслугамОбъекта = Новый Соответствие;	
				КонецЕсли; 
				
				Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ Не ТекНачалоПериода = Выборка.НачалоПериода Тогда
					
					ОписаниеУслуг 											= Новый Массив;
					
					Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
						СтрокаОписания 											= Новый Структура("
						|Услуга, ФормулаРасчета, Поставщик, СпособНачисления, ПриборУчета, НачалоПериода, КонецПериода, ДокументСсылка, КонецПериодаРасчета, ОбъемУслугиПотребленный, ОбъемЗаПрошлыйГод, КоэффициентПропорциональности",
						Выборка.Услуга, Выборка.ФормулаРасчета, Константы.энргПоставщикПоУмолчанию.Получить(), Выборка.СпособНачисления, Выборка.ПриборУчета, Выборка.НачалоПериода, Выборка.КонецПериода, ДокументСсылка, КонецПериодаРасчета, Выборка.ОбъемУслугиПотребленный, Выборка.ОбъемЗаПрошлыйГод, Выборка.КоэффициентПропорциональности); 			
					КонецЕсли;
					ПараметрыФормулы 										= Новый Соответствие;
					НачисленияПоУслугамТочки 								= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					
					НормативыПоУслугам  									= Новый Соответствие;
					НормативыПоУслугам.Вставить(Выборка.Услуга.УникальныйИдентификатор(), 	Выборка.НормаПотребления);			
					
				ИначеЕсли НЕ ТекУслуга = Выборка.Услуга Тогда
					
					Если  Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
						
						СтрокаОписания.Вставить("ПараметрыФормулы", ПараметрыФормулы);
						
					КонецЕсли;
					
					ЕСли СтрокаОписания <> Неопределено Тогда
						
						ОписаниеУслуг.Добавить(СтрокаОписания);
						
						
					КонецЕсли;
					НачисленияПоУслугамТочки.Вставить(ТекУслуга, НачисленияПоШкале);
					
					ПараметрыФормулы 										= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					
					Если  Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
						
						СтрокаОписания 											= Новый Структура("
						|Услуга, ФормулаРасчета, Поставщик, СпособНачисления, ПриборУчета, НачалоПериода, КонецПериода, ДокументСсылка, КонецПериодаРасчета, ОбъемУслугиПотребленный, ОбъемЗаПрошлыйГод, КоэффициентПропорциональности",
						Выборка.Услуга, Выборка.ФормулаРасчета, Константы.энргПоставщикПоУмолчанию.Получить(), Выборка.СпособНачисления, Выборка.ПриборУчета, Выборка.НачалоПериода, Выборка.КонецПериода, ДокументСсылка, КонецПериодаРасчета, Выборка.ОбъемУслугиПотребленный, Выборка.ОбъемЗаПрошлыйГод, Выборка.КоэффициентПропорциональности);
						
					КонецЕсли;
					НормативыПоУслугам.Вставить(Выборка.Услуга.УникальныйИдентификатор(), 		Выборка.НормаПотребления);			
				ИначеЕсли НЕ ТекШкала = Выборка.Шкала Тогда
					НачисленияПоШкале 										= Новый Соответствие;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Выборка.ФормулаРасчета) Тогда
					СтрокаНабора 											= Набор.добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
					СтрокаНабора.Период 									= КонецПериодаРасчета-1;
					СтрокаНабора.Регистратор 								= ДокументСсылка;
					СтрокаНабора.ВидНачисления 								= Перечисления.энргВидыНачислений.Начисление;
					СтрокаНабора.ПериодРасчета 								= ПериодНачисления;
					СтрокаНабора.Поставщик	 								= Константы.энргПоставщикПоУмолчанию.Получить();
					СтрокаНабора.ОбъемУслуги 								= Выборка.ОбъемУслуги * Выборка.КоэффициентПропорциональности;
					СтрокаНабора.ОбъемУслугиПотребленный 					= Выборка.ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
					
					Если Выборка.СодержитПотери И ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) Тогда 
												
						Если Выборка.ГБП = Перечисления.энргРасположениеРесурса.ДоГБП Или Выборка.ГБП = Перечисления.энргРасположениеРесурса.НаГБП Тогда
							ОбъемУслугиОсновной = НачисленияПоУслугамОбъекта.Получить(Выборка.ЗависитОтУслуги);
							Если Не ЗначениеЗаполнено(ОбъемУслугиОсновной) Тогда
								СтрокаНабора.ОбъемУслуги					= 0;
								СтрокаНабора.ОбъемУслугиПотребленный       	= 0;
								ОбъемУслуги									= 0;
								ОбъемУслугиПотребленный       				= 0;
							КонецЕсли;							 
						КонецЕсли;
						
					ИначеЕсли ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и НЕ Выборка.ПривязанаКШкале и НЕ Выборка.РасчетПоФормуле Тогда
						ОбъемУслуги 										= 0;
						ОбъемУслугиПотребленный 							= 0;
						Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
							Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
								ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
								ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
								ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
							КонецЕсли;
						КонецЕсли;
						СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
						СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
					КонецЕсли;
					
					Если Выборка.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ПустаяСсылка() И Выборка.Услуга = УслугаТН ТОГДА  
						ОбъемУслуги 										= 0;
						ОбъемУслугиПотребленный 							= 0;
						
						ЗависимаяУслуга =  УслугаТЭ;
						НормаПотребления = 0.06506;
						Если НЕ НачисленияПоУслугамТочки[ЗависимаяУслуга] = Неопределено Тогда
							Если НЕ НачисленияПоУслугамТочки[ЗависимаяУслуга][Выборка.Шкала] = Неопределено Тогда
								ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[ЗависимаяУслуга][Выборка.Шкала];
								ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги / НормаПотребления;
								ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный / НормаПотребления;
							КонецЕсли;
						КонецЕсли;
						СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
						СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
					КонецЕсли;
					
				КонецЕсли;
				
				КлючШкалы 													= Выборка.Шкала.УникальныйИдентификатор();
				Если НЕ ПараметрыФормулы.Получить(КлючШкалы) = Неопределено Тогда
					ПараметрыФормулы[КлючШкалы].ОбъемУслуги 				= ПараметрыФормулы[КлючШкалы].ОбъемУслуги + Выборка.ОбъемУслуги;
					ПараметрыФормулы[КлючШкалы].ОбъемУслугиПотребленный		= ПараметрыФормулы[КлючШкалы].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
				Иначе
					ПараметрыФормулы.Вставить(КлючШкалы, 	Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
				КонецЕсли; 		
				
				Если НЕ НачисленияПоШкале[Выборка.Шкала] = Неопределено Тогда
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги 			 = НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги + Выборка.ОбъемУслуги;
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный = НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
				Иначе
					НачисленияПоШкале.Вставить(Выборка.Шкала, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
				КонецЕсли;
				
				
				НачисленияПоУслугам.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				НачисленияПоУслугамОбъекта.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				
				//закрытая схема
				Если Выборка.ЗакрытаяСхемаГВС Тогда
					СтрокаНабора.ОбъемУслуги = 0;
				КонецЕсли;
				
				ТекОбъектРасчета 							= Выборка.ОбъектРасчета;
				ТекТочкаУчета								= Выборка.ТочкаУчета;
				ТекНачалоПериода							= Выборка.НачалоПериода;
				ТекУслуга 									= Выборка.Услуга;
				//ТекКонецПериода							= Выборка.КонецПериода;
				ТекШкала 									= Выборка.Шкала;
				
				Сч 	= Сч+1;
				
			КонецЦикла;	
			
			//добавить строки с формулами
			Если Не ОписаниеУслуг = Неопределено Тогда
				
				Если  Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
					
					СтрокаОписания.Вставить("ПараметрыФормулы", ПараметрыФормулы);
					ОписаниеУслуг.Добавить(СтрокаОписания);
					
				КонецЕсли;
				
				ДобавитьСтрокиНачисленияНППоФормуле(ПериодНачисления, Организация, Район, ВыборкаДоговор.Договор, ТекОбъектРасчета, ТекТочкаУчета, ОписаниеУслуг, НормативыПоУслугам, Набор);
			КонецЕсли;
			
			Если Документ = Неопределено и НЕ Набор = Неопределено и (Набор.Количество() > 0 ИЛИ НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0) тогда
				НачатьТранзакцию();
				Попытка 			
					Если НЕ ДокументОбъект  = Неопределено Тогда
						ДокументОбъект.ПометкаУдаления = Ложь;
						ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
						ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
					
					Если НЕ Договор = Неопределено и НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
						Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
							ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
						КонецЦикла;				
					КонецЕсли;
					
					Набор.Записать(Ложь);
					ЗафиксироватьТранзакцию();
				Исключение
					ОписаниеОшибки 											= ИнформацияОбОшибке();
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекДоговор 									= ВыборкаДоговор.Договор;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачисленияПоДолевымСхемам(Организация,ПериодНачисления,Район,Договор,Документ)  Экспорт 
	
	//ГраницыПериода  									= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);	
	//МВТ 												= Новый МенеджерВременныхТаблиц;
	//ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ,Организация,ПериодНачисления,Район,Договор,ГраницыПериода);
	//
	//Запрос 												= Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц 						= МВТ;
	//Запрос.Текст 										= ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам(Договор);
	//
	//Результат  											= Запрос.ВыполнитьПакет();
	//ВыборкаЗначенияТарифов 								= Результат[0].Выбрать();
	//ВыборкаОбъемМКД										= Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаАбоненты										= Результат[2].Выбрать();
	//
	//ТекСтроение											= Неопределено;
	//ТекПомещение  										= Неопределено;
	//ТекУслуга  											= Неопределено;
	//НаборЗаписей 										= Неопределено;
	//
	//ТекМКДАбонентов  									= Неопределено;
	//ТекПомещениеАбонентов  								= Неопределено;
	//ТекУслугаАбонентов  								= Неопределено;
	//
	//ДокументОбъект 										= Неопределено;
	//ДанныеПоУслуге 										= Неопределено;
	//НаборВыполненные 									= Неопределено;
	//ЗамещатьНаборВыполненные 							= Истина;
	//
	//ЗначенияТарифов 									= Новый Соответствие;
	//		
	//Если ВыборкаОбъемМКД.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ВыборкаАбоненты.следующий();
	//
	//Пока ВыборкаОбъемМКД.Следующий() Цикл
	//	
	//	Если НЕ ТекСтроение = ВыборкаОбъемМКД.Строение Тогда
	//		
	//		Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
	//			
	//			НачатьТранзакцию();
	//			
	//			НаборОтложенныхДвижений	= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	//			НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
	//			НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	//			НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
	//			НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.энргРазделыЗаписи.РаспределениеПомещения);
	//			НаборОтложенныхДвижений.Отбор.МКД.Установить(ТекСтроение);
	//			
	//			НаборОтложенныхДвижений.Записать();					
	//			
	//			Попытка 					
	//				НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
	//				НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
	//				НаборЗаписей.ДополнительныеСвойства.Вставить("МКД",    				ТекСтроение);
	//				НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
	//				НаборЗаписей.Записать();
	//				
	//				Если Не ДокументОбъект = Неопределено Тогда
	//					ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//					ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
	//				КонецЕсли; 					
	//				ЗафиксироватьТранзакцию();
	//			Исключение
	//				ОтменитьТранзакцию();
	//			КонецПопытки;
	//		КонецЕсли;
	//		
	//		ДокументСсылка 							= ВыборкаОбъемМКД.ДокументРаспределения;			
	//		
	//		Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
	//			ДокументСсылка 						= Документы.энргРаспределениеПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор());
	//			ДокументОбъект 						= Документы.энргРаспределениеПомещения.СоздатьДокумент();
	//			ДокументОбъект.Район 				= Район;
	//			ДокументОбъект.МКД 					= ВыборкаОбъемМКД.Строение;
	//			ДокументОбъект.Дата 				= ГраницыПериода.ЗавершениеОП-1;
	//			ДокументОбъект.Организация			= Организация;
	//			ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
	//			
	//			НаборВыполненные 						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
	//				ЗаписьВыполненные						= НаборВыполненные.Добавить();
	//				ЗаписьВыполненные.Организация 			= Организация;
	//				ЗаписьВыполненные.Район		 			= Район;
	//				ЗаписьВыполненные.ПериодНачисления 		= ПериодНачисления;
	//				ЗаписьВыполненные.ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.РаспределениеПомещения;
	//				ЗаписьВыполненные.МКД 					= ВыборкаОбъемМКД.Строение;
	//				ЗаписьВыполненные.ДокументНачисления 	= ДокументСсылка;
	//				ЗамещатьНаборВыполненные 				= Ложь;				
	//				
	//		Иначе
	//			ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
	//			ДокументОбъект.ПометкаУдаления 		= Ложь;
	//			
	//			НаборВыполненные 						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
	//			НаборВыполненные 						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
	//			НаборВыполненные.Отбор.Организация.Установить(Организация);
	//			НаборВыполненные.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	//			НаборВыполненные.Отбор.Район.Установить(Район);					
	//			НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.РаспределениеПомещения);
	//			НаборВыполненные.Отбор.МКД.Установить(ВыборкаОбъемМКД.Строение);
	//			
	//			ЗаписьВыполненные						= НаборВыполненные.Добавить();
	//			ЗаписьВыполненные.Организация 			= Организация;
	//			ЗаписьВыполненные.Район		 			= Район;
	//			ЗаписьВыполненные.ПериодНачисления 		= ПериодНачисления;
	//			ЗаписьВыполненные.ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.РаспределениеПомещения;
	//			ЗаписьВыполненные.МКД 					= ВыборкаОбъемМКД.Строение;
	//			ЗаписьВыполненные.ДокументНачисления 	= ДокументСсылка;
	//			ЗаписьВыполненные.ПометкаУдаления	 	= Ложь;
	//			
	//			
	//			НаборЗаписей 						= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	//			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	//			НаборЗаписей.Записать(); // очищаем набор записей
	//		КонецЕсли;
	//		
	//		НаборЗаписей 							= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	//		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	//		
	//		ВыборкаОбъемПомещения = ВыборкаОбъемМКД.Выбрать();
	//		
	//		Пока ВыборкаОбъемПомещения.Следующий() Цикл
	//			
	//			Если НЕ ТекПомещение = ВыборкаОбъемПомещения.ПомещениеСРазделеннымиЛС Или НЕ ТекУслуга = ВыборкаОбъемПомещения.Услуга Тогда
	//				
	//				Если Не ТекУслуга  = Неопределено Тогда
	//					РаспределитьОбъемПоУслугеПомещения(ПериодНачисления, Организация, Район, ?(ТекСтроение = Неопределено, ВыборкаОбъемМКД.Строение, ТекСтроение), ТекПомещение, ТекУслуга, ЗначенияТарифов, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей);
	//				КонецЕсли;
	//				
	//				
	//				ДанныеПоУслуге  										= Новый Структура;
	//				ДанныеПоУслуге.Вставить("ОбъемУслуги",					ВыборкаОбъемПомещения.ОбъемУслуги);
	//				ДанныеПоУслуге.Вставить("СуммарныйОбъемАбонентов",		ВыборкаОбъемПомещения.ОбъемПотребленияПоРазделеннымЛСПоИПУ);
	//				ДанныеПоУслуге.Вставить("АбонентыДляРаспределения", 	Новый Массив);
	//				ДанныеПоУслуге.Вставить("ВсегоАбонентов", 				ВыборкаОбъемПомещения.ВсегоАбонентов);
	//				ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентов", 		ВыборкаОбъемПомещения.ВсегоПлощадьАбонентов);
	//				ДанныеПоУслуге.Вставить("КоличествоЖильцов",			ВыборкаОбъемПомещения.КоличествоЖильцов);
	//				ДанныеПоУслуге.Вставить("УказанВидПлощади",				ВыборкаОбъемПомещения.УказанВидПлощади);
	//				
	//				ДанныеПоУслуге.Вставить("ДанныеНачисленийАбонентов", 	энргНачисления.ОписаниеТаблицыОбъемов());
	//				ДанныеПоУслуге.Вставить("СпособНачисления", 			ВыборкаОбъемПомещения.СпособНачисления);
	//				ДанныеПоУслуге.Вставить("ПотреблениеАбонентов", 		0);
	//				
	//				мАбонентыДляРаспределения 								= ДанныеПоУслуге.АбонентыДляРаспределения;
	//				ПотреблениеАбонентов 									= ДанныеПоУслуге.ПотреблениеАбонентов;

	//				
	//				// Двигаем выборку абонентов
	//				Пока НЕ ВыборкаАбоненты.ПомещениеСРазделеннымиЛС = ВыборкаОбъемПомещения.ПомещениеСРазделеннымиЛС ИЛИ НЕ ВыборкаАбоненты.Услуга = ВыборкаОбъемПомещения.Услуга Цикл
	//					Если НЕ ВыборкаАбоненты.Следующий() Тогда
	//						Прервать;
	//						ВыборкаАбоненты.сбросить();
	//					КонецЕсли;				
	//				КонецЦикла;
	//				
	//				ТекРазделенныйЛС 									= Неопределено;
	//				ДанныеАбонента 										= Неопределено;
	//				
	//				Пока ВыборкаАбоненты.ПомещениеСРазделеннымиЛС = ВыборкаОбъемПомещения.ПомещениеСРазделеннымиЛС и ВыборкаАбоненты.Услуга = ВыборкаОбъемПомещения.Услуга Цикл
	//					Если НЕ ТекРазделенныйЛС = ВыборкаАбоненты.Помещение Тогда
	//						Если Не ТекРазделенныйЛС = Неопределено Тогда
	//							мАбонентыДляРаспределения.Добавить(ДанныеАбонента);
	//						КонецЕсли;
	//						
	//						ДанныеАбонента 								= Новый Структура("Помещение, Абонент, ТочкаУчета, ЗначениеПлощади, ТарифнаяГруппа, Поставщик, КоличествоЖильцов, КоличествоПрописанных, КоличествоПроживающих, КоличествоСобственников, ДоляПотребленияЧислитель, ДоляПотребленияЗнаменатель, СпособРаспределенияОбъемаПомещения, ФиксированныйОбъемПотребления, КоэффициентРаспределенияОстатка",
	//						ВыборкаАбоненты.Помещение, ВыборкаАбоненты.Абонент, ВыборкаАбоненты.ТочкаУчета, ВыборкаАбоненты.ЗначениеПлощадиДляРаспределения, ВыборкаАбоненты.ТарифнаяГруппаДляРаспределения, ВыборкаАбоненты.ПоставщикДляРаспределения, ВыборкаАбоненты.КоличествоЖильцовЧастиПомещения, ВыборкаАбоненты.КоличествоПрописанных, ВыборкаАбоненты.КоличествоПроживающих, ВыборкаАбоненты.КоличествоСобственников,
	//						ВыборкаАбоненты.ДоляПотребленияЧислитель, ВыборкаАбоненты.ДоляПотребленияЗнаменатель, ВыборкаАбоненты.СпособРаспределенияОбъемаПомещения, ВыборкаАбоненты.ФиксированныйОбъемПотребления, ВыборкаАбоненты.КоэффициентРаспределенияОстатка);
	//						

	//					КонецЕсли;
	//					
	//					Если ВыборкаАбоненты.ЕстьИндивидуальныеНачисления  Тогда 
	//						СтрокаСписатьИндивидуальные  			= ДанныеПоУслуге.ДанныеНачисленийАбонентов.Добавить();
	//						ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаАбоненты);
	//						СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаАбоненты.ОбъемУслугиОборот;
	//						СтрокаСписатьИндивидуальные.Поставщик		= ВыборкаАбоненты.ПоставщикДляРаспределения;
	//						СтрокаСписатьИндивидуальные.Сумма			= ВыборкаАбоненты.СуммаОборот;
	//					КонецЕсли;

	//					
	//					ПотреблениеАбонентов 							= ВыборкаАбоненты.ОбъемУслугиОборот;
	//					
	//					ТекРазделенныйЛС 								= ВыборкаАбоненты.Помещение;
	//					
	//					Если НЕ ВыборкаАбоненты.Следующий() Тогда
	//						Прервать;
	//						ВыборкаАбоненты.сбросить();
	//					КонецЕсли; 				
	//				КонецЦикла; 			
	//				
	//				Если Не ТекРазделенныйЛС = Неопределено Тогда
	//					мАбонентыДляРаспределения.Добавить(ДанныеАбонента);
	//				КонецЕсли;
	//				
	//			КонецЕсли;		
	//			
	//			ТекПомещение 											= ВыборкаОбъемПомещения.ПомещениеСРазделеннымиЛС;
	//			ТекУслуга 												= ВыборкаОбъемПомещения.Услуга;
	//		КонецЦикла;
	//		
	//		ТекСтроение = ВыборкаОбъемМКД.Строение;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Если Не НаборЗаписей = Неопределено Тогда
	//	
	//	РаспределитьОбъемПоУслугеПомещения(ПериодНачисления, Организация, Район, ТекСтроение, ТекПомещение, ТекУслуга, ЗначенияТарифов, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей);
	//	
	//	Если НаборЗаписей.Количество() > 0 Тогда
	//		НачатьТранзакцию();
	//		Попытка				
	//			Если Не ДокументОбъект = Неопределено Тогда
	//				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
	//			КонецЕсли;
	//			
	//			Если НЕ НаборВыполненные = Неопределено Тогда
	//				НаборВыполненные.Записать(ЗамещатьНаборВыполненные);
	//			КонецЕсли;
	//			
	//			НаборОтложенныхДвижений 					= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	//			НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
	//			НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	//			НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
	//			НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.энргРазделыЗаписи.РаспределениеПомещения);
	//			НаборОтложенныхДвижений.Отбор.Строение.Установить(ТекСтроение);
	//			НаборОтложенныхДвижений.Записать();				
	//			
	//			НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
	//			НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
	//			НаборЗаписей.ДополнительныеСвойства.Вставить("МКД",    				ТекСтроение);
	//			НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
	//			НаборЗаписей.Записать(Ложь);	
	//			
	//			ЗафиксироватьТранзакцию();
	//		Исключение
	//			ОписаниеОшибки 								= ОписаниеОшибки();
	//			ОтменитьТранзакцию();
	//		КонецПопытки;
	//	КонецЕсли;		
	//КонецЕсли; 			
	
КонецПроцедуры

Процедура ДобавитьСтрокиНачисленияНППоФормуле(ПериодНачисления, Организация, Район, Договор, ОбъектРасчета, ТочкаУчета, ОписаниеУслуг, НормативыПоУслугам, Набор)
	
	Для Каждого СтрокаФормулы Из ОписаниеУслуг Цикл			
		ТекФормулаОбъемУслуги	 					= СтрокаФормулы.ФормулаРасчета;
		
		Если Не ЗначениеЗаполнено(ТекФормулаОбъемУслуги) Тогда
			Продолжить;
		КонецЕсли;
		ТекФормулаОбъемУслугиПотребленный			= СтрокаФормулы.ФормулаРасчета;
		ПараметрыФормулы 							= СтрокаФормулы.ПараметрыФормулы;
		Для Каждого ПараметрФормулы Из ПараметрыФормулы Цикл
			ОписаниеОбъема 							= ПараметрФормулы.Значение;
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ПараметрФормулы.Ключ + "]",ОписаниеОбъема.ОбъемУслуги);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ПараметрФормулы.Ключ + "]",ОписаниеОбъема.ОбъемУслугиПотребленный);
		КонецЦикла;
		
		Для Каждого ПараметрФормулы Из НормативыПоУслугам Цикл
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ПараметрФормулы.Ключ + "]",ПараметрФормулы.Значение);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ПараметрФормулы.Ключ + "]",ПараметрФормулы.Значение);
		КонецЦикла;
		
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги," ","");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,Символы.НПП,"");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,",",".");
		РезультатПоФормуламОбъемУслуги				= 0;
		ТекФормулаОбъемУслуги 						= СтрЗаменить(ТекФормулаОбъемУслуги,"[Результат]=","РезультатПоФормуламОбъемУслуги=");
		Выполнить ТекФормулаОбъемУслуги;
		
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный," ","");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,Символы.НПП,"");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,",",".");
		РезультатПоФормуламОбъемУслугиПотребленный	= 0;
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[Результат]=","РезультатПоФормуламОбъемУслугиПотребленный=");
		Выполнить ТекФормулаОбъемУслугиПотребленный;
		
		Если РезультатПоФормуламОбъемУслуги = 0 И РезультатПоФормуламОбъемУслугиПотребленный = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНабора 								= Набор.добавить();
		СтрокаНабора.Период 						= СтрокаФормулы.КонецПериодаРасчета-1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.Район 							= Район;
		СтрокаНабора.Договор 						= Договор;
		СтрокаНабора.ОбъектРасчета 					= ОбъектРасчета;
		СтрокаНабора.Услуга 						= СтрокаФормулы.Услуга;
		СтрокаНабора.ТочкаУчета 					= ТочкаУчета;
		СтрокаНабора.ВидНачисления 					= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.СпособНачисления 				= СтрокаФормулы.СпособНачисления;
		СтрокаНабора.ПриборУчета 					= СтрокаФормулы.ПриборУчета;
		СтрокаНабора.ТарифнаяЗона 					= Справочники.энргТарифныеЗоны.ПустаяСсылка();
		СтрокаНабора.Поставщик 						= СтрокаФормулы.Поставщик;
		СтрокаНабора.ПериодРасчета 					= ПериодНачисления;
		СтрокаНабора.ПериодНачисления 				= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги 					= РезультатПоФормуламОбъемУслуги * СтрокаФормулы.КоэффициентПропорциональности;		
		СтрокаНабора.ОбъемУслугиПотребленный 		= РезультатПоФормуламОбъемУслугиПотребленный * СтрокаФормулы.КоэффициентПропорциональности;		
		СтрокаНабора.НачалоПериода 					= СтрокаФормулы.НачалоПериода;
		СтрокаНабора.КонецПериода 					= СтрокаФормулы.КонецПериода;
		СтрокаНабора.Регистратор 					= СтрокаФормулы.ДокументСсылка;		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Снять средние начисления
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисленияНП(Организация, ПериодНачисления,Район,Договор,Документ) Экспорт
	
	перем ТекМКД,ДокументОбъект; 
	
	Если не ЗначениеЗаполнено(ПериодНачисления) или не ЗначениеЗаполнено(Район)  тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	//ПрочитатьНеСписанныйСредний(МВТ,НачалоПериодаРасчета,Район,МКД,Абонент,МКД<>Неопределено);	
	//результатЗапроса 								= РезультатЗапросаПерерасчетСреднего(МВТ,ПериодНачисления,Район,МКД,Абонент,МКД<>Неопределено); 	
	
	//Выборка  										= результатЗапроса.выбрать();
	//ВидОперации 									= Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет;
	//Сч 												= 0;
	//
	//Пока Выборка.следующий() цикл
	//	Если Документ = Неопределено тогда
	//		Если  ТекМКД <> Выборка.МКД тогда
	//			Если ТекМКД<>Неопределено тогда
	//				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//				ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
	//			КонецЕсли;
	//			
	//			Если ЗначениеЗаполнено(Выборка.ДокументПерерасчета) тогда
	//				ДокументОбъект  				= Выборка.ДокументПерерасчета.получитьОбъект();
	//				ДокументОбъект.Дата				= КонецПериодаРасчета-1;
	//				ДокументОбъект.ПометкаУдаления  = Ложь; 
	//				ОбъемНачислений  				= ДокументОбъект.СвязанныйПерерасчет;
	//				ОбъемНачислений.очистить();
	//			иначе
	//				ДокументОбъект  				= Документы.энргПерерасчет.СоздатьДокумент();
	//				ДокументОбъект.район  			= Район;
	//				ДокументОбъект.МКД 				= Выборка.МКД;
	//				ДокументОбъект.Дата				= КонецПериодаРасчета-1;
	//				ДокументОбъект.ВидОперации 		= ВидОперации;
	//				ОбъемНачислений  				= ДокументОбъект.СвязанныйПерерасчет;
	//			КонецЕсли;
	//		КонецЕсли;
	//	иначе
	//		ДокументОбъект 							= Документ;
	//		ОбъемНачислений 						= ДокументОбъект.СвязанныйПерерасчет;
	//	КонецЕсли;	
	//	
	//	ЗаполнитьЗначенияСвойств(ОбъемНачислений.добавить(),Выборка);
	//	ТекМКД 										= Выборка.МКД;
	//	Сч 											= Сч+1;
	//КонецЦикла;	
	//
	//Если Документ = Неопределено и не ДокументОбъект = Неопределено тогда
	//	ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//	ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
	//КонецЕсли;  
	
	//Если МКД = Неопределено тогда
	//	Набор 							= РегистрыСведений.энргВыполненныеНачисления.СоздатьНаборЗаписей();
	//	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	//	Набор.Отбор.Район.установить(Район);
	//	Набор.Отбор.ВидОперацииНачисления.установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
	//	Набор.ДополнительныеСвойства.Вставить("ЗаписьРазрешена");
	//	Запись 							= Набор.Добавить();
	//	Запись.ПериодНачисления 		= ПериодНачисления;
	//	Запись.Район					= Район;
	//	Запись.ВидОперацииНачисления	= Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних;
	//	Набор.Записать();
	//КонецЕсли; 
	//
КонецПроцедуры

Процедура ОтменитьЗакрытьПериода(Организация, ПериодНачисления,Район,МКД) Экспорт 
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 	="ВЫБРАТЬ
	|	энргНачисление.Ссылка
	|ИЗ
	|	Документ.энргНачисление КАК энргНачисление
	|ГДЕ
	|	энргНачисление.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачисление.МКД = &МКД
	|	И энргНачисление.Район = &Район
	|	И энргНачисление.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеМКД.Ссылка
	|ИЗ
	|	Документ.энргНачислениеМКД КАК энргНачислениеМКД
	|ГДЕ
	|	энргНачислениеМКД.Район = &Район
	|	И энргНачислениеМКД.Проведен
	|	И энргНачислениеМКД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Проведен
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПерерасчет.МКД = &МКД
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаПоказаний)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеПоФормуламРасчета.Ссылка
	|ИЗ
	|	Документ.энргНачислениеПоФормуламРасчета КАК энргНачислениеПоФормуламРасчета
	|ГДЕ
	|	энргНачислениеПоФормуламРасчета.Проведен
	|	И энргНачислениеПоФормуламРасчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачислениеПоФормуламРасчета.Район = &Район
	|	И энргНачислениеПоФормуламРасчета.МКД = &МКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	энргЗакрытиеПериода.Проведен
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	
	Если МКД = Неопределено тогда
		Текст 			= СтрЗаменить(Текст,"И энргНачисление.МКД = &МКД","");
		Текст			= СтрЗаменить(Текст,"И энргПерерасчет.МКД = &МКД","");
		Текст 			= СтрЗаменить(Текст,"И энргНачислениеПоФормуламРасчета.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 		= Текст;
	Результат  			= Запрос.Выполнить();
	Выборка 			= Результат.Выбрать();
	Пока Выборка.Следующий() цикл  		
		ДокОбъект  		= Выборка.ссылка.получитьОбъект();
		ДокОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",истина);
		ДокОбъект.УстановитьПометкуУдаления(Истина);		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗакрытьПериодДляРедактирования(ПериодНачисления,Район,МКД) Экспорт  
	
	Если МКД <> Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ДокуметЗакрытия 				= ДокуметЗакрытияПериода(ПериодНачисления,Район);
	
	Если не ЗначениеЗаполнено(ДокуметЗакрытия) тогда
		ДокументОбъект 				= Документы.энргЗакрытиеПериода.СоздатьДокумент();		
	иначе
		ДокументОбъект 				= ДокуметЗакрытия.ПолучитьОбъект();  
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",Истина);
	ДокументОбъект.Район 			= Район;
	ДокументОбъект.ПериодНачисления = ПериодНачисления;
	ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

Процедура ВспомогательныеДанныеНачисленияНП(МВТ,Организация,ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ОтборПоДому,ДнейВПериоде)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	
	
	Если ЗначениеЗаполнено(Договор) тогда
		Запрос.УстановитьПараметр("Договор",Договор);
		ОтборПоДоговору = Истина;
	Иначе
		ОтборПоДоговору = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоВеденияУчета",		Константы.энргДатаНачалаВеденияУчета.Получить());	 // Дата
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 // Дата
	Запрос.УстановитьПараметр("Организация",			Организация);	 // Дата
	Запрос.УстановитьПараметр("Район",					Район);	 // Районы
	Запрос.УстановитьПараметр("ДнейВПериоде",			ДнейВПериоде );
	Запрос.УстановитьПараметр("ПериодНовогоТарифа",		ПериодНовогоТарифа); // Число;
	
	Запрос.Текст 	= ТекстЗапросаВспомогательныеДанныеНачисления(ОтборПоДоговору);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьСтабильныеПериодыНП(МВТ,ЭтоПерерасчет)  
	
	Текст 							= ТекстПолучитьСтабильныеПериоды(ЭтоПерерасчет);
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачалоВеденияУчета", Константы.энргДатаНачалаВеденияУчета.Получить());
	Запрос.МенеджерВременныхТаблиц	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчетаНП(МВТ,РасчетПоФормуле,ЭтоПерерасчет,ИмяДокумента)
	
	Текст 							= ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле, ИмяДокумента);
	Запрос  						= Новый Запрос(Текст); 	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,ФормируемВременную,РасчетПоФормуле,ИмяДокумента); 
	
	Текст  							= ТекстРассчитатьИндивидуальныйОбъемПотребленияНП(ФормируемВременную, ИмяДокумента);
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("РасчетПоФормуле",РасчетПоФормуле);
	
	МассивУслуг = Новый Массив;
	
	УслугаОтопление = Справочники.энргВидыУслуг.НайтиПоНаименованию("Отопление");
	УслугаВентиляция = Справочники.энргВидыУслуг.НайтиПоНаименованию("Вентиляция");
	УслугаТЭ = Справочники.энргВидыУслуг.НайтиПоНаименованию("Горячее водоснабжение (теплоэнергия)");
	
	МассивУслуг.Добавить(УслугаОтопление);
	МассивУслуг.Добавить(УслугаВентиляция);
	
	Запрос.УстановитьПараметр("ОтоплениеВентиляция",МассивУслуг);	
	Запрос.УстановитьПараметр("ТЭ",УслугаТЭ);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область ТекстЗапросов

Функция ТекстЗапросаВспомогательныеДанныеНачисления(ОтборПоДоговору)
	
	Текст = 
	"ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Организация КАК Организация,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Район КАК Район,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ЗначенияПовышающихКоэффициентов
	|ИЗ
	|	РегистрСведений.энгрЗначенияПовышающихКоэффициентов.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК энгрЗначенияПовышающихКоэффициентовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.НежилыеПомещения)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК НастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	|	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	|	бестГарантированныеОбъемыСрезПоследних.Договор КАК Договор,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги
	|ПОМЕСТИТЬ ГарантированныеОбъемы
	|ИЗ
	|	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор
	|				И КОНЕЦПЕРИОДА(Месяц, ДЕНЬ) = КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ)) КАК бестГарантированныеОбъемыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(&КонецПериодаРасчета, НеНачислять) КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	энргВидыУслуг.СезонностьНастраивается КАК СезонностьНастраивается
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА &НачалоПериодаРасчета
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ &КонецПериодаРасчета
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета)
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифов.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа,
	|	энргЗначенияТарифов.Регистратор КАК Регистратор,
	|	ДОБАВИТЬКДАТЕ(энргЗначенияТарифов.Период, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|ПОМЕСТИТЬ ЗначенияТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргЗначенияТарифовСрезПоследних
	|		ПО энргЗначенияТарифов.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И энргЗначенияТарифов.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|			И (энргЗначенияТарифов.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.НомерПозиции КАК НомерПозиции,
	|	бестПредоставленныеПоказанияНП.Разделитель КАК Разделитель,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора КАК ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор КАК ДокРегистратор,
	|	бестПредоставленныеПоказанияНП.Показания КАК Показания
	|ПОМЕСТИТЬ НаборПредоставленныхПоказаний
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ)
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания
	|ПОМЕСТИТЬ НаборПредоставленныхПоказанийПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказаний КАК НаборПредоставленныхПоказаний
	|ГДЕ
	|	НаборПредоставленныхПоказаний.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийПредПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийПредПериод.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ МаксНомерПозицииПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказанийПредПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийПредПериод.Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.Район,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(НаборПредоставленныхПоказаний.ДатаРегистратора) КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксДатаРегистратораПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомерПозицииПредПериод КАК МаксНомерПозиции
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксНомерПозиции.Организация
	|			И НаборПредоставленныхПоказаний.Район = МаксНомерПозиции.Район
	|			И НаборПредоставленныхПоказаний.Договор = МаксНомерПозиции.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксНомерПозиции.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксНомерПозиции.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксНомерПозиции.ПриборУчета
	|			И НаборПредоставленныхПоказаний.Шкала = МаксНомерПозиции.Шкала
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксНомерПозиции.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксНомерПозиции.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказаний.Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПредоставленныхПоказаний.ДокРегистратор) КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРегистраторПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксДатаРегистратораПредПериод КАК МаксДатаРегистратора
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксДатаРегистратора.Организация
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксДатаРегистратора.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.Район = МаксДатаРегистратора.Район
	|			И НаборПредоставленныхПоказаний.Договор = МаксДатаРегистратора.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксДатаРегистратора.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксДатаРегистратора.ПриборУчета
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксДатаРегистратора.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.Шкала = МаксДатаРегистратора.Шкала
	|			И НаборПредоставленныхПоказаний.ДатаРегистратора = МаксДатаРегистратора.ДатаРегистратора
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксДатаРегистратора.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказаний.Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказаний.Разделитель) КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРазделительПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРегистраторПредПериод КАК МаксРегистратор
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксРегистратор.Организация
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксРегистратор.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.Район = МаксРегистратор.Район
	|			И НаборПредоставленныхПоказаний.Договор = МаксРегистратор.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксРегистратор.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксРегистратор.ПриборУчета
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксРегистратор.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.Шкала = МаксРегистратор.Шкала
	|			И НаборПредоставленныхПоказаний.ДатаРегистратора = МаксРегистратор.ДатаРегистратора
	|			И НаборПредоставленныхПоказаний.ДокРегистратор = МаксРегистратор.ДокРегистратор
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксРегистратор.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказаний.Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Район,
	|	НаборПредоставленныхПоказаний.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета.МКД КАК МКД
	|ПОМЕСТИТЬ бестМаксимальныеПоказанияСрезПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРазделительПредПериод КАК МаксРазделитель
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксРазделитель.Организация
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксРазделитель.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.Договор = МаксРазделитель.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксРазделитель.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксРазделитель.ПриборУчета
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксРазделитель.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.Шкала = МаксРазделитель.Шкала
	|			И НаборПредоставленныхПоказаний.ДатаРегистратора = МаксРазделитель.ДатаРегистратора
	|			И НаборПредоставленныхПоказаний.ДокРегистратор = МаксРазделитель.ДокРегистратор
	|			И НаборПредоставленныхПоказаний.Разделитель = МаксРазделитель.Разделитель
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксРазделитель.НомерПозиции
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксРазделитель.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезПоследних.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезПоследних.Договор КАК Договор,
	|	бестМаксимальныеПоказанияСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезПоследних.ОбъектРасчета.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезПоследних.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезПоследних.Показания КАК Показания,
	|	&НачалоПериодаРасчета КАК Период,
	|	-1 КАК НомерПозиции,
	|	бестМаксимальныеПоказанияСрезПоследних.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	бестМаксимальныеПоказанияСрезПредПериод КАК бестМаксимальныеПоказанияСрезПоследних
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезПоследних.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезПоследних.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|	И бестМаксимальныеПоказанияСрезПоследних.Район = &Район
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Показания,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.НомерПозиции,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания
	|ПОМЕСТИТЬ НаборПредоставленныхПоказанийТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказаний КАК НаборПредоставленныхПоказаний
	|ГДЕ
	|	НаборПредоставленныхПоказаний.ПериодНачисления = &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ МаксНомерПозицииТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора) КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксДатаРегистратораТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомерПозицииТекПериод КАК МаксНомерПозицииТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксНомерПозицииТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.Район = МаксНомерПозицииТекПериод.Район
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксНомерПозицииТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксНомерПозицииТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксНомерПозицииТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксНомерПозицииТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксНомерПозицииТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксНомерПозицииТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксНомерПозицииТекПериод.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.ДокРегистратор) КАК ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРегистраторТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксДатаРегистратораТекПериод КАК МаксДатаРегистратораТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксДатаРегистратораТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксДатаРегистратораТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.Район = МаксДатаРегистратораТекПериод.Район
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксДатаРегистратораТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксДатаРегистратораТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксДатаРегистратораТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксДатаРегистратораТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксДатаРегистратораТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора = МаксДатаРегистратораТекПериод.ДатаРегистратора
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксДатаРегистратораТекПериод.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.Разделитель) КАК Разделитель,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРазделительТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРегистраторТекПериод КАК МаксРегистраторТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксРегистраторТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксРегистраторТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.Район = МаксРегистраторТекПериод.Район
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксРегистраторТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксРегистраторТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксРегистраторТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксРегистраторТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксРегистраторТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора = МаксРегистраторТекПериод.ДатаРегистратора
	|			И НаборПредоставленныхПоказанийТекПериод.ДокРегистратор = МаксРегистраторТекПериод.ДокРегистратор
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксРегистраторТекПериод.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.Показания КАК Показания,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета.МКД КАК МКД
	|ПОМЕСТИТЬ бестМаксимальныеПоказанияСрезТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРазделительТекПериод КАК МаксРазделительТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксРазделительТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксРазделительТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксРазделительТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксРазделительТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксРазделительТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксРазделительТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксРазделительТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора = МаксРазделительТекПериод.ДатаРегистратора
	|			И НаборПредоставленныхПоказанийТекПериод.ДокРегистратор = МаксРазделительТекПериод.ДокРегистратор
	|			И НаборПредоставленныхПоказанийТекПериод.Разделитель = МаксРазделительТекПериод.Разделитель
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксРазделительТекПериод.НомерПозиции
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксРазделительТекПериод.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.Договор КАК Договор,
	|	ПоказанияНачало.ОбъектРасчета КАК ОбъектРасчета,
	|	ПоказанияНачало.МКД КАК МКД,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА &КонецПериодаРасчета
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|			И ПоказанияНачало.Договор = ПоказанияКонец.Договор
	|			И ПоказанияНачало.ОбъектРасчета = ПоказанияКонец.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднийОбъемПотребленияНП.Организация КАК Организация,
	|	бестСреднийОбъемПотребленияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСреднийОбъемПотребленияНП.Район КАК Район,
	|	бестСреднийОбъемПотребленияНП.МКД КАК МКД,
	|	бестСреднийОбъемПотребленияНП.Услуга КАК Услуга,
	|	бестСреднийОбъемПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСреднийОбъемПотребленияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестСреднийОбъемПотребленияНП.Шкала КАК Шкала,
	|	бестСреднийОбъемПотребленияНП.Объем КАК СреднийОбъем,
	|	бестСреднийОбъемПотребленияНП.Договор КАК Договор,
	|	бестСреднийОбъемПотребленияНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ СреднееПотреблениеАбонентов
	|ИЗ
	|	РегистрСведений.бестСреднийОбъемПотребленияНП КАК бестСреднийОбъемПотребленияНП
	|ГДЕ
	|	бестСреднийОбъемПотребленияНП.Организация = &Организация
	|	И бестСреднийОбъемПотребленияНП.ПериодНачисления = &ПериодНачисления
	|	И бестСреднийОбъемПотребленияНП.Район = &Район
	|	И бестСреднийОбъемПотребленияНП.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтабильныеПериодыШкалыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыШкалыНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыШкалыНП.Район КАК Район,
	|	бестСтабильныеПериодыШкалыНП.Договор КАК Договор,
	|	бестСтабильныеПериодыШкалыНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыШкалыНП.МКД КАК МКД,
	|	бестСтабильныеПериодыШкалыНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСтабильныеПериодыШкалыНП.Шкала КАК Шкала,
	|	бестСтабильныеПериодыШкалыНП.НомерПозиции КАК НомерПозиции,
	|	бестСтабильныеПериодыШкалыНП.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыШкалыНП КАК бестСтабильныеПериодыШкалыНП
	|ГДЕ
	|	бестСтабильныеПериодыШкалыНП.Организация = &Организация
	|	И бестСтабильныеПериодыШкалыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыШкалыНП.Район = &Район
	|	И бестСтабильныеПериодыШкалыНП.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестВыводПриборовУчетаНП.Организация КАК Организация,
	|	бестВыводПриборовУчетаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестВыводПриборовУчетаНП.Район КАК Район,
	|	бестВыводПриборовУчетаНП.Договор КАК Договор,
	|	бестВыводПриборовУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестВыводПриборовУчетаНП.МКД КАК МКД,
	|	бестВыводПриборовУчетаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестВыводПриборовУчетаНП.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	РегистрСведений.бестВыводПриборовУчетаНП КАК бестВыводПриборовУчетаНП
	|ГДЕ
	|	бестВыводПриборовУчетаНП.Организация = &Организация
	|	И бестВыводПриборовУчетаНП.ПериодНачисления = &ПериодНачисления
	|	И бестВыводПриборовУчетаНП.Район = &Район
	|	И бестВыводПриборовУчетаНП.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестМаксимальныеПоказанияСрезТекПериод.Организация КАК Организация,
	|	бестМаксимальныеПоказанияСрезТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезТекПериод.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезТекПериод.Договор КАК Договор,
	|	бестМаксимальныеПоказанияСрезТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезТекПериод.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезТекПериод.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезТекПериод.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезТекПериод.Показания КАК Показания
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	бестМаксимальныеПоказанияСрезТекПериод КАК бестМаксимальныеПоказанияСрезТекПериод
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезТекПериод.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезТекПериод.ПериодНачисления = &ПериодНачисления
	|	И бестМаксимальныеПоказанияСрезТекПериод.Район = &Район
	|	И бестМаксимальныеПоказанияСрезТекПериод.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоДоговору
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация КАК Организация,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район КАК Район,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература КАК ПроектнаяТемпература
	|ПОМЕСТИТЬ ТемператураНаружногоВоздуха
	|ИЗ
	|	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация КАК Организация,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район КАК Район,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература
	|ПОМЕСТИТЬ ФактическаяСреднемесячнаяТемпература
	|ИЗ
	|	РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НАЧАЛОПЕРИОДА(РасчетныйМесяц, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ)) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ДлительностьПериодов.НачалоФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ДлительностьПериодов.КонецФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа КАК ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор КАК Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа КАК ЗначениеТарифа,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомераСтрокЗначениеТарифа
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ЗначенияТарифов.ДатаСменыТарифа
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ЗначенияТарифов.Услуга
	|			И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Организация КАК Организация,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Район КАК Район,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ГБП КАК ГБП
	|ПОМЕСТИТЬ РасположениеТУОтносительноГБП
	|ИЗ
	|	РегистрСведений.бестРасположениеТочекУчетаОтносительноГБП.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасположениеТочекУчетаОтносительноГБПСрезПоследних
	|;	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","бестСтабильныеПериодыНП","ПериодРегистрации",Истина,Ложь) + "
	|	ВЫБОР
	|		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&КонецПериодаРасчета КАК ЗавершениеОП,
	|	&ДнейВПериоде КАК ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|ГДЕ
	|	бестСтабильныеПериодыНП.Организация = &Организация
	|	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыНП.Район = &Район
	|	И бестСтабильныеПериодыНП.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачало","Шкала",Истина,Ложь) + "	
	|	СтабильныеПериодыНачало.ПериодРегистрации,
	|	СтабильныеПериодыНачало.НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная)) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачало.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПривязанаКШкале
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоШкалы
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО СтабильныеПериодыНачало.Организация = СтабильныеПериодыШкалы.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СтабильныеПериодыШкалы.Район
	|			И СтабильныеПериодыНачало.Договор = СтабильныеПериодыШкалы.Договор
	|			И СтабильныеПериодыНачало.ОбъектРасчета = СтабильныеПериодыШкалы.ОбъектРасчета
	|			И СтабильныеПериодыНачало.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|			И СтабильныеПериодыНачало.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыНачало.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтабильныеПериодыНачало.Шкала = СтабильныеПериодыШкалы.Шкала
	|			КОНЕЦ)";
	
	Если Не ОтборПоДоговору  тогда
		Текст 		= СтрЗаменить(Текст,"И Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестПредоставленныеПоказанияНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестСреднийОбъемПотребленияНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыШкалыНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестВыводПриборовУчетаНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестМаксимальныеПоказанияСрезТекПериод.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)","");
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыНП.Договор = &Договор","");
	КонецЕсли;
	
	Возврат Текст;	
	
КонецФункции

Функция ТекстПолучитьСтабильныеПериоды(ЭтоПерерасчет)  
	
	Текст 	=
	"ВЫБРАТЬ
	|	НомераСтрокНачалоСезонности.Организация КАК Организация,
	|	НомераСтрокНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокНачалоСезонности.Район КАК Район,
	|	НомераСтрокНачалоСезонности.Договор КАК Договор,
	|	НомераСтрокНачалоСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокНачалоСезонности.МКД КАК МКД,
	|	НомераСтрокНачалоСезонности.Услуга КАК Услуга,
	|	НомераСтрокНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокНачалоСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокНачалоСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокНачалоСезонности КАК НомераСтрокНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокНачалоСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокНачалоСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокНачалоСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокНачалоСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокНачалоСезонности.Договор = СтабильныеПериодыНачало.Договор
	|			И НомераСтрокНачалоСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокНачалоСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокНачалоСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокНачалоСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокКонецСезонности.Организация КАК Организация,
	|	НомераСтрокКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокКонецСезонности.Район КАК Район,
	|	НомераСтрокКонецСезонности.МКД КАК МКД,
	|	НомераСтрокКонецСезонности.Договор КАК Договор,
	|	НомераСтрокКонецСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокКонецСезонности.Услуга КАК Услуга,
	|	НомераСтрокКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокКонецСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокКонецСезонности КАК НомераСтрокКонецСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокКонецСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокКонецСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокКонецСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокКонецСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокКонецСезонности.Договор = СтабильныеПериодыНачало.Договор
	|			И НомераСтрокКонецСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокКонецСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокКонецСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокКонецСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоШкалы","",Истина,Ложь) + "	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиНеПрименятьСезонность.НеПрименятьСезонность, ИСТИНА)
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СезонностьНачало,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонность.НеПрименятьСезонность, ЛОЖЬ) КАК НеПрименятьСезонность,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонность.ОбъемЗаПрошлыйГод, Ложь) КАК ОбъемЗаПрошлыйГод,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонность.КоэффициентНорматива, 1) КАК КоэффициентНорматива,
	|	ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0) КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоШкалы.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоШкалы.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоШкалы.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоШкалы.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачалоШкалы.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонность
	|		ПО СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонность.Район
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонность.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = ГарантированныеОбъемы.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = ГарантированныеОбъемы.Район
	|			И СтабильныеПериодыНачалоШкалы.Договор = ГарантированныеОбъемы.Договор
	|			И СтабильныеПериодыНачалоШкалы.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	|			И СтабильныеПериодыНачалоШкалы.Услуга = ГарантированныеОбъемы.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" +	бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "	
	|	СтабильныеПериодыНачалоСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + ВЫБОР
	|	КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачалоСезонности.СезонностьНачало
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УвеличениеПозиции
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Договор = НомераСтрокНачалоСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.ПериодРегистрации >= НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "
	|	НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + 1 КАК НомерПозиции,
	|	1 КАК КоэффициентСезоности,
	|	1
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериодыНачалоСезонности.НомерПозиции = НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И СтабильныеПериодыНачалоСезонности.Договор = НомераСтрокНачалоСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "	
	|	СтабильныеПериодыСезонность.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + СтабильныеПериодыСезонность.УвеличениеПозиции > СтабильныеПериодыСезонность.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыСезонность.ПериодРегистрации КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыСезонность.КоэффициентСезоности
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем КАК ГарантированныйОбъем
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТипНачисления
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Договор = НомераСтрокКонецСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыСезонность.ОбъектРасчета = НомераСтрокКонецСезонностиБезФормулы.ОбъектРасчета
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.ПериодРегистрации >= НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "		
	|	НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + 1,
	|	НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности,
	|	0 КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Договор = НомераСтрокКонецСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериодыСезонность.НомерПозиции - СтабильныеПериодыСезонность.УвеличениеПозиции = НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонностиТипНачисления","",Истина,Ложь) + "	
	|	СтабильныеКонецСезонностиТипНачисления.КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТипНачисления.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТипНачисления.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТипНачисления.НачалоОП,
	|	СтабильныеКонецСезонностиТипНачисления.ЗавершениеОП,
	|	СтабильныеКонецСезонностиТипНачисления.ДнейВПериоде,
	|	СтабильныеКонецСезонностиТипНачисления.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеКонецСезонностиТипНачисления.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеКонецСезонностиТипНачисления.КоэффициентНорматива,
	|	СтабильныеКонецСезонностиТипНачисления.ГарантированныйОбъем,
	|	СтабильныеКонецСезонностиТипНачисления.ВидДифференцированности,
	|	СтабильныеКонецСезонностиТипНачисления.ПривязанаКШкале,
	|	ВЫБОР
	|		КОГДА энргВидыДифференцированностиТарифныеЗоны.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТарифнаяЗона
	|ИЗ
	|	СтабильныеКонецСезонностиТипНачисления КАК СтабильныеКонецСезонностиТипНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеКонецСезонностиТипНачисления.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонностиТарифнаяЗона","",Истина,Ложь) + "
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидДифференцированности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПривязанаКШкале,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ПериодыПоказаний.Показания, 0) КАК Показания,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ГарантированныйОбъем КАК ГарантированныйОбъем
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	СтабильныеКонецСезонностиТарифнаяЗона КАК СтабильныеКонецСезонностиТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестНачислениеНП
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестЗаключениеДоговоровСЮридическимиЛицами
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСПриборомУчетаНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСУслугамиНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				ИНАЧЕ СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации МЕЖДУ ПериодыПоказаний.НачалоПериодДействия И ПериодыПоказаний.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Организация = ПериодыПоказаний.Организация
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Район = ПериодыПоказаний.Район
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Договор = ПериодыПоказаний.Договор
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ОбъектРасчета = ПериодыПоказаний.ОбъектРасчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПриборУчета = ПериодыПоказаний.ПриборУчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Шкала = ПериодыПоказаний.Шкала
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона = ПериодыПоказаний.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыПоказанияНачало","НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	СтабильныеПериодыПоказанияНачало.ВидДифференцированности,
	|	СтабильныеПериодыПоказанияНачало.ПривязанаКШкале,
	|	СтабильныеПериодыПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,
	|	СтабильныеПериодыПоказанияНачало.Показания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПриборУчета ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.Показания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|					ТОГДА СтабильныеПериодыПоказанияКонец.Показания
	|				ИНАЧЕ СтабильныеПериодыПоказанияНачало.Показания
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеПериодыПоказанияНачало.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыПоказанияНачало.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыПоказанияНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПоказанияНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПоказанияНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыПоказанияКонец.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыПоказанияНачало.ГарантированныйОбъем КАК ГарантированныйОбъем
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияКонец
	|		ПО (СтабильныеПериодыПоказанияНачало.НомерПозиции = СтабильныеПериодыПоказанияКонец.НомерПозиции - 1)
	|			И СтабильныеПериодыПоказанияНачало.Организация = СтабильныеПериодыПоказанияКонец.Организация
	|			И СтабильныеПериодыПоказанияНачало.ПериодНачисления = СтабильныеПериодыПоказанияКонец.ПериодНачисления
	|			И СтабильныеПериодыПоказанияНачало.Район = СтабильныеПериодыПоказанияКонец.Район
	|			И СтабильныеПериодыПоказанияНачало.Договор = СтабильныеПериодыПоказанияКонец.Договор
	|			И СтабильныеПериодыПоказанияНачало.ОбъектРасчета = СтабильныеПериодыПоказанияКонец.ОбъектРасчета
	|			И СтабильныеПериодыПоказанияНачало.ТочкаУчета = СтабильныеПериодыПоказанияКонец.ТочкаУчета
	|			И СтабильныеПериодыПоказанияНачало.Услуга = СтабильныеПериодыПоказанияКонец.Услуга
	|			И СтабильныеПериодыПоказанияНачало.ТарифнаяЗона = СтабильныеПериодыПоказанияКонец.ТарифнаяЗона";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле, ИмяДокумента)
	
	Текст   = 
	"ВЫБРАТЬ
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.Договор КАК Договор,
	|	Периоды.МКД КАК МКД,
	|	Периоды.ОбъектРасчета КАК ОбъектРасчета,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.НомерПозиции КАК НомерПозиции,
	|	Периоды.ДоговорЗаключен КАК ДоговорЗаключен,
	|	Периоды.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	|	Периоды.УслугаПодключена КАК УслугаПодключена,
	|	Периоды.ПриборВведен КАК ПриборВведен,
	|	Периоды.ПриборУчета КАК ПриборУчета,
	|	Периоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	Периоды.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	|	Периоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	Периоды.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Периоды.ДатаПоверки КАК ДатаПоверки,
	|	Периоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	Периоды.КоэффициентРасчета КАК КоэффициентРасчета,
	|	Периоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	Периоды.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	Периоды.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	|	Периоды.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	Периоды.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	Периоды.РасчетПоФормуле КАК РасчетПоФормуле,
	|	Периоды.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	|	Периоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Периоды.КлючНорматива КАК КлючНорматива,
	|	Периоды.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	Периоды.Поставщик КАК Поставщик,
	|	Периоды.Шкала КАК Шкала,
	|	Периоды.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	Периоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)) КАК ФормулаРасчета,
	|	Периоды.НачалоПериода КАК НачалоПериода,
	|	Периоды.КонецПериода КАК КонецПериода,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.НачальныеПоказания КАК НачПок,
	|	Периоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, 0) КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ КАК КонПок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ОбъектРасчета ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПредоставленныеПоказания.ВСрок
	|		КОНЕЦ) КАК ПоказанияВСрок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеВыводаПрибораУчета.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВыводПрибораУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ПоказанияПредоставлены,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаДокумента.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеНП.ПустаяСсылка))) КАК ДокументНачисления,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	Периоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|	МАКСИМУМ(ЕСТЬNULL(ПредоставленныеПоказанияПоДоговору.ПоказанияТекущегоПериода, ЛОЖЬ)) КАК ЕстьПоказанияАбонента,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.СледующийРегистратор КАК СледующийРегистратор,
	|	Периоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	Периоды.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ЕСТЬNULL(ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	|	ЕСТЬNULL(ТемператураНаружногоВоздуха.ПроектнаяТемпература, -28) КАК ПроектнаяТемператураНаружногоВоздуха,
	|	энргВидыУслуг.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	Периоды.ТипСхемыГВС КАК ТипСхемыГВС,
|	Периоды.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
|	Периоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
|	Периоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	Периоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗакрытаяСхемаГВС
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормойТипНачисления
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО Периоды.Организация = ПредоставленныеПоказания.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказания.Район
	|			И Периоды.Договор = ПредоставленныеПоказания.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.Договор = МаксимальныеПоказания.Договор
	|			И Периоды.ОбъектРасчета = МаксимальныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеНП КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ))
	|			И Периоды.Организация = ТаблицаДокумента.Организация
	|			И Периоды.Район = ТаблицаДокумента.Район
	|			И Периоды.Договор = ТаблицаДокумента.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеАбонентов КАК СреднееПотреблениеАбонентов
	|		ПО Периоды.Организация = СреднееПотреблениеАбонентов.Организация
	|			И Периоды.ПериодНачисления = СреднееПотреблениеАбонентов.ПериодНачисления
	|			И Периоды.Район = СреднееПотреблениеАбонентов.Район
	|			И Периоды.Договор = СреднееПотреблениеАбонентов.Договор
	|			И Периоды.ОбъектРасчета = СреднееПотреблениеАбонентов.ОбъектРасчета
	|			И Периоды.Услуга = СреднееПотреблениеАбонентов.Услуга
	|			И Периоды.ТочкаУчета = СреднееПотреблениеАбонентов.ТочкаУчета
	|			И Периоды.Шкала = СреднееПотреблениеАбонентов.Шкала
	|			И Периоды.ТарифнаяЗона = СреднееПотреблениеАбонентов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВыводаПрибораУчета КАК ДанныеВыводаПрибораУчета
	|		ПО Периоды.Организация = ДанныеВыводаПрибораУчета.Организация
	|			И Периоды.ПериодНачисления = ДанныеВыводаПрибораУчета.ПериодНачисления
	|			И Периоды.Район = ДанныеВыводаПрибораУчета.Район
	|			И Периоды.Договор = ДанныеВыводаПрибораУчета.Договор
	|			И Периоды.ОбъектРасчета = ДанныеВыводаПрибораУчета.ОбъектРасчета
	|			И Периоды.ТочкаУчета = ДанныеВыводаПрибораУчета.ТочкаУчета
	|			И Периоды.ПриборУчета = ДанныеВыводаПрибораУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Периоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Периоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоДоговору КАК ПредоставленныеПоказанияПоДоговору
	|		ПО Периоды.Организация = ПредоставленныеПоказанияПоДоговору.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияПоДоговору.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияПоДоговору.Район
	|			И Периоды.Договор = ПредоставленныеПоказанияПоДоговору.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказанияПоДоговору.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемператураНаружногоВоздуха КАК ТемператураНаружногоВоздуха
	|		ПО Периоды.Организация = ТемператураНаружногоВоздуха.Организация
	|			И Периоды.Район = ТемператураНаружногоВоздуха.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическаяСреднемесячнаяТемпература КАК ФактическаяСреднемесячнаяТемпература
	|		ПО Периоды.Организация = ФактическаяСреднемесячнаяТемпература.Организация
	|			И Периоды.Район = ФактическаяСреднемесячнаяТемпература.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО Периоды.Организация = МКДНеНачислятьТЭ.Организация
	|			И Периоды.Район = МКДНеНачислятьТЭ.Район
	|			И Периоды.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И (ВЫБОР
	|				КОГДА МКДНеНачислятьТЭ.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА Периоды.МКД = МКДНеНачислятьТЭ.МКД
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И Периоды.ТипСхемыГВС = МКДНеНачислятьТЭ.ТипСхемы
	|			И Периоды.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту
	|ГДЕ
	|	Периоды.ДоговорЗаключен
	|	И Периоды.УслугаПодключена
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Организация,
	|	Периоды.ПериодНачисления,
	|	Периоды.Район,
	|	Периоды.Договор,
	|	Периоды.МКД,
	|	Периоды.ОбъектРасчета,
	|	Периоды.Услуга,
	|	Периоды.ТочкаУчета,
	|	Периоды.НомерПозиции,
	|	Периоды.ДоговорЗаключен,
	|	Периоды.ОбъектРасчетаПодключен,
	|	Периоды.УслугаПодключена,
	|	Периоды.ПриборВведен,
	|	Периоды.ПриборУчета,
	|	Периоды.ЗначениеНагрузки,
	|	Периоды.ЗначениеМесячнойНагрузки,
	|	Периоды.ЗначениеПлощади,
	|	Периоды.ТарифнаяГруппа,
	|	Периоды.ДатаПоверки,
	|	Периоды.ЗависимаяТочкаУчета,
	|	Периоды.КоэффициентРасчета,
	|	Периоды.ДатаСостоянияПрибора,
	|	Периоды.МенялосьСостояниеПУ,
	|	Периоды.МенялосьСостояниеФормулы,
	|	Периоды.ЗначениеНормативаЗаДень,
	|	Периоды.ОбъектУчаствуетВРаспределенииМКД,
	|	Периоды.РасчетПоФормуле,
	|	Периоды.ТепловаяСоставляющая,
	|	Периоды.СпособРасчетаНорматива,
	|	Периоды.КлючНорматива,
	|	Периоды.ТемператураВнутриПомещения,
	|	Периоды.Поставщик,
	|	Периоды.Шкала,
	|	Периоды.НетВозможностьУстановкиПУ,
	|	Периоды.СоставнаяУслуга,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)),
	|	Периоды.НачалоПериода,
	|	Периоды.КонецПериода,
	|	Периоды.ВидДифференцированности,
	|	Периоды.ТарифнаяЗона,
	|	Периоды.ПривязанаКШкале,
	|	Периоды.НачальныеПоказания,
	|	СреднееПотреблениеАбонентов.СреднийОбъем,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, 0),
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)),
	|	Периоды.НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод,
	|	Периоды.ГарантированныйОбъем,
	|	Периоды.ДнейВПериоде,
	|	Периоды.СледующийРегистратор,
	|	Периоды.КоэффициентНорматива,
	|	Периоды.ТипСхемыГВС,
	|	Периоды.ВидТепловогоПункта,
	|	ЕСТЬNULL(ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемпература, 0),
	|	ЕСТЬNULL(ТемператураНаружногоВоздуха.ПроектнаяТемпература, -28),
	|	энргВидыУслуг.ИспользоватьПовыщающийКоэффициент,
	|	Периоды.УчаствуетВДолевойСхеме,
	|	Периоды.СпособРаспределенияОбъемаДолевойТУ,
	|	Периоды.СпособРаспределенияОстаткаДолевыеСхемы,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";   	
	
	Если РасчетПоФормуле тогда
		Текст = СтрЗаменить(Текст,
		"И НЕ Периоды.РасчетПоФормуле",
		" И (Периоды.РасчетПоФормуле  ИЛИ НЕ Периоды.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))");
	КонецЕсли; 
	
	Текст 							= СтрЗаменить(Текст,"Документ.бестНачислениеНП КАК ТаблицаДокумента","Документ."  + ИмяДокумента + " КАК ТаблицаДокумента");
	Текст 							= СтрЗаменить(Текст,"ТипНачисления",ИмяДокумента);
	
	Возврат Текст;
	
КонецФункции

Функция ТекстРассчитатьИндивидуальныйОбъемПотребленияНП(ФормируемВременную,ИмяДокумента); 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 1
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 2
	|			ИНАЧЕ 3
	|		КОНЕЦ) КАК Приоритет
	|ПОМЕСТИТЬ ПриоритетНормыТипНачисления
	|ИЗ
	|	ДанныеДляРасчетаПередНормойТипНачисления КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0
	|	И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|			ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ТочкиНачисленияНормыТипНачисления
	|ИЗ
	|	ДанныеДляРасчетаПередНормойТипНачисления КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормыТипНачисления КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ПриоритетНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Договор = ПриоритетНормы.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ПриоритетНормы.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И (ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0)
	|			И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 1
	|					ТОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|							И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				КОГДА ПриоритетНормы.Приоритет = 2
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета
	|;  
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","ДанныеДляРасчетаПередНормой","НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ДанныеДляРасчетаПередНормой.КонПок КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ДанныеДляРасчетаПЕредНормой,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|				И ДанныеДляРасчетаПередНормой.Услуга = &ТЭ
	|			ТОГДА ЗНАЧЕНИЕ(СПравочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ энргВидыУслуг.ЗависитОтУслуги
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.КоэффициентРасчета = 1
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ТочкиНачисленияНормы.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчетаПередНормой.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература,
	|	ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха КАК ПроектнаяТемператураНаружногоВоздуха,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,	
	|	ДанныеДляРасчетаПередНормой.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	ЕСТЬNULL(ЗначенияПовышающихКоэффициентов.Коэффициент, 1) КАК ПовышающийКоэффициент,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|				И ДанныеДляРасчетаПередНормой.Услуга = &ТЭ
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетГВС,
	|	РасположениеТУОтносительноГБП.ГБП КАК ГБП,
	|	ЕСТЬNULL(ДанныеДляРасчетаПередНормой.Услуга.СодержитПотери,Ложь) КАК СодержитПотери
	|ПОМЕСТИТЬ ДанныеДляРасчетаТипНачисления
	|ИЗ
	|	ДанныеДляРасчетаПередНормойТипНачисления КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормыбестНачислениеНП КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ТочкиНачисленияНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.Договор = ТочкиНачисленияНормы.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТочкиНачисленияНормы.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ДанныеДляРасчетаПередНормой.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияПовышающихКоэффициентов.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасположениеТУОтносительноГБП КАК РасположениеТУОтносительноГБП
	|		ПО ДанныеДляРасчетаПередНормой.Организация = РасположениеТУОтносительноГБП.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = РасположениеТУОтносительноГБП.Район
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = РасположениеТУОтносительноГБП.ТочкаУчета
	|;  
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ДанныеДляРасчетабестНачислениеНП.Организация КАК Организация,
	|ДанныеДляРасчетабестНачислениеНП.ПериодНачисления КАК ПериодНачисления,
	|ДанныеДляРасчетабестНачислениеНП.Район КАК Район,
	|ДанныеДляРасчетабестНачислениеНП.Договор КАК Договор,
	|ДанныеДляРасчетабестНачислениеНП.ОбъектРасчета КАК ОбъектРасчета,
	|ДанныеДляРасчетабестНачислениеНП.ТочкаУчета КАК ТочкаУчета,
	|ДанныеДляРасчетабестНачислениеНП.ЗначениеНагрузки КАК ЗначениеНагрузки
	|ПОМЕСТИТЬ ВТ_ПропорциональноНагрузке
	|ИЗ
	|ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчетабестНачислениеНП
	|ГДЕ
	|ДанныеДляРасчетабестНачислениеНП.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПропорциональноНагрузке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПропорциональноНагрузке.Организация КАК Организация,
	|ВТ_ПропорциональноНагрузке.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ПропорциональноНагрузке.Район КАК Район,
	|	ВТ_ПропорциональноНагрузке.Договор КАК Договор,
	|	ВТ_ПропорциональноНагрузке.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ПропорциональноНагрузке.ТочкаУчета КАК ТочкаУчета,
	|	СУММА(ВТ_ПропорциональноНагрузке.ЗначениеНагрузки) КАК ЗначениеНагрузки
	|ПОМЕСТИТЬ ВТ_СуммарнаяНагрузка
	|ИЗ
	|	ВТ_ПропорциональноНагрузке КАК ВТ_ПропорциональноНагрузке
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПропорциональноНагрузке.Организация,
	|	ВТ_ПропорциональноНагрузке.ПериодНачисления,
	|	ВТ_ПропорциональноНагрузке.Район,
	|	ВТ_ПропорциональноНагрузке.Договор,
	|	ВТ_ПропорциональноНагрузке.ОбъектРасчета,
	|	ВТ_ПропорциональноНагрузке.ТочкаУчета
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация КАК Организация,
	|	ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчета.Район КАК Район,
	|	ДанныеДляРасчета.Договор КАК Договор,
	|	ДанныеДляРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчета.МКД КАК МКД,
	|	ДанныеДляРасчета.Услуга КАК Услуга,
	|	ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчета.Шкала КАК Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен КАК ПриборВведен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|			ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК ОбъемУслугиПотребленный,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|						ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|					ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|				КОНЕЦ КАК ЧИСЛО(15, 6))
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КАК СпособНачисления,
	|	ДанныеДляРасчета.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчета.НачПок КАК НачальныеПоказания,
	|	ДанныеДляРасчета.КонПок КАК КонечныеПоказания,
	|	ДанныеДляРасчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления КАК НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	1 КАК ПовыщающийКоэффициент,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПропорциональноНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СуммарнаяНагрузка.ТочкаУчета ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СуммарнаяНагрузка.ЗначениеНагрузки = 0
	|								ТОГДА 0
	|							ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.ЗначениеНагрузки / ВТ_СуммарнаяНагрузка.ЗначениеНагрузки КАК ЧИСЛО(15, 6))
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентПропорциональности,
	|	ДанныеДляРасчета.ПриоритетГВС КАК ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП КАК ГБП,
	|	ДанныеДляРасчета.СодержитПотери КАК СодержитПотери
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиШкалПриборовУчетаНП.СрезПоследних КАК бестУслугиШкалПриборовУчетаНПСрезПоследних
	|		ПО ДанныеДляРасчета.Организация = бестУслугиШкалПриборовУчетаНПСрезПоследних.Организация
	|			И ДанныеДляРасчета.ТочкаУчета = бестУслугиШкалПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ДанныеДляРасчета.ПриборУчета = бестУслугиШкалПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И ДанныеДляРасчета.Услуга = бестУслугиШкалПриборовУчетаНПСрезПоследних.Услуга
	|			И ДанныеДляРасчета.Шкала = бестУслугиШкалПриборовУчетаНПСрезПоследних.Шкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммарнаяНагрузка КАК ВТ_СуммарнаяНагрузка
	|		ПО ДанныеДляРасчета.Организация = ВТ_СуммарнаяНагрузка.Организация
	|			И ДанныеДляРасчета.ТочкаУчета = ВТ_СуммарнаяНагрузка.ТочкаУчета
	|			И ДанныеДляРасчета.ОбъектРасчета = ВТ_СуммарнаяНагрузка.ОбъектРасчета
	|ГДЕ
	|	ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.ЕстьПоказанияАбонента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.Услуга В (&ОтоплениеВентиляция)
	|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(ДанныеДляРасчета.НачалоПериода, ДанныеДляРасчета.КонецПериода, ЧАС)
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|					ИНАЧЕ 1
	|				КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде * 24) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.Услуга В (&ОтоплениеВентиляция)
	|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(ДанныеДляРасчета.НачалоПериода, ДанныеДляРасчета.КонецПериода, ЧАС)
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|					ИНАЧЕ 1
	|				КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0 
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ИспользоватьПовыщающийКоэффициент
	|				И НЕ ДанныеДляРасчета.НетВозможностьУстановкиПУ
	|			ТОГДА ДанныеДляРасчета.ПовышающийКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * ДанныеДляРасчета.КоэффициентСезоности * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * ДанныеДляРасчета.КоэффициентСезоности * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем > 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(ДанныеДляРасчета.НачалоПериода, ДанныеДляРасчета.КонецПериода, ЧАС)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|					ИНАЧЕ 1
	|				КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ЕСТЬNULL(ДанныеДляРасчета.ТемператураВнутриПомещения, 18) - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(ДанныеДляРасчета.НачалоПериода, ДанныеДляРасчета.КонецПериода, ЧАС)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|					ИНАЧЕ 1
	|				КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|	И ДанныеДляРасчета.СреднийОбъем = 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|";
	
	Если не ФормируемВременную тогда
		Текст 		= Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	Район,
		|	Договор,
		|	ОбъектРасчета,
		|	СодержитПотери,
		|	РасчетПоФормуле,		
		|	ТочкаУчета,
		|	НачалоПериода,
		|	КонецПериода,
		|	ЗависитОтУслуги,
	    |	ПриоритетГВС
		|	ИТОГИ ПО
		|    Договор,
		|    ДокументНачисления";

	КонецЕсли;
	
	Если не ФормируемВременную тогда
		Текст 		= СтрЗаменить(Текст,"ПОМЕСТИТЬ ДанныеНачисленийТипНачисления","");		
	КонецЕсли; 
	
	Текст = СтрЗаменить(Текст,"ТипНачисления",ИмяДокумента);
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти 

#Область Начислить_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде,ОтборПоДому)
	
	МВТ  = Новый МенеджерВременныхТаблиц;
	ВспомогательныеДанныеНачисленияНП(МВТ,Организация, ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ОтборПоДому,ДнейВПериоде);
	ПолучитьСтабильныеПериодыНП(МВТ,Ложь);
	ПолучитьДанныеДляРасчетаНП(МВТ,ЛОЖЬ,Ложь,"бестНачислениеНП");
	Возврат РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,ЛОЖЬ,Ложь,"бестНачислениеНП");
	
	
КонецФункции

#КонецОбласти


#Область ЗакрытьПериодДляРедактирования_ВспомогательныеФункции

Функция ДокуметЗакрытияПериода(ПериодНачисления,Район)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	НЕ энргЗакрытиеПериода.ПометкаУдаления
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат  Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.энргЗакрытиеПериода.ПустаяСсылка();	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляОтладкиИТестирования

Функция ПрочитатьДанныеВременнойТаблицы(МВТ,ТекстЗапроса) 
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область НачислениеПоДолевымСхемам

Процедура РаспределитьОбъемПоУслугеПомещения(ПериодНачисления, Организация, Район, Строение, Помещение, Услуга, ЗначенияТарифов, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей)
	
	ПустаяТочкаУчета 					= Справочники.энргТочкиУчета.ПустаяСсылка();
	ВидНачисления 						= Перечисления.энргВидыНачислений.Начисление;
	
	кРаспределения                      = 0;
	
	Для Каждого СтрокаНачисленийАбонента Из ДанныеПоУслуге.ДанныеНачисленийАбонентов Цикл
		СтрокаНабора  					= НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
		СтрокаНабора.Распределение 		= Истина;
		СтрокаНабора.ОбъемУслуги 		= -СтрокаНабора.ОбъемУслуги;
		СтрокаНабора.Сумма 				= -СтрокаНабора.Сумма;
		СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
	КонецЦикла;
	
	
	Если ДанныеПоУслуге.СуммарныйОбъемАбонентов <> 0 И ДанныеПоУслуге.СуммарныйОбъемАбонентов >= ДанныеПоУслуге.ОбъемУслуги Тогда 
		//Для Каждого СтрокаНачисленийАбонента Из ДанныеПоУслуге.ДанныеНачисленийАбонентов Цикл
		//	СтрокаНабора  					= НаборЗаписей.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
		//	СтрокаНабора.Распределение 		= Истина;
		//	СтрокаНабора.ОбъемУслуги 		= -СтрокаНабора.ОбъемУслуги;
		//	СтрокаНабора.Сумма 				= -СтрокаНабора.Сумма;
		//	СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
		//КонецЦикла;
		кРаспределения =  ДанныеПоУслуге.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемАбонентов;
		ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги;
	Иначе
		ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги - ДанныеПоУслуге.СуммарныйОбъемАбонентов;
	КонецЕсли;	
	
	//ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги - ;
	
	Если ОсталосьРаспределить <= 0 Тогда
		Возврат;
	КонецЕсли;	
	
	АбонентыДляРаспределения 			= ДанныеПоУслуге.АбонентыДляРаспределения;
	Распределили 						= 0;
	Для Сч = 0 По АбонентыДляРаспределения.ВГраница() Цикл
		
		ДанныеАбонента 					= АбонентыДляРаспределения[Сч];
		
		//КоличествоПроживающих = ?(ДанныеАбонента.КоличествоПроживающих = 0,?(ДанныеАбонента.КоличествоПрописанных = 0, ДанныеАбонента.КоличествоСобственников, ДанныеАбонента.КоличествоПрописанных),ДанныеАбонента.КоличествоПроживающих);
		
		Если Сч = АбонентыДляРаспределения.ВГраница() Тогда
			ОбъемУслуги 				= ОсталосьРаспределить - Распределили;
		Иначе
			Если ДанныеПоУслуге.УказанВидПлощади Тогда
				кПлощади 					= ДанныеАбонента.ЗначениеПлощади / ДанныеПоУслуге.ВсегоПлощадьАбонентов;
				ОбъемУслуги 				= ОсталосьРаспределить * кПлощади;	
			Иначе
				кПроживающих 				= ДанныеАбонента.КоличествоЖильцов / ДанныеПоУслуге.КоличествоЖильцов;
				ОбъемУслуги 				= ОсталосьРаспределить * кПроживающих;		
			КонецЕсли;
			
			////Если ДанныеПоУслуге.СуммарныйОбъемАбонентов > ДанныеПоУслуге.ОбъемУслуги Тогда
			////	ОбъемУслуги                     = ДанныеАбонента.ОбъемУслуги * кРаспределения;
			////	//Если ДанныеАбонента.ДолевоеРаспределение Тогда
			////	//	//Доля = ДанныеАбонента.ДоляПотребленияЧислитель / ДанныеАбонента.ДоляПотребленияЗнаменатель;
			////	//	//ОбъемУслуги 					= ДанныеПоУслуге.ОбъемУслуги * Доля;
			////	//ИначеЕсли ДанныеАбонента.ФиксированныйОбъемПотребления <> 0 Тогда
			////	//	Если ДанныеПоУслуге.СуммарныйОбъемАбонентов > ДанныеПоУслуге.ОбъемУслуги Тогда
			////	//		ОбъемУслуги                     = ДанныеАбонента.ОбъемУслуги * кРаспределения;
			////	//	Иначе
			////	//		ОбъемУслуги                     = 0;
			////	//		Распределили                    = Распределили + ДанныеАбонента.ОбъемУслуги;
			////	//	КонецЕсли;
			////	
			////Иначе
			////	Если ДанныеАбонента.ДопСоглашение Тогда
			////		ОбъемУслуги                     = ОсталосьРаспределить * ДанныеАбонента.КоэффициентРаспределенияОстатка / 100;
			////		
			////	Иначе
			////		Если ЗначениеЗаполнено(ДанныеАбонента.ЗначениеПлощади) Тогда
			////			кПлощади 					= ДанныеАбонента.ЗначениеПлощади / ДанныеПоУслуге.ВсегоПлощадьАбонентов;
			////			ОбъемУслуги 				= ОсталосьРаспределить * кПлощади;	
			////		Иначе
			////			кПроживающих 				= ДанныеАбонента.КоличествоЖильцов / ДанныеПоУслуге.ДанныеАбонента;
			////			ОбъемУслуги 				= ОсталосьРаспределить * кПроживающих;		
			////		КонецЕсли;
			////	КонецЕсли;
			////	
			////КонецЕсли; 
	КонецЕсли; 
	
	//ХэшСтрокиТарифа 					= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа,Услуга,ДанныеАбонента.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
	//ЗначениеТарифа 						= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
	
	СтрокаНабора  							= НаборЗаписей.Добавить();
	СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
	СтрокаНабора.Район 						= Район;
	СтрокаНабора.Распределение 				= Истина;
	СтрокаНабора.Организация				= Организация;
	СтрокаНабора.Строение 					= Строение;
	СтрокаНабора.Помещение                  = ДанныеАбонента.Помещение;
		СтрокаНабора.Абонент					= ДанныеАбонента.Абонент;
		СтрокаНабора.Услуга						= Услуга;
		СтрокаНабора.ТочкаУчета					= ПустаяТочкаУчета;
		СтрокаНабора.ВидНачисления 				= ВидНачисления;
		СтрокаНабора.СпособНачисления 			= ДанныеПоУслуге.СпособНачисления;
		СтрокаНабора.Поставщик 					= ДанныеАбонента.Поставщик;
		СтрокаНабора.ПериодРасчета				= ПериодНачисления;
		СтрокаНабора.ПериодНачисления			= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 			= ДанныеАбонента.ЗначениеПлощади;
		СтрокаНабора.КоличествоПрописанных 		= ДанныеАбонента.КоличествоПрописанных;
		СтрокаНабора.КоличествоПроживающих 		= ДанныеАбонента.КоличествоПроживающих;
		СтрокаНабора.КоличествоСобственников 	= ДанныеАбонента.КоличествоСобственников;
		Распределили 							= Распределили + СтрокаНабора.ОбъемУслуги;								
		
	КонецЦикла;	  
	
КонецПроцедуры

Функция ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(Договор)
	
	Текст = "ВЫБРАТЬ
	        |	бестОтложенныеДвиженияДокументовНП.Организация КАК Организация,
	        |	бестОтложенныеДвиженияДокументовНП.Район КАК Район,
	        |	бестОтложенныеДвиженияДокументовНП.Договор КАК Договор,
	        |	бестОтложенныеДвиженияДокументовНП.ПериодНачисления КАК ПериодНачисления
	        |ПОМЕСТИТЬ ДокументыДляРаспределения
	        |ИЗ
	        |	РегистрСведений.бестОтложенныеДвиженияДокументовНП КАК бестОтложенныеДвиженияДокументовНП
	        |ГДЕ
	        |	бестОтложенныеДвиженияДокументовНП.Организация = &Организация
	        |	И бестОтложенныеДвиженияДокументовНП.ПериодНачисления = &ПериодНачисления
	        |	И бестОтложенныеДвиженияДокументовНП.Район = &Район
	        |	И бестОтложенныеДвиженияДокументовНП.Договор = &Договор
	        |	И бестОтложенныеДвиженияДокументовНП.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСтабильныеПериодыНП.Организация КАК Организация,
	        |	бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	        |	бестСтабильныеПериодыНП.Район КАК Район,
	        |	бестСтабильныеПериодыНП.МКД КАК МКД,
	        |	бестСтабильныеПериодыНП.Договор КАК Договор,
	        |	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	        |	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестСтабильныеПериодыНП.НомерПозиции КАК НомерПозиции,
	        |	бестСтабильныеПериодыНП.ПериодРегистрации КАК ПериодРегистрации,
	        |	бестСтабильныеПериодыНП.ДатаРегистратора КАК ДатаРегистратора,
	        |	бестСтабильныеПериодыНП.ДокРегистратор КАК ДокРегистратор,
	        |	бестСтабильныеПериодыНП.ДоговорЗаключен КАК ДоговорЗаключен,
	        |	бестСтабильныеПериодыНП.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	        |	бестСтабильныеПериодыНП.УслугаПодключена КАК УслугаПодключена,
	        |	бестСтабильныеПериодыНП.ПриборВведен КАК ПриборВведен,
	        |	бестСтабильныеПериодыНП.ПриборУчета КАК ПриборУчета,
	        |	бестСтабильныеПериодыНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	бестСтабильныеПериодыНП.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	бестСтабильныеПериодыНП.ТарифнаяГруппа КАК ТарифнаяГруппа,
	        |	бестСтабильныеПериодыНП.ДатаПоверки КАК ДатаПоверки,
	        |	бестСтабильныеПериодыНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	бестСтабильныеПериодыНП.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	бестСтабильныеПериодыНП.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	        |	бестСтабильныеПериодыНП.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	        |	бестСтабильныеПериодыНП.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	        |	бестСтабильныеПериодыНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	        |	бестСтабильныеПериодыНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	        |	бестСтабильныеПериодыНП.РасчетПоФормуле КАК РасчетПоФормуле,
	        |	бестСтабильныеПериодыНП.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	        |	бестСтабильныеПериодыНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	бестСтабильныеПериодыНП.КлючНорматива КАК КлючНорматива,
	        |	бестСтабильныеПериодыНП.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	        |	бестСтабильныеПериодыНП.Поставщик КАК Поставщик,
	        |	бестСтабильныеПериодыНП.Шкала КАК Шкала,
	        |	бестСтабильныеПериодыНП.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	        |	бестСтабильныеПериодыНП.СоставнаяУслуга КАК СоставнаяУслуга,
	        |	бестСтабильныеПериодыНП.ФормулаРасчета КАК ФормулаРасчета,
	        |	бестСтабильныеПериодыНП.ТипСхемыГВС КАК ТипСхемыГВС,
	        |	бестСтабильныеПериодыНП.ВидТепловогоПункта КАК ВидТепловогоПункта,
	        |	бестСтабильныеПериодыНП.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	        |	бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы
	        |ПОМЕСТИТЬ СтабПериоды
	        |ИЗ
	        |	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	        |		ПО бестСтабильныеПериодыНП.Организация = ДокументыДляРаспределения.Организация
	        |			И бестСтабильныеПериодыНП.Район = ДокументыДляРаспределения.Район
	        |			И бестСтабильныеПериодыНП.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	        |			И бестСтабильныеПериодыНП.Договор = ДокументыДляРаспределения.Договор
	        |			И (бестСтабильныеПериодыНП.Организация = &Организация)
	        |			И (бестСтабильныеПериодыНП.Район = &Район)
	        |			И (бестСтабильныеПериодыНП.Договор = &Договор)
	        |			И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	        |			И (бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	МИНИМУМ(СтабПериоды.НомерПозиции) КАК НомерПозиции
	        |ПОМЕСТИТЬ СтабПериодыМинНомерПозиции
	        |ИЗ
	        |	СтабПериоды КАК СтабПериоды
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	        |		ПО СтабПериоды.Организация = ДокументыДляРаспределения.Организация
	        |			И СтабПериоды.Район = ДокументыДляРаспределения.Район
	        |			И СтабПериоды.ПериодНачисления = ДокументыДляРаспределения.Договор
	        |			И СтабПериоды.Договор = ДокументыДляРаспределения.ПериодНачисления
	        |			И (СтабПериоды.Организация = &Организация)
	        |			И (СтабПериоды.Район = &Район)
	        |			И (СтабПериоды.Договор = &Договор)
	        |			И (СтабПериоды.ПериодНачисления = &ПериодНачисления)
	        |			И (СтабПериоды.УчаствуетВДолевойСхеме)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтабПериоды.Организация,
	        |	СтабПериоды.Район,
	        |	СтабПериоды.Договор,
	        |	СтабПериоды.ОбъектРасчета,
	        |	СтабПериоды.Услуга,
	        |	СтабПериоды.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.МКД КАК МКД,
	        |	СтабПериоды.Услуга КАК Услуга1,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	СтабПериоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	СтабПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	СтабПериоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы
	        |ПОМЕСТИТЬ СтабПериодыПоМинПозиции
	        |ИЗ
	        |	СтабПериоды КАК СтабПериоды
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериодыМинНомерПозиции КАК СтабПериодыМинНомерПозиции
	        |		ПО СтабПериоды.Организация = СтабПериодыМинНомерПозиции.Организация
	        |			И СтабПериоды.Район = СтабПериодыМинНомерПозиции.Район
	        |			И СтабПериоды.Договор = СтабПериодыМинНомерПозиции.Договор
	        |			И СтабПериоды.ОбъектРасчета = СтабПериодыМинНомерПозиции.ОбъектРасчета
	        |			И СтабПериоды.Услуга = СтабПериодыМинНомерПозиции.Услуга
	        |			И СтабПериоды.ТочкаУчета = СтабПериодыМинНомерПозиции.ТочкаУчета
	        |			И СтабПериоды.НомерПозиции = СтабПериодыМинНомерПозиции.НомерПозиции";
	
	
	Текст 							=
	"ВЫБРАТЬ
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОтложенныеДвиженияДокументов.Организация КАК Организация,
	|	энргОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	|	энргОтложенныеДвиженияДокументов.Район КАК Район,
	|	энргОтложенныеДвиженияДокументов.Строение КАК Строение
	|ПОМЕСТИТЬ ДокументыДляРаспределения
	|ИЗ
	|	РегистрСведений.энргОтложенныеДвиженияДокументов КАК энргОтложенныеДвиженияДокументов
	|ГДЕ
	|	энргОтложенныеДвиженияДокументов.Организация = &Организация
	|	И энргОтложенныеДвиженияДокументов.ПериодНачисления = &ПериодНачисления
	|	И энргОтложенныеДвиженияДокументов.Район = &Район
	|	И энргОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.РаспределениеПомещения)
	|	И НЕ энргОтложенныеДвиженияДокументов.ЧастныйСектор
	|	И энргОтложенныеДвиженияДокументов.Строение = &Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПомещенияСрезПоследних.Организация КАК Организация,
	|	энргСостояниеПомещенияСрезПоследних.Район КАК Район,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ПОМЕСТИТЬ ПомещенияСРазделеннымиЛС
	|ИЗ
	|	РегистрСведений.энргСостояниеПомещения.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргСостояниеПомещенияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО энргСостояниеПомещенияСрезПоследних.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|ГДЕ
	|	энргСостояниеПомещенияСрезПоследних.ЯвляетсяПомещениемСРаздЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргСтабильныеПериоды.Организация КАК Организация,
	|	энргСтабильныеПериоды.Район КАК Район,
	|	энргСтабильныеПериоды.Строение КАК МКД,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	МИНИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ СтабПериодыМинНомерСтроки
	|ИЗ
	|	ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО ДокументыДляРаспределения.Организация = энргСтабильныеПериоды.Организация
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И ДокументыДляРаспределения.Район = энргСтабильныеПериоды.Район
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И ДокументыДляРаспределения.Строение = энргСтабильныеПериоды.Строение
	|			И (энргСтабильныеПериоды.Строение = &Строение)
	|			И (энргСтабильныеПериоды.ЯвляетсяПомещениемСРазделеннымиЛС)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Организация,
	|	энргСтабильныеПериоды.Район,
	|	энргСтабильныеПериоды.Строение,
	|	энргСтабильныеПериоды.Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета,
	|	энргСтабильныеПериоды.Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.Организация КАК Организация,
	|	энргСтабильныеПериоды.Район КАК Район,
	|	энргСтабильныеПериоды.Строение КАК Строение,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериоды.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргСтабильныеПериоды.КоличествоЖильцов КАК КоличествоЖильцов
	|ПОМЕСТИТЬ СтабПериодыПоМинПозиции
	|ИЗ
	|	СтабПериодыМинНомерСтроки КАК СтабПериодыМинНомерСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО СтабПериодыМинНомерСтроки.Организация = энргСтабильныеПериоды.Организация
	|			И СтабПериодыМинНомерСтроки.Район = энргСтабильныеПериоды.Район
	|			И СтабПериодыМинНомерСтроки.МКД = энргСтабильныеПериоды.Строение
	|			И СтабПериодыМинНомерСтроки.Помещение = энргСтабильныеПериоды.Помещение
	|			И СтабПериодыМинНомерСтроки.Услуга = энргСтабильныеПериоды.Услуга
	|			И СтабПериодыМинНомерСтроки.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И СтабПериодыМинНомерСтроки.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргСтабильныеПериоды.Организация КАК Организация,
	|	энргСтабильныеПериоды.Район КАК Район,
	|	энргСтабильныеПериоды.Строение КАК МКД,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериоды.ЗначениеПлощади КАК ПлощадьМОП,
	|	энргСтабильныеПериоды.Помещение КАК Помещение
	|ПОМЕСТИТЬ УслугиМКДРаспределять
	|ИЗ
	|	ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО ДокументыДляРаспределения.Организация = энргСтабильныеПериоды.Организация
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И ДокументыДляРаспределения.Район = энргСтабильныеПериоды.Район
	|			И (энргСтабильныеПериоды.НомерПозиции = 0)
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И ДокументыДляРаспределения.Строение = энргСтабильныеПериоды.Строение
	|			И (энргСтабильныеПериоды.Строение = &Строение)
	|			И (энргСтабильныеПериоды.ЯвляетсяПомещениемСРазделеннымиЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабПериодыПоМинПозиции.Организация,
	|	СтабПериодыПоМинПозиции.Район,
	|	СтабПериодыПоМинПозиции.Строение,
	|	СтабПериодыПоМинПозиции.Услуга,
	|	СтабПериодыПоМинПозиции.ТочкаУчета,
	|	СтабПериодыПоМинПозиции.ЗначениеПлощади,
	|	СтабПериодыПоМинПозиции.Помещение
	|ИЗ
	|	ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериодыПоМинПозиции КАК СтабПериодыПоМинПозиции
	|		ПО ДокументыДляРаспределения.Организация = СтабПериодыПоМинПозиции.Организация
	|			И ДокументыДляРаспределения.Район = СтабПериодыПоМинПозиции.Район
	|			И (СтабПериодыПоМинПозиции.Организация = &Организация)
	|			И (СтабПериодыПоМинПозиции.Район = &Район)
	|			И ДокументыДляРаспределения.Строение = СтабПериодыПоМинПозиции.Строение
	|			И (СтабПериодыПоМинПозиции.Строение = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|	энргВидыУслуг.НачислятьПоСостояниюНаНачалоРасчетногоПериода КАК НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|ПОМЕСТИТЬ ПоследниеНомераСтрока
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляРаспределения.Организация КАК Организация,
	|		ДокументыДляРаспределения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляРаспределения.Район КАК Район,
	|		ДокументыДляРаспределения.Строение КАК Строение,
	|		энргНомераСтрокСтабильногоПериода.Помещение КАК Помещение,
	|		энргНомераСтрокСтабильногоПериода.Услуга КАК Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНомераСтрокСтабильногоПериода КАК энргНомераСтрокСтабильногоПериода
	|			ПО ДокументыДляРаспределения.Организация = энргНомераСтрокСтабильногоПериода.Организация
	|				И ДокументыДляРаспределения.ПериодНачисления = энргНомераСтрокСтабильногоПериода.ПериодНачисления
	|				И ДокументыДляРаспределения.Район = энргНомераСтрокСтабильногоПериода.Район
	|				И ДокументыДляРаспределения.Строение = энргНомераСтрокСтабильногоПериода.Строение
	|				И (энргНомераСтрокСтабильногоПериода.Организация = &Организация)
	|				И (энргНомераСтрокСтабильногоПериода.ПериодНачисления = &ПериодНачисления)
	|				И (энргНомераСтрокСтабильногоПериода.Район = &Район)
	|				И (НЕ энргНомераСтрокСтабильногоПериода.ЧастныйСектор)
	|				И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)
	|				И (энргНомераСтрокСтабильногоПериода.Помещение.ТипПомещения = ЗНАЧЕНИЕ(Перечисление.энргТипыПомещений.Комната)),
	|		ПомещенияСРазделеннымиЛС КАК ПомещенияСРазделеннымиЛС
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументыДляРаспределения.Организация,
	|		ДокументыДляРаспределения.ПериодНачисления,
	|		ДокументыДляРаспределения.Район,
	|		ДокументыДляРаспределения.Строение,
	|		энргНомераСтрокСтабильногоПериода.Помещение,
	|		энргНомераСтрокСтабильногоПериода.Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеНомераСтрока.Организация КАК Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления КАК ПериодНачисления,
	|	ПоследниеНомераСтрока.Район КАК Район,
	|	ПоследниеНомераСтрока.Строение КАК Строение,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	энргСтабильныеПериоды.Абонент КАК Абонент,
	|	ПоследниеНомераСтрока.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.ПриборВведен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриборов,
	|	МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Абонент = энргСтабильныеПериоды.Поставщик
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьСобственнаяПоставка,
	|	МАКСИМУМ(энргСтабильныеПериоды.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	энргСтабильныеПериоды.Поставщик КАК Поставщик,
	|	энргСтабильныеПериоды.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	энргСтабильныеПериоды.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	энргСтабильныеПериоды.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	энргСтабильныеПериоды.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	энргСтабильныеПериоды.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргСтабильныеПериоды.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргСтабильныеПериоды.КоличествоСобственников КАК КоличествоСобственников,
	|	энргСтабильныеПериоды.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргСтабильныеПериоды.Помещение.Родитель КАК ПомещениеСРазделеннымиЛС
	|ПОМЕСТИТЬ АбонентыДляРаспределения
	|ИЗ
	|	ПоследниеНомераСтрока КАК ПоследниеНомераСтрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО ПоследниеНомераСтрока.Организация = энргСтабильныеПериоды.Организация
	|			И ПоследниеНомераСтрока.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|			И (энргСтабильныеПериоды.Строение = &Строение)
	|			И ПоследниеНомераСтрока.Район = энргСтабильныеПериоды.Район
	|			И ПоследниеНомераСтрока.Строение = энргСтабильныеПериоды.Строение
	|			И ПоследниеНомераСтрока.Помещение = энргСтабильныеПериоды.Помещение
	|			И ПоследниеНомераСтрока.Услуга = энргСтабильныеПериоды.Услуга
	|			И ПоследниеНомераСтрока.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|					ТОГДА энргСтабильныеПериоды.НомерПозиции = 0
	|				ИНАЧЕ ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			КОНЕЦ)
	|			И (энргСтабильныеПериоды.ЛСОткрыт)
	|			И (энргСтабильныеПериоды.УслугаПодключена)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Помещение,
	|	энргСтабильныеПериоды.Абонент,
	|	ПоследниеНомераСтрока.Услуга,
	|	энргСтабильныеПериоды.Поставщик,
	|	энргСтабильныеПериоды.СпособРаспределенияОбъемаПомещения,
	|	энргСтабильныеПериоды.ФиксированныйОбъемПотребления,
	|	энргСтабильныеПериоды.ДоляПотребленияЧислитель,
	|	энргСтабильныеПериоды.ДоляПотребленияЗнаменатель,
	|	энргСтабильныеПериоды.КоэффициентРаспределенияОстатка,
	|	энргСтабильныеПериоды.КоличествоПрописанных,
	|	энргСтабильныеПериоды.КоличествоСобственников,
	|	энргСтабильныеПериоды.КоличествоПроживающих,
	|	энргСтабильныеПериоды.Помещение.Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АбонентыДляРаспределения.Помещение КАК Комната,
	|	ВЫБОР
	|		КОГДА НЕ АбонентыДляРаспределения.КоличествоПрописанных = 0
	|			ТОГДА АбонентыДляРаспределения.КоличествоПрописанных
	|		КОГДА НЕ АбонентыДляРаспределения.КоличествоПроживающих = 0
	|			ТОГДА АбонентыДляРаспределения.КоличествоПроживающих
	|		КОГДА НЕ АбонентыДляРаспределения.КоличествоСобственников = 0
	|			ТОГДА АбонентыДляРаспределения.КоличествоСобственников
	|	КОНЕЦ КАК КоличествоЖильцов,
	|	АбонентыДляРаспределения.Организация КАК Организация,
	|	АбонентыДляРаспределения.Район КАК Район,
	|	АбонентыДляРаспределения.Строение КАК Строение,
	|	АбонентыДляРаспределения.ПомещениеСРазделеннымиЛС КАК ПомещениеСРазделеннымиЛС
	|ПОМЕСТИТЬ КоличествоЖильцовПоАбонентам
	|ИЗ
	|	АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.ПомещениеСРазделеннымиЛС КАК ПомещениеСРазделеннымиЛС,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ВсегоАбонентов КАК ВсегоАбонентов,
	|	ВложенныйЗапрос.ВсегоСПриборомУчета КАК ВсегоСПриборомУчета,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|	ЕСТЬNULL(энргДокументыНачислений.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргРаспределениеМКД.ПустаяСсылка)) КАК ДокументРаспределения,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УказанВидПлощади,
	|	энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|	ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВложенныйЗапросКоличествоЖильцов.КоличествоЖильцов КАК КоличествоЖильцов
	|ПОМЕСТИТЬ ДанныеПомещенияПоУслугам
	|ИЗ
	|	(ВЫБРАТЬ
	|		АбонентыДляРаспределения.Организация КАК Организация,
	|		АбонентыДляРаспределения.ПериодНачисления КАК ПериодНачисления,
	|		АбонентыДляРаспределения.Район КАК Район,
	|		АбонентыДляРаспределения.Строение КАК Строение,
	|		АбонентыДляРаспределения.Услуга КАК Услуга,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АбонентыДляРаспределения.Помещение) КАК ВсегоАбонентов,
	|		СУММА(АбонентыДляРаспределения.КоличествоПриборов) КАК ВсегоСПриборомУчета,
	|		СУММА(АбонентыДляРаспределения.ЗначениеПлощади) КАК ВсегоПлощадьАбонентов,
	|		СУММА(АбонентыДляРаспределения.ПлощадьСобственнаяПоставка) КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|		СУММА(АбонентыДляРаспределения.КоличествоПрописанных) КАК КоличествоПрописанных,
	|		СУММА(АбонентыДляРаспределения.КоличествоСобственников) КАК КоличествоСобственников,
	|		СУММА(АбонентыДляРаспределения.КоличествоПроживающих) КАК КоличествоПроживающих,
	|		АбонентыДляРаспределения.ПомещениеСРазделеннымиЛС КАК ПомещениеСРазделеннымиЛС
	|	ИЗ
	|		АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АбонентыДляРаспределения.Организация,
	|		АбонентыДляРаспределения.ПериодНачисления,
	|		АбонентыДляРаспределения.Район,
	|		АбонентыДляРаспределения.Строение,
	|		АбонентыДляРаспределения.Услуга,
	|		АбонентыДляРаспределения.ПомещениеСРазделеннымиЛС) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|		ПО ВложенныйЗапрос.Организация = энргДокументыНачислений.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргДокументыНачислений.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргДокументыНачислений.Район
	|			И ВложенныйЗапрос.Строение = энргДокументыНачислений.МКД
	|			И (энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.РаспределениеМКД))
	|			И (энргДокументыНачислений.ПериодНачисления = &ПериодНачисления)
	|			И (энргДокументыНачислений.Организация = &Организация)
	|			И (энргДокументыНачислений.Район = &Район)
	|			И (энргДокументыНачислений.МКД = &Строение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(КоличествоЖильцовПоАбонентам.КоличествоЖильцов) КАК КоличествоЖильцов,
	|			КоличествоЖильцовПоАбонентам.Организация КАК Организация,
	|			КоличествоЖильцовПоАбонентам.Район КАК Район,
	|			КоличествоЖильцовПоАбонентам.Строение КАК Строение,
	|			КоличествоЖильцовПоАбонентам.ПомещениеСРазделеннымиЛС КАК ПомещениеСРазделеннымиЛС
	|		ИЗ
	|			КоличествоЖильцовПоАбонентам КАК КоличествоЖильцовПоАбонентам
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КоличествоЖильцовПоАбонентам.ПомещениеСРазделеннымиЛС,
	|			КоличествоЖильцовПоАбонентам.Организация,
	|			КоличествоЖильцовПоАбонентам.Район,
	|			КоличествоЖильцовПоАбонентам.Строение) КАК ВложенныйЗапросКоличествоЖильцов
	|		ПО ВложенныйЗапрос.Организация = ВложенныйЗапросКоличествоЖильцов.Организация
	|			И ВложенныйЗапрос.Район = ВложенныйЗапросКоличествоЖильцов.Район
	|			И ВложенныйЗапрос.Строение = ВложенныйЗапросКоличествоЖильцов.Строение
	|			И ВложенныйЗапрос.ПомещениеСРазделеннымиЛС = ВложенныйЗапросКоличествоЖильцов.ПомещениеСРазделеннымиЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Район КАК Район,
	|	энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Строение КАК Строение,
	|	энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|	УслугиМКДРаспределять.ПлощадьМОП КАК ПлощадьМОП,
	|	УслугиМКДРаспределять.Помещение КАК Помещение
	|ПОМЕСТИТЬ ОбъемыДляРаспределения
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Строение = &Строение) КАК энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиМКДРаспределять КАК УслугиМКДРаспределять
	|		ПО энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Организация = УслугиМКДРаспределять.Организация
	|			И энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Район = УслугиМКДРаспределять.Район
	|			И энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Услуга = УслугиМКДРаспределять.Услуга
	|			И энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.ТочкаУчета = УслугиМКДРаспределять.ТочкаУчета
	|			И энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Строение = УслугиМКДРаспределять.МКД
	|			И энргОбъемНачисленийПомещенийСРазделеннымиЛСОбороты.Помещение = УслугиМКДРаспределять.Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Район КАК Район,
	|	энргОбъемНачисленийОбороты.Строение КАК Строение,
	|	энргОбъемНачисленийОбороты.Помещение КАК Помещение,
	|	энргОбъемНачисленийОбороты.Абонент КАК Абонент,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачисленийОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала КАК Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачисленийОбороты.СуммаОборот КАК СуммаОборот,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ ЧастныйСектор
	|				И Строение = &Строение
	|				И Помещение В
	|					(ВЫБРАТЬ
	|						АбонентыДляРаспределения.Помещение
	|					ИЗ
	|						АбонентыДляРаспределения)) КАК энргОбъемНачисленийОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъемНачислений.Район КАК Район,
	|	ОбъемНачислений.Строение КАК Строение,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	СУММА(ОбъемНачислений.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ОбъемНачислений.ОбъемУслугиОборот) КАК ОбъемУслугиОборот,
	|	ОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	ОбъемНачислений.Помещение.Родитель КАК ПомещениеСРазделеннымиЛС
	|ПОМЕСТИТЬ ОбъемПотребленияИПУПоРазделеннымЛС
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|ГДЕ
	|	ОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Район,
	|	ОбъемНачислений.Строение,
	|	ОбъемНачислений.Услуга,
	|	ОбъемНачислений.СпособНачисления,
	|	ОбъемНачислений.Помещение.Родитель";
	
	//Если Строение = Неопределено Тогда		
	//	Текст 						= СтрЗаменить(Текст,"И (энргРаспределениеМКД.МКД = &Строение)","");
	//	Текст 						= СтрЗаменить(Текст,"И энргОтложенныеДвиженияДокументов.Строение = &Строение","");
	//	Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)","");
	//	Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.Строение = &Строение)","");
	//	Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &Строение)","");		
	//	Текст 						= СтрЗаменить(Текст,"И Строение = &Строение","");
	//	Текст 						= СтрЗаменить(Текст,"И (бестОбъектыРасчета.МКД = &Строение)","");
	//	Текст 						= СтрЗаменить(Текст,"И МКД = &Строение","");
	//	Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.МКД = &Строение)","");
	//	Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.МКД = &Строение)","");
	//	Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.МКД = &Строение)","");
	//	Текст 						= СтрЗаменить(Текст,"И (энргДокументыНачислений.МКД = &Строение)","");		
	//КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам(Договор)
	Текст 							= 
	"ВЫБРАТЬ
	|	ЗначенияТекущихТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТекущихТарифов.Услуга КАК Услуга,
	|	ЗначенияТекущихТарифов.Поставщик КАК Поставщик,
	|	ЗначенияТекущихТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЗначенияТекущихТарифов.Значение КАК Значение,
	|	ЗначенияТекущихТарифов.СтавкаНДС КАК СтавкаНДС,
	|	ЗначенияТекущихТарифов.НДСВнутри КАК НДСВнутри
	|ИЗ
	|	ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|ГДЕ
	|	(ЗначенияТекущихТарифов.ГруппаПотребителей, ЗначенияТекущихТарифов.Услуга, ЗначенияТекущихТарифов.Поставщик) В
	|			(ВЫБРАТЬ
	|				АбонентыДляРаспределения.ТарифнаяГруппа,
	|				АбонентыДляРаспределения.Услуга,
	|				АбонентыДляРаспределения.Поставщик
	|			ИЗ
	|				АбонентыДляРаспределения КАК АбонентыДляРаспределения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ВсегоАбонентов КАК ВсегоАбонентов,
	|	ВложенныйЗапрос.ПлощадьМОП КАК ПлощадьМОП,
	|	ВложенныйЗапрос.ВсегоСПриборомУчета КАК ВсегоСПриборомУчета,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|	ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	ВложенныйЗапрос.НачисленаТолькоНорма КАК НачисленаТолькоНорма,
	|	ВложенныйЗапрос.ДокументРаспределения КАК ДокументРаспределения,
	|	ВложенныйЗапрос.ЕстьНачислениеПоПриборам КАК ЕстьНачислениеПоПриборам,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.УказанВидПлощади КАК УказанВидПлощади,
	|	ВложенныйЗапрос.ПомещениеСРазделеннымиЛС КАК ПомещениеСРазделеннымиЛС,
	|	ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ВложенныйЗапрос.ОбъемПотребленияПоРазделеннымЛСПоИПУ КАК ОбъемПотребленияПоРазделеннымЛСПоИПУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеМКДПоУслугам.Строение КАК Строение,
	|		ДанныеМКДПоУслугам.ПомещениеСРазделеннымиЛС КАК ПомещениеСРазделеннымиЛС,
	|		ДанныеМКДПоУслугам.Услуга КАК Услуга,
	|		ДанныеМКДПоУслугам.ВсегоАбонентов КАК ВсегоАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоСПриборомУчета КАК ВсегоСПриборомУчета,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|		ДанныеМКДПоУслугам.УказанВидПлощади КАК УказанВидПлощади,
	|		СУММА(ОбъемыДляРаспределения.ОбъемУслугиОборот) КАК ОбъемУслуги,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ОбъемыДляРаспределения.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК НачисленаТолькоНорма,
	|		МАКСИМУМ(ОбъемыДляРаспределения.ПлощадьМОП) КАК ПлощадьМОП,
	|		ДанныеМКДПоУслугам.ДокументРаспределения КАК ДокументРаспределения,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ОбъемыДляРаспределения.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ЕстьНачислениеПоПриборам,
	|		ОбъемыДляРаспределения.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ОбъемыДляРаспределения.СпособНачисления КАК СпособНачисления,
	|		ДанныеМКДПоУслугам.КоличествоЖильцов КАК КоличествоЖильцов,
	|		ЕСТЬNULL(ОбъемПотребленияИПУПоРазделеннымЛС.ОбъемУслугиОборот, 0) КАК ОбъемПотребленияПоРазделеннымЛСПоИПУ
	|	ИЗ
	|		ДанныеПомещенияПоУслугам КАК ДанныеМКДПоУслугам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыДляРаспределения КАК ОбъемыДляРаспределения
	|			ПО ДанныеМКДПоУслугам.Район = ОбъемыДляРаспределения.Район
	|				И ДанныеМКДПоУслугам.Строение = ОбъемыДляРаспределения.Строение
	|				И ДанныеМКДПоУслугам.Услуга = ОбъемыДляРаспределения.Услуга
	|			ЛЕВОЕ СОЕДИНЕНИЕ ОбъемПотребленияИПУПоРазделеннымЛС КАК ОбъемПотребленияИПУПоРазделеннымЛС
	|			ПО ДанныеМКДПоУслугам.ПомещениеСРазделеннымиЛС = ОбъемПотребленияИПУПоРазделеннымЛС.ПомещениеСРазделеннымиЛС
	|				И ДанныеМКДПоУслугам.Услуга = ОбъемПотребленияИПУПоРазделеннымЛС.Услуга
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеМКДПоУслугам.Строение,
	|		ДанныеМКДПоУслугам.Услуга,
	|		ДанныеМКДПоУслугам.ВсегоАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоСПриборомУчета,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентов,
	|		ДанныеМКДПоУслугам.УказанВидПлощади,
	|		ОбъемыДляРаспределения.ТарифнаяЗона,
	|		ОбъемыДляРаспределения.СпособНачисления,
	|		ДанныеМКДПоУслугам.ДокументРаспределения,
	|		ДанныеМКДПоУслугам.ПомещениеСРазделеннымиЛС,
	|		ДанныеМКДПоУслугам.КоличествоЖильцов,
	|		ЕСТЬNULL(ОбъемПотребленияИПУПоРазделеннымЛС.ОбъемУслугиОборот, 0)) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|ИТОГИ
	|	МАКСИМУМ(ДокументРаспределения)
	|ПО
	|	Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АбонентыДляРаспределения.Организация КАК Организация,
	|	АбонентыДляРаспределения.Район КАК Район,
	|	АбонентыДляРаспределения.Строение КАК Строение,
	|	АбонентыДляРаспределения.ПомещениеСРазделеннымиЛС КАК ПомещениеСРазделеннымиЛС,
	|	АбонентыДляРаспределения.Помещение КАК Помещение,
	|	АбонентыДляРаспределения.Абонент КАК Абонент,
	|	АбонентыДляРаспределения.Услуга КАК Услуга,
	|	АбонентыДляРаспределения.ЗначениеПлощади КАК ЗначениеПлощадиДляРаспределения,
	|	АбонентыДляРаспределения.ТарифнаяГруппа КАК ТарифнаяГруппаДляРаспределения,
	|	АбонентыДляРаспределения.Поставщик КАК ПоставщикДляРаспределения,
	|	ОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	ОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	ОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемНачислений.Шкала КАК Шкала,
	|	ОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ОбъемНачислений.Поставщик КАК Поставщик,
	|	ОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ЕСТЬNULL(ОбъемНачислений.СуммаОборот, 0) КАК СуммаОборот,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслугиОборот, 0) КАК ОбъемУслугиОборот,
	|	ВЫБОР
	|		КОГДА ОбъемНачислений.Абонент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИндивидуальныеНачисления,
	|	АбонентыДляРаспределения.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	АбонентыДляРаспределения.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	АбонентыДляРаспределения.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	АбонентыДляРаспределения.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	АбонентыДляРаспределения.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ВЫБОР
	|		КОГДА НЕ АбонентыДляРаспределения.КоличествоПрописанных = 0
	|			ТОГДА АбонентыДляРаспределения.КоличествоПрописанных
	|		КОГДА НЕ АбонентыДляРаспределения.КоличествоСобственников = 0
	|			ТОГДА АбонентыДляРаспределения.КоличествоСобственников
	|		КОГДА НЕ АбонентыДляРаспределения.КоличествоПроживающих = 0
	|			ТОГДА АбонентыДляРаспределения.КоличествоПроживающих
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЖильцовЧастиПомещения,
	|	АбонентыДляРаспределения.КоличествоПрописанных КАК КоличествоПрописанных,
	|	АбонентыДляРаспределения.КоличествоСобственников КАК КоличествоСобственников,
	|	АбонентыДляРаспределения.КоличествоПроживающих КАК КоличествоПроживающих
	|ИЗ
	|	АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачислений КАК ОбъемНачислений
	|		ПО АбонентыДляРаспределения.Район = ОбъемНачислений.Район
	|			И АбонентыДляРаспределения.Строение = ОбъемНачислений.Строение
	|			И АбонентыДляРаспределения.Услуга = ОбъемНачислений.Услуга
	|			И АбонентыДляРаспределения.Помещение = ОбъемНачислений.Помещение
	|ГДЕ
	|	АбонентыДляРаспределения.Абонент ССЫЛКА Справочник.энргАбоненты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Строение,
	|	Услуга,
	|	Помещение";
		
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область НачислениеПоДолевымСхемам_ВспомогательныеПроцедуры

Процедура ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ, Организация,ПериодНачисления,Район,Договор, ГраницыПериода)	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Договор",			Договор);
	Запрос.УстановитьПараметр("НачалоПериода",		ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",		ГраницыПериода.ЗавершениеОП);
	Запрос.Текст 					= ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(Договор);
	Запрос.Выполнить();
КонецПроцедуры


#КонецОбласти










