// тестовый комментарий костина    .
#Область СлужебныйИнтерфейс

// Процедура - Начислить
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура Начислить(Организация,ПериодНачисления,Район,Договор,Документ,Отдельностоящие = Неопределено) Экспорт
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	ПериодНовогоТарифа 								= Константы.энргДеньНачалаПримененияНовогоТарифа.Получить();
	результатЗапроса 								= РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде,Документ<>Неопределено,Отдельностоящие); 	
	КонецПериода  									= КонецМесяца(ПериодНачисления);
	Сч 												= 0;
	ТекДоговор  									= Неопределено;
	ТекОбъектРасчета 								= Неопределено;
	ТекТочкаУчета									= Неопределено;
	ТекНачалоПериода								= Неопределено;
	ТекУслуга 										= Неопределено;
	ТекШкала 										= Неопределено;
	ДокументОбъект									= Неопределено;
	Набор 											= Неопределено;
	ВидНачисления 									= Перечисления.энргВидыНачислений.Начисление;
	ФормулыРасчет 									= Неопределено;
	ПараметрыФормулы 								= Неопределено;
	ТекСпособНачисленияПоФормуле 					= Неопределено;
	СпособРасчетаПоФормуле 							= Неопределено;
	СтрокаОписания 									= Неопределено;
	ОписаниеУслуг 									= Неопределено;
	НормативыПоУслугам 								= Неопределено;
	НачисляемПоФормуле 								= Ложь;	
	СтрокиНабораДоЗаписи 							= Неопределено;	
	НачисленияПоУслугам 							= Новый Соответствие;
	НачисленияПоУслугамОбъекта						= Новый Соответствие;
	
	ВыборкаДоговор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговор.Следующий() Цикл 
		
		ВыборкаДок = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ДокументСсылка 									= Неопределено;
		
		Пока ВыборкаДок.Следующий() Цикл
			
			Если Документ = Неопределено и ДокументСсылка = Неопределено Тогда					
				ДокументСсылка											= ВыборкаДок.ДокументНачисления;
				ДокументОбъект 											= Неопределено;
				ПометкаУдаления 										= ВыборкаДок.ДокументНачисления.ПометкаУдаления;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
					
					ДокументСсылка 										= Документы.бестНачислениеНП.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  									= Документы.бестНачислениеНП.СоздатьДокумент();
					ДокументОбъект.район  								= Район;
					ДокументОбъект.Дата									= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 							= Организация;
					ДокументОбъект.Договор	 							= ВыборкаДок.Договор;
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект										= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 						= Ложь;
				КонецЕсли;
				
				Набор 													= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				
				Если НЕ Договор = Неопределено Тогда
					Набор.ДополнительныеСвойства.Вставить("Договор",	Договор);
					Если ДокументОбъект = Неопределено Тогда
						Набор.Прочитать();
						СтрокиНабораДоЗаписи 							= Набор.Выгрузить();
						СтрокиУдалить 									= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Договор", Договор));
						Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
							СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						Набор.Очистить();
					КонецЕсли;
				КонецЕсли;	
				
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
				КонецЕсли;		
			ИначеЕсли Не Документ = Неопределено Тогда
				Набор 													= Документ.Движения.бестОбъемНачисленийНП;
			КонецЕсли;
			
			Выборка  										= ВыборкаДок.выбрать();
			
			Пока Выборка.следующий() цикл
				
				Если ТекОбъектРасчета <> Выборка.ОбъектРасчета Тогда
					НачисленияПоУслугамОбъекта = Новый Соответствие;	
				КонецЕсли; 
				
				Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ Не ТекНачалоПериода = Выборка.НачалоПериода Тогда
					
					ОписаниеУслуг 											= Новый Массив;
					
					Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
						СтрокаОписания 											= Новый Структура("
						|Услуга, ФормулаРасчета, Поставщик, СпособНачисления, ПриборУчета, НачалоПериода, КонецПериода, ДокументСсылка, КонецПериодаРасчета, ОбъемУслугиПотребленный, ОбъемЗаПрошлыйГод, КоэффициентПропорциональности",
						Выборка.Услуга, Выборка.ФормулаРасчета, Константы.энргПоставщикПоУмолчанию.Получить(), Выборка.СпособНачисления, Выборка.ПриборУчета, Выборка.НачалоПериода, Выборка.КонецПериода, ДокументСсылка, КонецПериодаРасчета, Выборка.ОбъемУслугиПотребленный, Выборка.ОбъемЗаПрошлыйГод, Выборка.КоэффициентПропорциональности); 			
					КонецЕсли;
					
					ПараметрыФормулы 										= Новый Соответствие;
					НачисленияПоУслугамТочки 								= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					
					НормативыПоУслугам  									= Новый Соответствие;
					НормативыПоУслугам.Вставить(Выборка.Услуга.УникальныйИдентификатор(), 	Выборка.НормаПотребления);			
					
				ИначеЕсли НЕ ТекУслуга = Выборка.Услуга Тогда
					
					Если  Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
						
						СтрокаОписания.Вставить("ПараметрыФормулы", ПараметрыФормулы);
						
					КонецЕсли;
					
					ЕСли СтрокаОписания <> Неопределено Тогда
						
						ОписаниеУслуг.Добавить(СтрокаОписания);
						
					КонецЕсли;
					
					НачисленияПоУслугамТочки.Вставить(ТекУслуга, НачисленияПоШкале);
					
					ПараметрыФормулы 										= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					
					Если  Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
						
						СтрокаОписания 											= Новый Структура("
						|Услуга, ФормулаРасчета, Поставщик, СпособНачисления, ПриборУчета, НачалоПериода, КонецПериода, ДокументСсылка, КонецПериодаРасчета, ОбъемУслугиПотребленный, ОбъемЗаПрошлыйГод, КоэффициентПропорциональности",
						Выборка.Услуга, Выборка.ФормулаРасчета, Константы.энргПоставщикПоУмолчанию.Получить(), Выборка.СпособНачисления, Выборка.ПриборУчета, Выборка.НачалоПериода, Выборка.КонецПериода, ДокументСсылка, КонецПериодаРасчета, Выборка.ОбъемУслугиПотребленный, Выборка.ОбъемЗаПрошлыйГод, Выборка.КоэффициентПропорциональности);
						
					КонецЕсли;
					НормативыПоУслугам.Вставить(Выборка.Услуга.УникальныйИдентификатор(), 		Выборка.НормаПотребления);			
				ИначеЕсли НЕ ТекШкала = Выборка.Шкала Тогда
					НачисленияПоШкале 										= Новый Соответствие;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Выборка.ФормулаРасчета) Тогда
					СтрокаНабора 											= Набор.добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
					СтрокаНабора.Период 									= КонецПериодаРасчета-1;
					СтрокаНабора.Регистратор 								= ДокументСсылка;
					СтрокаНабора.ВидНачисления 								= Перечисления.энргВидыНачислений.Начисление;
					СтрокаНабора.ПериодРасчета 								= ПериодНачисления;
					СтрокаНабора.Поставщик	 								= Константы.энргПоставщикПоУмолчанию.Получить();
					СтрокаНабора.ОбъемУслуги 								= Выборка.ОбъемУслуги * Выборка.КоэффициентПропорциональности;
					СтрокаНабора.ОбъемУслугиПотребленный 					= Выборка.ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
					
					Если Выборка.СодержитПотери И ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) Тогда 
												
						Если Выборка.ГБП = Перечисления.энргРасположениеРесурса.ДоГБП Или Выборка.ГБП = Перечисления.энргРасположениеРесурса.НаГБП Тогда
							ОбъемУслугиОсновной = НачисленияПоУслугамОбъекта.Получить(Выборка.ЗависитОтУслуги);
							Если Не ЗначениеЗаполнено(ОбъемУслугиОсновной) Тогда
								СтрокаНабора.ОбъемУслуги					= 0;
								СтрокаНабора.ОбъемУслугиПотребленный       	= 0;
								ОбъемУслуги									= 0;
								ОбъемУслугиПотребленный       				= 0;
							КонецЕсли;							 
						КонецЕсли;
						
					ИначеЕсли ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и НЕ Выборка.ПривязанаКШкале и НЕ Выборка.РасчетПоФормуле И
						Отдельностоящие <> Неопределено Тогда
						
						Если Отдельностоящие Тогда
							
							ОбъемУслуги 										= 0;
							ОбъемУслугиПотребленный 							= 0;
							Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
								Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
									
									ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
									
									Если Выборка.УслугаСОбратнымРасчетом Тогда
										ОбъемУслуги 							= ?(Выборка.ТемператураПодачиИсточника = Выборка.ТемператураХолоднойВодыИсточника, 0, ОбъемУслугиОсновной.ОбъемУслуги / (Выборка.ТемператураПодачиИсточника - Выборка.ТемператураХолоднойВодыИсточника)*1000);
										ОбъемУслугиПотребленный 				= ?(Выборка.ТемператураПодачиИсточника = Выборка.ТемператураХолоднойВодыИсточника, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / (Выборка.ТемператураПодачиИсточника - Выборка.ТемператураХолоднойВодыИсточника) * 1000);
									Иначе
										ОбъемУслуги 							= ОбъемУслугиОсновной.ОбъемУслуги * (Выборка.ТемператураПодачиИсточника - Выборка.ТемператураХолоднойВодыИсточника) / 1000;
										ОбъемУслугиПотребленный 				= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * (Выборка.ТемператураПодачиИсточника - Выборка.ТемператураХолоднойВодыИсточника) / 1000;
									КонецЕсли;
									
								КонецЕсли;
							КонецЕсли;
							СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
							СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
						КонецЕсли;
						
						
					ИначеЕсли ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и НЕ Выборка.ПривязанаКШкале и НЕ Выборка.РасчетПоФормуле Тогда

						Если Выборка.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке 
							Или Выборка.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда 
							
							ОбъемУслуги 										= 0;
							ОбъемУслугиПотребленный 							= 0;
							Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
								Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
									
									ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
									
									Если Выборка.бестИспользоватьТемпературныйКоэффициентПоВоде Тогда 
										
										ТемпературныйКоэффициентПоВоде = (Выборка.ТемператураПодачиИсточника - Выборка.ТемператураХолоднойВодыИсточника) / 1000;
										
										Если Выборка.ОбратныйРасчет Тогда
											ОбъемУслуги 								= ?(ТемпературныйКоэффициентПоВоде = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ТемпературныйКоэффициентПоВоде);
											ОбъемУслугиПотребленный 					= ?(ТемпературныйКоэффициентПоВоде = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ТемпературныйКоэффициентПоВоде);
										Иначе
											ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * ТемпературныйКоэффициентПоВоде;
											ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * ТемпературныйКоэффициентПоВоде;
										КонецЕсли;
										
									Иначе
										Если Выборка.ОбратныйРасчет Тогда
											ОбъемУслуги 								= ?(ОбъемУслугиОсновной.НормаПотребления = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ОбъемУслугиОсновной.НормаПотребления);
											ОбъемУслугиПотребленный 					= ?(ОбъемУслугиОсновной.НормаПотребления = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ОбъемУслугиОсновной.НормаПотребления);
										Иначе
											ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
											ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЕсли;
							КонецЕсли;
							СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
							СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
							
							
							//ИначеЕсли   Не Выборка.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда
							//	ОбъемУслуги 										= 0;
							//	ОбъемУслугиПотребленный 							= 0;
							//	Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
							//		Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
							//			
							//			ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
							//			
							//			Если Выборка.УслугаСОбратнымРасчетом Тогда
							//				ОбъемУслуги 								= ?(ОбъемУслугиОсновной.НормаПотребления = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ОбъемУслугиОсновной.НормаПотребления);
							//				ОбъемУслугиПотребленный 					= ?(ОбъемУслугиОсновной.НормаПотребления = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ОбъемУслугиОсновной.НормаПотребления);
							//			Иначе
							//				ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
							//				ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
							//			КонецЕсли;
							//			
							//		КонецЕсли;
							//	КонецЕсли;
							//	СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
							//	СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
							//КонецЕсли;
						КонецЕсли;
						
								
							
							//ИначеЕсли   Не Выборка.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда
							//	ОбъемУслуги 										= 0;
							//	ОбъемУслугиПотребленный 							= 0;
							//	Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
							//		Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
							//			
							//			ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
							//			
							//			Если Выборка.УслугаСОбратнымРасчетом Тогда
							//				ОбъемУслуги 								= ?(ОбъемУслугиОсновной.НормаПотребления = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ОбъемУслугиОсновной.НормаПотребления);
							//				ОбъемУслугиПотребленный 					= ?(ОбъемУслугиОсновной.НормаПотребления = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ОбъемУслугиОсновной.НормаПотребления);
							//			Иначе
							//				ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
							//				ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
							//			КонецЕсли;
							//			
							//		КонецЕсли;
							//	КонецЕсли;
							//	СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
							//	СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
							//КонецЕсли;
						

					КонецЕсли;
					
				КонецЕсли;
				
				КлючШкалы 													= Выборка.Шкала.УникальныйИдентификатор();
				Если НЕ ПараметрыФормулы.Получить(КлючШкалы) = Неопределено Тогда
					ПараметрыФормулы[КлючШкалы].ОбъемУслуги 				= ПараметрыФормулы[КлючШкалы].ОбъемУслуги + Выборка.ОбъемУслуги;
					ПараметрыФормулы[КлючШкалы].ОбъемУслугиПотребленный		= ПараметрыФормулы[КлючШкалы].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
				Иначе
					ПараметрыФормулы.Вставить(КлючШкалы, 	Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
				КонецЕсли; 		
				
				Если НЕ НачисленияПоШкале[Выборка.Шкала] = Неопределено Тогда
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги 			 = НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги + Выборка.ОбъемУслуги;
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный = НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
					НачисленияПоШкале[Выборка.Шкала].НормаПотребления        = Выборка.НормаПотребления;
				Иначе
					НачисленияПоШкале.Вставить(Выборка.Шкала, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный, НормаПотребления", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный, Выборка.НормаПотребления));
				КонецЕсли;
				
				
				НачисленияПоУслугам.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				НачисленияПоУслугамОбъекта.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				
				//закрытая схема
				Если Выборка.ЗакрытаяСхемаГВС Тогда
					СтрокаНабора.ОбъемУслуги = 0;
				КонецЕсли;
				
				ТекОбъектРасчета 							= Выборка.ОбъектРасчета;
				ТекТочкаУчета								= Выборка.ТочкаУчета;
				ТекНачалоПериода							= Выборка.НачалоПериода;
				ТекУслуга 									= Выборка.Услуга;
				//ТекКонецПериода							= Выборка.КонецПериода;
				ТекШкала 									= Выборка.Шкала;
				
				Сч 	= Сч+1;
				
			КонецЦикла;	
			
			//добавить строки с формулами
			Если Не ОписаниеУслуг = Неопределено Тогда
				
				Если  Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
					
					СтрокаОписания.Вставить("ПараметрыФормулы", ПараметрыФормулы);
					ОписаниеУслуг.Добавить(СтрокаОписания);
					
				КонецЕсли;
				
				ДобавитьСтрокиНачисленияНППоФормуле(ПериодНачисления, Организация, Район, ВыборкаДоговор.Договор, ТекОбъектРасчета, ТекТочкаУчета, ОписаниеУслуг, НормативыПоУслугам, Набор);
			КонецЕсли;
			
			Если Документ = Неопределено и НЕ Набор = Неопределено и (Набор.Количество() > 0 ИЛИ НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0) тогда
				НачатьТранзакцию();
				Попытка 			
					Если НЕ ДокументОбъект  = Неопределено Тогда
						ДокументОбъект.ПометкаУдаления = Ложь;
						ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
						ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
					
					Если НЕ Договор = Неопределено и НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
						Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
							ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
						КонецЦикла;				
					КонецЕсли;
					
					Набор.Записать(Ложь);
					ЗафиксироватьТранзакцию();
				Исключение
					ОписаниеОшибки 											= ИнформацияОбОшибке();
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекДоговор 									= ВыборкаДоговор.Договор;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачисленияПоДолевымСхемам(Организация,ПериодНачисления,Район,Договор,Документ)  Экспорт 
	
	ГраницыПериода  									= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);	
	МВТ 												= Новый МенеджерВременныхТаблиц;
	ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ,Организация,ПериодНачисления,Район,Договор,ГраницыПериода);
	
	Запрос 												= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 						= МВТ;
	Запрос.Текст 										= ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам();
	Запрос.УстановитьПараметр("НачалоПериода",			ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",			ГраницыПериода.ЗавершениеОП);
	
	Результат  											= Запрос.ВыполнитьПакет();
	ВыборкаДолевойОбъем									= Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСубабоненты									= Результат[1].Выбрать();
	
	ТекДоговор											= Неопределено;
	ТекОбъектРасчета                                    = Неопределено;
	ТекТочкаУчета                                       = Неопределено;
	
	НаборЗаписей 										= Неопределено;
	
	ДокументОбъект 										= Неопределено;
	ДанныеПоУслуге 										= Неопределено;
	НаборВыполненные 									= Неопределено;
	ЗамещатьНаборВыполненные 							= Истина;
	
	НачисленияПоТочке = Новый Соответствие;
	РассчитанныеОбъемыПоТочке = Новый Соответствие;
	СторнированныеОбъемыПоТочке = Новый Соответствие;
	
	ТаблицаСторнированныхОбъемов = Новый ТаблицаЗначений;
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("ОбъемУслуги", Новый ОписаниеТипов("Число"));
	
	
	Если ВыборкаДолевойОбъем.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСубабоненты.следующий();
	
	Пока ВыборкаДолевойОбъем.Следующий() Цикл
		
		ТекУслуга 										= Неопределено;
		
		Если НЕ ТекДоговор = ВыборкаДолевойОбъем.Договор Тогда
			
			Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
				
				НачатьТранзакцию();
				
				НаборОтложенныхДвижений	= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
				НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
				НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
				НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
				НаборОтложенныхДвижений.Отбор.Договор.Установить(ТекДоговор);
				
				НаборОтложенныхДвижений.Записать();					
				
				Попытка 					
					НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
					НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
					НаборЗаписей.ДополнительныеСвойства.Вставить("Договор",    			ТекДоговор);
					НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
					НаборЗаписей.Записать();
					
					Если Не ДокументОбъект = Неопределено Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
						ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
					КонецЕсли; 					
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
			
			ДокументСсылка 							= ВыборкаДолевойОбъем.ДокументНачисленияПоДолевымСхемам;			
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
				ДокументСсылка 						= Документы.бестНачислениеПоДолевымСхемам.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект 						= Документы.бестНачислениеПоДолевымСхемам.СоздатьДокумент();
				ДокументОбъект.Район 				= Район;
				ДокументОбъект.Договор 				= ВыборкаДолевойОбъем.Договор;
				ДокументОбъект.Дата 				= ГраницыПериода.ЗавершениеОП-1;
				ДокументОбъект.Организация			= Организация;
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
				
			Иначе
				ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления 		= Ложь;
								
				НаборЗаписей 						= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборЗаписей.Записать(); // очищаем набор записей
			КонецЕсли;
			
			НаборЗаписей 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			
			ВыборкаТочкиУчета = ВыборкаДолевойОбъем.Выбрать();
			
			Пока ВыборкаТочкиУчета.Следующий() Цикл
				
				Если НЕ ТекТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета Или НЕ ТекУслуга = ВыборкаТочкиУчета.Услуга Тогда
					
					Если Не ТекУслуга  = Неопределено Тогда
						НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, ?(ТекДоговор = Неопределено, ВыборкаДолевойОбъем.Договор, ТекДоговор), ТекТочкаУчета, ТекУслуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке);
					КонецЕсли;
									
					ДанныеПоУслуге  												= Новый Структура;
					
										
					ДанныеПоУслуге.Вставить("РасчетИндивидуальногоПотребления",		ВыборкаТочкиУчета.РасчетИндивидуальногоПотребления);
					ДанныеПоУслуге.Вставить("СуммарныйОбъемСубабонентов",			ВыборкаТочкиУчета.ОбъемПотребленияСубабонентов);
					ДанныеПоУслуге.Вставить("Субабоненты", 							Новый Массив);
					ДанныеПоУслуге.Вставить("ЗначениеНагрузки", 					ВыборкаТочкиУчета.ЗначениеНагрузки);
					ДанныеПоУслуге.Вставить("ЗначениеПлощади", 						ВыборкаТочкиУчета.ЗначениеПлощади);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеНагрузкиСубабонентов",ВыборкаТочкиУчета.СуммарноеЗначениеНагрузкиСубабонентов);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеПлощадиСубабонентов", ВыборкаТочкиУчета.СуммарноеЗначениеПлощадиСубабонентов);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеДоговорногоОбъемаСуб",ВыборкаТочкиУчета.СуммарноеЗначениеДоговорногоОбъемаСуб);
					ДанныеПоУслуге.Вставить("ВсегоТочекУчетаСубабонентов", 			ВыборкаТочкиУчета.ВсегоТочекУчетаСубабонентов);
					ДанныеПоУслуге.Вставить("ВсегоПриборовУчетаСубабонентов", 		ВыборкаТочкиУчета.ВсегоПриборовУчетаСубабонентов);
					ДанныеПоУслуге.Вставить("ДанныеНачисленийСубабонентов", 		бестНачисленияНП.ОписаниеТаблицыОбъемов());
					ДанныеПоУслуге.Вставить("СпособНачисления", 					ВыборкаТочкиУчета.СпособНачисления);
					ДанныеПоУслуге.Вставить("ПотреблениеСубабонентов", 				0);
					ДанныеПоУслуге.Вставить("ОбъемСубКРаспределению", 				ВыборкаТочкиУчета.ОбъемСубКРаспределению);
					
					мСубабоненты 											= ДанныеПоУслуге.Субабоненты;
					ПотреблениеСубабонентов 								= ДанныеПоУслуге.ПотреблениеСубабонентов;

					ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Очистить();
					
					Если ВыборкаТочкиУчета.Уровень = 0 Тогда
						ДанныеПоУслуге.Вставить("ОбъемУслуги",							ВыборкаТочкиУчета.ОбъемУслуги);
					Иначе
						Если РассчитанныеОбъемыПоТочке[ВыборкаТочкиУчета.ТочкаУчета] <> Неопределено Тогда
							РассчитанныйОбъемУслуги 	= РассчитанныеОбъемыПоТочке[ВыборкаТочкиУчета.ТочкаУчета][ВыборкаТочкиУчета.Услуга];
							ДанныеПоУслуге.Вставить("ОбъемУслуги",							РассчитанныйОбъемУслуги);
							
							НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаТочкиУчета.ТочкаУчета,ВыборкаТочкиУчета.Услуга,РассчитанныйОбъемУслуги));
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаТочкиУчета);
								СтрокаСписатьИндивидуальные.ОбъемУслуги		= РассчитанныйОбъемУслуги;
								
								СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаТочкиУчета);
								СтрокаСторнированныхОбъемов.ОбъемУслуги		= РассчитанныйОбъемУслуги;
											
							КонецЕсли;
														
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					
					// Двигаем выборку абонентов
					Пока НЕ ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета ИЛИ НЕ ВыборкаСубабоненты.Услуга = ВыборкаТочкиУчета.Услуга Цикл
						Если НЕ ВыборкаСубабоненты.Следующий() Тогда
							Прервать;
							ВыборкаСубабоненты.сбросить();
						КонецЕсли;				
					КонецЦикла;
					
					ТекСубабонент	 									= Неопределено;
					ДанныеСубабонента 									= Неопределено;
					
					Пока ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета и ВыборкаСубабоненты.Услуга = ВыборкаТочкиУчета.Услуга Цикл
						Если НЕ ТекСубабонент = ВыборкаСубабоненты.ТочкаУчета Тогда
							Если Не ТекСубабонент = Неопределено Тогда
								мСубабоненты.Добавить(ДанныеСубабонента);
							КонецЕсли;
							
							
							ДанныеСубабонента 								= Новый Структура("Договор, ОбъектРасчета, ТочкаУчета, ОбъемУслуги, ЗначениеПлощади, КоэффициентДолевогоРаспределения, СпособРаспределенияОбъемаДолевойТУ, СпособРаспределенияОстаткаДолевыеСхемы, ЗависимаяТочкаУчета, ЗначениеНагрузки, ДоговорнойОбъем",
							ВыборкаСубабоненты.Договор, ВыборкаСубабоненты.ОбъектРасчета, ВыборкаСубабоненты.ТочкаУчета, ВыборкаСубабоненты.ОбъемУслуги, ВыборкаСубабоненты.ЗначениеПлощади, ВыборкаСубабоненты.КоэффициентДолевогоРаспределения, ВыборкаСубабоненты.СпособРаспределенияОбъемаДолевойТУ, 
							ВыборкаСубабоненты.СпособРаспределенияОстаткаДолевыеСхемы, ВыборкаСубабоненты.ЗависимаяТочкаУчета, ВыборкаСубабоненты.ЗначениеНагрузки, ВыборкаСубабоненты.ДоговорнойОбъем);
							
							
						КонецЕсли;
						
						Если ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаСубабоненты.ТочкаУчета Тогда
							
							НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаСубабоненты.ТочкаУчета,ВыборкаСубабоненты.Услуга,РассчитанныйОбъемУслуги));
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаСубабоненты);
								СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаСубабоненты.ОбъемУслуги;
								
								СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаСубабоненты);
								СтрокаСторнированныхОбъемов.ОбъемУслуги		= ВыборкаСубабоненты.ОбъемУслуги;

							КонецЕсли;
				
						Иначе
							Если ВыборкаСубабоненты.СторнироватьОбъемИндивидуальногоПотребления Тогда
								
														
								НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаСубабоненты.ТочкаУчета,ВыборкаСубабоненты.Услуга,РассчитанныйОбъемУслуги));
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаСубабоненты);
								СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаСубабоненты.ОбъемУслуги;
								
								СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаСубабоненты);
								СтрокаСторнированныхОбъемов.ОбъемУслуги		= ВыборкаСубабоненты.ОбъемУслуги;
							КонецЕсли;

								
							КонецЕсли;
						КонецЕсли;
						
						ПотреблениеАбонентов 							= ВыборкаСубабоненты.ОбъемУслуги;
						
						ТекСубабонент 									= ВыборкаСубабоненты.ТочкаУчета;
						
						Если НЕ ВыборкаСубабоненты.Следующий() Тогда
							Прервать;
							ВыборкаСубабоненты.сбросить();
						КонецЕсли; 				
					КонецЦикла; 			
					
					Если Не ТекСубабонент = Неопределено Тогда
						мСубабоненты.Добавить(ДанныеСубабонента);
					КонецЕсли;
					
				КонецЕсли;		
				
				ТекТочкаУчета 											= ВыборкаТочкиУчета.ТочкаУчета;
				ТекУслуга 												= ВыборкаТочкиУчета.Услуга;
			КонецЦикла;
			
			Если Не НаборЗаписей = Неопределено Тогда
				
				НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, ТекДоговор, ТекТочкаУчета, ТекУслуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке);
				
				Если НаборЗаписей.Количество() > 0 Тогда
					НачатьТранзакцию();
					Попытка				
						Если Не ДокументОбъект = Неопределено Тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						
						НаборОтложенныхДвижений 					= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
						НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
						НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
						НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
						НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
						НаборОтложенныхДвижений.Отбор.Договор.Установить(ТекДоговор);
						НаборОтложенныхДвижений.Записать();				
						
						НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
						НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
						НаборЗаписей.ДополнительныеСвойства.Вставить("Договор",    			ТекДоговор);
						НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
						НаборЗаписей.Записать(Ложь);	
						
						ЗафиксироватьТранзакцию();
					Исключение
						ОписаниеОшибки 								= ОписаниеОшибки();
						ОтменитьТранзакцию();
					КонецПопытки;
				КонецЕсли;		
			КонецЕсли; 			
			
			
			ТекДоговор = ВыборкаДолевойОбъем.Договор;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьСтрокиНачисленияНППоФормуле(ПериодНачисления, Организация, Район, Договор, ОбъектРасчета, ТочкаУчета, ОписаниеУслуг, НормативыПоУслугам, Набор)
	
	Для Каждого СтрокаФормулы Из ОписаниеУслуг Цикл			
		ТекФормулаОбъемУслуги	 					= СтрокаФормулы.ФормулаРасчета;
		
		Если Не ЗначениеЗаполнено(ТекФормулаОбъемУслуги) Тогда
			Продолжить;
		КонецЕсли;
		ТекФормулаОбъемУслугиПотребленный			= СтрокаФормулы.ФормулаРасчета;
		ПараметрыФормулы 							= СтрокаФормулы.ПараметрыФормулы;
		Для Каждого ПараметрФормулы Из ПараметрыФормулы Цикл
			ОписаниеОбъема 							= ПараметрФормулы.Значение;
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ПараметрФормулы.Ключ + "]",ОписаниеОбъема.ОбъемУслуги);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ПараметрФормулы.Ключ + "]",ОписаниеОбъема.ОбъемУслугиПотребленный);
		КонецЦикла;
		
		Для Каждого ПараметрФормулы Из НормативыПоУслугам Цикл
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ПараметрФормулы.Ключ + "]",ПараметрФормулы.Значение);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ПараметрФормулы.Ключ + "]",ПараметрФормулы.Значение);
		КонецЦикла;
		
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги," ","");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,Символы.НПП,"");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,",",".");
		РезультатПоФормуламОбъемУслуги				= 0;
		ТекФормулаОбъемУслуги 						= СтрЗаменить(ТекФормулаОбъемУслуги,"[Результат]=","РезультатПоФормуламОбъемУслуги=");
		Выполнить ТекФормулаОбъемУслуги;
		
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный," ","");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,Символы.НПП,"");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,",",".");
		РезультатПоФормуламОбъемУслугиПотребленный	= 0;
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[Результат]=","РезультатПоФормуламОбъемУслугиПотребленный=");
		Выполнить ТекФормулаОбъемУслугиПотребленный;
		
		Если РезультатПоФормуламОбъемУслуги = 0 И РезультатПоФормуламОбъемУслугиПотребленный = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНабора 								= Набор.добавить();
		СтрокаНабора.Период 						= СтрокаФормулы.КонецПериодаРасчета-1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.Район 							= Район;
		СтрокаНабора.Договор 						= Договор;
		СтрокаНабора.ОбъектРасчета 					= ОбъектРасчета;
		СтрокаНабора.Услуга 						= СтрокаФормулы.Услуга;
		СтрокаНабора.ТочкаУчета 					= ТочкаУчета;
		СтрокаНабора.ВидНачисления 					= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.СпособНачисления 				= СтрокаФормулы.СпособНачисления;
		СтрокаНабора.ПриборУчета 					= СтрокаФормулы.ПриборУчета;
		СтрокаНабора.ТарифнаяЗона 					= Справочники.энргТарифныеЗоны.ПустаяСсылка();
		СтрокаНабора.Поставщик 						= СтрокаФормулы.Поставщик;
		СтрокаНабора.ПериодРасчета 					= ПериодНачисления;
		СтрокаНабора.ПериодНачисления 				= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги 					= РезультатПоФормуламОбъемУслуги * СтрокаФормулы.КоэффициентПропорциональности;		
		СтрокаНабора.ОбъемУслугиПотребленный 		= РезультатПоФормуламОбъемУслугиПотребленный * СтрокаФормулы.КоэффициентПропорциональности;		
		СтрокаНабора.НачалоПериода 					= СтрокаФормулы.НачалоПериода;
		СтрокаНабора.КонецПериода 					= СтрокаФормулы.КонецПериода;
		СтрокаНабора.Регистратор 					= СтрокаФормулы.ДокументСсылка;		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Снять средние начисления
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисленияНП(Организация, ПериодНачисления,Район,Договор,Документ) Экспорт
	
	перем ТекМКД,ДокументОбъект; 
	
	Если не ЗначениеЗаполнено(ПериодНачисления) или не ЗначениеЗаполнено(Район)  тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	//ПрочитатьНеСписанныйСредний(МВТ,НачалоПериодаРасчета,Район,МКД,Абонент,МКД<>Неопределено);	
	//результатЗапроса 								= РезультатЗапросаПерерасчетСреднего(МВТ,ПериодНачисления,Район,МКД,Абонент,МКД<>Неопределено); 	
	
	//Выборка  										= результатЗапроса.выбрать();
	//ВидОперации 									= Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет;
	//Сч 												= 0;
	//
	//Пока Выборка.следующий() цикл
	//	Если Документ = Неопределено тогда
	//		Если  ТекМКД <> Выборка.МКД тогда
	//			Если ТекМКД<>Неопределено тогда
	//				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//				ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
	//			КонецЕсли;
	//			
	//			Если ЗначениеЗаполнено(Выборка.ДокументПерерасчета) тогда
	//				ДокументОбъект  				= Выборка.ДокументПерерасчета.получитьОбъект();
	//				ДокументОбъект.Дата				= КонецПериодаРасчета-1;
	//				ДокументОбъект.ПометкаУдаления  = Ложь; 
	//				ОбъемНачислений  				= ДокументОбъект.СвязанныйПерерасчет;
	//				ОбъемНачислений.очистить();
	//			иначе
	//				ДокументОбъект  				= Документы.энргПерерасчет.СоздатьДокумент();
	//				ДокументОбъект.район  			= Район;
	//				ДокументОбъект.МКД 				= Выборка.МКД;
	//				ДокументОбъект.Дата				= КонецПериодаРасчета-1;
	//				ДокументОбъект.ВидОперации 		= ВидОперации;
	//				ОбъемНачислений  				= ДокументОбъект.СвязанныйПерерасчет;
	//			КонецЕсли;
	//		КонецЕсли;
	//	иначе
	//		ДокументОбъект 							= Документ;
	//		ОбъемНачислений 						= ДокументОбъект.СвязанныйПерерасчет;
	//	КонецЕсли;	
	//	
	//	ЗаполнитьЗначенияСвойств(ОбъемНачислений.добавить(),Выборка);
	//	ТекМКД 										= Выборка.МКД;
	//	Сч 											= Сч+1;
	//КонецЦикла;	
	//
	//Если Документ = Неопределено и не ДокументОбъект = Неопределено тогда
	//	ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//	ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
	//КонецЕсли;  
	
	//Если МКД = Неопределено тогда
	//	Набор 							= РегистрыСведений.энргВыполненныеНачисления.СоздатьНаборЗаписей();
	//	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	//	Набор.Отбор.Район.установить(Район);
	//	Набор.Отбор.ВидОперацииНачисления.установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
	//	Набор.ДополнительныеСвойства.Вставить("ЗаписьРазрешена");
	//	Запись 							= Набор.Добавить();
	//	Запись.ПериодНачисления 		= ПериодНачисления;
	//	Запись.Район					= Район;
	//	Запись.ВидОперацииНачисления	= Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних;
	//	Набор.Записать();
	//КонецЕсли; 
	//
КонецПроцедуры

Процедура ОтменитьЗакрытьПериода(Организация, ПериодНачисления,Район,МКД) Экспорт 
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 	="ВЫБРАТЬ
	|	энргНачисление.Ссылка
	|ИЗ
	|	Документ.энргНачисление КАК энргНачисление
	|ГДЕ
	|	энргНачисление.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачисление.МКД = &МКД
	|	И энргНачисление.Район = &Район
	|	И энргНачисление.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеМКД.Ссылка
	|ИЗ
	|	Документ.энргНачислениеМКД КАК энргНачислениеМКД
	|ГДЕ
	|	энргНачислениеМКД.Район = &Район
	|	И энргНачислениеМКД.Проведен
	|	И энргНачислениеМКД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Проведен
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПерерасчет.МКД = &МКД
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаПоказаний)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	энргЗакрытиеПериода.Проведен
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	
	Если МКД = Неопределено тогда
		Текст 			= СтрЗаменить(Текст,"И энргНачисление.МКД = &МКД","");
		Текст			= СтрЗаменить(Текст,"И энргПерерасчет.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 		= Текст;
	Результат  			= Запрос.Выполнить();
	Выборка 			= Результат.Выбрать();
	Пока Выборка.Следующий() цикл  		
		ДокОбъект  		= Выборка.ссылка.получитьОбъект();
		ДокОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",истина);
		ДокОбъект.УстановитьПометкуУдаления(Истина);		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗакрытьПериодДляРедактирования(ПериодНачисления,Район,МКД) Экспорт  
	
	Если МКД <> Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ДокуметЗакрытия 				= ДокуметЗакрытияПериода(ПериодНачисления,Район);
	
	Если не ЗначениеЗаполнено(ДокуметЗакрытия) тогда
		ДокументОбъект 				= Документы.энргЗакрытиеПериода.СоздатьДокумент();		
	иначе
		ДокументОбъект 				= ДокуметЗакрытия.ПолучитьОбъект();  
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",Истина);
	ДокументОбъект.Район 			= Район;
	ДокументОбъект.ПериодНачисления = ПериодНачисления;
	ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

Процедура ВспомогательныеДанныеНачисленияНП(МВТ,Организация,ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ОтборПоДому,ДнейВПериоде,Отдельностоящие)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	
	
	Если ЗначениеЗаполнено(Договор) тогда
		Запрос.УстановитьПараметр("Договор",Договор);
		ОтборПоДоговору = Истина;
	Иначе
		ОтборПоДоговору = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоВеденияУчета",		Константы.энргДатаНачалаВеденияУчета.Получить());	 // Дата
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 // Дата
	Запрос.УстановитьПараметр("Организация",			Организация);	 // Дата
	Запрос.УстановитьПараметр("Район",					Район);	 // Районы
	Запрос.УстановитьПараметр("ДнейВПериоде",			ДнейВПериоде );
	Запрос.УстановитьПараметр("ПериодНовогоТарифа",		ПериодНовогоТарифа); // Число;
	Запрос.УстановитьПараметр("НачалоПредПериодаРасчета",ДобавитьМесяц(НачалоПериодаРасчета, -1));	 // Дата
	
	Запрос.Текст 	= ТекстЗапросаВспомогательныеДанныеНачисления(ОтборПоДоговору,Отдельностоящие);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьСтабильныеПериодыНП(МВТ,ЭтоПерерасчет,Отдельностоящие)  
	
	Текст 							= ТекстПолучитьСтабильныеПериоды(ЭтоПерерасчет,Отдельностоящие);
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачалоВеденияУчета", Константы.энргДатаНачалаВеденияУчета.Получить());
	Запрос.УстановитьПараметр("ТемператураВнутриПомещенияПоУмолчанию", Константы.бестТемператураВнутриПомещенияПоУмолчанию.Получить());
	Запрос.МенеджерВременныхТаблиц	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчетаНП(МВТ,РасчетПоФормуле,ЭтоПерерасчет,ИмяДокумента,Отдельностоящие)
	
	Текст 							= ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле, ИмяДокумента,Отдельностоящие);
	Запрос  						= Новый Запрос(Текст); 	
	Запрос.УстановитьПараметр("ПроектнаяТемператураПоУмолчанию", Константы.бестПроектнаяТемператураНаружногоВоздухаПоУмолчанию.Получить());
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,ФормируемВременную,РасчетПоФормуле,ИмяДокумента,Отдельностоящие); 
	
	Текст  							= ТекстРассчитатьИндивидуальныйОбъемПотребленияНП(ФормируемВременную, ИмяДокумента,Отдельностоящие);
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("РасчетПоФормуле",РасчетПоФормуле);
	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область ТекстЗапросов

Функция ТекстЗапросаВспомогательныеДанныеНачисления(ОтборПоДоговору,Отдельностоящие)
	
	Текст = 
	"ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Организация КАК Организация,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Район КАК Район,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Коэффициент КАК Коэффициент,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ЗначенияПовышающихКоэффициентов
	|ИЗ
	|	РегистрСведений.энгрЗначенияПовышающихКоэффициентов.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энгрЗначенияПовышающихКоэффициентовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.НежилыеПомещения)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	|	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	|	бестГарантированныеОбъемыСрезПоследних.Договор КАК Договор,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги
	|ПОМЕСТИТЬ ГарантированныеОбъемы
	|ИЗ
	|	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета.МКД = &МКД
	|				И Договор = &Договор
	|				И КОНЕЦПЕРИОДА(Месяц, ДЕНЬ) = КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ)) КАК бестГарантированныеОбъемыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(&КонецПериодаРасчета, НеНачислять) КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТемператураИсточникаСрезПоследних.Организация КАК Организация,
	|	бестТемператураИсточникаСрезПоследних.Район КАК Район,
	|	бестТемператураИсточникаСрезПоследних.Источник КАК Источник,
	|	бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника
	|ПОМЕСТИТЬ ТемпературыИсточника
	|ИЗ
	|	РегистрСведений.бестТемператураИсточника.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестТемператураИсточникаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНастройкиОбратногоРасчетаПоГВС.Организация КАК Организация,
	|	бестНастройкиОбратногоРасчетаПоГВС.Район КАК Район,
	|	бестНастройкиОбратногоРасчетаПоГВС.Услуга КАК Услуга,
	|	бестНастройкиОбратногоРасчетаПоГВС.ОбратныйРасчет КАК ОбратныйРасчет,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги
	|ПОМЕСТИТЬ НастройкиГВС
	|ИЗ
	|	РегистрСведений.бестНастройкиОбратногоРасчетаПоГВС КАК бестНастройкиОбратногоРасчетаПоГВС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестНастройкиОбратногоРасчетаПоГВС.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестНастройкиОбратногоРасчетаПоГВС.Организация = &Организация
	|	И бестНастройкиОбратногоРасчетаПоГВС.Район = &Район
	|	И бестНастройкиОбратногоРасчетаПоГВС.ОбратныйРасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	энргВидыУслуг.СезонностьНастраивается КАК СезонностьНастраивается
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА &НачалоПериодаРасчета
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ &КонецПериодаРасчета
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета)
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|						&НачалоПериодаРасчета,
	|						Организация = &Организация
	|							И Район = &Район) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|ПОМЕСТИТЬ ОтопительныйПериод
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргДлительностиПериодов.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА ДЕНЬ(НАЧАЛОПЕРИОДА(&НачалоПериодаРасчета, ГОД))
	|		КОНЕЦ КАК ДеньНачала,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА МЕСЯЦ(НАЧАЛОПЕРИОДА(&НачалоПериодаРасчета, ГОД))
	|		КОНЕЦ КАК МесяцНачала,
	|		ДЕНЬ(энргДлительностиПериодов.КонецПериода) КАК ДеньОкончания,
	|		МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|		ГОД(&КонецПериодаРасчета) КАК ГодНачало,
	|		ГОД(&КонецПериодаРасчета) КАК ГодОкончания
	|	ИЗ
	|		РегистрСведений.энргДлительностиПериодов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргДлительностиПериодов
	|	ГДЕ
	|		энргДлительностиПериодов.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтопительныйПериод)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргДлительностиПериодов.Сезонность,
	|		ДЕНЬ(энргДлительностиПериодов.НачалоПериода),
	|		МЕСЯЦ(энргДлительностиПериодов.НачалоПериода),
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(&КонецПериодаРасчета, ГОД))
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА МЕСЯЦ(КОНЕЦПЕРИОДА(&КонецПериодаРасчета, ГОД))
	|		КОНЕЦ,
	|		ГОД(&КонецПериодаРасчета),
	|		ГОД(&КонецПериодаРасчета)
	|	ИЗ
	|		РегистрСведений.энргДлительностиПериодов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргДлительностиПериодов
	|	ГДЕ
	|		энргДлительностиПериодов.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтопительныйПериод)) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифов.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа,
	|	энргЗначенияТарифов.Регистратор КАК Регистратор,
	|	ДОБАВИТЬКДАТЕ(энргЗначенияТарифов.Период, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|ПОМЕСТИТЬ ЗначенияТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргЗначенияТарифовСрезПоследних
	|		ПО энргЗначенияТарифов.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И энргЗначенияТарифов.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|			И (энргЗначенияТарифов.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.НомерПозиции КАК НомерПозиции,
	|	бестПредоставленныеПоказанияНП.Разделитель КАК Разделитель,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора КАК ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор КАК ДокРегистратор,
	|	бестПредоставленныеПоказанияНП.Показания КАК Показания,
	|	бестПредоставленныеПоказанияНП.ВСрок КАК ВСрок
	|ПОМЕСТИТЬ НаборПредоставленныхПоказаний
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ)
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания,
	|	НаборПредоставленныхПоказаний.ВСрок КАК ВСрок
	|ПОМЕСТИТЬ НаборПредоставленныхПоказанийПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказаний КАК НаборПредоставленныхПоказаний
	|ГДЕ
	|	НаборПредоставленныхПоказаний.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийПредПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийПредПериод.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ МаксНомерПозицииПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказанийПредПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийПредПериод.Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.Район,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(НаборПредоставленныхПоказаний.ДатаРегистратора) КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксДатаРегистратораПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомерПозицииПредПериод КАК МаксНомерПозиции
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксНомерПозиции.Организация
	|			И НаборПредоставленныхПоказаний.Район = МаксНомерПозиции.Район
	|			И НаборПредоставленныхПоказаний.Договор = МаксНомерПозиции.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксНомерПозиции.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксНомерПозиции.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксНомерПозиции.ПриборУчета
	|			И НаборПредоставленныхПоказаний.Шкала = МаксНомерПозиции.Шкала
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксНомерПозиции.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксНомерПозиции.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказаний.Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПредоставленныхПоказаний.ДокРегистратор) КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРегистраторПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксДатаРегистратораПредПериод КАК МаксДатаРегистратора
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксДатаРегистратора.Организация
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксДатаРегистратора.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.Район = МаксДатаРегистратора.Район
	|			И НаборПредоставленныхПоказаний.Договор = МаксДатаРегистратора.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксДатаРегистратора.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксДатаРегистратора.ПриборУчета
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксДатаРегистратора.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.Шкала = МаксДатаРегистратора.Шкала
	|			И НаборПредоставленныхПоказаний.ДатаРегистратора = МаксДатаРегистратора.ДатаРегистратора
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксДатаРегистратора.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказаний.Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказаний.Разделитель) КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРазделительПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРегистраторПредПериод КАК МаксРегистратор
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксРегистратор.Организация
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксРегистратор.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.Район = МаксРегистратор.Район
	|			И НаборПредоставленныхПоказаний.Договор = МаксРегистратор.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксРегистратор.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксРегистратор.ПриборУчета
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксРегистратор.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.Шкала = МаксРегистратор.Шкала
	|			И НаборПредоставленныхПоказаний.ДатаРегистратора = МаксРегистратор.ДатаРегистратора
	|			И НаборПредоставленныхПоказаний.ДокРегистратор = МаксРегистратор.ДокРегистратор
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксРегистратор.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказаний.Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Район,
	|	НаборПредоставленныхПоказаний.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета.МКД КАК МКД
	|ПОМЕСТИТЬ бестМаксимальныеПоказанияСрезПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРазделительПредПериод КАК МаксРазделитель
	|		ПО НаборПредоставленныхПоказаний.Организация = МаксРазделитель.Организация
	|			И НаборПредоставленныхПоказаний.ПериодНачисления = МаксРазделитель.ПериодНачисления
	|			И НаборПредоставленныхПоказаний.Договор = МаксРазделитель.Договор
	|			И НаборПредоставленныхПоказаний.ОбъектРасчета = МаксРазделитель.ОбъектРасчета
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксРазделитель.ПриборУчета
	|			И НаборПредоставленныхПоказаний.ТарифнаяЗона = МаксРазделитель.ТарифнаяЗона
	|			И НаборПредоставленныхПоказаний.Шкала = МаксРазделитель.Шкала
	|			И НаборПредоставленныхПоказаний.ДатаРегистратора = МаксРазделитель.ДатаРегистратора
	|			И НаборПредоставленныхПоказаний.ДокРегистратор = МаксРазделитель.ДокРегистратор
	|			И НаборПредоставленныхПоказаний.Разделитель = МаксРазделитель.Разделитель
	|			И НаборПредоставленныхПоказаний.НомерПозиции = МаксРазделитель.НомерПозиции
	|			И НаборПредоставленныхПоказаний.ПриборУчета = МаксРазделитель.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезПоследних.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезПоследних.Договор КАК Договор,
	|	бестМаксимальныеПоказанияСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезПоследних.ОбъектРасчета.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезПоследних.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезПоследних.Показания КАК Показания,
	|	&НачалоПериодаРасчета КАК Период,
	|	-1 КАК НомерПозиции,
	|	бестМаксимальныеПоказанияСрезПоследних.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	бестМаксимальныеПоказанияСрезПредПериод КАК бестМаксимальныеПоказанияСрезПоследних
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезПоследних.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезПоследних.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|	И бестМаксимальныеПоказанияСрезПоследних.Район = &Район
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Показания,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.НомерПозиции,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания
	|ПОМЕСТИТЬ НаборПредоставленныхПоказанийТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказаний КАК НаборПредоставленныхПоказаний
	|ГДЕ
	|	НаборПредоставленныхПоказаний.ПериодНачисления = &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ МаксНомерПозицииТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора) КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксДатаРегистратораТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомерПозицииТекПериод КАК МаксНомерПозицииТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксНомерПозицииТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.Район = МаксНомерПозицииТекПериод.Район
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксНомерПозицииТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксНомерПозицииТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксНомерПозицииТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксНомерПозицииТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксНомерПозицииТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксНомерПозицииТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксНомерПозицииТекПериод.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.ДокРегистратор) КАК ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРегистраторТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксДатаРегистратораТекПериод КАК МаксДатаРегистратораТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксДатаРегистратораТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксДатаРегистратораТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.Район = МаксДатаРегистратораТекПериод.Район
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксДатаРегистратораТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксДатаРегистратораТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксДатаРегистратораТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксДатаРегистратораТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксДатаРегистратораТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора = МаксДатаРегистратораТекПериод.ДатаРегистратора
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксДатаРегистратораТекПериод.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийТекПериод.Разделитель) КАК Разделитель,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ МаксРазделительТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРегистраторТекПериод КАК МаксРегистраторТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксРегистраторТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксРегистраторТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.Район = МаксРегистраторТекПериод.Район
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксРегистраторТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксРегистраторТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксРегистраторТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксРегистраторТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксРегистраторТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора = МаксРегистраторТекПериод.ДатаРегистратора
	|			И НаборПредоставленныхПоказанийТекПериод.ДокРегистратор = МаксРегистраторТекПериод.ДокРегистратор
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксРегистраторТекПериод.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийТекПериод.Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.Район,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийТекПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийТекПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийТекПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийТекПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийТекПериод.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказанийТекПериод.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказанийТекПериод.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказанийТекПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийТекПериод.Показания КАК Показания,
	|	НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета.МКД КАК МКД
	|ПОМЕСТИТЬ бестМаксимальныеПоказанияСрезТекПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийТекПериод КАК НаборПредоставленныхПоказанийТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРазделительТекПериод КАК МаксРазделительТекПериод
	|		ПО НаборПредоставленныхПоказанийТекПериод.Организация = МаксРазделительТекПериод.Организация
	|			И НаборПредоставленныхПоказанийТекПериод.ПериодНачисления = МаксРазделительТекПериод.ПериодНачисления
	|			И НаборПредоставленныхПоказанийТекПериод.Договор = МаксРазделительТекПериод.Договор
	|			И НаборПредоставленныхПоказанийТекПериод.ОбъектРасчета = МаксРазделительТекПериод.ОбъектРасчета
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксРазделительТекПериод.ПриборУчета
	|			И НаборПредоставленныхПоказанийТекПериод.ТарифнаяЗона = МаксРазделительТекПериод.ТарифнаяЗона
	|			И НаборПредоставленныхПоказанийТекПериод.Шкала = МаксРазделительТекПериод.Шкала
	|			И НаборПредоставленныхПоказанийТекПериод.ДатаРегистратора = МаксРазделительТекПериод.ДатаРегистратора
	|			И НаборПредоставленныхПоказанийТекПериод.ДокРегистратор = МаксРазделительТекПериод.ДокРегистратор
	|			И НаборПредоставленныхПоказанийТекПериод.Разделитель = МаксРазделительТекПериод.Разделитель
	|			И НаборПредоставленныхПоказанийТекПериод.НомерПозиции = МаксРазделительТекПериод.НомерПозиции
	|			И НаборПредоставленныхПоказанийТекПериод.ПриборУчета = МаксРазделительТекПериод.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.Договор КАК Договор,
	|	ПоказанияНачало.ОбъектРасчета КАК ОбъектРасчета,
	|	ПоказанияНачало.МКД КАК МКД,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА &КонецПериодаРасчета
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|			И ПоказанияНачало.Договор = ПоказанияКонец.Договор
	|			И ПоказанияНачало.ОбъектРасчета = ПоказанияКонец.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднийОбъемПотребленияНП.Организация КАК Организация,
	|	бестСреднийОбъемПотребленияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСреднийОбъемПотребленияНП.Район КАК Район,
	|	бестСреднийОбъемПотребленияНП.МКД КАК МКД,
	|	бестСреднийОбъемПотребленияНП.Услуга КАК Услуга,
	|	бестСреднийОбъемПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСреднийОбъемПотребленияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестСреднийОбъемПотребленияНП.Шкала КАК Шкала,
	|	бестСреднийОбъемПотребленияНП.Объем КАК СреднийОбъем,
	|	бестСреднийОбъемПотребленияНП.Договор КАК Договор,
	|	бестСреднийОбъемПотребленияНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ СреднееПотреблениеАбонентов
	|ИЗ
	|	РегистрСведений.бестСреднийОбъемПотребленияНП КАК бестСреднийОбъемПотребленияНП
	|ГДЕ
	|	бестСреднийОбъемПотребленияНП.Организация = &Организация
	|	И бестСреднийОбъемПотребленияНП.ПериодНачисления = &ПериодНачисления
	|	И бестСреднийОбъемПотребленияНП.Район = &Район
	|	И бестСреднийОбъемПотребленияНП.Договор = &Договор
	|	И бестСреднийОбъемПотребленияНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериодыМКД.Организация КАК Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район КАК Район,
	|		энргСтабильныеПериодыМКД.МКД КАК МКД,
	|		энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргСтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|	ГДЕ
	|		энргСтабильныеПериодыМКД.Организация = &Организация
	|		И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|		И энргСтабильныеПериодыМКД.Район = &Район
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериодыМКД.Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район,
	|		энргСтабильныеПериодыМКД.МКД,
	|		энргСтабильныеПериодыМКД.Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = энргСтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргСтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = энргСтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргСтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериодыМКД.НомерПозиции
	|			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКД.Район = &Район)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКД.Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район,
	|	энргСтабильныеПериодыМКД.МКД,
	|	энргСтабильныеПериодыМКД.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонента) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		бестСтабильныеПериодыНП.Организация КАК Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район КАК Район,
	|		ЛОЖЬ КАК ЧастныйСектор,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.МКД КАК Строение,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|		бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|		МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеПлощади) КАК ПлощадьАбонента,
	|		ВЫБОР
	|			КОГДА бестСтабильныеПериодыНП.Поставщик = бестСтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА бестСтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			бестСтабильныеПериодыНП.Организация КАК Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район КАК Район,
	|			ЛОЖЬ КАК ЧастныйСектор,
	|			бестСтабильныеПериодыНП.МКД КАК Строение,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|			бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(бестСтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|			бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор КАК Договор
	|		ИЗ
	|			РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|		ГДЕ
	|			бестСтабильныеПериодыНП.Организация = &Организация
	|			И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|			И бестСтабильныеПериодыНП.Район = &Район
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бестСтабильныеПериодыНП.Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район,
	|			бестСтабильныеПериодыНП.Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета,
	|			бестСтабильныеПериодыНП.МКД,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение,
	|			бестСтабильныеПериодыНП.ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|			ПО ВложенныйЗапрос.Организация = бестСтабильныеПериодыНП.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = бестСтабильныеПериодыНП.ПериодНачисления
	|				И ВложенныйЗапрос.Район = бестСтабильныеПериодыНП.Район
	|				И ВложенныйЗапрос.Услуга = бестСтабильныеПериодыНП.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = бестСтабильныеПериодыНП.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = бестСтабильныеПериодыНП.НомерПозиции
	|				И (бестСтабильныеПериодыНП.Организация = &Организация)
	|				И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|				И (бестСтабильныеПериодыНП.Район = &Район)
	|				И ВложенныйЗапрос.Договор = бестСтабильныеПериодыНП.Договор
	|				И ВложенныйЗапрос.ОбъектРасчета = бестСтабильныеПериодыНП.ОбъектРасчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бестСтабильныеПериодыНП.Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район,
	|		бестСтабильныеПериодыНП.Услуга,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.МКД,
	|		ВЫБОР
	|			КОГДА бестСтабильныеПериодыНП.Поставщик = бестСтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА бестСтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		энргСтабильныеПериоды.Услуга,
	|		МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади),
	|		ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация КАК Организация,
	|			энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|			энргСтабильныеПериоды.Район КАК Район,
	|			энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение КАК Строение,
	|			энргСтабильныеПериоды.Помещение КАК Помещение,
	|			энргСтабильныеПериоды.Услуга КАК Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ГДЕ
	|			энргСтабильныеПериоды.Организация = &Организация
	|			И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|			И энргСтабильныеПериоды.Район = &Район
	|			И НЕ энргСтабильныеПериоды.ЧастныйСектор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.ПериодНачисления,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.ЧастныйСектор) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ПО ВложенныйЗапрос.Организация = энргСтабильныеПериоды.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|				И ВложенныйЗапрос.Район = энргСтабильныеПериоды.Район
	|				И ВложенныйЗапрос.Услуга = энргСтабильныеПериоды.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				И (энргСтабильныеПериоды.Организация = &Организация)
	|				И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|				И (энргСтабильныеПериоды.Район = &Район)
	|				И ВложенныйЗапрос.Строение = энргСтабильныеПериоды.Строение
	|				И ВложенныйЗапрос.Помещение = энргСтабильныеПериоды.Помещение
	|				И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.Услуга,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьМОП) КАК ПлощадьМОП,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначенияПлощадейСтроений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначениеПлощадейМКД.Организация КАК Организация,
	|		ЗначениеПлощадейМКД.ПериодНачисления КАК ПериодНачисления,
	|		ЗначениеПлощадейМКД.Район КАК Район,
	|		ЗначениеПлощадейМКД.МКД КАК МКД,
	|		ЗначениеПлощадейМКД.Услуга КАК Услуга,
	|		ЗначениеПлощадейМКД.ПлощадьМОП КАК ПлощадьМОП,
	|		0 КАК ПлощадьАбонентов,
	|		0 КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеПлощадейМКД КАК ЗначениеПлощадейМКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗначениеИндивидуальныхПлощадей.Организация,
	|		ЗначениеИндивидуальныхПлощадей.ПериодНачисления,
	|		ЗначениеИндивидуальныхПлощадей.Район,
	|		ЗначениеИндивидуальныхПлощадей.Строение,
	|		ЗначениеИндивидуальныхПлощадей.Услуга,
	|		0,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьАбонентов,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеИндивидуальныхПлощадей КАК ЗначениеИндивидуальныхПлощадей) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтабильныеПериодыПриборыУзловУчета.Организация КАК Организация,
	|	бестСтабильныеПериодыПриборыУзловУчета.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыПриборыУзловУчета.Район КАК Район,
	|	бестСтабильныеПериодыПриборыУзловУчета.Договор КАК Договор,
	|	бестСтабильныеПериодыПриборыУзловУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.НомерПозиции КАК НомерПозиции,
	|	бестСтабильныеПериодыПриборыУзловУчета.УзелУчета КАК УзелУчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.ПриборВведен КАК ПриборВведен
	|ПОМЕСТИТЬ СтабильныеПериодыПриборыУзловУчета
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыПриборыУзловУчета КАК бестСтабильныеПериодыПриборыУзловУчета
	|ГДЕ
	|	бестСтабильныеПериодыПриборыУзловУчета.Организация = &Организация
	|	И бестСтабильныеПериодыПриборыУзловУчета.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыПриборыУзловУчета.Район = &Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтабильныеПериодыШкалыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыШкалыНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыШкалыНП.Район КАК Район,
	|	бестСтабильныеПериодыШкалыНП.Договор КАК Договор,
	|	бестСтабильныеПериодыШкалыНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыШкалыНП.МКД КАК МКД,
	|	бестСтабильныеПериодыШкалыНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСтабильныеПериодыШкалыНП.ПриборУчета КАК ПриборУчета,
	|	бестСтабильныеПериодыШкалыНП.Шкала КАК Шкала,
	|	бестСтабильныеПериодыШкалыНП.НомерПозиции КАК НомерПозиции,
	|	бестСтабильныеПериодыШкалыНП.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыШкалыНП КАК бестСтабильныеПериодыШкалыНП
	|ГДЕ
	|	бестСтабильныеПериодыШкалыНП.Организация = &Организация
	|	И бестСтабильныеПериодыШкалыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыШкалыНП.Район = &Район
	|	И бестСтабильныеПериодыШкалыНП.Договор = &Договор
	|	И бестСтабильныеПериодыШкалыНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета
	|;
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийПредПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийПредПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета.МКД КАК МКД,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийПредПериод.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказанийПредПериод
	|	
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийПредПериод.Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Район,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета.МКД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестВыводПриборовУчетаНП.Организация КАК Организация,
	|	бестВыводПриборовУчетаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестВыводПриборовУчетаНП.Район КАК Район,
	|	бестВыводПриборовУчетаНП.Договор КАК Договор,
	|	бестВыводПриборовУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестВыводПриборовУчетаНП.МКД КАК МКД,
	|	бестВыводПриборовУчетаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестВыводПриборовУчетаНП.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	РегистрСведений.бестВыводПриборовУчетаНП КАК бестВыводПриборовУчетаНП
	|ГДЕ
	|	бестВыводПриборовУчетаНП.Организация = &Организация
	|	И бестВыводПриборовУчетаНП.ПериодНачисления = &ПериодНачисления
	|	И бестВыводПриборовУчетаНП.Район = &Район
	|	И бестВыводПриборовУчетаНП.Договор = &Договор
	|	И бестВыводПриборовУчетаНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестМаксимальныеПоказанияСрезТекПериод.Организация КАК Организация,
	|	бестМаксимальныеПоказанияСрезТекПериод.ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезТекПериод.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезТекПериод.Договор КАК Договор,
	|	бестМаксимальныеПоказанияСрезТекПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезТекПериод.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезТекПериод.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезТекПериод.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезТекПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезТекПериод.Показания КАК Показания
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	бестМаксимальныеПоказанияСрезТекПериод КАК бестМаксимальныеПоказанияСрезТекПериод
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезТекПериод.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезТекПериод.ПериодНачисления = &ПериодНачисления
	|	И бестМаксимальныеПоказанияСрезТекПериод.Район = &Район
	|	И бестМаксимальныеПоказанияСрезТекПериод.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоДоговору
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.Договор = &Договор
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация КАК Организация,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район КАК Район,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература КАК ПроектнаяТемпература
	|ПОМЕСТИТЬ ТемператураНаружногоВоздуха
	|ИЗ
	|	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестИзмененияОкружающейСредыСрезПоследних.Организация КАК Организация,
	|	бестИзмененияОкружающейСредыСрезПоследних.Район КАК Район,
	|	бестИзмененияОкружающейСредыСрезПоследних.ПроектнаяТемператураХВС КАК ПроектнаяТемператураХВС,
	|	бестИзмененияОкружающейСредыСрезПоследних.ПроектнаяТемператураГВС КАК ПроектнаяТемператураГВС,
	|	бестИзмененияОкружающейСредыСрезПоследних.ТемператураХВСВОтопительныйПериод КАК ТемператураХВСВОтопительныйПериод,
	|	бестИзмененияОкружающейСредыСрезПоследних.ТемператураХВСВНеотопительныйПериод КАК ТемператураХВСВНеотопительныйПериод
	|ПОМЕСТИТЬ ТемпературыПоВоде
	|ИЗ
	|	РегистрСведений.бестИзмененияОкружающейСреды.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестИзмененияОкружающейСредыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация КАК Организация,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район КАК Район,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература
	|ПОМЕСТИТЬ ФактическаяСреднемесячнаяТемпература
	|ИЗ
	|	РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НАЧАЛОПЕРИОДА(РасчетныйМесяц, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ)) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация КАК Организация,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.Район КАК Район,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения КАК КатегорияПомещения,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная КАК ТемператураОптимальная
	|ПОМЕСТИТЬ ТемператураКатегорииПомещения
	|ИЗ
	|	РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНПОбороты.Организация КАК Организация,
	|	бестОбъемНачисленийНПОбороты.Район КАК Район,
	|	бестОбъемНачисленийНПОбороты.Договор КАК Договор,
	|	бестОбъемНачисленийНПОбороты.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНПОбороты.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНПОбороты.Услуга КАК Услуга,
	|	бестОбъемНачисленийНПОбороты.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНПОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|	бестОбъемНачисленийНПОбороты.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНПОбороты.КоличествоЧасовШтатнойРаботыПУОборот КАК КоличествоЧасовШтатнойРаботыПУОборот
	|ПОМЕСТИТЬ РасходЗаПредПериод
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	|			&НачалоПредПериодаРасчета,
	|			&НачалоПериодаРасчета,
	|			Запись,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестОбъемНачисленийНПОбороты
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестНомераСтрокСтабильногоПериодаНП.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)
	|			И (бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	бестНомераСтрокСтабильногоПериодаНП.ПриборУчета,
	|	ДлительностьПериодов.НачалоФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестНомераСтрокСтабильногоПериодаНП.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)
	|			И (бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	бестНомераСтрокСтабильногоПериодаНП.ПриборУчета,
	|	ДлительностьПериодов.КонецФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета, 	
	|	бестНомераСтрокСтабильногоПериодаНП.ПриборУчета КАК ПриборУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа КАК ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор КАК Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа КАК ЗначениеТарифа,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомераСтрокЗначениеТарифа
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ЗначенияТарифов.ДатаСменыТарифа
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ЗначенияТарифов.Услуга
	|			И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)
	|			И (бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	бестНомераСтрокСтабильногоПериодаНП.ПриборУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Организация КАК Организация,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Район КАК Район,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ГБП КАК ГБП
	|ПОМЕСТИТЬ РасположениеТУОтносительноГБП
	|ИЗ
	|	РегистрСведений.бестРасположениеТочекУчетаОтносительноГБП.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасположениеТочекУчетаОтносительноГБПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Договор КАК Договор,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	ТемпературыИсточника.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ТемпературыИсточника.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника
	|ПОМЕСТИТЬ ТемпературыИсточникаТочекУчета
	|ИЗ
	|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТемпературыИсточника КАК ТемпературыИсточника
	|		ПО бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация = ТемпературыИсточника.Организация
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.Район = ТемпературыИсточника.Район
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = ТемпературыИсточника.Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","бестСтабильныеПериодыНП","ПериодРегистрации",Истина,Ложь) + "
	|	ВЫБОР
	|		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&КонецПериодаРасчета КАК ЗавершениеОП,
	|	&ДнейВПериоде КАК ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|ГДЕ
	|	бестСтабильныеПериодыНП.Организация = &Организация
	|	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыНП.Район = &Район
	|	И бестСтабильныеПериодыНП.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачало","ПриборУчета,Шкала",Истина,Ложь) + "	
 	|	СтабильныеПериодыПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	 |	СтабильныеПериодыНачало.ПриборУчета КАК УзелУчета,
	|	СтабильныеПериодыНачало.ПериодРегистрации,
	|	СтабильныеПериодыНачало.НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная)) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачало.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПривязанаКШкале
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоШкалы
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПриборыУзловУчета КАК СтабильныеПериодыПриборыУзловУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|			ПО СтабильныеПериодыПриборыУзловУчета.Организация = СтабильныеПериодыШкалы.Организация
	|				И СтабильныеПериодыПриборыУзловУчета.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|				И СтабильныеПериодыПриборыУзловУчета.Район = СтабильныеПериодыШкалы.Район
	|				И СтабильныеПериодыПриборыУзловУчета.Договор = СтабильныеПериодыШкалы.Договор
	|				И СтабильныеПериодыПриборыУзловУчета.ОбъектРасчета = СтабильныеПериодыШкалы.ОбъектРасчета
	|				И СтабильныеПериодыПриборыУзловУчета.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|				И СтабильныеПериодыПриборыУзловУчета.ПриборУчета = СтабильныеПериодыШкалы.ПриборУчета
	|				И СтабильныеПериодыПриборыУзловУчета.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|		ПО СтабильныеПериодыНачало.Организация = СтабильныеПериодыПриборыУзловУчета.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СтабильныеПериодыПриборыУзловУчета.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СтабильныеПериодыПриборыУзловУчета.Район
	|			И СтабильныеПериодыНачало.Договор = СтабильныеПериодыПриборыУзловУчета.Договор
	|			И СтабильныеПериодыНачало.ОбъектРасчета = СтабильныеПериодыПриборыУзловУчета.ОбъектРасчета
	|			И СтабильныеПериодыНачало.ТочкаУчета = СтабильныеПериодыПриборыУзловУчета.ТочкаУчета
	|			И СтабильныеПериодыНачало.НомерПозиции = СтабильныеПериодыПриборыУзловУчета.НомерПозиции
	|			И СтабильныеПериодыНачало.ПриборУчета = СтабильныеПериодыПриборыУзловУчета.УзелУчета";
	
	Если Не ОтборПоДоговору  тогда
		Текст 		= СтрЗаменить(Текст,"И Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестПредоставленныеПоказанияНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестСреднийОбъемПотребленияНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыШкалыНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестВыводПриборовУчетаНП.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестМаксимальныеПоказанияСрезТекПериод.Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И (бестНомераСтрокСтабильногоПериодаНП.Договор = &Договор)","");
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыНП.Договор = &Договор","");
	КонецЕсли;
	
	Если Отдельностоящие = Неопределено Тогда
		Текст 		= СтрЗаменить(Текст,"И ОбъектРасчета.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"И бестПредоставленныеПоказанияНП.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"И бестСреднийОбъемПотребленияНП.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыШкалыНП.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"И бестВыводПриборовУчетаНП.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"И (бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД)","");
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыНП.МКД = &МКД","");
	ИначеЕсли Отдельностоящие = Ложь Тогда
		Текст 		= СтрЗаменить(Текст,"МКД = &МКД","МКД <> &МКД");
	КонецЕсли;
	
	Возврат Текст;	
	
КонецФункции

Функция ТекстПолучитьСтабильныеПериоды(ЭтоПерерасче,Отдельностоящие)  
	
	Текст 	=
	"ВЫБРАТЬ
	|	НомераСтрокНачалоСезонности.Организация КАК Организация,
	|	НомераСтрокНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокНачалоСезонности.Район КАК Район,
	|	НомераСтрокНачалоСезонности.Договор КАК Договор,
	|	НомераСтрокНачалоСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокНачалоСезонности.МКД КАК МКД,
	|	НомераСтрокНачалоСезонности.Услуга КАК Услуга,
	|	НомераСтрокНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокНачалоСезонности.ПриборУчета КАК ПриборУчета,
	|	НомераСтрокНачалоСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокНачалоСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокНачалоСезонности КАК НомераСтрокНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокНачалоСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокНачалоСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокНачалоСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокНачалоСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокНачалоСезонности.Договор = СтабильныеПериодыНачало.Договор
	|			И НомераСтрокНачалоСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокНачалоСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокНачалоСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокНачалоСезонности.ПриборУчета = СтабильныеПериодыНачало.ПриборУчета
	|			И НомераСтрокНачалоСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокКонецСезонности.Организация КАК Организация,
	|	НомераСтрокКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокКонецСезонности.Район КАК Район,
	|	НомераСтрокКонецСезонности.МКД КАК МКД,
	|	НомераСтрокКонецСезонности.Договор КАК Договор,
	|	НомераСтрокКонецСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокКонецСезонности.Услуга КАК Услуга,
	|	НомераСтрокКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокКонецСезонности.ПриборУчета КАК ПриборУчета,
	|	НомераСтрокКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокКонецСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокКонецСезонности КАК НомераСтрокКонецСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокКонецСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокКонецСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокКонецСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокКонецСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокКонецСезонности.Договор = СтабильныеПериодыНачало.Договор
	|			И НомераСтрокКонецСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокКонецСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокКонецСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокКонецСезонности.ПриборУчета = СтабильныеПериодыНачало.ПриборУчета
	|			И НомераСтрокКонецСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоШкалы","",Истина,Ложь) + "	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиНеПрименятьСезонность.НеПрименятьСезонность, ИСТИНА)
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СезонностьНачало,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонность.НеПрименятьСезонность, ЛОЖЬ) КАК НеПрименятьСезонность,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонность.ОбъемЗаПрошлыйГод, Ложь) КАК ОбъемЗаПрошлыйГод,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонность.КоэффициентНорматива, 1) КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоШкалы.УзелУчета КАК УзелУчета,
	|	ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0) КАК ГарантированныйОбъем,
	|   ЕСТЬNULL(ТемператураКатегорииПомещения.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоШкалы.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоШкалы.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоШкалы.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоШкалы.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачалоШкалы.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонность
	|		ПО СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонность.Район
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонность.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = ГарантированныеОбъемы.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = ГарантированныеОбъемы.Район
	|			И СтабильныеПериодыНачалоШкалы.Договор = ГарантированныеОбъемы.Договор
	|			И СтабильныеПериодыНачалоШкалы.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	|			И СтабильныеПериодыНачалоШкалы.Услуга = ГарантированныеОбъемы.Услуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТемператураКатегорииПомещения КАК ТемператураКатегорииПомещения
	|			ПО бестОбъектыРасчета.КатегорияПомещения = ТемператураКатегорииПомещения.КатегорияПомещения
	|		ПО СтабильныеПериодыНачалоШкалы.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" +	бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "	
	|	СтабильныеПериодыНачалоСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.УзелУчета КАК УзелУчета,
	|   СтабильныеПериодыНачалоСезонности.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + ВЫБОР
	|	КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачалоСезонности.СезонностьНачало
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УвеличениеПозиции
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Договор = НомераСтрокНачалоСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.ПриборУчета = НомераСтрокНачалоСезонностиБезФормулы.ПриборУчета
	|			И СтабильныеПериодыНачалоСезонности.ПериодРегистрации >= НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "
	|	НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.УзелУчета КАК УзелУчета,
	|   СтабильныеПериодыНачалоСезонности.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + 1 КАК НомерПозиции,
	|	1 КАК КоэффициентСезоности,
	|	1
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.ПриборУчета = НомераСтрокНачалоСезонностиБезФормулы.ПриборУчета
	|			И (СтабильныеПериодыНачалоСезонности.НомерПозиции = НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И СтабильныеПериодыНачалоСезонности.Договор = НомераСтрокНачалоСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "	
	|	СтабильныеПериодыСезонность.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + СтабильныеПериодыСезонность.УвеличениеПозиции > СтабильныеПериодыСезонность.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыСезонность.ПериодРегистрации КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыСезонность.КоэффициентСезоности
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|   СтабильныеПериодыСезонность.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТипНачисления
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Договор = НомераСтрокКонецСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыСезонность.ОбъектРасчета = НомераСтрокКонецСезонностиБезФормулы.ОбъектРасчета
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.ПриборУчета = НомераСтрокКонецСезонностиБезФормулы.ПриборУчета
	|			И СтабильныеПериодыСезонность.ПериодРегистрации >= НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "		
	|	НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + 1,
	|	НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности,
	|	0 КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.УзелУчета,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем,
	|   СтабильныеПериодыСезонность.ТемператураВнутриПомещения
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Договор = НомераСтрокКонецСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.ПриборУчета = НомераСтрокКонецСезонностиБезФормулы.ПриборУчета
	|			И (СтабильныеПериодыСезонность.НомерПозиции - СтабильныеПериодыСезонность.УвеличениеПозиции = НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонностиТипНачисления","",Истина,Ложь) + "	
	|	СтабильныеКонецСезонностиТипНачисления.КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТипНачисления.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТипНачисления.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТипНачисления.НачалоОП,
	|	СтабильныеКонецСезонностиТипНачисления.ЗавершениеОП,
	|	СтабильныеКонецСезонностиТипНачисления.ДнейВПериоде,
	|	СтабильныеКонецСезонностиТипНачисления.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеКонецСезонностиТипНачисления.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеКонецСезонностиТипНачисления.КоэффициентНорматива,
	|	СтабильныеКонецСезонностиТипНачисления.УзелУчета КАК УзелУчета,
	|	СтабильныеКонецСезонностиТипНачисления.ГарантированныйОбъем,
	|   СтабильныеКонецСезонностиТипНачисления.ТемператураВнутриПомещения,
	|	СтабильныеКонецСезонностиТипНачисления.ВидДифференцированности,
	|	СтабильныеКонецСезонностиТипНачисления.ПривязанаКШкале,
	|	ВЫБОР
	|		КОГДА энргВидыДифференцированностиТарифныеЗоны.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТарифнаяЗона
	|ИЗ
	|	СтабильныеКонецСезонностиТипНачисления КАК СтабильныеКонецСезонностиТипНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеКонецСезонностиТипНачисления.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонностиТарифнаяЗона","",Истина,Ложь) + "
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидДифференцированности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПривязанаКШкале,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ПериодыПоказаний.Показания, 0) КАК Показания,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеКонецСезонностиТарифнаяЗона.УзелУчета КАК УзелУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|   СтабильныеКонецСезонностиТарифнаяЗона.ТемператураВнутриПомещения  КАК ТемператураВнутриПомещения
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	СтабильныеКонецСезонностиТарифнаяЗона КАК СтабильныеКонецСезонностиТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестНачислениеНП
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестЗаключениеДоговоровСЮридическимиЛицами
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСПриборомУчетаНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСУслугамиНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				ИНАЧЕ СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации МЕЖДУ ПериодыПоказаний.НачалоПериодДействия И ПериодыПоказаний.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Организация = ПериодыПоказаний.Организация
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Район = ПериодыПоказаний.Район
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Договор = ПериодыПоказаний.Договор
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ОбъектРасчета = ПериодыПоказаний.ОбъектРасчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПриборУчета = ПериодыПоказаний.ПриборУчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Шкала = ПериодыПоказаний.Шкала
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона = ПериодыПоказаний.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыПоказанияНачало","НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	СтабильныеПериодыПоказанияНачало.ВидДифференцированности,
	|	СтабильныеПериодыПоказанияНачало.ПривязанаКШкале,
	|	СтабильныеПериодыПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,
	|	СтабильныеПериодыПоказанияНачало.Показания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПриборУчета ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.Показания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|					ТОГДА СтабильныеПериодыПоказанияКонец.Показания
	|				ИНАЧЕ СтабильныеПериодыПоказанияНачало.Показания
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеПериодыПоказанияНачало.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыПоказанияНачало.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыПоказанияНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПоказанияНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПоказанияНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыПоказанияКонец.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыПоказанияНачало.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыПоказанияНачало.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыПоказанияНачало.ТемператураВнутриПомещения  КАК ТемператураВнутриПомещения
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияКонец
	|		ПО (СтабильныеПериодыПоказанияНачало.НомерПозиции = СтабильныеПериодыПоказанияКонец.НомерПозиции - 1)
	|			И СтабильныеПериодыПоказанияНачало.Организация = СтабильныеПериодыПоказанияКонец.Организация
	|			И СтабильныеПериодыПоказанияНачало.ПериодНачисления = СтабильныеПериодыПоказанияКонец.ПериодНачисления
	|			И СтабильныеПериодыПоказанияНачало.Район = СтабильныеПериодыПоказанияКонец.Район
	|			И СтабильныеПериодыПоказанияНачало.Договор = СтабильныеПериодыПоказанияКонец.Договор
	|			И СтабильныеПериодыПоказанияНачало.ОбъектРасчета = СтабильныеПериодыПоказанияКонец.ОбъектРасчета
	|			И СтабильныеПериодыПоказанияНачало.ТочкаУчета = СтабильныеПериодыПоказанияКонец.ТочкаУчета
	|			И СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|			И СтабильныеПериодыПоказанияНачало.Услуга = СтабильныеПериодыПоказанияКонец.Услуга
	|			И СтабильныеПериодыПоказанияНачало.ТарифнаяЗона = СтабильныеПериодыПоказанияКонец.ТарифнаяЗона";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле, ИмяДокумента,Отдельностоящие)
	
	Текст   = 
	"ВЫБРАТЬ
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.Договор КАК Договор,
	|	Периоды.МКД КАК МКД,
	|	Периоды.ОбъектРасчета КАК ОбъектРасчета,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.НомерПозиции КАК НомерПозиции,
	|	Периоды.ДоговорЗаключен КАК ДоговорЗаключен,
	|	Периоды.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	|	Периоды.УслугаПодключена КАК УслугаПодключена,
	|	Периоды.ПриборВведен КАК ПриборВведен,
	|	Периоды.УзелУчета КАК УзелУчета,
	|	Периоды.ПриборУчета КАК ПриборУчета,
	|	Периоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	Периоды.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	|	Периоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	Периоды.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Периоды.ДатаПоверки КАК ДатаПоверки,
	|	Периоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	Периоды.КоэффициентРасчета КАК КоэффициентРасчета,
	|	Периоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	Периоды.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	Периоды.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	|	Периоды.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	Периоды.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	Периоды.РасчетПоФормуле КАК РасчетПоФормуле,
	|	Периоды.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	|	Периоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Периоды.КлючНорматива КАК КлючНорматива,
	|	Периоды.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	Периоды.Поставщик КАК Поставщик,
	|	Периоды.Шкала КАК Шкала,
	|	Периоды.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	Периоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)) КАК ФормулаРасчета,
	|	Периоды.НачалоПериода КАК НачалоПериода,
	|	Периоды.КонецПериода КАК КонецПериода,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.НачальныеПоказания КАК НачПок,
	|	Периоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, 0) КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ КАК КонПок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ОбъектРасчета ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПредоставленныеПоказания.ВСрок
	|		КОНЕЦ) КАК ПоказанияВСрок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеВыводаПрибораУчета.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВыводПрибораУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ПоказанияПредоставлены,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаДокумента.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеНП.ПустаяСсылка))) КАК ДокументНачисления,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	Периоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|	МАКСИМУМ(ЕСТЬNULL(ПредоставленныеПоказанияПоДоговору.ПоказанияТекущегоПериода, ЛОЖЬ)) КАК ЕстьПоказанияАбонента,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.СледующийРегистратор КАК СледующийРегистратор,
	|	Периоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	Периоды.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ЕСТЬNULL(ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	|	ЕСТЬNULL(ТемператураНаружногоВоздуха.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию) КАК ПроектнаяТемператураНаружногоВоздуха,
	//|	энргВидыУслуг.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	Периоды.ТипСхемыГВС КАК ТипСхемыГВС,
	|	Периоды.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	|	Периоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	Периоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	Периоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	Периоды.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	Периоды.СпособРасчетаПриВыходеПУ КАК СпособРасчетаПриВыходеПУ,
	|	Периоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗакрытаяСхемаГВС,
	|	ВЫБОР
	|		КОГДА Периоды.КоличествоЧасовРаботы = 0
	|			ТОГДА 24
	|		ИНАЧЕ Периоды.КоличествоЧасовРаботы
	|	КОНЕЦ КАК КоличествоЧасовРаботы,
	|	ВЫБОР
	|		КОГДА ТемпературыПоВоде.ПроектнаяТемператураГВС <> 0
	|				И ТемпературыПоВоде.ПроектнаяТемператураГВС <> ТемпературыПоВоде.ПроектнаяТемператураХВС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтопительныйПериод.Сезонность ЕСТЬ NULL
	|						ТОГДА (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВНеотопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|					ИНАЧЕ (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВОтопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТемпературныйКоэффициентПоВоде,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоде КАК бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ОтопительныйПериод.Сезонность КАК ОтопительныйПериод,
	|	ЕСТЬNULL(РасходЗаПредПериод.ОбъемУслугиОборот, 0) КАК РасходЗаПредыдущийПериод,
	|	ВЫБОР
	|		КОГДА ПредоставленныеПоказанияПредПериод.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеПоказанийЗаПредПериод,
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот, 0) КАК ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0) КАК ПлощадьМОП,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0) КАК ПлощадьАбонентов,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормойТипНачисления
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО Периоды.Организация = ПредоставленныеПоказания.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказания.Район
	|			И Периоды.Договор = ПредоставленныеПоказания.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.Договор = МаксимальныеПоказания.Договор
	|			И Периоды.ОбъектРасчета = МаксимальныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеНП КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ))
	|			И Периоды.Организация = ТаблицаДокумента.Организация
	|			И Периоды.Район = ТаблицаДокумента.Район
	|			И Периоды.Договор = ТаблицаДокумента.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеАбонентов КАК СреднееПотреблениеАбонентов
	|		ПО Периоды.Организация = СреднееПотреблениеАбонентов.Организация
	|			И Периоды.ПериодНачисления = СреднееПотреблениеАбонентов.ПериодНачисления
	|			И Периоды.Район = СреднееПотреблениеАбонентов.Район
	|			И Периоды.Договор = СреднееПотреблениеАбонентов.Договор
	|			И Периоды.ОбъектРасчета = СреднееПотреблениеАбонентов.ОбъектРасчета
	|			И Периоды.Услуга = СреднееПотреблениеАбонентов.Услуга
	|			И Периоды.ТочкаУчета = СреднееПотреблениеАбонентов.ТочкаУчета
	|			И Периоды.Шкала = СреднееПотреблениеАбонентов.Шкала
	|			И Периоды.ТарифнаяЗона = СреднееПотреблениеАбонентов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВыводаПрибораУчета КАК ДанныеВыводаПрибораУчета
	|		ПО Периоды.Организация = ДанныеВыводаПрибораУчета.Организация
	|			И Периоды.ПериодНачисления = ДанныеВыводаПрибораУчета.ПериодНачисления
	|			И Периоды.Район = ДанныеВыводаПрибораУчета.Район
	|			И Периоды.Договор = ДанныеВыводаПрибораУчета.Договор
	|			И Периоды.ОбъектРасчета = ДанныеВыводаПрибораУчета.ОбъектРасчета
	|			И Периоды.ТочкаУчета = ДанныеВыводаПрибораУчета.ТочкаУчета
	|			И Периоды.ПриборУчета = ДанныеВыводаПрибораУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Периоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Периоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоДоговору КАК ПредоставленныеПоказанияПоДоговору
	|		ПО Периоды.Организация = ПредоставленныеПоказанияПоДоговору.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияПоДоговору.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияПоДоговору.Район
	|			И Периоды.Договор = ПредоставленныеПоказанияПоДоговору.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказанияПоДоговору.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемператураНаружногоВоздуха КАК ТемператураНаружногоВоздуха
	|		ПО Периоды.Организация = ТемператураНаружногоВоздуха.Организация
	|			И Периоды.Район = ТемператураНаружногоВоздуха.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическаяСреднемесячнаяТемпература КАК ФактическаяСреднемесячнаяТемпература
	|		ПО Периоды.Организация = ФактическаяСреднемесячнаяТемпература.Организация
	|			И Периоды.Район = ФактическаяСреднемесячнаяТемпература.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО Периоды.Организация = МКДНеНачислятьТЭ.Организация
	|			И Периоды.Район = МКДНеНачислятьТЭ.Район
	|			И Периоды.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И (ВЫБОР
	|				КОГДА МКДНеНачислятьТЭ.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА Периоды.МКД = МКДНеНачислятьТЭ.МКД
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И Периоды.ТипСхемыГВС = МКДНеНачислятьТЭ.ТипСхемы
	|			И Периоды.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыПоВоде КАК ТемпературыПоВоде
	|		ПО Периоды.Организация = ТемпературыПоВоде.Организация
	|			И Периоды.Район = ТемпературыПоВоде.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтопительныйПериод КАК ОтопительныйПериод
	|		ПО Периоды.НачалоПериода >= ОтопительныйПериод.НачалоПериодаДействия
	|		И Периоды.КонецПериода <= ОтопительныйПериод.КонецПериодаДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходЗаПредПериод КАК РасходЗаПредПериод
	|		ПО Периоды.Организация = РасходЗаПредПериод.Организация
	|			И Периоды.Район = РасходЗаПредПериод.Район
	|			И Периоды.Договор = РасходЗаПредПериод.Договор
	|			И Периоды.ОбъектРасчета = РасходЗаПредПериод.ОбъектРасчета
	|			И Периоды.ТочкаУчета = РасходЗаПредПериод.ТочкаУчета
	|			И Периоды.Услуга = РасходЗаПредПериод.Услуга
	|		ПОЛНОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПредПериод КАК ПредоставленныеПоказанияПредПериод
	|		ПО Периоды.Район = ПредоставленныеПоказанияПредПериод.Район
	|			И Периоды.Договор = ПредоставленныеПоказанияПредПериод.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказанияПредПериод.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказанияПредПериод.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСтроений КАК ЗначенияПлощадейСтроений
	|		ПО Периоды.Организация = ЗначенияПлощадейСтроений.Организация
	|			И Периоды.ПериодНачисления = ЗначенияПлощадейСтроений.ПериодНачисления
	|			И Периоды.Район = ЗначенияПлощадейСтроений.Район
	|			И Периоды.МКД = ЗначенияПлощадейСтроений.МКД
	|			И Периоды.Услуга = ЗначенияПлощадейСтроений.Услуга
	|ГДЕ
	|	Периоды.ДоговорЗаключен
	|	И Периоды.УслугаПодключена
	|	И ВЫБОР
	|			КОГДА Периоды.УчаствуетВДолевойСхеме
	|				ТОГДА ВЫБОР
	|						КОГДА Периоды.ТочкаУчета <> Периоды.ЗависимаяТочкаУчета
	|							ТОГДА ВЫБОР
	|									КОГДА Периоды.ПриборВведен
	|										ТОГДА ИСТИНА
	|									ИНАЧЕ Периоды.РасчетИндивидуальногоПотребления
	|								КОНЕЦ
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Организация,
	|	Периоды.ПериодНачисления,
	|	Периоды.Район,
	|	Периоды.Договор,
	|	Периоды.МКД,
	|	Периоды.ОбъектРасчета,
	|	Периоды.Услуга,
	|	Периоды.ТочкаУчета,
	|	Периоды.УзелУчета,
	//|	Периоды.УзелУчетаУдалить,
	|	Периоды.ПриборУчета,
	//|	Периоды.ПриборУчетаУдалить,
	//|	Периоды.ПриборУчетаРесурс,
	|	Периоды.НомерПозиции,
	|	Периоды.ДоговорЗаключен,
	|	Периоды.ОбъектРасчетаПодключен,
	|	Периоды.УслугаПодключена,
	|	Периоды.ПриборВведен,
	|	Периоды.ЗначениеНагрузки,
	|	Периоды.ЗначениеМесячнойНагрузки,
	|	Периоды.ЗначениеПлощади,
	|	Периоды.ТарифнаяГруппа,
	|	Периоды.ДатаПоверки,
	|	Периоды.ЗависимаяТочкаУчета,
	|	Периоды.КоэффициентРасчета,
	|	Периоды.ДатаСостоянияПрибора,
	|	Периоды.МенялосьСостояниеПУ,
	|	Периоды.МенялосьСостояниеФормулы,
	|	Периоды.ЗначениеНормативаЗаДень,
	|	Периоды.ОбъектУчаствуетВРаспределенииМКД,
	|	Периоды.РасчетПоФормуле,
	|	Периоды.ТепловаяСоставляющая,
	|	Периоды.СпособРасчетаНорматива,
	|	Периоды.КлючНорматива,
	|	Периоды.ТемператураВнутриПомещения,
	|	Периоды.Поставщик,
	|	Периоды.Шкала,
	|	Периоды.НетВозможностьУстановкиПУ,
	|	Периоды.СоставнаяУслуга,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)),
	|	Периоды.НачалоПериода,
	|	Периоды.КонецПериода,
	|	Периоды.ВидДифференцированности,
	|	Периоды.ТарифнаяЗона,
	|	Периоды.ПривязанаКШкале,
	|	Периоды.НачальныеПоказания,
	|	СреднееПотреблениеАбонентов.СреднийОбъем,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, 0),
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)),
	|	Периоды.НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод,
	|	Периоды.ГарантированныйОбъем,
	|	Периоды.ДнейВПериоде,
	|	Периоды.СледующийРегистратор,
	|	Периоды.КоэффициентНорматива,
	|	Периоды.ТипСхемыГВС,
	|	Периоды.ВидТепловогоПункта,
	|	ЕСТЬNULL(ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемпература, 0),
	|	ЕСТЬNULL(ТемператураНаружногоВоздуха.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию),
//	|	энргВидыУслуг.ИспользоватьПовыщающийКоэффициент,
	|	Периоды.УчаствуетВДолевойСхеме,
	|	Периоды.СпособРаспределенияОбъемаДолевойТУ,
	|	Периоды.СпособРаспределенияОстаткаДолевыеСхемы,
	|	Периоды.РасчетИндивидуальногоПотребления,
	|	Периоды.КоэффициентДолевогоРаспределения,
	|	Периоды.СпособРасчетаПриВыходеПУ,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ВЫБОР
	|		КОГДА Периоды.КоличествоЧасовРаботы = 0
	|			ТОГДА 24
	|		ИНАЧЕ Периоды.КоличествоЧасовРаботы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТемпературыПоВоде.ПроектнаяТемператураГВС <> 0
	|				И ТемпературыПоВоде.ПроектнаяТемператураГВС <> ТемпературыПоВоде.ПроектнаяТемператураХВС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтопительныйПериод.Сезонность ЕСТЬ NULL
	|						ТОГДА (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВНеотопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|					ИНАЧЕ (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВОтопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ОтопительныйПериод.Сезонность,
	|	ЕСТЬNULL(РасходЗаПредПериод.ОбъемУслугиОборот, 0),
	|	ВЫБОР
	|		КОГДА ПредоставленныеПоказанияПредПериод.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0)
	|";   	
	
	Если РасчетПоФормуле тогда
		Текст = СтрЗаменить(Текст,
		"И НЕ Периоды.РасчетПоФормуле",
		" И (Периоды.РасчетПоФормуле  ИЛИ НЕ Периоды.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))");
	КонецЕсли; 
	
	Текст 							= СтрЗаменить(Текст,"Документ.бестНачислениеНП КАК ТаблицаДокумента","Документ."  + ИмяДокумента + " КАК ТаблицаДокумента");
	Текст 							= СтрЗаменить(Текст,"ТипНачисления",ИмяДокумента);
	
	Возврат Текст;
	
КонецФункции

Функция ТекстРассчитатьИндивидуальныйОбъемПотребленияНП(ФормируемВременную,ИмяДокумента,Отдельностоящие); 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 1
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 2
	|			ИНАЧЕ 3
	|		КОНЕЦ) КАК Приоритет
	|ПОМЕСТИТЬ ПриоритетНормыТипНачисления
	|ИЗ
	|	ДанныеДляРасчетаПередНормойТипНачисления КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0
	|	И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|			ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ТочкиНачисленияНормыТипНачисления
	|ИЗ
	|	ДанныеДляРасчетаПередНормойТипНачисления КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормыТипНачисления КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ПриоритетНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Договор = ПриоритетНормы.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ПриоритетНормы.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И (ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0)
	|			И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 1
	|					ТОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|							И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				КОГДА ПриоритетНормы.Приоритет = 2
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета
	|;  
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","ДанныеДляРасчетаПередНормой","НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.УзелУчета КАК УзелУчета,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ДанныеДляРасчетаПередНормой.КонПок КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ДанныеДляРасчетаПЕредНормой,
	|	ВЫБОР
	|		КОГДА НЕ НастройкиГВСЗависимаяУслуга.Услуга ЕСТЬ NULL
	|			ТОГДА НастройкиГВСЗависимаяУслуга.Услуга
	|		КОГДА НЕ НастройкиГВС.Услуга ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ энргВидыУслуг.ЗависитОтУслуги
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.КоэффициентРасчета = 1
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ТочкиНачисленияНормы.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчетаПередНормой.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература,
	|	ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха КАК ПроектнаяТемператураНаружногоВоздуха,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,	
	//|	ДанныеДляРасчетаПередНормой.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	ЕСТЬNULL(ЗначенияПовышающихКоэффициентов.Коэффициент, 1) КАК ПовышающийКоэффициент,
	|	ВЫБОР
	|		КОГДА НЕ НастройкиГВСЗависимаяУслуга.Услуга ЕСТЬ NULL
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетГВС,
	|   ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	РасположениеТУОтносительноГБП.ГБП КАК ГБП,
	|	ЕСТЬNULL(ДанныеДляРасчетаПередНормой.Услуга.СодержитПотери, ЛОЖЬ) КАК СодержитПотери,
	|	ДанныеДляРасчетаПередНормой.ТемпературныйКоэффициентПоВоде КАК ТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ВЫБОР
	|		КОГДА НастройкиГВСЗависимаяУслуга.Услуга ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УслугаСОбратнымРасчетом,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураПодачиИсточника, 0) КАК ТемператураПодачиИсточника,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0) КАК ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчетаПередНормой.РасходЗаПредыдущийПериод КАК РасходЗаПредыдущийПериод,
	|	ДанныеДляРасчетаПередНормой.НаличиеПоказанийЗаПредПериод КАК НаличиеПоказанийЗаПредПериод,
	|	ДанныеДляРасчетаПередНормой.ВремяШтатнойРаботыПУЗаПредыдущийПериод КАК ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботы КАК КоличествоЧасовПредоставленияУслуги,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты
	|ПОМЕСТИТЬ ДанныеДляРасчетаТипНачисления
	|ИЗ
	|	ДанныеДляРасчетаПередНормойТипНачисления КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормыбестНачислениеНП КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ТочкиНачисленияНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.Договор = ТочкиНачисленияНормы.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТочкиНачисленияНормы.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ДанныеДляРасчетаПередНормой.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияПовышающихКоэффициентов.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияПовышающихКоэффициентов.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасположениеТУОтносительноГБП КАК РасположениеТУОтносительноГБП
	|		ПО ДанныеДляРасчетаПередНормой.Организация = РасположениеТУОтносительноГБП.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = РасположениеТУОтносительноГБП.Район
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = РасположениеТУОтносительноГБП.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиГВС КАК НастройкиГВСЗависимаяУслуга
	|		ПО (ДанныеДляРасчетаПередНормой.Организация = НастройкиГВСЗависимаяУслуга.Организация)
	|			И (ДанныеДляРасчетаПередНормой.Район = НастройкиГВСЗависимаяУслуга.Район)
	|			И (ДанныеДляРасчетаПередНормой.Услуга = НастройкиГВСЗависимаяУслуга.ЗависитОтУслуги)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиГВС КАК НастройкиГВС
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НастройкиГВС.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НастройкиГВС.Район
	|			И ДанныеДляРасчетаПередНормой.Услуга = НастройкиГВС.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыИсточникаТочекУчета КАК ТемпературыИсточникаТочекУчета
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТемпературыИсточникаТочекУчета.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ТемпературыИсточникаТочекУчета.Район
	|			И ДанныеДляРасчетаПередНормой.Договор = ТемпературыИсточникаТочекУчета.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТемпературыИсточникаТочекУчета.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТемпературыИсточникаТочекУчета.ТочкаУчета
	|;  
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ДанныеДляРасчетабестНачислениеНП.Организация КАК Организация,
	|ДанныеДляРасчетабестНачислениеНП.ПериодНачисления КАК ПериодНачисления,
	|ДанныеДляРасчетабестНачислениеНП.Район КАК Район,
	|ДанныеДляРасчетабестНачислениеНП.Договор КАК Договор,
	|ДанныеДляРасчетабестНачислениеНП.ОбъектРасчета КАК ОбъектРасчета,
	|ДанныеДляРасчетабестНачислениеНП.ТочкаУчета КАК ТочкаУчета,
	|ДанныеДляРасчетабестНачислениеНП.ЗначениеНагрузки КАК ЗначениеНагрузки
	|ПОМЕСТИТЬ ВТ_ПропорциональноНагрузке
	|ИЗ
	|ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчетабестНачислениеНП
	|ГДЕ
	|ДанныеДляРасчетабестНачислениеНП.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПропорциональноНагрузке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПропорциональноНагрузке.Организация КАК Организация,
	|ВТ_ПропорциональноНагрузке.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ПропорциональноНагрузке.Район КАК Район,
	|	ВТ_ПропорциональноНагрузке.Договор КАК Договор,
	|	ВТ_ПропорциональноНагрузке.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ПропорциональноНагрузке.ТочкаУчета КАК ТочкаУчета,
	|	СУММА(ВТ_ПропорциональноНагрузке.ЗначениеНагрузки) КАК ЗначениеНагрузки
	|ПОМЕСТИТЬ ВТ_СуммарнаяНагрузка
	|ИЗ
	|	ВТ_ПропорциональноНагрузке КАК ВТ_ПропорциональноНагрузке
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПропорциональноНагрузке.Организация,
	|	ВТ_ПропорциональноНагрузке.ПериодНачисления,
	|	ВТ_ПропорциональноНагрузке.Район,
	|	ВТ_ПропорциональноНагрузке.Договор,
	|	ВТ_ПропорциональноНагрузке.ОбъектРасчета,
	|	ВТ_ПропорциональноНагрузке.ТочкаУчета
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация КАК Организация,
	|	ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчета.Район КАК Район,
	|	ДанныеДляРасчета.Договор КАК Договор,
	|	ДанныеДляРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчета.МКД КАК МКД,
	|	ДанныеДляРасчета.Услуга КАК Услуга,
	|	ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета КАК УзелУчета,
	|	ДанныеДляРасчета.Шкала КАК Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен КАК ПриборВведен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|			ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК ОбъемУслугиПотребленный,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|			ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) КАК ОбъемУслуги,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КАК СпособНачисления,
	|	ДанныеДляРасчета.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчета.НачПок КАК НачальныеПоказания,
	|	ДанныеДляРасчета.КонПок КАК КонечныеПоказания,
	|	ДанныеДляРасчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления КАК НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	1 КАК ПовыщающийКоэффициент,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПропорциональноНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СуммарнаяНагрузка.ТочкаУчета ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СуммарнаяНагрузка.ЗначениеНагрузки = 0
	|								ТОГДА 0
	|							ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.ЗначениеНагрузки / ВТ_СуммарнаяНагрузка.ЗначениеНагрузки КАК ЧИСЛО(15, 6))
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентПропорциональности,
	|	0 КАК ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП КАК ГБП,
	|	ДанныеДляРасчета.СодержитПотери КАК СодержитПотери,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом КАК УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК КоличествоЧасовШтатнойРаботыПУ,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде КАК бестИспользоватьТемпературныйКоэффициентПоВоде
	|	ПОМЕСТИТЬ ПредварительныйРасчет
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиШкалПриборовУчетаНП.СрезПоследних КАК бестУслугиШкалПриборовУчетаНПСрезПоследних
	|		ПО ДанныеДляРасчета.Организация = бестУслугиШкалПриборовУчетаНПСрезПоследних.Организация
	|			И ДанныеДляРасчета.ТочкаУчета = бестУслугиШкалПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ДанныеДляРасчета.ПриборУчета = бестУслугиШкалПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И ДанныеДляРасчета.Услуга = бестУслугиШкалПриборовУчетаНПСрезПоследних.Услуга
	|			И ДанныеДляРасчета.Шкала = бестУслугиШкалПриборовУчетаНПСрезПоследних.Шкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммарнаяНагрузка КАК ВТ_СуммарнаяНагрузка
	|		ПО ДанныеДляРасчета.Организация = ВТ_СуммарнаяНагрузка.Организация
	|			И ДанныеДляРасчета.ТочкаУчета = ВТ_СуммарнаяНагрузка.ТочкаУчета
	|			И ДанныеДляРасчета.ОбъектРасчета = ВТ_СуммарнаяНагрузка.ОбъектРасчета
	|ГДЕ
	|	ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.ЕстьПоказанияАбонента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху  ТОГДА
	| ВЫБОР КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	| ИНАЧЕ 0
	| КОНЕЦ 
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде 
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху  ТОГДА
	| ВЫБОР КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	| ИНАЧЕ 0
	| КОНЕЦ 
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде 
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.ПовышающийКоэффициент = -1
	|				И НЕ ДанныеДляРасчета.НетВозможностьУстановкиПУ
	|			ТОГДА ДанныеДляРасчета.ПовышающийКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод = 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод / ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ)  * ДанныеДляРасчета.КоличествоЧасовРаботы КАК ЧИСЛО(15, 6))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * ДанныеДляРасчета.КоэффициентСезоности * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод = 0
	|									ТОГДА 0
	|								ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод / ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ)  * ДанныеДляРасчета.КоличествоЧасовРаботы КАК ЧИСЛО(15, 6))
	|							КОНЕЦ
	|					ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * ДанныеДляРасчета.КоэффициентСезоности * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ВЫБОР
	|		КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|			ТОГДА ДанныеДляРасчета.НаличиеПоказанийЗаПредПериод
	|		ИНАЧЕ ДанныеДляРасчета.СреднийОбъем > 0
	|	КОНЕЦ
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|									ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	|								ИНАЧЕ 0
	|							КОНЕЦ
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|									ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	|								ИНАЧЕ 0
	|							КОНЕЦ
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.КоличествоЧасовРаботы
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|ИЗ
	|	ДанныеДляРасчетабестНачислениеНП КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|	И ВЫБОР
	|		КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|			ТОГДА НЕ ДанныеДляРасчета.НаличиеПоказанийЗаПредПериод
	|		ИНАЧЕ ДанныеДляРасчета.СреднийОбъем = 0
	|	КОНЕЦ
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредварительныйРасчет.Организация КАК Организация,
	|	ПредварительныйРасчет.ПериодНачисления КАК ПериодНачисления,
	|	ПредварительныйРасчет.Район КАК Район,
	|	ПредварительныйРасчет.МКД КАК МКД,
	|	ПредварительныйРасчет.Договор КАК Договор,
	|	ПредварительныйРасчет.ОбъектРасчета КАК ОбъектРасчета,
	|	ПредварительныйРасчет.Услуга КАК Услуга,
	|	ПредварительныйРасчет.ТочкаУчета КАК ТочкаУчета,
	|	ПредварительныйРасчет.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ПредварительныйРасчет.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПредварительныйРасчет.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПредварительныйРасчет.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ПредварительныйРасчет.НормаПотребления КАК НормаПотребления,
	|	ПредварительныйРасчет.СпособНачисления КАК СпособНачисления,
	|	ПредварительныйРасчет.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ПредварительныйРасчет.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	ПредварительныйРасчет КАК ПредварительныйРасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.Организация КАК Организация,
	|	Услуги.ПериодНачисления КАК ПериодНачисления,
	|	Услуги.Район КАК Район,
	|	Услуги.МКД КАК МКД,
	|	Услуги.Договор КАК Договор,
	|	Услуги.ОбъектРасчета КАК ОбъектРасчета,
	|	Услуги.Услуга КАК Услуга,
	|	Услуги.ТочкаУчета КАК ТочкаУчета,
	|	Услуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	Услуги.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Услуги.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	Услуги.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	Услуги.НормаПотребления КАК НормаПотребления,
	|	Услуги.СпособНачисления КАК СпособНачисления,
	|	Услуги.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	Услуги.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ ЗависимыеУслуги
	|ИЗ
	|	Услуги КАК Услуги
	|ГДЕ
	|	Услуги.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимыеУслуги.Организация КАК Организация,
	|	ЗависимыеУслуги.ПериодНачисления КАК ПериодНачисления,
	|	ЗависимыеУслуги.Район КАК Район,
	|	ЗависимыеУслуги.МКД КАК МКД,
	|	ЗависимыеУслуги.Договор КАК Договор,
	|	ЗависимыеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	|	ЗависимыеУслуги.Услуга КАК Услуга,
	|	ЗависимыеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ЗависимыеУслуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ЗависимыеУслуги.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ЗависимыеУслуги.СпособНачисления КАК СпособНачисления,
	|	ВЫБОР
	|		КОГДА ЗависимыеУслуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗависимыеУслуги.ЗначениеНормативаЗаДень = 0
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА ЗависимыеУслуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗависимыеУслуги.ГарантированныйОбъем = 0
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА ЗависимыеУслуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗависимыеУслуги.ЗначениеНагрузки = 0
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА ЗависимыеУслуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗависимыеУслуги.НормаПотребления = 0
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|	КОНЕЦ КАК ПриоритетРасчетаЗависимыхУслуг,
	|	Услуги.СпособНачисления КАК СпособНачисленияЗависимойУслуги,
	|	ЛОЖЬ КАК ОбратныйРасчет,
	|	ЗависимыеУслуги.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ ВзимозависимостьУслуг
	|ИЗ
	|	ЗависимыеУслуги КАК ЗависимыеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО (ЗависимыеУслуги.Организация = Услуги.Организация)
	|			И (ЗависимыеУслуги.Район = Услуги.Район)
	|			И (ЗависимыеУслуги.Договор = Услуги.Договор)
	|			И (ЗависимыеУслуги.ОбъектРасчета = Услуги.ОбъектРасчета)
	|			И (ЗависимыеУслуги.ЗависитОтУслуги = Услуги.Услуга)
	|			И (ЗависимыеУслуги.ТочкаУчета = Услуги.ТочкаУчета)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗависимыеУслуги.Организация,
	|	ЗависимыеУслуги.ПериодНачисления,
	|	ЗависимыеУслуги.Район,
	|	ЗависимыеУслуги.МКД,
	|	ЗависимыеУслуги.Договор,
	|	ЗависимыеУслуги.ОбъектРасчета,
	|	ЗависимыеУслуги.ЗависитОтУслуги,
	|	ЗависимыеУслуги.ТочкаУчета,
	|	ЗависимыеУслуги.Услуга,
	|	ЗависимыеУслуги.СпособРасчетаНорматива,
	|	Услуги.СпособНачисления,
	|	ВЫБОР
	|		КОГДА Услуги.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Услуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|					ТОГДА ВЫБОР
	|							КОГДА Услуги.ЗначениеНормативаЗаДень = 0
	|								ТОГДА 2
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОГДА Услуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|					ТОГДА ВЫБОР
	|							КОГДА Услуги.ГарантированныйОбъем = 0
	|								ТОГДА 2
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОГДА Услуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|					ТОГДА ВЫБОР
	|							КОГДА Услуги.ЗначениеНагрузки = 0
	|								ТОГДА 2
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОГДА Услуги.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|					ТОГДА ВЫБОР
	|							КОГДА Услуги.НормаПотребления = 0
	|								ТОГДА 2
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗависимыеУслуги.СпособНачисления,
	|	ИСТИНА,
	|	ЛОЖЬ
	|ИЗ
	|	ЗависимыеУслуги КАК ЗависимыеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО (ЗависимыеУслуги.Организация = Услуги.Организация)
	|			И (ЗависимыеУслуги.Район = Услуги.Район)
	|			И (ЗависимыеУслуги.Договор = Услуги.Договор)
	|			И (ЗависимыеУслуги.ОбъектРасчета = Услуги.ОбъектРасчета)
	|			И (ЗависимыеУслуги.ЗависитОтУслуги = Услуги.Услуга)
	|			И (ЗависимыеУслуги.ТочкаУчета = Услуги.ТочкаУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныйРасчет.Организация КАК Организация,
	|	ПредварительныйРасчет.ПериодНачисления КАК ПериодНачисления,
	|	ПредварительныйРасчет.НачалоПериода КАК НачалоПериода,
	|	ПредварительныйРасчет.КонецПериода КАК КонецПериода,
	|	ПредварительныйРасчет.Район КАК Район,
	|	ПредварительныйРасчет.Договор КАК Договор,
	|	ПредварительныйРасчет.ОбъектРасчета КАК ОбъектРасчета,
	|	ПредварительныйРасчет.МКД КАК МКД,
	|	ПредварительныйРасчет.Услуга КАК Услуга,
	|	ПредварительныйРасчет.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ВзимозависимостьУслуг.СпособНачисленияЗависимойУслуги = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|				ИЛИ ВзимозависимостьУслуг.СпособНачисленияЗависимойУслуги = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)
	|			ТОГДА ПредварительныйРасчет.ЗависитОтУслуги
	|		КОГДА ВзимозависимостьУслуг.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|				ИЛИ ВзимозависимостьУслуг.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВзимозависимостьУслуг.Услуга ЕСТЬ NULL
	|					ТОГДА ВЫБОР
	|							КОГДА ВзимозависимостьУслуг.ПриоритетРасчетаЗависимыхУслуг = 2
	|								ТОГДА ВзимозависимостьУслуг.ЗависитОтУслуги
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|						КОНЕЦ
	|				ИНАЧЕ ПредварительныйРасчет.ЗависитОтУслуги
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ВзимозависимостьУслуг.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ПредварительныйРасчет.ПриборУчета КАК ПриборУчета,
	|	ПредварительныйРасчет.Шкала КАК Шкала,
	|	ПредварительныйРасчет.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредварительныйРасчет.ПриборВведен КАК ПриборВведен,
	|	ПредварительныйРасчет.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ПредварительныйРасчет.ОбъемУслуги КАК ОбъемУслуги,
	|	ПредварительныйРасчет.СпособНачисления КАК СпособНачисления,
	|	ПредварительныйРасчет.ДокументНачисления КАК ДокументНачисления,
	|	ПредварительныйРасчет.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ПредварительныйРасчет.НачальныеПоказания КАК НачальныеПоказания,
	|	ПредварительныйРасчет.КонечныеПоказания КАК КонечныеПоказания,
	|	ПредварительныйРасчет.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ПредварительныйРасчет.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ПредварительныйРасчет.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ПредварительныйРасчет.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ПредварительныйРасчет.НормаПотребления КАК НормаПотребления,
	|	ПредварительныйРасчет.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПредварительныйРасчет.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ПредварительныйРасчет.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ПредварительныйРасчет.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПредварительныйРасчет.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ПредварительныйРасчет.ВидПлощади КАК ВидПлощади,
	|	ПредварительныйРасчет.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ПредварительныйРасчет.ФормулаРасчета КАК ФормулаРасчета,
	|	ПредварительныйРасчет.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ПредварительныйРасчет.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ПредварительныйРасчет.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ПредварительныйРасчет.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ПредварительныйРасчет.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ПредварительныйРасчет.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	ПредварительныйРасчет.КоэффициентПропорциональности КАК КоэффициентПропорциональности,
	|	ЕСТЬNULL(ВзимозависимостьУслуг.ПриоритетРасчетаЗависимыхУслуг, ПредварительныйРасчет.ПриоритетГВС) КАК ПриоритетГВС,
	|	ПредварительныйРасчет.ГБП КАК ГБП,
	|	ПредварительныйРасчет.СодержитПотери КАК СодержитПотери,
	|	ПредварительныйРасчет.УслугаСОбратнымРасчетом КАК УслугаСОбратнымРасчетом,
	|	ПредварительныйРасчет.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ПредварительныйРасчет.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ПредварительныйРасчет.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	ПредварительныйРасчет.ГарантированныйОбъем КАК ГарантированныйОбъем, 
	|	ПредварительныйРасчет.бестИспользоватьТемпературныйКоэффициентПоВоде КАК бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ВзимозависимостьУслуг.ОбратныйРасчет КАК ОбратныйРасчет
	|ИЗ
	|	ПредварительныйРасчет КАК ПредварительныйРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзимозависимостьУслуг КАК ВзимозависимостьУслуг
	|		ПО ПредварительныйРасчет.Организация = ВзимозависимостьУслуг.Организация
	|			И ПредварительныйРасчет.Район = ВзимозависимостьУслуг.Район
	|			И ПредварительныйРасчет.Договор = ВзимозависимостьУслуг.Договор
	|			И ПредварительныйРасчет.ОбъектРасчета = ВзимозависимостьУслуг.ОбъектРасчета
	|			И ПредварительныйРасчет.Услуга = ВзимозависимостьУслуг.Услуга
	|			И ПредварительныйРасчет.ТочкаУчета = ВзимозависимостьУслуг.ТочкаУчета
	|";
	
	Если не ФормируемВременную тогда
		Текст 		= Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	Район,
		|	Договор,
		|	ОбъектРасчета,
		|	СодержитПотери,
		|	РасчетПоФормуле,		
		|	ТочкаУчета,
		|	НачалоПериода,
		|	КонецПериода,
		|	ЗависитОтУслуги
//	    |	ПриоритетГВС
		|	ИТОГИ ПО
		|    Договор,
		|    ДокументНачисления";

	КонецЕсли;
	
	Если не ФормируемВременную тогда
		Текст 		= СтрЗаменить(Текст,"ПОМЕСТИТЬ ДанныеНачисленийТипНачисления","");		
	КонецЕсли; 
	
	Текст = СтрЗаменить(Текст,"ТипНачисления",ИмяДокумента);
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти 

#Область Начислить_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде,ОтборПоДому,Отдельностоящие)
	
	МВТ  = Новый МенеджерВременныхТаблиц;
	ВспомогательныеДанныеНачисленияНП(МВТ,Организация, ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ОтборПоДому,ДнейВПериоде,Отдельностоящие);
	ПолучитьСтабильныеПериодыНП(МВТ,Ложь,Отдельностоящие);
	ПолучитьДанныеДляРасчетаНП(МВТ,ЛОЖЬ,Ложь,"бестНачислениеНП",Отдельностоящие);
	Возврат РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,ЛОЖЬ,Ложь,"бестНачислениеНП",Отдельностоящие);
	
	
КонецФункции

#КонецОбласти


#Область ЗакрытьПериодДляРедактирования_ВспомогательныеФункции

Функция ДокуметЗакрытияПериода(ПериодНачисления,Район)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	НЕ энргЗакрытиеПериода.ПометкаУдаления
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат  Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.энргЗакрытиеПериода.ПустаяСсылка();	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляОтладкиИТестирования

Функция ПрочитатьДанныеВременнойТаблицы(МВТ,ТекстЗапроса) 
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область НачислениеПоДолевымСхемам

Процедура НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, Договор, ТочкаУчета, Услуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке)
	
	ПустаяТочкаУчета 					= Справочники.энргТочкиУчета.ПустаяСсылка();
	ВидНачисления 						= Перечисления.энргВидыНачислений.Начисление;
	
	кРаспределения                      = 0;
	
	Для Каждого СтрокаНачисленийСуб Из ДанныеПоУслуге.ДанныеНачисленийСубабонентов Цикл
		СтрокаНабора  					= НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийСуб);
		СтрокаНабора.ОбъемУслуги 		= -СтрокаНабора.ОбъемУслуги;
		СтрокаНабора.Распределение 		= Истина;
		СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
	КонецЦикла;
		
	ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги + ДанныеПоУслуге.ОбъемСубКРаспределению;
	
	Если ОсталосьРаспределить <= 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Субабоненты 			= ДанныеПоУслуге.Субабоненты;
	Распределили 						= 0;
	
	СубабонентыОстаток = Новый Массив;

	
	Для Сч = 0 По Субабоненты.ВГраница() Цикл
		
		ДанныеСубабонента 					= Субабоненты[Сч];
		
		Если Не ЗначениеЗаполнено(ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ)  Тогда
			
			НачисленияПоУслуге = Новый Соответствие;
			НачисленияПоУслуге.Вставить(Услуга, Новый Структура("ОбъемУслуги, ОбъемУслугиГоловнойТУ", ДанныеСубабонента.ОбъемУслуги, ДанныеПоУслуге.ОбъемУслуги));
			НачисленияПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, НачисленияПоУслуге);
			
			РассчитанныеОбъемыПоУслуге = Новый Соответствие;
			РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ДанныеСубабонента.ОбъемУслуги); 
			РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, РассчитанныеОбъемыПоУслуге);

			Продолжить;
		КонецЕсли;
		
		Если Сч = Субабоненты.ВГраница() Тогда
			ОбъемУслуги 				= ОсталосьРаспределить - Распределили;
		Иначе
			Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение Тогда
				ОбъемУслуги 				= ОсталосьРаспределить * ДанныеСубабонента.КоэффициентДолевогоРаспределения;	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноПлощади Тогда
				ОбъемУслуги 				= ?( ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ЗначениеПлощади / ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ЗначениеНагрузки / ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноДоговорномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ДоговорнойОбъем / ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.ВсегоТочекУчетаСубабонентов = ДанныеПоУслуге.ВсегоПриборовУчетаСубабонентов Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.РасчетИндивидуальногоПотребления Тогда
				
				 Если ДанныеСубабонента.ТочкаУчета = ДанныеСубабонента.ЗависимаяТочкаУчета   Тогда
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределить * ДанныеПоУслуге.ОбъемУслуги / ( ДанныеПоУслуге.ОбъемУслуги + ДанныеПоУслуге.СуммарныйОбъемСубабонентов));	
				Иначе
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги / ( ДанныеПоУслуге.ОбъемУслуги + ДанныеПоУслуге.СуммарныйОбъемСубабонентов));	
				КонецЕсли;
				
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги  Тогда
				
				ОбъемУслугиОсновной 			= НачисленияПоТочке[ДанныеСубабонента.ТочкаУчета][Услуга.ЗависитОтУслуги];
				ОбъемУслуги 				    = ?(ОбъемУслугиОсновной.ОбъемУслугиГоловнойТУ = 0, 0, ОсталосьРаспределить * ОбъемУслугиОсновной.ОбъемУслуги / ОбъемУслугиОсновной.ОбъемУслугиГоловнойТУ);	
				
			КонецЕсли;
			
		КонецЕсли;
		
		РассчитанныеОбъемыПоУслуге = Новый Соответствие;
		РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
		РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, РассчитанныеОбъемыПоУслуге);
		
		Если ЗначениеЗаполнено(ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы) Тогда
			СубабонентыОстаток.Добавить(ДанныеСубабонента);
			
			Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.Остаток Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		НачисленияПоУслуге = Новый Соответствие;
		НачисленияПоУслуге.Вставить(Услуга, Новый Структура("ОбъемУслуги, ОбъемУслугиГоловнойТУ", ОбъемУслуги, ДанныеПоУслуге.ОбъемУслуги));
		
		НачисленияПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, НачисленияПоУслуге);
			
		СтрокаНабора  							= НаборЗаписей.Добавить();
		СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 						= Район;
		СтрокаНабора.Организация				= Организация;
		СтрокаНабора.Договор 					= ДанныеСубабонента.Договор;
		СтрокаНабора.ОбъектРасчета              = ДанныеСубабонента.ОбъектРасчета;
		СтрокаНабора.Услуга						= Услуга;
		СтрокаНабора.ТочкаУчета					= ДанныеСубабонента.ТочкаУчета;
		СтрокаНабора.ВидНачисления 				= ВидНачисления;
		СтрокаНабора.СпособНачисления 			= ДанныеПоУслуге.СпособНачисления;
		СтрокаНабора.ДолевоеРаспределение 		= Истина;
		СтрокаНабора.ПериодРасчета				= ПериодНачисления;
		СтрокаНабора.ПериодНачисления			= ПериодНачисления;
		
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 			= ДанныеСубабонента.ЗначениеПлощади;
		Распределили 							= Распределили + СтрокаНабора.ОбъемУслуги;								
		
	КонецЦикла;	
	
	//распределить остаток
	
	ОсталосьРаспределитьОстаток = ОсталосьРаспределить - Распределили;
	
	РаспределилиОстаток 		= 0;

	Для Сч = 0 По СубабонентыОстаток.ВГраница() Цикл
		
		ДанныеСубабонента 					= СубабонентыОстаток[Сч];
				
		Если Сч = СубабонентыОстаток.ВГраница() Тогда
			ОбъемУслуги 				= ОсталосьРаспределитьОстаток - РаспределилиОстаток;
		Иначе
			Если ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение Тогда
				ОбъемУслуги 				= ОсталосьРаспределить * ДанныеСубабонента.КоэффициентРасчета;	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноПлощади Тогда
				ОбъемУслуги 				= ?( ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ЗначениеПлощади / ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ЗначениеНагрузки / ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноДоговорномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ДоговорнойОбъем / ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.ВсегоТочекУчетаСубабонентов = ДанныеПоУслуге.ВсегоПриборовУчетаСубабонентов Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.РасчетИндивидуальногоПотребления Тогда
				Если ДанныеСубабонента.ТочкаУчета = ДанныеСубабонента.ЗависимаяТочкаУчета   Тогда
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеПоУслуге.ОбъемУслуги / ( ДанныеПоУслуге.ОбъемУслуги + ДанныеПоУслуге.СуммарныйОбъемСубабонентов));	
				Иначе
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ОбъемУслуги / ( ДанныеПоУслуге.ОбъемУслуги + ДанныеПоУслуге.СуммарныйОбъемСубабонентов));	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		РассчитанныеОбъемыПоУслуге = Новый Соответствие;
		РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
		РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, РассчитанныеОбъемыПоУслуге);
		
			
		СтрокаНабора  							= НаборЗаписей.Добавить();
		СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 						= Район;
		СтрокаНабора.Организация				= Организация;
		СтрокаНабора.Договор 					= ДанныеСубабонента.Договор;
		СтрокаНабора.ОбъектРасчета              = ДанныеСубабонента.ОбъектРасчета;
		СтрокаНабора.Услуга						= Услуга;
		СтрокаНабора.ТочкаУчета					= ДанныеСубабонента.ТочкаУчета;
		СтрокаНабора.ВидНачисления 				= ВидНачисления;
		СтрокаНабора.СпособНачисления 			= ДанныеПоУслуге.СпособНачисления;
		СтрокаНабора.ДолевоеРаспределение 		= Истина;
		СтрокаНабора.ПериодРасчета				= ПериодНачисления;
		СтрокаНабора.ПериодНачисления			= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 			= ДанныеСубабонента.ЗначениеПлощади;
		РаспределилиОстаток 					= РаспределилиОстаток + СтрокаНабора.ОбъемУслуги;								
		
	КонецЦикла;	 
	
	
КонецПроцедуры

Функция ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(Договор = Неопределено)
	
	Текст = "ВЫБРАТЬ
	        |	бестОтложенныеДвиженияДокументовНП.Организация КАК Организация,
	        |	бестОтложенныеДвиженияДокументовНП.Район КАК Район,
	        |	бестОтложенныеДвиженияДокументовНП.Договор КАК Договор,
	        |	бестОтложенныеДвиженияДокументовНП.ПериодНачисления КАК ПериодНачисления
	        |ПОМЕСТИТЬ ДокументыДляРаспределения
	        |ИЗ
	        |	РегистрСведений.бестОтложенныеДвиженияДокументовНП КАК бестОтложенныеДвиженияДокументовНП
	        |ГДЕ
	        |	бестОтложенныеДвиженияДокументовНП.Организация = &Организация
	        |	И бестОтложенныеДвиженияДокументовНП.ПериодНачисления = &ПериодНачисления
	        |	И бестОтложенныеДвиженияДокументовНП.Район = &Район
	        |	И бестОтложенныеДвиженияДокументовНП.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам)
	        |	И бестОтложенныеДвиженияДокументовНП.Договор = &Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	        |ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	        |ИЗ
	        |	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	        |			&КонецПериода,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.НежилыеПомещения)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСтабильныеПериодыНП.Организация КАК Организация,
	        |	бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	        |	бестСтабильныеПериодыНП.Район КАК Район,
	        |	бестСтабильныеПериодыНП.МКД КАК МКД,
	        |	бестСтабильныеПериодыНП.Договор КАК Договор,
	        |	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	        |	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестСтабильныеПериодыНП.НомерПозиции КАК НомерПозиции,
	        |	бестСтабильныеПериодыНП.ПериодРегистрации КАК ПериодРегистрации,
	        |	бестСтабильныеПериодыНП.ДатаРегистратора КАК ДатаРегистратора,
	        |	бестСтабильныеПериодыНП.ДокРегистратор КАК ДокРегистратор,
	        |	бестСтабильныеПериодыНП.ДоговорЗаключен КАК ДоговорЗаключен,
	        |	бестСтабильныеПериодыНП.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	        |	бестСтабильныеПериодыНП.УслугаПодключена КАК УслугаПодключена,
	        |	бестСтабильныеПериодыНП.ПриборВведен КАК ПриборВведен,
	        |	бестСтабильныеПериодыНП.ПриборУчета КАК ПриборУчета,
	        |	бестСтабильныеПериодыНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	бестСтабильныеПериодыНП.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	бестСтабильныеПериодыНП.ТарифнаяГруппа КАК ТарифнаяГруппа,
	        |	бестСтабильныеПериодыНП.ДатаПоверки КАК ДатаПоверки,
	        |	бестСтабильныеПериодыНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	бестСтабильныеПериодыНП.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	бестСтабильныеПериодыНП.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	        |	бестСтабильныеПериодыНП.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	        |	бестСтабильныеПериодыНП.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	        |	бестСтабильныеПериодыНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	        |	бестСтабильныеПериодыНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	        |	бестСтабильныеПериодыНП.РасчетПоФормуле КАК РасчетПоФормуле,
	        |	бестСтабильныеПериодыНП.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	        |	бестСтабильныеПериодыНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	бестСтабильныеПериодыНП.КлючНорматива КАК КлючНорматива,
	        |	бестСтабильныеПериодыНП.Поставщик КАК Поставщик,
	        |	бестСтабильныеПериодыНП.Шкала КАК Шкала,
	        |	бестСтабильныеПериодыНП.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	        |	бестСтабильныеПериодыНП.СоставнаяУслуга КАК СоставнаяУслуга,
	        |	бестСтабильныеПериодыНП.ФормулаРасчета КАК ФормулаРасчета,
	        |	бестСтабильныеПериодыНП.ТипСхемыГВС КАК ТипСхемыГВС,
	        |	бестСтабильныеПериодыНП.ВидТепловогоПункта КАК ВидТепловогоПункта,
	        |	бестСтабильныеПериодыНП.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	        |	бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	бестСтабильныеПериодыНП.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	бестСтабильныеПериодыНП.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	бестСтабильныеПериодыНП.СпособРасчетаПриВыходеПУ КАК СпособРасчетаПриВыходеПУ
	        |ПОМЕСТИТЬ СтабПериоды
	        |ИЗ
	        |	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	        |		ПО бестСтабильныеПериодыНП.Организация = ДокументыДляРаспределения.Организация
	        |			И бестСтабильныеПериодыНП.Район = ДокументыДляРаспределения.Район
	        |			И бестСтабильныеПериодыНП.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	        |			И бестСтабильныеПериодыНП.Договор = ДокументыДляРаспределения.Договор
	        |			И (бестСтабильныеПериодыНП.Организация = &Организация)
	        |			И (бестСтабильныеПериодыНП.Район = &Район)
	        |			И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	        |			И (бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме)
	        |			И (бестСтабильныеПериодыНП.Договор = &Договор)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	МИНИМУМ(СтабПериоды.НомерПозиции) КАК НомерПозиции,
	        |	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета
	        |ПОМЕСТИТЬ СтабПериодыМинНомерПозиции
	        |ИЗ
	        |	СтабПериоды КАК СтабПериоды
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	        |		ПО СтабПериоды.Организация = ДокументыДляРаспределения.Организация
	        |			И СтабПериоды.Район = ДокументыДляРаспределения.Район
	        |			И СтабПериоды.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	        |			И СтабПериоды.Договор = ДокументыДляРаспределения.Договор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтабПериоды.Организация,
	        |	СтабПериоды.Район,
	        |	СтабПериоды.Договор,
	        |	СтабПериоды.ОбъектРасчета,
	        |	СтабПериоды.Услуга,
	        |	СтабПериоды.ТочкаУчета,
	        |	СтабПериоды.ЗависимаяТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.МКД КАК МКД,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	СтабПериоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	СтабПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	СтабПериоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	СтабПериоды.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	СтабПериоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	СтабПериоды.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	СтабПериоды.СпособРасчетаПриВыходеПУ КАК СпособРасчетаПриВыходеПУ
	        |ПОМЕСТИТЬ УслугиДолевойТУ
	        |ИЗ
	        |	СтабПериоды КАК СтабПериоды
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериодыМинНомерПозиции КАК СтабПериодыМинНомерПозиции
	        |		ПО СтабПериоды.Организация = СтабПериодыМинНомерПозиции.Организация
	        |			И СтабПериоды.Район = СтабПериодыМинНомерПозиции.Район
	        |			И СтабПериоды.Договор = СтабПериодыМинНомерПозиции.Договор
	        |			И СтабПериоды.ОбъектРасчета = СтабПериодыМинНомерПозиции.ОбъектРасчета
	        |			И СтабПериоды.Услуга = СтабПериодыМинНомерПозиции.Услуга
	        |			И СтабПериоды.ТочкаУчета = СтабПериодыМинНомерПозиции.ТочкаУчета
	        |			И СтабПериоды.НомерПозиции = СтабПериодыМинНомерПозиции.НомерПозиции
	        |			И (СтабПериоды.ТочкаУчета = СтабПериоды.ЗависимаяТочкаУчета)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УслугиДолевойТУ.Организация КАК Организация,
	        |	УслугиДолевойТУ.Район КАК Район,
	        |	УслугиДолевойТУ.Договор КАК Договор,
	        |	УслугиДолевойТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	УслугиДолевойТУ.Услуга КАК Услуга,
	        |	УслугиДолевойТУ.МКД КАК МКД,
	        |	УслугиДолевойТУ.ТочкаУчета КАК ТочкаУчета,
	        |	УслугиДолевойТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	УслугиДолевойТУ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	УслугиДолевойТУ.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	УслугиДолевойТУ.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	УслугиДолевойТУ.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	УслугиДолевойТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	УслугиДолевойТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	УслугиДолевойТУ.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	УслугиДолевойТУ.СпособРасчетаПриВыходеПУ КАК СпособРасчетаПриВыходеПУ,
	        |	ЕСТЬNULL(бестУровниВложенностиРасчетныхСхемСрезПоследних.Уровень, 0) КАК Уровень
	        |ПОМЕСТИТЬ УровеньДолевыхТУ
	        |ИЗ
	        |	УслугиДолевойТУ КАК УслугиДолевойТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУровниВложенностиРасчетныхСхем.СрезПоследних(&КонецПериода, ) КАК бестУровниВложенностиРасчетныхСхемСрезПоследних
	        |		ПО УслугиДолевойТУ.Организация = бестУровниВложенностиРасчетныхСхемСрезПоследних.Организация
	        |			И УслугиДолевойТУ.Район = бестУровниВложенностиРасчетныхСхемСрезПоследних.Район
	        |			И УслугиДолевойТУ.Договор = бестУровниВложенностиРасчетныхСхемСрезПоследних.Договор
	        |			И УслугиДолевойТУ.ОбъектРасчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ОбъектРасчета
	        |			И УслугиДолевойТУ.Услуга = бестУровниВложенностиРасчетныхСхемСрезПоследних.Услуга
	        |			И УслугиДолевойТУ.ТочкаУчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Организация КАК Организация,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Район КАК Район,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Договор КАК Договор,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента КАК УслугаСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределения КАК СпособРаспределения
	        |ПОМЕСТИТЬ ТочкиСубабонентов
	        |ИЗ
	        |	УслугиДолевойТУ КАК СтабПериодыПоМинПозиции
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	        |		ПО СтабПериодыПоМинПозиции.Организация = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Организация
	        |			И СтабПериодыПоМинПозиции.Район = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Район
	        |			И СтабПериодыПоМинПозиции.Договор = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Договор
	        |			И СтабПериодыПоМинПозиции.ОбъектРасчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	        |			И СтабПериодыПоМинПозиции.ТочкаУчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	        |	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	        |	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	        |	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	        |	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	        |	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	        |	ТочкиСубабонентов.Договор КАК ДоговорДолевойТУ,
	        |	ТочкиСубабонентов.ОбъектРасчета КАК ОбъектРасчетаДолевойТУ,
	        |	ТочкиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.Услуга КАК УслугаДолевойТУ,
	        |	ТочкиСубабонентов.СпособРаспределения КАК СпособРаспределения,
	        |	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ ПоследниеНомераСтрок
	        |ИЗ
	        |	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	        |		ПО бестНомераСтрокСтабильногоПериодаНП.Организация = ТочкиСубабонентов.Организация
	        |			И бестНомераСтрокСтабильногоПериодаНП.Район = ТочкиСубабонентов.Район
	        |			И бестНомераСтрокСтабильногоПериодаНП.Договор = ТочкиСубабонентов.ДоговорСубабонента
	        |			И бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |			И бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	        |			И (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	        |			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	        |			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ТочкиСубабонентов.УслугаСубабонента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестНомераСтрокСтабильногоПериодаНП.Организация,
	        |	бестНомераСтрокСтабильногоПериодаНП.Район,
	        |	бестНомераСтрокСтабильногоПериодаНП.Договор,
	        |	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	        |	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	        |	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	        |	ТочкиСубабонентов.Договор,
	        |	ТочкиСубабонентов.ОбъектРасчета,
	        |	ТочкиСубабонентов.ГоловнаяТочкаУчета,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.Услуга,
	        |	ТочкиСубабонентов.СпособРаспределения,
	        |	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	        |	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	        |	бестГарантированныеОбъемыСрезПоследних.Договор КАК Договор,
	        |	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	        |	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги
	        |ПОМЕСТИТЬ ГарантированныеОбъемы
	        |ИЗ
	        |	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	        |			&КонецПериода,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (Договор, ОбъектРасчета) В
	        |					(ВЫБРАТЬ
	        |						ТочкиСубабонентов.ДоговорСубабонента,
	        |						ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |					ИЗ
	        |						ТочкиСубабонентов КАК ТочкиСубабонентов)
	        |				И КОНЕЦПЕРИОДА(Месяц, ДЕНЬ) = КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ)) КАК бестГарантированныеОбъемыСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	бестСтабильныеПериодыНП.Организация КАК Организация,
	        |	бестСтабильныеПериодыНП.Район КАК Район,
	        |	бестСтабильныеПериодыНП.Договор КАК Договор,
	        |	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	        |	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	        |	МАКСИМУМ(бестСтабильныеПериодыНП.КоэффициентРасчета) КАК КоэффициентРасчета,
	        |	ПоследниеНомераСтрок.СпособРаспределения КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	бестСтабильныеПериодыНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеПлощади) КАК ЗначениеПлощади,
	        |	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	        |	ПоследниеНомераСтрок.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрок.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрок.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ВЫБОР
	        |		КОГДА бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	        |			ТОГДА 2
	        |		КОГДА бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК Приоритет,
	        |	МАКСИМУМ(ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0)) КАК ЗначениеНорматива,
	        |	бестСтабильныеПериодыНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	МАКСИМУМ(ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0)) КАК ДоговорнойОбъем,
	        |	СУММА(ВЫБОР
	        |			КОГДА бестСтабильныеПериодыНП.ПриборВведен
	        |				ТОГДА 1
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК КоличествоПриборов,
	        |	бестСтабильныеПериодыНП.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	бестСтабильныеПериодыНП.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	бестСтабильныеПериодыНП.СпособРасчетаПриВыходеПУ КАК СпособРасчетаПриВыходеПУ,
	        |	ПоследниеНомераСтрок.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	ПоследниеНомераСтрок.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ ПараметрыСубабонентов
	        |ИЗ
	        |	ПоследниеНомераСтрок КАК ПоследниеНомераСтрок
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	        |			ПО бестСтабильныеПериодыНП.Организация = ЗначенияТекущихНормПотребления.Организация
	        |				И бестСтабильныеПериодыНП.Район = ЗначенияТекущихНормПотребления.Район
	        |				И бестСтабильныеПериодыНП.Услуга = ЗначенияТекущихНормПотребления.Услуга
	        |				И бестСтабильныеПериодыНП.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	        |			ПО бестСтабильныеПериодыНП.Организация = ГарантированныеОбъемы.Организация
	        |				И бестСтабильныеПериодыНП.Район = ГарантированныеОбъемы.Район
	        |				И бестСтабильныеПериодыНП.Договор = ГарантированныеОбъемы.Договор
	        |				И бестСтабильныеПериодыНП.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	        |				И бестСтабильныеПериодыНП.Услуга = ГарантированныеОбъемы.Услуга
	        |		ПО ПоследниеНомераСтрок.Организация = бестСтабильныеПериодыНП.Организация
	        |			И ПоследниеНомераСтрок.Район = бестСтабильныеПериодыНП.Район
	        |			И ПоследниеНомераСтрок.Договор = бестСтабильныеПериодыНП.Договор
	        |			И ПоследниеНомераСтрок.ОбъектРасчета = бестСтабильныеПериодыНП.ОбъектРасчета
	        |			И ПоследниеНомераСтрок.Услуга = бестСтабильныеПериодыНП.Услуга
	        |			И ПоследниеНомераСтрок.НомерПозиции = бестСтабильныеПериодыНП.НомерПозиции
	        |			И (бестСтабильныеПериодыНП.Организация = &Организация)
	        |			И (бестСтабильныеПериодыНП.Район = &Район)
	        |			И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	        |			И (бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме)
	        |			И (бестСтабильныеПериодыНП.ДоговорЗаключен)
	        |			И (бестСтабильныеПериодыНП.ОбъектРасчетаПодключен)
	        |			И (бестСтабильныеПериодыНП.УслугаПодключена)
	        |			И ПоследниеНомераСтрок.ТочкаУчета = бестСтабильныеПериодыНП.ТочкаУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО ПоследниеНомераСтрок.Услуга = энргВидыУслуг.Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестСтабильныеПериодыНП.Организация,
	        |	бестСтабильныеПериодыНП.Район,
	        |	бестСтабильныеПериодыНП.Договор,
	        |	бестСтабильныеПериодыНП.ОбъектРасчета,
	        |	бестСтабильныеПериодыНП.Услуга,
	        |	бестСтабильныеПериодыНП.ТочкаУчета,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОстаткаДолевыеСхемы,
	        |	бестСтабильныеПериодыНП.ЗависимаяТочкаУчета,
	        |	ПоследниеНомераСтрок.ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрок.ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрок.ГоловнаяТочкаУчета,
	        |	бестСтабильныеПериодыНП.СпособРасчетаНорматива,
	        |	бестСтабильныеПериодыНП.РасчетИндивидуальногоПотребления,
	        |	бестСтабильныеПериодыНП.КоэффициентДолевогоРаспределения,
	        |	бестСтабильныеПериодыНП.СпособРасчетаПриВыходеПУ,
	        |	ПоследниеНомераСтрок.СторнироватьОбъемИндивидуальногоПотребления,
	        |	ВЫБОР
	        |		КОГДА бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	        |			ТОГДА 2
	        |		КОГДА бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	энргВидыУслуг.ЗависитОтУслуги,
	        |	ПоследниеНомераСтрок.УслугаДолевойТУ,
	        |	ПоследниеНомераСтрок.СпособРаспределения
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТочкаОсновнойУслуги.Организация КАК Организация,
	        |	ТочкаОсновнойУслуги.Район КАК Район,
	        |	ТочкаОсновнойУслуги.Договор КАК Договор,
	        |	ТочкаОсновнойУслуги.ОбъектРасчета КАК ОбъектРасчета,
	        |	ТочкаОсновнойУслуги.Услуга КАК Услуга,
	        |	ТочкаОсновнойУслуги.ТочкаУчета КАК ТочкаУчета,
	        |	ТочкаЗависимойУслуги.ЗначениеНагрузки КАК ЗначениеНагрузки
	        |ПОМЕСТИТЬ ЗначениеНагрузкиЗависимойУслуги
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ТочкаОсновнойУслуги
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыСубабонентов КАК ТочкаЗависимойУслуги
	        |		ПО ТочкаОсновнойУслуги.Организация = ТочкаЗависимойУслуги.Организация
	        |			И ТочкаОсновнойУслуги.Район = ТочкаЗависимойУслуги.Район
	        |			И ТочкаОсновнойУслуги.Договор = ТочкаЗависимойУслуги.Договор
	        |			И ТочкаОсновнойУслуги.ОбъектРасчета = ТочкаЗависимойУслуги.ОбъектРасчета
	        |			И ТочкаОсновнойУслуги.ТочкаУчета = ТочкаЗависимойУслуги.ТочкаУчета
	        |			И ТочкаОсновнойУслуги.Услуга = ТочкаЗависимойУслуги.ЗависитОтУслуги
	        |ГДЕ
	        |	ТочкаОсновнойУслуги.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке)
	        |	И ТочкаОсновнойУслуги.ЗначениеНагрузки = 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПараметрыСубабонентов.Договор КАК Договор,
	        |	ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПараметрыСубабонентов.Услуга КАК Услуга,
	        |	ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ПараметрыСубабонентов.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	ГарантированныеОбъемы.ОбъемУслуги КАК ДоговорнойОбъем
	        |ПОМЕСТИТЬ ЗначенияПараметровОсновныхТочек
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	        |		ПО ПараметрыСубабонентов.Договор = ГарантированныеОбъемы.Договор
	        |			И ПараметрыСубабонентов.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	        |			И ПараметрыСубабонентов.Услуга = ГарантированныеОбъемы.Услуга
	        |ГДЕ
	        |	ПараметрыСубабонентов.Услуга.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНПОбороты.Район КАК Район,
	        |	бестОбъемНачисленийНПОбороты.Договор КАК Договор,
	        |	бестОбъемНачисленийНПОбороты.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНПОбороты.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНПОбороты.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНПОбороты.СпособНачисления КАК СпособНачисления,
	        |	бестОбъемНачисленийНПОбороты.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийНПОбороты.Шкала КАК Шкала,
	        |	бестОбъемНачисленийНПОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот
	        |ПОМЕСТИТЬ ОбъемыДолевойТУДляРаспределения
	        |ИЗ
	        |	УровеньДолевыхТУ КАК УровеньДолевыхТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	        |				&НачалоПериода,
	        |				&КонецПериода,
	        |				,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И ПериодНачисления = &ПериодНачисления
	        |					И НЕ Распределение
	        |					И НЕ ДолевоеРаспределение) КАК бестОбъемНачисленийНПОбороты
	        |		ПО УровеньДолевыхТУ.Организация = бестОбъемНачисленийНПОбороты.Организация
	        |			И УровеньДолевыхТУ.Район = бестОбъемНачисленийНПОбороты.Район
	        |			И УровеньДолевыхТУ.Договор = бестОбъемНачисленийНПОбороты.Договор
	        |			И УровеньДолевыхТУ.ОбъектРасчета = бестОбъемНачисленийНПОбороты.ОбъектРасчета
	        |			И УровеньДолевыхТУ.Услуга = бестОбъемНачисленийНПОбороты.Услуга
	        |			И УровеньДолевыхТУ.ТочкаУчета = бестОбъемНачисленийНПОбороты.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНПОбороты.Организация КАК Организация,
	        |	бестОбъемНачисленийНПОбороты.Район КАК Район,
	        |	бестОбъемНачисленийНПОбороты.Договор КАК Договор,
	        |	бестОбъемНачисленийНПОбороты.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНПОбороты.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНПОбороты.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНПОбороты.ВидНачисления КАК ВидНачисления,
	        |	бестОбъемНачисленийНПОбороты.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	        |	ПараметрыСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПараметрыСубабонентов.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ
	        |ПОМЕСТИТЬ ОбъемНачисленийСубабонентов
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	        |				&НачалоПериода,
	        |				&КонецПериода,
	        |				,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И (Договор, ОбъектРасчета, ТочкаУчета) В
	        |						(ВЫБРАТЬ
	        |							ТочкиСубабонентов.ДоговорСубабонента,
	        |							ТочкиСубабонентов.ОбъектРасчетаСубабонента,
	        |							ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |						ИЗ
	        |							ТочкиСубабонентов КАК ТочкиСубабонентов)
	        |					И НЕ Распределение
	        |					И НЕ ДолевоеРаспределение) КАК бестОбъемНачисленийНПОбороты
	        |		ПО ПараметрыСубабонентов.Организация = бестОбъемНачисленийНПОбороты.Организация
	        |			И ПараметрыСубабонентов.Район = бестОбъемНачисленийНПОбороты.Район
	        |			И ПараметрыСубабонентов.Договор = бестОбъемНачисленийНПОбороты.Договор
	        |			И ПараметрыСубабонентов.ОбъектРасчета = бестОбъемНачисленийНПОбороты.ОбъектРасчета
	        |			И ПараметрыСубабонентов.Услуга = бестОбъемНачисленийНПОбороты.Услуга
	        |			И ПараметрыСубабонентов.ТочкаУчета = бестОбъемНачисленийНПОбороты.ТочкаУчета
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА ПараметрыСубабонентов.РасчетИндивидуальногоПотребления
	        |				ТОГДА ПараметрыСубабонентов.ТочкаУчета <> ПараметрыСубабонентов.ГоловнаяТочкаУчета
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемНачисленийСубабонентов.Организация КАК Организация,
	        |	ОбъемНачисленийСубабонентов.Район КАК Район,
	        |	ОбъемНачисленийСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СУММА(ОбъемНачисленийСубабонентов.ОбъемУслугиОборот) КАК ОбъемУслугиОборот,
	        |	ОбъемНачисленийСубабонентов.Услуга КАК Услуга
	        |ПОМЕСТИТЬ СуммарныйОбъемСубабонентов
	        |ИЗ
	        |	ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |ГДЕ
	        |	ОбъемНачисленийСубабонентов.СпособРаспределенияОбъемаДолевойТУ <> ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПустаяСсылка)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОбъемНачисленийСубабонентов.Организация,
	        |	ОбъемНачисленийСубабонентов.Район,
	        |	ОбъемНачисленийСубабонентов.ДоговорДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета,
	        |	ОбъемНачисленийСубабонентов.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемНачисленийСубабонентов.Организация КАК Организация,
	        |	ОбъемНачисленийСубабонентов.Район КАК Район,
	        |	ОбъемНачисленийСубабонентов.ОбъемУслугиОборот * ОбъемНачисленийСубабонентов.КоэффициентРасчета КАК ОбъемСуб,
	        |	ОбъемНачисленийСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ОбъемНачисленийСубабонентов.Договор КАК Договор,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ОбъемНачисленийСубабонентов.Услуга КАК Услуга,
	        |	ОбъемНачисленийСубабонентов.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ СубабонентыКРаспределению
	        |ИЗ
	        |	ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |ГДЕ
	        |	ОбъемНачисленийСубабонентов.КоэффициентРасчета <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СубабонентыКРаспределению.Организация КАК Организация,
	        |	СубабонентыКРаспределению.Район КАК Район,
	        |	СубабонентыКРаспределению.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	СубабонентыКРаспределению.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	СубабонентыКРаспределению.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СУММА(СубабонентыКРаспределению.ОбъемСуб) КАК ОбъемСуб,
	        |	СубабонентыКРаспределению.Услуга КАК Услуга
	        |ПОМЕСТИТЬ ОбъемСубКРаспределению
	        |ИЗ
	        |	СубабонентыКРаспределению КАК СубабонентыКРаспределению
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СубабонентыКРаспределению.Организация,
	        |	СубабонентыКРаспределению.Район,
	        |	СубабонентыКРаспределению.ДоговорДолевойТУ,
	        |	СубабонентыКРаспределению.ОбъектРасчетаДолевойТУ,
	        |	СубабонентыКРаспределению.ГоловнаяТочкаУчета,
	        |	СубабонентыКРаспределению.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПараметрыСубабонентов.Организация КАК Организация,
	        |	ПараметрыСубабонентов.Район КАК Район,
	        |	ПараметрыСубабонентов.Договор КАК Договор,
	        |	ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПараметрыСубабонентов.Услуга КАК Услуга,
	        |	ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ПараметрыСубабонентов.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	ПараметрыСубабонентов.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	ПараметрыСубабонентов.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	ПараметрыСубабонентов.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	ВЫБОР
	        |		КОГДА ЗначенияПараметровОсновныхТочек.ТочкаУчета ЕСТЬ NULL
	        |			ТОГДА ВЫБОР
	        |					КОГДА ПараметрыСубабонентов.ЗначениеНагрузки = 0
	        |						ТОГДА ЗначениеНагрузкиЗависимойУслуги.ЗначениеНагрузки
	        |					ИНАЧЕ ПараметрыСубабонентов.ЗначениеНагрузки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ПараметрыСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	        |					ТОГДА ЗначенияПараметровОсновныхТочек.ЗначениеНагрузки * ПараметрыСубабонентов.ЗначениеНорматива
	        |				ИНАЧЕ ПараметрыСубабонентов.ЗначениеНагрузки
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ЗначениеНагрузки,
	        |	ВЫБОР
	        |		КОГДА ЗначенияПараметровОсновныхТочек.ТочкаУчета ЕСТЬ NULL
	        |			ТОГДА ПараметрыСубабонентов.ДоговорнойОбъем
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ПараметрыСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	        |					ТОГДА ЗначенияПараметровОсновныхТочек.ДоговорнойОбъем * ПараметрыСубабонентов.ЗначениеНорматива
	        |				ИНАЧЕ ПараметрыСубабонентов.ДоговорнойОбъем
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ДоговорнойОбъем,
	        |	ПараметрыСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПараметрыСубабонентов.Приоритет КАК Приоритет,
	        |	ОбъемНачисленийСубабонентов.ПриборУчета КАК ПриборУчета,
	        |	ЕСТЬNULL(ОбъемНачисленийСубабонентов.ОбъемУслугиОборот, 0) КАК ОбъемУслугиОборот,
	        |	ВЫБОР
	        |		КОГДА ОбъемНачисленийСубабонентов.ОбъектРасчета ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ЕстьИндивидуальныеНачисления,
	        |	ПараметрыСубабонентов.КоличествоПриборов КАК КоличествоПриборов,
	        |	ПараметрыСубабонентов.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	ПараметрыСубабонентов.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	ПараметрыСубабонентов.СпособРасчетаПриВыходеПУ КАК СпособРасчетаПриВыходеПУ,
	        |	ПараметрыСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	ЕСТЬNULL(бестУровниВложенностиРасчетныхСхемСрезПоследних.Уровень, 0) КАК Уровень
	        |ПОМЕСТИТЬ ДанныеПоСубабонентам
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |		ПО ПараметрыСубабонентов.Организация = ОбъемНачисленийСубабонентов.Организация
	        |			И ПараметрыСубабонентов.Район = ОбъемНачисленийСубабонентов.Район
	        |			И ПараметрыСубабонентов.Договор = ОбъемНачисленийСубабонентов.Договор
	        |			И ПараметрыСубабонентов.ОбъектРасчета = ОбъемНачисленийСубабонентов.ОбъектРасчета
	        |			И ПараметрыСубабонентов.Услуга = ОбъемНачисленийСубабонентов.Услуга
	        |			И ПараметрыСубабонентов.ТочкаУчета = ОбъемНачисленийСубабонентов.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметровОсновныхТочек КАК ЗначенияПараметровОсновныхТочек
	        |		ПО ПараметрыСубабонентов.Договор = ЗначенияПараметровОсновныхТочек.Договор
	        |			И ПараметрыСубабонентов.ОбъектРасчета = ЗначенияПараметровОсновныхТочек.ОбъектРасчета
	        |			И ПараметрыСубабонентов.ТочкаУчета = ЗначенияПараметровОсновныхТочек.ТочкаУчета
	        |			И ПараметрыСубабонентов.Услуга.ЗависитОтУслуги = ЗначенияПараметровОсновныхТочек.Услуга
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначениеНагрузкиЗависимойУслуги КАК ЗначениеНагрузкиЗависимойУслуги
	        |		ПО ПараметрыСубабонентов.Договор = ЗначениеНагрузкиЗависимойУслуги.Договор
	        |			И ПараметрыСубабонентов.ОбъектРасчета = ЗначениеНагрузкиЗависимойУслуги.ОбъектРасчета
	        |			И ПараметрыСубабонентов.Услуга = ЗначениеНагрузкиЗависимойУслуги.Услуга
	        |			И ПараметрыСубабонентов.ТочкаУчета = ЗначениеНагрузкиЗависимойУслуги.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО ПараметрыСубабонентов.Услуга = энргВидыУслуг.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУровниВложенностиРасчетныхСхем.СрезПоследних(&КонецПериода, ) КАК бестУровниВложенностиРасчетныхСхемСрезПоследних
	        |		ПО ПараметрыСубабонентов.Организация = бестУровниВложенностиРасчетныхСхемСрезПоследних.Организация
	        |			И ПараметрыСубабонентов.Район = бестУровниВложенностиРасчетныхСхемСрезПоследних.Район
	        |			И ПараметрыСубабонентов.ДоговорДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.Договор
	        |			И ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.ОбъектРасчета
	        |			И ПараметрыСубабонентов.ГоловнаяТочкаУчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ТочкаУчета
	        |			И ПараметрыСубабонентов.УслугаДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УровеньДолевыхТУ.Организация КАК Организация,
	        |	УровеньДолевыхТУ.Район КАК Район,
	        |	УровеньДолевыхТУ.Договор КАК Договор,
	        |	УровеньДолевыхТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	УровеньДолевыхТУ.Услуга КАК Услуга,
	        |	УровеньДолевыхТУ.МКД КАК МКД,
	        |	УровеньДолевыхТУ.ТочкаУчета КАК ТочкаУчета,
	        |	УровеньДолевыхТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	УровеньДолевыхТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	ЕСТЬNULL(ПлощадьСубабонентов.ЗначениеПлощади, 0) КАК СуммарноеЗначениеПлощадиСубабонентов,
	        |	ЕСТЬNULL(ДоговорныеОбъемыНагрузка.ЗначениеНагрузки, 0) КАК СуммарноеЗначениеНагрузкиСубабонентов,
	        |	ЕСТЬNULL(ДоговорныеОбъемыНагрузка.ДоговорнойОбъем, 0) КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	        |	КоличествоПриборов.КоличествоТУ КАК ВсегоТочекУчетаСубабонентов,
	        |	КоличествоПриборов.КоличествоПУ КАК ВсегоПриборовУчетаСубабонентов,
	        |	УровеньДолевыхТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	ОбъемСубКРаспределению.ОбъемСуб КАК ОбъемСубКРАспределению,
	        |	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	УровеньДолевыхТУ.Уровень КАК Уровень
	        |ПОМЕСТИТЬ ДанныеПоДолевымТУ
	        |ИЗ
	        |	УровеньДолевыхТУ КАК УровеньДолевыхТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |			СУММА(ВложенныйЗапрос.ЗначениеПлощади) КАК ЗначениеПлощади
	        |		ИЗ
	        |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |				ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |				ПараметрыСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |				ПараметрыСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |				ПараметрыСубабонентов.ЗначениеПлощади КАК ЗначениеПлощади,
	        |				ПараметрыСубабонентов.Договор КАК Договор,
	        |				ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |				ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета
	        |			ИЗ
	        |				ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |			ГДЕ
	        |				ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ <> ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПустаяСсылка)) КАК ВложенныйЗапрос
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ,
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ) КАК ПлощадьСубабонентов
	        |		ПО УровеньДолевыхТУ.Договор = ПлощадьСубабонентов.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = ПлощадьСубабонентов.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = ПлощадьСубабонентов.ГоловнаяТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |			ДанныеПоСубабонентам.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |			ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |			СУММА(ДанныеПоСубабонентам.ДоговорнойОбъем) КАК ДоговорнойОбъем,
	        |			ДанныеПоСубабонентам.Услуга КАК Услуга,
	        |			СУММА(ДанныеПоСубабонентам.ЗначениеНагрузки) КАК ЗначениеНагрузки
	        |		ИЗ
	        |			ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ,
	        |			ДанныеПоСубабонентам.ГоловнаяТочкаУчета,
	        |			ДанныеПоСубабонентам.ДоговорДолевойТУ,
	        |			ДанныеПоСубабонентам.Услуга) КАК ДоговорныеОбъемыНагрузка
	        |		ПО УровеньДолевыхТУ.Договор = ДоговорныеОбъемыНагрузка.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = ДоговорныеОбъемыНагрузка.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = ДоговорныеОбъемыНагрузка.ГоловнаяТочкаУчета
	        |			И УровеньДолевыхТУ.Услуга = ДоговорныеОбъемыНагрузка.Услуга
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВложенныйЗапрос.Организация КАК Организация,
	        |			ВложенныйЗапрос.Район КАК Район,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |			СУММА(ВложенныйЗапрос.КоличествоТУ) КАК КоличествоТУ,
	        |			СУММА(ВложенныйЗапрос.КоличествоПУ) КАК КоличествоПУ
	        |		ИЗ
	        |			(ВЫБРАТЬ
	        |				ДанныеПоСубабонентам.Организация КАК Организация,
	        |				ДанныеПоСубабонентам.Район КАК Район,
	        |				ДанныеПоСубабонентам.Договор КАК Договор,
	        |				ДанныеПоСубабонентам.Услуга КАК Услуга,
	        |				ДанныеПоСубабонентам.ОбъектРасчета КАК ОбъектРасчета,
	        |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПоСубабонентам.ТочкаУчета) КАК КоличествоТУ,
	        |				ДанныеПоСубабонентам.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |				ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |				ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |				СУММА(ДанныеПоСубабонентам.КоличествоПриборов) КАК КоличествоПУ
	        |			ИЗ
	        |				ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	        |			
	        |			СГРУППИРОВАТЬ ПО
	        |				ДанныеПоСубабонентам.Организация,
	        |				ДанныеПоСубабонентам.Район,
	        |				ДанныеПоСубабонентам.Договор,
	        |				ДанныеПоСубабонентам.Услуга,
	        |				ДанныеПоСубабонентам.ОбъектРасчета,
	        |				ДанныеПоСубабонентам.ДоговорДолевойТУ,
	        |				ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ,
	        |				ДанныеПоСубабонентам.ГоловнаяТочкаУчета) КАК ВложенныйЗапрос
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ВложенныйЗапрос.Организация,
	        |			ВложенныйЗапрос.Район,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ,
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ,
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета) КАК КоличествоПриборов
	        |		ПО УровеньДолевыхТУ.Организация = КоличествоПриборов.Организация
	        |			И УровеньДолевыхТУ.Район = КоличествоПриборов.Район
	        |			И УровеньДолевыхТУ.Договор = КоличествоПриборов.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = КоличествоПриборов.ОбъектРасчетаДолевойТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемСубКРаспределению КАК ОбъемСубКРаспределению
	        |		ПО УровеньДолевыхТУ.Организация = ОбъемСубКРаспределению.Организация
	        |			И УровеньДолевыхТУ.Район = ОбъемСубКРаспределению.Район
	        |			И УровеньДолевыхТУ.Договор = ОбъемСубКРаспределению.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = ОбъемСубКРаспределению.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = ОбъемСубКРаспределению.ГоловнаяТочкаУчета
	        |			И УровеньДолевыхТУ.Услуга = ОбъемСубКРаспределению.Услуга
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО УровеньДолевыхТУ.Услуга = энргВидыУслуг.Ссылка";
	       	
	
	Если Договор = Неопределено Тогда		
		Текст 						= СтрЗаменить(Текст,"И бестОтложенныеДвиженияДокументовНП.Договор = &Договор","");
		Текст 						= СтрЗаменить(Текст,"И (бестСтабильныеПериодыНП.Договор = &Договор)","");
		Текст 						= СтрЗаменить(Текст,"И Договор = &Договор","");
	
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам()
	Текст 							= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.ОбъемУслугиОборот КАК ОбъемУслуги,
	|	ВложенныйЗапрос.ДокументНачисленияПоДолевымСхемам КАК ДокументНачисленияПоДолевымСхемам,
	|	ВложенныйЗапрос.ОбъемПотребленияСубабонентов КАК ОбъемПотребленияСубабонентов,
	|	ВложенныйЗапрос.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ВложенныйЗапрос.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВложенныйЗапрос.СуммарноеЗначениеПлощадиСубабонентов КАК СуммарноеЗначениеПлощадиСубабонентов,
	|	ВложенныйЗапрос.СуммарноеЗначениеНагрузкиСубабонентов КАК СуммарноеЗначениеНагрузкиСубабонентов,
	|	ВложенныйЗапрос.СуммарноеЗначениеДоговорногоОбъемаСуб КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	|	ВложенныйЗапрос.ВсегоТочекУчетаСубабонентов КАК ВсегоТочекУчетаСубабонентов,
	|	ВложенныйЗапрос.ВсегоПриборовУчетаСубабонентов КАК ВсегоПриборовУчетаСубабонентов,
	|	ВложенныйЗапрос.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ВложенныйЗапрос.ОбъемСубКРАспределению КАК ОбъемСубКРаспределению,
	|	ВложенныйЗапрос.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ВложенныйЗапрос.Уровень КАК Уровень
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоДолевымТУ.Организация КАК Организация,
	|		ДанныеПоДолевымТУ.Район КАК Район,
	|		ДанныеПоДолевымТУ.Договор КАК Договор,
	|		ДанныеПоДолевымТУ.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеПоДолевымТУ.Услуга КАК Услуга,
	|		ДанныеПоДолевымТУ.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоДолевымТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|		ДанныеПоДолевымТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	|		ОбъемыДолевойТУДляРаспределения.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|		ОбъемыДолевойТУДляРаспределения.ПриборУчета КАК ПриборУчета,
	|		ОбъемыДолевойТУДляРаспределения.СпособНачисления КАК СпособНачисления,
	|		ЕСТЬNULL(ДокументНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеПоДолевымСхемам.ПустаяСсылка)) КАК ДокументНачисленияПоДолевымСхемам,
	|		СуммарныйОбъемСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	|		СуммарныйОбъемСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|		СуммарныйОбъемСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|		СуммарныйОбъемСубабонентов.ОбъемУслугиОборот КАК ОбъемПотребленияСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеПлощадиСубабонентов КАК СуммарноеЗначениеПлощадиСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеНагрузкиСубабонентов КАК СуммарноеЗначениеНагрузкиСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеДоговорногоОбъемаСуб КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	|		ДанныеПоДолевымТУ.ВсегоТочекУчетаСубабонентов КАК ВсегоТочекУчетаСубабонентов,
	|		ДанныеПоДолевымТУ.ВсегоПриборовУчетаСубабонентов КАК ВсегоПриборовУчетаСубабонентов,
	|		ДанныеПоДолевымТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|		ЕСТЬNULL(ДанныеПоДолевымТУ.ОбъемСубКРАспределению, 0) КАК ОбъемСубКРАспределению,
	|		ДанныеПоДолевымТУ.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|		ЕСТЬNULL(ДанныеПоДолевымТУ.Уровень, 0) КАК Уровень
	|	ИЗ
	|		ДанныеПоДолевымТУ КАК ДанныеПоДолевымТУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыДолевойТУДляРаспределения КАК ОбъемыДолевойТУДляРаспределения
	|			ПО ДанныеПоДолевымТУ.Район = ОбъемыДолевойТУДляРаспределения.Район
	|				И ДанныеПоДолевымТУ.Договор = ОбъемыДолевойТУДляРаспределения.Договор
	|				И ДанныеПоДолевымТУ.ОбъектРасчета = ОбъемыДолевойТУДляРаспределения.ОбъектРасчета
	|				И ДанныеПоДолевымТУ.Услуга = ОбъемыДолевойТУДляРаспределения.Услуга
	|				И ДанныеПоДолевымТУ.ТочкаУчета = ОбъемыДолевойТУДляРаспределения.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеПоДолевымСхемам КАК ДокументНачисления
	|			ПО (ДокументНачисления.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И ДанныеПоДолевымТУ.Организация = ДокументНачисления.Организация
	|				И ДанныеПоДолевымТУ.Район = ДокументНачисления.Район
	|				И ДанныеПоДолевымТУ.Договор = ДокументНачисления.Договор
	|			ЛЕВОЕ СОЕДИНЕНИЕ СуммарныйОбъемСубабонентов КАК СуммарныйОбъемСубабонентов
	|			ПО ДанныеПоДолевымТУ.Договор = СуммарныйОбъемСубабонентов.ДоговорДолевойТУ
	|				И ДанныеПоДолевымТУ.ОбъектРасчета = СуммарныйОбъемСубабонентов.ОбъектРасчетаДолевойТУ
	|				И ДанныеПоДолевымТУ.ТочкаУчета = СуммарныйОбъемСубабонентов.ГоловнаяТочкаУчета
	|				И ДанныеПоДолевымТУ.Услуга = СуммарныйОбъемСубабонентов.Услуга) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень,
	|	Договор,
	|	ОбъектРасчета,
	|	ЗависитОтУслуги,
	|	Услуга
	|ИТОГИ
	|	МАКСИМУМ(ДокументНачисленияПоДолевымСхемам)
	|ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоСубабонентам.Организация КАК Организация,
	|	ДанныеПоСубабонентам.Район КАК Район,
	|	ДанныеПоСубабонентам.Договор КАК Договор,
	|	ДанныеПоСубабонентам.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеПоСубабонентам.Услуга КАК Услуга,
	|	ДанныеПоСубабонентам.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПоСубабонентам.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеПоСубабонентам.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ДанныеПоСубабонентам.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ДанныеПоСубабонентам.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеПоСубабонентам.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеПоСубабонентам.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДанныеПоСубабонентам.ДоговорнойОбъем КАК ДоговорнойОбъем,
	|	ДанныеПоСубабонентам.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	|	ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДанныеПоСубабонентам.Приоритет КАК Приоритет,
	|	ДанныеПоСубабонентам.ПриборУчета КАК ПриборУчета,
	|	ДанныеПоСубабонентам.ОбъемУслугиОборот КАК ОбъемУслуги,
	|	ДанныеПоСубабонентам.ЕстьИндивидуальныеНачисления КАК ЕстьИндивидуальныеНачисления,
	|	ДанныеПоСубабонентам.КоличествоПриборов КАК КоличествоПриборов,
	|	ДанныеПоСубабонентам.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ДанныеПоСубабонентам.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ДанныеПоСубабонентам.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	ДанныеПоСубабонентам.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеПоСубабонентам.Уровень КАК Уровень
	|ИЗ
	|	ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорДолевойТУ,
	|	ОбъектРасчетаДолевойТУ,
	|	ЗависитОтУслуги,
	|	Услуга,
	|	Приоритет";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область НачислениеПоДолевымСхемам_ВспомогательныеПроцедуры

Процедура ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ, Организация,ПериодНачисления,Район,Договор, ГраницыПериода)	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Договор",			Договор);
	Запрос.УстановитьПараметр("НачалоПериода",		ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",		ГраницыПериода.ЗавершениеОП);
	Запрос.Текст 					= ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(Договор);
	Запрос.Выполнить();
КонецПроцедуры


#КонецОбласти











