#Область СлужебныйИнтерфейс

// Процедура - Начислить
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура Начислить(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие, Договор,Документ) Экспорт
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	СпособНачисленияПоПриборам						= Перечисления.энргСпособНачислений.ПоПриборам;
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	ПериодНовогоТарифа 								= Константы.энргДеньНачалаПримененияНовогоТарифа.Получить();
	результатЗапроса 								= РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,ИсключаяОтдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде); 	
	Сч 												= 0;
	ТекМКД  										= Неопределено;
	ТекОбъектРасчета 								= Неопределено;
	ТекТочкаУчета									= Неопределено;
	ТекНачалоПериода								= Неопределено;
	ТекУслуга 										= Неопределено;
	ТекШкала 										= Неопределено;
	ДокументОбъект									= Неопределено;
	Набор 											= Неопределено;
	ВидНачисления 									= Перечисления.энргВидыНачислений.Начисление;
	ПараметрыФормулы 								= Неопределено;
	//НормативыПоУслугам 								= Неопределено;
	НормативыНаПодогрев 							= Неопределено;
	НаборРасчетСреднегоОбъемаНП						= Неопределено;	
	ТекДокумент 									= Неопределено;
	
	НачисленияПоУслугам 							= Новый Соответствие;
	НачисленияПоУслугамОбъекта						= Новый Соответствие;
	УдалитьСтрокиПоРегистрацииОбъема				= Новый Соответствие;
	УдалитьСтрокиПоСреднемуПоНормативу				= Новый Соответствие;
	ПараметрыРасчета 								= бестНачисленияНП.ТипыКоэффициентовВФормулахРасчета();
	КлючСтруктурыПараметрыРасчетаФормулы 			= "";
	Для каждого КлючЗначение из ПараметрыРасчета Цикл
		КлючСтруктурыПараметрыРасчетаФормулы  = КлючСтруктурыПараметрыРасчетаФормулы + КлючЗначение.Ключ + ",";
	КонецЦикла;
	КлючСтруктурыПараметрыРасчетаФормулы = Сред(КлючСтруктурыПараметрыРасчетаФормулы,0,СтрДлина(КлючСтруктурыПараметрыРасчетаФормулы) - 1);
	
	ПараметрыРасчетаФормулы							= Новый Структура(КлючСтруктурыПараметрыРасчетаФормулы);
	
	ИсклНачисленияНорматива 						= Новый Массив();
	//ИсклНачисленияНорматива.Добавить(Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина);
	ИсклНачисленияНорматива.Добавить(Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке);
	
	ТЗДанныеСуточнойВедомости = РегистрыСведений.бестИтоговыеЗначенияПараметровСуточнойВедомости.ПолучитьДанныеВедомости(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие,КонецПериодаРасчета);
	
	СтрокаОписанияФормулы 											= Неопределено;
	МассивФормулРасчета												= Неопределено;	
	КлючСтруктурыФормулы 											= "
	|Организация, ПериодНачисления, Район, МКД, Услуга, ОбъектРасчета, 
	|ТочкаУчета, Договор, ДокументСсылка,ФормулаРасчета, Поставщик,
	|СпособНачисления, УзелПриборУчета, НеПрименятьСезонность,
	|НачалоПериода, КонецПериода, ОбъемЗаПрошлыйГод";
		
	
	ВыборкаМКД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМКД.Следующий() Цикл 		
		
		ВыборкаДок = ВыборкаМКД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ДокументСсылка 									= Неопределено;
		
		Пока ВыборкаДок.Следующий() Цикл
			
			Если Документ = Неопределено и ДокументСсылка = Неопределено Тогда					
				ДокументСсылка											= ВыборкаДок.ДокументНачисления;
				ДокументОбъект 											= Неопределено;
				ПометкаУдаления 										= ВыборкаДок.ДокументНачисления.ПометкаУдаления;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
					
					ДокументСсылка 										= Документы.бестНачислениеНП.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  									= Документы.бестНачислениеНП.СоздатьДокумент();
					ДокументОбъект.ТипНачисления  						= Перечисления.бестТипыНачисления.Начисление;
					ДокументОбъект.район  								= Район;
					ДокументОбъект.Дата									= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 							= Организация;
					ДокументОбъект.МКД	 								= ВыборкаДок.МКД;
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект										= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 						= Ложь;
				КонецЕсли;
				
				Набор 													= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				
				НаборРасчетСреднегоОбъемаНП = РегистрыСведений.бестРасчетСреднегоОбъемаНП.СоздатьНаборЗаписей();
				НаборРасчетСреднегоОбъемаНП.Отбор.ДокРегистратор.установить(ДокументСсылка);	
				
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
					НаборРасчетСреднегоОбъемаНП.Записать();
				КонецЕсли;		
			ИначеЕсли Не Документ = Неопределено Тогда
				Набор 													= Документ.Движения.бестОбъемНачисленийНП;
				Если ЗначениеЗаполнено(ДокументСсылка) Тогда
					ДокОбъект = ДокументСсылка.ПолучитьОбъект();
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецЕсли;
			
			Выборка  										= ВыборкаДок.выбрать();
			
			Пока Выборка.следующий() цикл 
				
				
				Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ Не ТекНачалоПериода = Выборка.НачалоПериода Тогда
					
					Если ТекОбъектРасчета <> Выборка.ОбъектРасчета Тогда
						НачисленияПоУслугамОбъекта = Новый Соответствие;	
					КонецЕсли; 
					
					Если НЕ ТекОбъектРасчета = Неопределено И ТекТочкаУчета <> Выборка.ТочкаУчета Тогда
						СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
						СтрокаОписанияФормулы.Вставить("ПараметрыРасчетаФормулы", ПараметрыРасчетаФормулы);
						ПараметрыРасчетаФормулы							= Новый Структура(КлючСтруктурыПараметрыРасчетаФормулы);
						МассивФормулРасчета.Добавить(СтрокаОписанияФормулы); 				
						
						ДобавитьСтрокиНачисленияНППоФормуле(ТЗДанныеСуточнойВедомости, МассивФормулРасчета, Набор, ПараметрыРасчета);
					КонецЕсли;
					
					МассивФормулРасчета 									= Новый Массив;
					СтрокаОписанияФормулы 									= Новый Структура(КлючСтруктурыФормулы);
					ЗаполнитьЗначенияСвойств(СтрокаОписанияФормулы, Выборка); 
					
					НачисленияПоУслугамТочки 								= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					ПараметрыФормулы 										= Новый Соответствие;
					//НормативыПоУслугам  									= Новый Соответствие;
					КоэффициентыПоУслугам  									= Новый Соответствие;
					
					
					//НормативыПоУслугам  									= Новый Соответствие;
					//НормативыПоУслугам.Вставить(Выборка.Услуга, 			Выборка.НормаПотребления);	
					
					//ПараметрыРасчетаФормулы.НормативНаПодогрев  			= Выборка.РасчетныйНормативНаПодогрев;
					//НормативыНаПодогрев.Вставить(Выборка.Услуга, 			Выборка.РасчетныйНормативНаПодогрев);	
				ИначеЕсли НЕ ТекУслуга = Выборка.Услуга Тогда
					
					СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
					СтрокаОписанияФормулы.Вставить("ПараметрыРасчетаФормулы", ПараметрыРасчетаФормулы);
					ПараметрыРасчетаФормулы							= Новый Структура(КлючСтруктурыПараметрыРасчетаФормулы);
					МассивФормулРасчета.Добавить(СтрокаОписанияФормулы);
					НачисленияПоУслугамТочки.Вставить(ТекУслуга, НачисленияПоШкале);
					
					ПараметрыФормулы 										= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					
					СтрокаОписанияФормулы 									= Новый Структура(КлючСтруктурыФормулы);
					ЗаполнитьЗначенияСвойств(СтрокаОписанияФормулы, Выборка);
					
					//НормативыПоУслугам.Вставить(Выборка.Услуга, 		Выборка.НормаПотребления);			
					//НормативыНаПодогрев.Вставить(Выборка.Услуга, 		Выборка.РасчетныйНормативНаПодогрев);
					//ПараметрыРасчетаФормулы.НормативНаПодогрев  		= Выборка.РасчетныйНормативНаПодогрев;

					
				ИначеЕсли НЕ ТекШкала = Выборка.Шкала Тогда
					НачисленияПоШкале 										= Новый Соответствие;
				КонецЕсли; 
				
				
				Если НЕ ЗначениеЗаполнено(Выборка.ФормулаРасчета) Тогда
					//
					Если Выборка.НаличиеЗарегистрированногоОбъема Тогда
						Если УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления] <> Неопределено
							И УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга] <> Неопределено
							И УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ТочкаУчета] <> Неопределено Тогда
							
							Продолжить;
						ИначеЕсли Выборка.ОбъемУслуги <> 0 или Выборка.ОбъемУслугиПотребленный <> 0 Тогда										
							Если УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления] = Неопределено Тогда
								СоотвествиеПрибора = Новый Соответствие;
								СоотвествиеПрибора.Вставить(Выборка.ТочкаУчета,Истина);
								СоотвествиеУслуги = Новый Соответствие;
								СоотвествиеУслуги.Вставить(Выборка.Услуга,СоотвествиеПрибора);
								УдалитьСтрокиПоРегистрацииОбъема.Вставить(Выборка.СпособНачисления,СоотвествиеУслуги);
								
							ИначеЕсли УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга] = Неопределено Тогда
								СоотвествиеПрибора = Новый Соответствие;
								СоотвествиеПрибора.Вставить(Выборка.ТочкаУчета,Истина);
								УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления].Вставить(Выборка.Услуга,СоотвествиеПрибора);	
							Иначе 
								УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга].Вставить(Выборка.ТочкаУчета,Истина);
							КонецЕсли;
							
							
							СтрокаНабораРасчетСреднего = НаборРасчетСреднегоОбъемаНП.добавить();
							ЗаполнитьЗначенияСвойств(СтрокаНабораРасчетСреднего, Выборка);
							СтрокаНабораРасчетСреднего.ОбъемУслуги = Выборка.ОбъемУслуги;
							СтрокаНабораРасчетСреднего.ДокРегистратор = ДокументСсылка;
							
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					//
					
					
					Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.СреднееПоНормативу или Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоНормативу Тогда
						
						Если НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления] = Неопределено 
							И НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга] = Неопределено 
							И НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета] = Неопределено
							И НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета][Выборка.НачалоПериода] = Неопределено Тогда
							
							Продолжить;					
						КонецЕсли;
						
						
						Если УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления] = Неопределено Тогда
							СоотвествиеНачалоПериода = Новый Соответствие;
							СоотвествиеНачалоПериода.Вставить(Выборка.НачалоПериода,Истина);
							СоотвествиеПрибора = Новый Соответствие;
							СоотвествиеПрибора.Вставить(Выборка.ОбъектРасчета,СоотвествиеНачалоПериода);
							СоотвествиеУслуги = Новый Соответствие;
							СоотвествиеУслуги.Вставить(Выборка.Услуга,СоотвествиеПрибора);
							УдалитьСтрокиПоСреднемуПоНормативу.Вставить(Выборка.СпособНачисления,СоотвествиеУслуги);
							
						ИначеЕсли УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга] = Неопределено Тогда
							СоотвествиеНачалоПериода = Новый Соответствие;
							СоотвествиеНачалоПериода.Вставить(Выборка.НачалоПериода,Истина);
							СоотвествиеПрибора = Новый Соответствие;
							СоотвествиеПрибора.Вставить(Выборка.ОбъектРасчета,СоотвествиеНачалоПериода);
							УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления].Вставить(Выборка.Услуга,СоотвествиеПрибора);	
						ИначеЕсли УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета] = Неопределено Тогда
							СоотвествиеНачалоПериода = Новый Соответствие;
							СоотвествиеНачалоПериода.Вставить(Выборка.НачалоПериода,Истина);
							УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга].Вставить(Выборка.ОбъектРасчета,СоотвествиеНачалоПериода);
						ИначеЕсли УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета][Выборка.НачалоПериода] = Неопределено Тогда
							УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета].Вставить(Выборка.НачалоПериода,Истина);
						КонецЕсли;				
					КонецЕсли;
					
					
					
					
					СтрокаНабора 											= Набор.добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
					СтрокаНабора.Период 									= КонецПериодаРасчета-1;
					СтрокаНабора.Регистратор 								= ДокументСсылка;
					СтрокаНабора.ВидНачисления 								= Перечисления.энргВидыНачислений.Начисление;
					СтрокаНабора.ПериодРасчета 								= ПериодНачисления;
					СтрокаНабора.Поставщик	 								= Выборка.Поставщик;
					СтрокаНабора.ОбъемУслуги 								= Выборка.ОбъемУслуги;
					СтрокаНабора.ОбъемУслугиПотребленный 					= Выборка.ОбъемУслугиПотребленный;
					
					Если Выборка.СодержитПотери И ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) Тогда 
						
						Если Выборка.ГБП = Перечисления.энргРасположениеРесурса.ДоГБП Или Выборка.ГБП = Перечисления.энргРасположениеРесурса.НаГБП Тогда
							ОбъемУслугиОсновной = НачисленияПоУслугамОбъекта.Получить(Выборка.ЗависитОтУслуги);
							Если Не ЗначениеЗаполнено(ОбъемУслугиОсновной) Тогда
								СтрокаНабора.ОбъемУслуги					= 0;
								СтрокаНабора.ОбъемУслугиПотребленный       	= 0;
								ОбъемУслуги									= 0;
								ОбъемУслугиПотребленный       				= 0;
							КонецЕсли;							 
						КонецЕсли;						
						
						
					ИначеЕсли ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) И Не Выборка.НаличиеЗарегистрированногоОбъема Тогда
						
						Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено и НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
							
							ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
							
							ТемпературныйКоэффициент = (Выборка.ТемператураПодачи - Выборка.ТемператураХолоднойВоды) / 1000;
							
							ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги;
							ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный;
							
							
							Если Выборка.ПорядокРасчетаУслуг = 2 Тогда
								Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоНормативу Тогда
									ОбъемУслуги = ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ТемпературныйКоэффициент);
									ОбъемУслугиПотребленный = ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ТемпературныйКоэффициент);
									
								ИначеЕсли Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
									
									Если Выборка.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке Тогда
										ОбъемУслуги = ОбъемУслугиОсновной.ОбъемУслуги * ТемпературныйКоэффициент;
										ОбъемУслугиПотребленный = ОбъемУслугиОсновной.ОбъемУслугиПотребленный * ТемпературныйКоэффициент;
									ИначеЕсли Выборка.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда
										ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги* Выборка.НормаПотребления;
										ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный* Выборка.НормаПотребления;
										
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
							СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги;
							СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					ЗаполнитьЗначенияСвойств(ПараметрыРасчетаФормулы,Выборка);
				КонецЕсли;
				КлючШкалы 													= Выборка.Шкала.УникальныйИдентификатор();
				КлючЧастиУзла 												= Выборка.ПриборУчета.УникальныйИдентификатор();
				
				Если ПараметрыФормулы[КлючЧастиУзла] = Неопределено Тогда
					СоотвествиеШкалы 										= Новый Соответствие;
					СоотвествиеШкалы.Вставить(КлючШкалы, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
					ПараметрыФормулы.Вставить(КлючЧастиУзла, СоотвествиеШкалы);
				ИначеЕсли ПараметрыФормулы[КлючЧастиУзла][КлючШкалы] = Неопределено Тогда
					ПараметрыФормулы[КлючЧастиУзла].Вставить(КлючШкалы, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
				Иначе
					ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслуги 				= ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслуги + Выборка.ОбъемУслуги;
					ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслугиПотребленный 	= ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
				КонецЕсли;
				
				Если НЕ НачисленияПоШкале[Выборка.Шкала] = Неопределено Тогда
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги 			 = НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги + СтрокаНабора.ОбъемУслуги;
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный = НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный + СтрокаНабора.ОбъемУслугиПотребленный;
				Иначе
					НачисленияПоШкале.Вставить(Выборка.Шкала, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", СтрокаНабора.ОбъемУслуги, СтрокаНабора.ОбъемУслугиПотребленный));
				КонецЕсли;
				
				
				
				НачисленияПоУслугам.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				//НормативыНаПодогрев.Вставить(Выборка.Услуга, 		Выборка.РасчетныйНормативНаПодогрев);
				//ПараметрыРасчетаФормулы.НормативНаПодогрев  									= Выборка.РасчетныйНормативНаПодогрев;
				НачисленияПоУслугамОбъекта.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				
				//закрытая схема
				Если Выборка.ЗакрытаяСхемаГВС Тогда
					СтрокаНабора.ОбъемУслуги = 0;
				КонецЕсли;
				
				ТекОбъектРасчета 							= Выборка.ОбъектРасчета;
				ТекТочкаУчета								= Выборка.ТочкаУчета;
				ТекНачалоПериода							= Выборка.НачалоПериода;
				ТекУслуга 									= Выборка.Услуга;
				ТекШкала 									= Выборка.Шкала;
				Сч 	= Сч+1;
				
			КонецЦикла;	
			
			//добавить строки с формулами
			Если Не МассивФормулРасчета = Неопределено Тогда
				СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
				СтрокаОписанияФормулы.Вставить("ПараметрыРасчетаФормулы", ПараметрыРасчетаФормулы);
				МассивФормулРасчета.Добавить(СтрокаОписанияФормулы);
				
				ДобавитьСтрокиНачисленияНППоФормуле(ТЗДанныеСуточнойВедомости, МассивФормулРасчета, Набор, ПараметрыРасчета);
			КонецЕсли;
			
			
			Если Документ = Неопределено и НЕ Набор = Неопределено и Набор.Количество() > 0 тогда
				НачатьТранзакцию();
				Попытка 			
					Если НЕ ДокументОбъект  = Неопределено Тогда
						ДокументОбъект.ПометкаУдаления = Ложь;
						ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
						ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
					
					Набор.Записать(Ложь);
					
					Если ЗначениеЗаполнено(НаборРасчетСреднегоОбъемаНП) Тогда
						ТЗСвернуть = НаборРасчетСреднегоОбъемаНП.выгрузить();
						ТЗСвернуть.свернуть("Организация,ПериодНачисления,Район,ОбъектРасчета,ТочкаУчета,Шкала,ТарифнаяЗона,Разделитель,ДокРегистратор,МКД","ОбъемУслуги");
						НаборРасчетСреднегоОбъемаНП.Очистить();
						НаборРасчетСреднегоОбъемаНП.Загрузить(ТЗСвернуть);
						НаборРасчетСреднегоОбъемаНП.Записать();
					КонецЕсли;
					
					ЗафиксироватьТранзакцию();
				Исключение
					ОписаниеОшибки 											= ИнформацияОбОшибке();
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
			
			ТекДокумент = ВыборкаДок.ДокументНачисления;
			
		КонецЦикла;
		
		ТекМКД 									= ВыборкаМКД.МКД;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачисленияПоДолевымСхемам(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие,Договор,Документ)  Экспорт 
	
	ГраницыПериода  									= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район, ПериодНачисления,Ложь);	
	МВТ 												= Новый МенеджерВременныхТаблиц;
	ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ,Организация,ПериодНачисления,Район,ИсключаяОтдельностоящие,МКД,ГраницыПериода);
	
	МассивПропроциональныхНачислений					= Новый Массив;
	МассивПропроциональныхНачислений.Добавить(Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему);
	МассивПропроциональныхНачислений.Добавить(Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги);
	МассивПропроциональныхНачислений.Добавить(Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему);
	
	Запрос 												= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 						= МВТ;
	Запрос.Текст 										= ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам();
	Запрос.УстановитьПараметр("НачалоПериода",			ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",			ГраницыПериода.ЗавершениеОП);
	
	Результат  											= Запрос.ВыполнитьПакет();
	ВыборкаДолевойОбъем									= Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСубабоненты									= Результат[1].Выбрать();
	
	ТекМКД												= Неопределено;
	ТекОбъектРасчета                                    = Неопределено;
	ТекТочкаУчета                                       = Неопределено;
	
	НаборЗаписей 										= Неопределено;
	
	ДокументОбъект 										= Неопределено;
	ДанныеПоУслуге 										= Неопределено;
	НаборВыполненные 									= Неопределено;
	ЗамещатьНаборВыполненные 							= Истина;
	
	НачисленияПоТочке = Новый Соответствие;
	РассчитанныеОбъемыПоТочке = Новый Соответствие;
	СторнированныеОбъемыПоТочке = Новый Соответствие;
	
	ТаблицаСторнированныхОбъемов = Новый ТаблицаЗначений;
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("ОбъемУслуги", Новый ОписаниеТипов("Число"));
	
	
	Если ВыборкаДолевойОбъем.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСубабоненты.следующий();
	
	Пока ВыборкаДолевойОбъем.Следующий() Цикл
		
		ТекУслуга 										= Неопределено;
		
		Если НЕ ТекМКД = ВыборкаДолевойОбъем.МКД Тогда
			
			Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
				
				НачатьТранзакцию();
				
				НаборОтложенныхДвижений	= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
				НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
				НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
				НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
				НаборОтложенныхДвижений.Отбор.МКД.Установить(ТекМКД);
				
				НаборОтложенныхДвижений.Записать();					
				
				Попытка 					
					НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
					НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
					НаборЗаписей.ДополнительныеСвойства.Вставить("МКД",  	  			ТекМКД);
					НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
					НаборЗаписей.Записать();
					
					Если Не ДокументОбъект = Неопределено Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
						ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
					КонецЕсли; 					
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
			
			ДокументСсылка 							= ВыборкаДолевойОбъем.ДокументНачисленияПоДолевымСхемам;			
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
				ДокументСсылка 						= Документы.бестНачислениеПоДолевымСхемам.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект 						= Документы.бестНачислениеПоДолевымСхемам.СоздатьДокумент();
				ДокументОбъект.Район 				= Район;
				ДокументОбъект.МКД 					= ВыборкаДолевойОбъем.МКД;
				ДокументОбъект.Дата 				= ГраницыПериода.ЗавершениеОП-1;
				ДокументОбъект.Организация			= Организация;
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
				
			Иначе
				ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления 		= Ложь;
				
				НаборЗаписей 						= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборЗаписей.Записать(); // очищаем набор записей
				
				//ДокОбъект = ДокументСсылка.ПолучитьОбъект();
				//ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
			НаборЗаписей 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			
			ВыборкаТочкиУчета = ВыборкаДолевойОбъем.Выбрать();
			
			Пока ВыборкаТочкиУчета.Следующий() Цикл
				
				Если НЕ ТекТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета Или НЕ ТекУслуга = ВыборкаТочкиУчета.Услуга Тогда
					
					Если Не ТекУслуга  = Неопределено Тогда
						НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, ?(ТекМКД = Неопределено, ВыборкаДолевойОбъем.МКД, ТекМКД), ТекТочкаУчета, ТекУслуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке);
					КонецЕсли;
					
					ДанныеПоУслуге  												= Новый Структура;
					
					
					ДанныеПоУслуге.Вставить("РасчетИндивидуальногоПотребления",		ВыборкаТочкиУчета.РасчетИндивидуальногоПотребления);
					ДанныеПоУслуге.Вставить("СуммарныйОбъемСубабонентов",			ВыборкаТочкиУчета.ОбъемПотребленияСубабонентов);
					ДанныеПоУслуге.Вставить("Субабоненты", 							Новый Массив);
					ДанныеПоУслуге.Вставить("ЗначениеНагрузки", 					ВыборкаТочкиУчета.ЗначениеНагрузки);
					ДанныеПоУслуге.Вставить("ЗначениеПлощади", 						ВыборкаТочкиУчета.ЗначениеПлощади);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеНагрузкиСубабонентов",ВыборкаТочкиУчета.СуммарноеЗначениеНагрузкиСубабонентов);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеПлощадиСубабонентов", ВыборкаТочкиУчета.СуммарноеЗначениеПлощадиСубабонентов);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеДоговорногоОбъемаСуб",ВыборкаТочкиУчета.СуммарноеЗначениеДоговорногоОбъемаСуб);
					ДанныеПоУслуге.Вставить("ВсегоТочекУчетаСубабонентов", 			ВыборкаТочкиУчета.ВсегоТочекУчетаСубабонентов);
					ДанныеПоУслуге.Вставить("ВсегоПриборовУчетаСубабонентов", 		ВыборкаТочкиУчета.ВсегоПриборовУчетаСубабонентов);
					ДанныеПоУслуге.Вставить("ДанныеНачисленийСубабонентов", 		бестНачисленияНП.ОписаниеТаблицыОбъемов());
					ДанныеПоУслуге.Вставить("СпособНачисления", 					ВыборкаТочкиУчета.СпособНачисления);
					ДанныеПоУслуге.Вставить("ПотреблениеСубабонентов", 				0);
					ДанныеПоУслуге.Вставить("ОбъемСубКРаспределению", 				ВыборкаТочкиУчета.ОбъемСубКРаспределению);
					ДанныеПоУслуге.Вставить("СхемаРасчетаПриВыходеПУ", 				ВыборкаТочкиУчета.СхемаРасчетаПриВыходеПУ);
					
					мСубабоненты 											= ДанныеПоУслуге.Субабоненты;
					ПотреблениеСубабонентов 								= ДанныеПоУслуге.ПотреблениеСубабонентов;
					
					ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Очистить();
					
					Если ВыборкаТочкиУчета.Уровень = 0 Тогда
						ДанныеПоУслуге.Вставить("ОбъемУслуги",							ВыборкаТочкиУчета.ОбъемУслуги);
					Иначе
						Если РассчитанныеОбъемыПоТочке[ВыборкаТочкиУчета.ОбъектРасчета] <> Неопределено Тогда
							РассчитанныйОбъемУслуги 	= РассчитанныеОбъемыПоТочке[ВыборкаТочкиУчета.ОбъектРасчета][ВыборкаТочкиУчета.Услуга];
							ДанныеПоУслуге.Вставить("ОбъемУслуги",	?(РассчитанныйОбъемУслуги = Неопределено, ВыборкаТочкиУчета.ОбъемУслуги,РассчитанныйОбъемУслуги) );
							
							НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаТочкиУчета.ТочкаУчета,ВыборкаТочкиУчета.Услуга,РассчитанныйОбъемУслуги));
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаТочкиУчета);
								СтрокаСписатьИндивидуальные.ОбъемУслуги		= РассчитанныйОбъемУслуги;
								
								СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаТочкиУчета);
								СтрокаСторнированныхОбъемов.ОбъемУслуги		= РассчитанныйОбъемУслуги;
								
							КонецЕсли;
							
						Иначе
							//Продолжить;
							ДанныеПоУслуге.Вставить("ОбъемУслуги",							0);
						КонецЕсли;
					КонецЕсли;
					
					
					// Двигаем выборку абонентов
					Пока НЕ ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета ИЛИ НЕ ВыборкаСубабоненты.Услуга = ВыборкаТочкиУчета.Услуга Цикл
						Если НЕ ВыборкаСубабоненты.Следующий() Тогда
							Прервать;
							ВыборкаСубабоненты.сбросить();
						КонецЕсли;				
					КонецЦикла;
					
					ТекСубабонент	 									= Неопределено;
					ДанныеСубабонента 									= Неопределено;
					
					Пока ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета и ВыборкаСубабоненты.Услуга = ВыборкаТочкиУчета.Услуга Цикл
						Если НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета] = Неопределено Тогда
							НачисленияПоТочке.Вставить(ВыборкаСубабоненты.ОбъектРасчета, Новый Соответствие);
						КонецЕсли;
						Если НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета][ВыборкаСубабоненты.Услуга] = Неопределено Тогда
							НачисленияПоУслуге = Новый Структура("ОбъемУслугиГоловнойТУ, ОбъемУслуги", 0, 0);
							НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета].Вставить(ВыборкаСубабоненты.Услуга, НачисленияПоУслуге);
						КонецЕсли;
						
						НачисленияПоУслуге = НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета][ВыборкаСубабоненты.Услуга];
						НачисленияПоУслуге.ОбъемУслуги = НачисленияПоУслуге.ОбъемУслуги + ВыборкаСубабоненты.ОбъемУслуги;
						
						Если НЕ ТекСубабонент = ВыборкаСубабоненты.ТочкаУчета Тогда
							Если Не ТекСубабонент = Неопределено Тогда
								мСубабоненты.Добавить(ДанныеСубабонента);
							КонецЕсли;
							
							
							ДанныеСубабонента 								= Новый Структура("МКД, ОбъектРасчета, ТочкаУчета, ОбъемУслуги, ЗначениеПлощади, КоэффициентДолевогоРаспределения, СпособРаспределенияОбъемаДолевойТУ, СпособРаспределенияОстаткаДолевыеСхемы, ЗависимаяТочкаУчета, ЗначениеНагрузки, ДоговорнойОбъем, ФиксированныйОбъем,ТарифнаяЗона,Поставщик",
							ВыборкаСубабоненты.МКД, ВыборкаСубабоненты.ОбъектРасчета, ВыборкаСубабоненты.ТочкаУчета, ВыборкаСубабоненты.ОбъемУслуги, ВыборкаСубабоненты.ЗначениеПлощади, ВыборкаСубабоненты.КоэффициентДолевогоРаспределения, ВыборкаСубабоненты.СпособРаспределенияОбъемаДолевойТУ, 
							ВыборкаСубабоненты.СпособРаспределенияОстаткаДолевыеСхемы, ВыборкаСубабоненты.ЗависимаяТочкаУчета, ВыборкаСубабоненты.ЗначениеНагрузки, ВыборкаСубабоненты.ДоговорнойОбъем, ВыборкаСубабоненты.ФиксированныйОбъем, ВыборкаСубабоненты.ТарифнаяЗона, ВыборкаСубабоненты.Поставщик);
							
							
						КонецЕсли;
						
						Если ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаСубабоненты.ТочкаУчета Тогда
							
							НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаСубабоненты.ТочкаУчета,ВыборкаСубабоненты.Услуга,РассчитанныйОбъемУслуги));
							НачисленияПоУслуге.ОбъемУслуги = НачисленияПоУслуге.ОбъемУслуги - ВыборкаСубабоненты.ОбъемУслуги;
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаСубабоненты);
								СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
								
								СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаСубабоненты);
								СтрокаСторнированныхОбъемов.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
								
							КонецЕсли;
							
						Иначе
							Если ВыборкаСубабоненты.СторнироватьОбъемИндивидуальногоПотребления Тогда
								
								НачисленияПоУслуге.ОбъемУслуги = НачисленияПоУслуге.ОбъемУслуги - ВыборкаСубабоненты.ОбъемУслуги;
								НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаСубабоненты.ТочкаУчета,ВыборкаСубабоненты.Услуга,РассчитанныйОбъемУслуги));
								Если НайденныеСтроки.Количество() = 0 Тогда
									СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаСубабоненты);
									СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
									
									СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаСубабоненты);
									СтрокаСторнированныхОбъемов.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
								КонецЕсли;
								
								
							КонецЕсли;
						КонецЕсли;
						
						ПотреблениеАбонентов 							= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
						
						ТекСубабонент 									= ВыборкаСубабоненты.ТочкаУчета;
						
						Если МассивПропроциональныхНачислений.Найти(ВыборкаСубабоненты.СпособРаспределенияОбъемаДолевойТУ) = Неопределено Тогда
							ДанныеПоУслуге.СуммарныйОбъемСубабонентов = ДанныеПоУслуге.СуммарныйОбъемСубабонентов - ВыборкаСубабоненты.ОбъемУслуги;
						КонецЕсли;
						
						Если НЕ ВыборкаСубабоненты.Следующий() Тогда
							Прервать;
							ВыборкаСубабоненты.сбросить();
						КонецЕсли; 				
					КонецЦикла; 			
					
					Если Не ТекСубабонент = Неопределено Тогда
						мСубабоненты.Добавить(ДанныеСубабонента);
					КонецЕсли;
					
				КонецЕсли;		
				
				ТекТочкаУчета 											= ВыборкаТочкиУчета.ТочкаУчета;
				ТекУслуга 												= ВыборкаТочкиУчета.Услуга;
				
			КонецЦикла;
			
			Если Не НаборЗаписей = Неопределено Тогда
				
				НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, ТекМКД, ТекТочкаУчета, ТекУслуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке);
				
				Если НаборЗаписей.Количество() > 0 Тогда
					НачатьТранзакцию();
					Попытка				
						Если Не ДокументОбъект = Неопределено Тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						
						НаборОтложенныхДвижений 					= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
						НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
						НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
						НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
						НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
						НаборОтложенныхДвижений.Отбор.МКД.Установить(ТекМКД);
						НаборОтложенныхДвижений.Записать();				
						
						НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
						НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
						НаборЗаписей.ДополнительныеСвойства.Вставить("МКД",    				ТекМКД);
						НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
						НаборЗаписей.Записать(Ложь);	
						
						ЗафиксироватьТранзакцию();
					Исключение
						ОписаниеОшибки 								= ОписаниеОшибки();
						ОтменитьТранзакцию();
					КонецПопытки;
				КонецЕсли;		
			КонецЕсли; 			
			
			
			ТекМКД = ВыборкаДолевойОбъем.МКД;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачислитьПеню(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие,Договор,Документ) Экспорт  
	
	//НачислятьПеню = Константы.энргНачислятьПеню.Получить();
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	энргПрименениеНачисленияПениСрезПоследних.Период КАК Период,
	|	энргПрименениеНачисленияПениСрезПоследних.Организация КАК Организация,
	|	энргПрименениеНачисленияПениСрезПоследних.НачислятьПеню КАК НачислятьПеню
	|ИЗ
	|	РегистрСведений.энргПрименениеНачисленияПени.СрезПоследних(&Период, Организация = &Организация) КАК энргПрименениеНачисленияПениСрезПоследних";
	Запрос.УстановитьПараметр("Период", 		ГраницыПериода.ЗАвершениеОП-1);
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	НачислятьПеню = Ложь;
	Если Выборка.Следующий() Тогда
		НачислятьПеню = Выборка.НачислятьПеню;	
	КонецЕсли;	
	
	Если не НачислятьПеню тогда
		Запрос  								= Новый Запрос;
		Запрос.Текст 							=
		"ВЫБРАТЬ
		|	МАКСИМУМ(бестНачислениеПениНП.Ссылка) КАК Ссылка
		|ИЗ
		|	Документ.бестНачислениеПениНП КАК бестНачислениеПениНП
		|ГДЕ
		|	бестНачислениеПениНП.Организация = &Организация
		|	И бестНачислениеПениНП.Район = &Район
		|	И бестНачислениеПениНП.ПериодНачисления = &ПериодНачисления
		|	И НЕ бестНачислениеПениНП.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ПериодНачисления", 		ПериодНачисления);
		Запрос.УстановитьПараметр("Организация", 			Организация);
		Запрос.УстановитьПараметр("Район", 					Район);
		
		Результат = Запрос.Выполнить();
		Выборка		= Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				ДокОб = Выборка.Ссылка.ПолучитьОбъект();
				ДокОб.ПометкаУдаления = Истина;
				ДокОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройки системы не предполагают начисление пени");		
		Возврат;	
	КонецЕсли;
	
	Если не НачислятьПеню тогда		
		Возврат;
	КонецЕсли;
	
	ОсновнойПроизводственныйКалендарь = Константы.бестОсновнойПроизводственныйКалендарь.Получить();
	
	Если НЕ ЗначениеЗаполнено(ОсновнойПроизводственныйКалендарь) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен основной производственный календарь");
		Возврат;
	КонецЕсли;
	
	
	// Ставки рефинансирования
	Запрос  								= Новый Запрос;
	Запрос.Текст 							=
	"ВЫБРАТЬ
	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&Период, ) КАК энргСтавкиРефинансированияСрезПоследних";
	Запрос.УстановитьПараметр("Период", ПериодНачисления);
	
	Результат  								= Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена информация по ставке рефинансирования,
		|	 Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка  								= Результат.Выбрать();
	Выборка.Следующий();
	СтавкаРефинансирования  				= Выборка.Коэффициент; 
	
	// Настройка расчет пени
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестНастройкаРасчетаПениСрезПоследних.КатегорияПотребителя КАК КатегорияПотребителя,
	|	бестНастройкаРасчетаПениСрезПоследних.От КАК От,
	|	бестНастройкаРасчетаПениСрезПоследних.До КАК До,
	|	бестНастройкаРасчетаПениСрезПоследних.Числитель КАК Числитель,
	|	бестНастройкаРасчетаПениСрезПоследних.Знаменатель КАК Знаменатель
	|ИЗ
	|	РегистрСведений.бестНастройкаРасчетаПениНП.СрезПоследних(&Период,) КАК бестНастройкаРасчетаПениСрезПоследних
	|ИТОГИ ПО
	|	КатегорияПотребителя";
	
	Запрос.УстановитьПараметр("Период", ПериодНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки расчет пени, Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	
	ВыборкаКатегорияПотребителя = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеИтог =Новый Соответствие; 
	Пока ВыборкаКатегорияПотребителя.Следующий() Цикл
		МаксЗначение = 0;
		СоответствиеКатегория = Новый Соответствие;
		РангКоэффициента = 1;
		
		Строка = ВыборкаКатегорияПотребителя.Выбрать();
		
		Пока Строка.Следующий() Цикл
			Если Строка.До = 0 Тогда
				НСтр = Новый Структура;
				НСтр.Вставить("Числитель", Строка.Числитель);
				НСтр.Вставить("Знаменатель", Строка.Знаменатель);
				НСтр.Вставить("РангКоэффициента", РангКоэффициента);
				
				СоответствиеКатегория.Вставить(Строка.До, НСтр);
			Иначе
				Для Сч = Строка.От По Строка.До Цикл
					НСтр = Новый Структура;
					НСтр.Вставить("Числитель", Строка.Числитель);
					НСтр.Вставить("Знаменатель", Строка.Знаменатель);
					НСтр.Вставить("РангКоэффициента", РангКоэффициента);
					
					СоответствиеКатегория.Вставить(Сч, НСтр);
					
					МаксЗначение = Макс(МаксЗначение, Сч);
				КонецЦикла;
			КонецЕсли;
			
			РангКоэффициента = РангКоэффициента + 1;
			
		КонецЦикла;
		СоответствиеИтог.Вставить(ВыборкаКатегорияПотребителя.КатегорияПотребителя,СоответствиеКатегория);
	КонецЦикла;
	
	// Настройки начисления пени.
	Запрос  									= Новый Запрос;
	Запрос.Текст 								=
	"ВЫБРАТЬ
	|	бестОстановленныеРасчетыПени.Договор КАК Договор
	|ПОМЕСТИТЬ ДоговорыСОстановкойПени
	|ИЗ
	|	РегистрСведений.бестОстановленныеРасчетыПени КАК бестОстановленныеРасчетыПени
	|ГДЕ
	|	бестОстановленныеРасчетыПени.Организация = &Организация
	|	И бестОстановленныеРасчетыПени.Район = &Район
	|	И ВЫБОР
	|			КОГДА &НачалоПериода >= бестОстановленныеРасчетыПени.От
	|						И &НачалоПериода < бестОстановленныеРасчетыПени.До
	|					ИЛИ &КонецПериода >= бестОстановленныеРасчетыПени.От
	|						И &КонецПериода < бестОстановленныеРасчетыПени.До
	|				ТОГДА ИСТИНА
	|			КОГДА бестОстановленныеРасчетыПени.От >= &НачалоПериода
	|						И бестОстановленныеРасчетыПени.От < &КонецПериода
	|					ИЛИ бестОстановленныеРасчетыПени.До >= &НачалоПериода
	|						И бестОстановленныеРасчетыПени.До < &КонецПериода
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Район КАК Район,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Организация КАК Организация,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Договор КАК Договор,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Услуга КАК Услуга,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Период КАК Период,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаНачальныйОстаток + бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаНДСНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаКонечныйОстаток + бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаНДСКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ДанныеЗадолженности
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчётыПоУслугамЮрЛица.ОстаткиИОбороты(
	|			,
	|			&КонецПериода,
	|			День,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ Договор В
	|						(ВЫБРАТЬ
	|							ДоговорыСОстановкойПени.Договор КАК Договор
	|						ИЗ
	|							ДоговорыСОстановкойПени КАК ДоговорыСОстановкойПени)
	|				И НЕ ЗНАЧЕНИЕ(справочник.энргдоговорыконтрагентов.пустаяссылка) В
	|						(ВЫБРАТЬ
	|							ДоговорыСОстановкойПени.Договор КАК Договор
	|						ИЗ
	|							ДоговорыСОстановкойПени КАК ДоговорыСОстановкойПени)) КАК бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.Организация КАК Организация,
	|	ДанныеЗадолженности.Договор КАК Договор,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	МИНИМУМ(ДанныеЗадолженности.Период) КАК Период,
	|	МИНИМУМ(ЕСТЬNULL(бестНастройкиОплатыПоЮрЛицамСрезПоследних.СрокОплаты, 0)) КАК ДеньНачалаОплаты
	|ПОМЕСТИТЬ ДатаНачала
	|ИЗ
	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкиОплатыПоЮрЛицам.СрезПоследних(
	|				&КонецПериода,
	|				ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический)
	|					И Район = &Район
	|					И Организация = &Организация) КАК бестНастройкиОплатыПоЮрЛицамСрезПоследних
	|		ПО ДанныеЗадолженности.Договор = бестНастройкиОплатыПоЮрЛицамСрезПоследних.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗадолженности.Договор,
	|	ДанныеЗадолженности.Услуга,
	|	ДанныеЗадолженности.ПериодНачисления,
	|	ДанныеЗадолженности.Район,
	|	ДанныеЗадолженности.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(бестНачислениеПениНП.Ссылка) КАК Ссылка,
	|	бестНачислениеПениНП.Район КАК Район,
	|	бестНачислениеПениНП.Организация КАК Организация
	|ПОМЕСТИТЬ ДокументыНачисления
	|ИЗ
	|	Документ.бестНачислениеПениНП КАК бестНачислениеПениНП
	|ГДЕ
	|	бестНачислениеПениНП.Организация = &Организация
	|	И бестНачислениеПениНП.Район = &Район
	|	И бестНачислениеПениНП.ПериодНачисления = &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНачислениеПениНП.Район,
	|	бестНачислениеПениНП.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.Организация КАК Организация,
	|	ДанныеЗадолженности.Договор КАК Договор,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеЗадолженности.Период КАК Период,
	|	ДанныеЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДанныеЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачала.Период КАК НачальныйПериод,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ДатаНачала.Период) + 1 = МЕСЯЦ(&ПериодНачисления)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДанныеЗадолженности.ПериодНачисления, МЕСЯЦ, 1), ДЕНЬ, ДатаНачала.ДеньНачалаОплаты)
	//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДатаНачала.Период, МЕСЯЦ, 1)
	|		ИНАЧЕ &НачалоПериода
	|	КОНЕЦ КАК ДатаНачалаНачисленияПени,
	|	ЕСТЬNULL(ДокументыНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеПениНП.ПустаяСсылка)) КАК ДокументНачисления,
	|	ДанныеЗадолженности.Договор.КатегорияПотребителя КАК КатегорияПотребителя,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДанныеЗадолженности.ПериодНачисления, МЕСЯЦ, 1), ДЕНЬ, ДатаНачала.ДеньНачалаОплаты) КАК ИзначальнаяДатаНачисленияПени
	|ИЗ
	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачала КАК ДатаНачала
	|		ПО ДанныеЗадолженности.Район = ДатаНачала.Район
	|			И ДанныеЗадолженности.Организация = ДатаНачала.Организация
	|			И ДанныеЗадолженности.Договор = ДатаНачала.Договор
	|			И ДанныеЗадолженности.Услуга = ДатаНачала.Услуга
	|			И ДанныеЗадолженности.ПериодНачисления = ДатаНачала.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачисления КАК ДокументыНачисления
	|		ПО ДанныеЗадолженности.Район = ДокументыНачисления.Район
	|			И ДанныеЗадолженности.Организация = ДокументыНачисления.Организация
	|ГДЕ
	|	ДанныеЗадолженности.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеЗадолженности.СуммаНачальныйОстаток > 0";
	
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	//Для каждого стр из ТЗ Цикл
	//	
	//	мДат = Новый Массив();
	//	мДат.Добавить(стр.ДатаНачалаНачисленияПени);
	//	мДат.Добавить(стр.ИзначальнаяДатаНачисленияПени);
	//	РабочаяДата = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ОсновнойПроизводственныйКалендарь,мДат,,Ложь);
	//	
	//	Если РабочаяДата <> Неопределено Тогда
	//		Если стр.ИзначальнаяДатаНачисленияПени = стр.ДатаНачалаНачисленияПени Тогда
	//			стр.ДатаНачалаНачисленияПени 		= РабочаяДата[стр.ДатаНачалаНачисленияПени];
	//		КонецЕсли;
	//		стр.ИзначальнаяДатаНачисленияПени 	= РабочаяДата[стр.ИзначальнаяДатаНачисленияПени];
	//	КонецЕсли;
	//
	//КонецЦикла;
	
	Запрос  									= Новый Запрос;
	Запрос.Текст 								=
	"ВЫБРАТЬ
	|	ТЗ.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	ТЗ.Период КАК Период,
	|	ТЗ.ДокументНачисления КАК ДокументНачисления,
	|	ТЗ.Договор КАК Договор,
	|	ТЗ.Услуга КАК Услуга,
	|	ТЗ.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ТЗ.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ТЗ.НачальныйПериод КАК НачальныйПериод,
	|	ТЗ.КатегорияПотребителя КАК КатегорияПотребителя,
	|	ТЗ.ИзначальнаяДатаНачисленияПени КАК ИзначальнаяДатаНачисленияПени
	|ПОМЕСТИТЬ ДатаНачальногоПериода
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаНачальногоПериода.ДокументНачисления КАК ДокументНачисления,
	|	ДатаНачальногоПериода.Договор КАК Договор,
	|	ДатаНачальногоПериода.Услуга КАК Услуга,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДатаНачальногоПериода.Период КАК Период,
	|	ДатаНачальногоПериода.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДатаНачальногоПериода.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ИзначальнаяДатаНачисленияПени, ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ДЕНЬ) КАК ДнейНаДеньНачала,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ИзначальнаяДатаНачисленияПени, ДатаНачальногоПериода.Период, ДЕНЬ) КАК ДнейПросрочкиСДатыНачалаНачисленийПени,
	|	ДЕНЬ(ДатаНачальногоПериода.Период) КАК ДеньПериода,
	|	ДЕНЬ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени) КАК ДеньНачала,
	|	ДатаНачальногоПериода.НачальныйПериод КАК НачальныйПериод,
	|	ДатаНачальногоПериода.КатегорияПотребителя КАК КатегорияПотребителя,
	|	ДатаНачальногоПериода.ИзначальнаяДатаНачисленияПени КАК ИзначальнаяДатаНачисленияПени
	|ИЗ
	|	ДатаНачальногоПериода КАК ДатаНачальногоПериода
	|ГДЕ
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени < &КонецПериода
	|	И ДатаНачальногоПериода.Период >= ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Период
	|ИТОГИ
	|	МАКСИМУМ(ДнейНаДеньНачала),
	|	МАКСИМУМ(ДеньНачала)
	|ПО
	|	ДокументНачисления,
	|	ПериодНачисления,
	|	Договор,
	|	Услуга";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументНачисления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументНачисления.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДокументНачисления.ДокументНачисления) Тогда
			ДокументОбъект = ВыборкаДокументНачисления.ДокументНачисления.ПолучитьОбъект();
			ДокументОбъект.Дата = КонецПериодаРасчета - 1;
			ДокументОбъект.ПометкаУдаления  = Ложь;
			ДокументОбъект.ДанныеНачислений.Очистить();
		Иначе
			ДокументОбъект = Документы.бестНачислениеПениНП.СоздатьДокумент();
			ДокументОбъект.Дата = КонецПериодаРасчета - 1;
			ДокументОбъект.Район = Район;
			ДокументОбъект.Организация = Организация;
			ДокументОбъект.ПериодНачисления = ПериодНачисления;
			ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
		
		ПараметрыШапки = Новый Структура;
		ПараметрыШапки.Вставить("ПериодНачисления", ПериодНачисления);
		ПараметрыШапки.Вставить("Организация", ДокументОбъект.Организация);
		ПараметрыШапки.Вставить("Район", ДокументОбъект.Район);
		ПараметрыШапки.Вставить("ЭтоОплата", Ложь);
		ПараметрыШапки.Вставить("Кассир", ДокументОбъект.Ответственный);
		ПараметрыШапки.Вставить("ИсточникПоступления", Неопределено);
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПараметрыПроведения", ПараметрыШапки);
		
		ВыборкаПериодНачисления = ВыборкаДокументНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаПериодНачисления.Следующий() Цикл
			ВыборкаДоговор = ВыборкаПериодНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаДоговор.Следующий() Цикл
				ВыборкаУслуга = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				Пока ВыборкаУслуга.Следующий() Цикл
					
					//ДеньНачалаДляРасчета = ВыборкаУслуга.ДеньНачала + 1;
					//ДнейНаДеньНачалаДляРасчета = ВыборкаУслуга.ДнейНаДеньНачала + 1;
					
					ВыборкаДетальныеЗаписи = ВыборкаУслуга.Выбрать();	
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ДеньНачалаДляРасчета = ВыборкаДетальныеЗаписи.ДнейНаДеньНачала + 1;
						//ДнейНаДеньНачалаДляРасчета = ВыборкаДетальныеЗаписи.ДнейНаДеньНачала + 1;
						
						ДнейПросрочки = 0;
						СуммаЗадолженности = ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток;
						КоэффициентЧислитель = 1;
						КоэффициентЗнаменатель = 1;
						ПредКоэффициентЧислитель = 1;
						ПредКоэффициентЗнаменатель = 1;
						РангКоэффициента = 0;
						ПредыдущийРанг = Неопределено;
						
						Для Сч = ДеньНачалаДляРасчета По ВыборкаДетальныеЗаписи.ДнейПросрочкиСДатыНачалаНачисленийПени Цикл
							
							ДнейПросрочки = ДнейПросрочки + 1;
							Соответствие = СоответствиеИтог.Получить(ВыборкаДетальныеЗаписи.КатегорияПотребителя);
							СтруктураКоэффициента = Соответствие.Получить(?(ДеньНачалаДляРасчета <= МаксЗначение, ДеньНачалаДляРасчета, 0));
							Если СтруктураКоэффициента = Неопределено Тогда
								КоэффициентЧислитель = 1;
								КоэффициентЗнаменатель = 1;
								РангКоэффициента = 0;
							Иначе
								КоэффициентЧислитель = СтруктураКоэффициента.Числитель;
								КоэффициентЗнаменатель = СтруктураКоэффициента.Знаменатель;
								РангКоэффициента = СтруктураКоэффициента.РангКоэффициента;
							КонецЕсли;
							
							Если НЕ РангКоэффициента = ПредыдущийРанг И НЕ ПредыдущийРанг = Неопределено Тогда
								НСтр = ДокументОбъект.ДанныеНачислений.Добавить();
								ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
								НСтр.КоэффициентЧислитель = ПредКоэффициентЧислитель;
								НСтр.КоэффициентЗнаменатель = ПредКоэффициентЗнаменатель;
								НСтр.СуммаЗадолженности = СуммаЗадолженности;
								НСтр.ДнейПросрочки = ДнейПросрочки;
								НСтр.СтавкаРефинансирования = СтавкаРефинансирования;							
								НСтр.ДатаНачисления = ВыборкаДетальныеЗаписи.НачальныйПериод;
								НСтр.ПериодНачисления = НачалоМесяца(ВыборкаДетальныеЗаписи.НачальныйПериод);
								НСтр.СуммаПени = НСтр.СуммаЗадолженности * (НСтр.КоэффициентЧислитель / НСтр.КоэффициентЗнаменатель) * НСтр.СтавкаРефинансирования / 100 * НСтр.ДнейПросрочки;
								
								ДнейПросрочки = 0;
							КонецЕсли;
							
							ПредыдущийРанг = РангКоэффициента;
							ПредКоэффициентЧислитель = КоэффициентЧислитель;
							ПредКоэффициентЗнаменатель = КоэффициентЗнаменатель;
							ДеньНачалаДляРасчета = ДеньНачалаДляРасчета + 1;
							
						КонецЦикла;
						Если ДнейПросрочки > 0 Тогда
							НСтр = ДокументОбъект.ДанныеНачислений.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							НСтр.КоэффициентЧислитель = КоэффициентЧислитель;
							НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
							НСтр.СуммаЗадолженности = СуммаЗадолженности;
							НСтр.ДнейПросрочки = ДнейПросрочки;
							НСтр.СтавкаРефинансирования = СтавкаРефинансирования;							
							НСтр.ДатаНачисления = ВыборкаДетальныеЗаписи.НачальныйПериод;
							НСтр.ПериодНачисления = НачалоМесяца(ВыборкаДетальныеЗаписи.НачальныйПериод);
							НСтр.СуммаПени = НСтр.СуммаЗадолженности * (НСтр.КоэффициентЧислитель / НСтр.КоэффициентЗнаменатель) * НСтр.СтавкаРефинансирования / 100 * НСтр.ДнейПросрочки;
							
							ДеньНачалаДляРасчета = ВыборкаДетальныеЗаписи.ДнейНаДеньНачала + 1;
						КонецЕсли;
					КонецЦикла;				
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	//Результат = Запрос.Выполнить();
	//
	//Выборка  									= Результат.Выбрать();
	//ТекМКД  									= Неопределено; 
	//ДокументОбъект 							= Неопределено;
	//Пока Выборка.Следующий() цикл
	//	
	//	Если ТекМКД <> Выборка.МКД тогда
	//		Если ТекМКД<> Неопределено тогда
	//			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//		КонецЕсли;
	//		
	//		Если ЗначениеЗаполнено(Выборка.ДокументНачисления) тогда
	//			ДокументОбъект  				= Выборка.ДокументНачисления.ПолучитьОбъект();
	//			ДокументОбъект.ПометкаУдаления  = Ложь;
	//			ТабЧасть 						= ДокументОбъект.ДанныеНачислений;
	//		иначе
	//			ДокументОбъект  				= Документы.энргНачислениеПени.СоздатьДокумент();
	//			ТабЧасть 						= ДокументОбъект.ДанныеНачислений;
	//		КонецЕсли;		
	//		ТабЧасть.очистить();			
	//	КонецЕсли;	
	//	
	//	СтрокаНачислений  						= ТабЧасть.добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаНачислений,Выборка);
	//	
	//	ТекМКД 									= Выборка.МКД;		
	//КонецЦикла; 
	//
	//Если ТекМКД<> Неопределено тогда
	//	ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//КонецЕсли;
	//
	//Если МКД = Неопределено тогда
	//	//Набор 									= РегистрыСведений.энргВыполненныеНачисления.СоздатьНаборЗаписей();
	//	//Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	//	//Набор.Отбор.Район.установить(Район);
	//	//Набор.Отбор.ВидОперацииНачисления.установить(Перечисления.энргВидыОперацийНачисления.НачислениеПени);
	//	//Набор.ДополнительныеСвойства.Вставить("ЗаписьРазрешена");
	//	//Запись 								= Набор.Добавить();
	//	//Запись.ПериодНачисления 				= ПериодНачисления;
	//	//Запись.Район							= Район;
	//	//Запись.ВидОперацииНачисления			= Перечисления.энргВидыОперацийНачисления.НачислениеПени;
	//	//Набор.Записать();
	//КонецЕсли; 	 
	
КонецПроцедуры

Процедура ДобавитьСтрокиНачисленияНППоФормуле(ТЗДанныеСуточнойВедомости, ОписаниеУслуг, Набор, ПараметрыРасчета)
	
	ТипыРасходов 									= энргНачисления.ТипыРасходовВФормулахРасчета();

	Для Каждого СтрокаФормулы Из ОписаниеУслуг Цикл			
		ТекФормулаОбъемУслуги	 					= СтрокаФормулы.ФормулаРасчета;
		
		Если Не ЗначениеЗаполнено(ТекФормулаОбъемУслуги) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("ОбъектРасчета",		СтрокаФормулы.ОбъектРасчета);
		Отбор.Вставить("УзелУчета",			СтрокаФормулы.УзелПриборУчета);
		Отбор.Вставить("ПериодНачисления",	СтрокаФормулы.ПериодНачисления);
		мТекСтрокДанныеСуточнойВедомости = ТЗДанныеСуточнойВедомости.НайтиСтроки(Отбор);
		
		Отбор.ПериодНачисления	= ДобавитьМесяц(СтрокаФормулы.ПериодНачисления, -1);
		мПредСтрокДанныеСуточнойВедомости = ТЗДанныеСуточнойВедомости.НайтиСтроки(Отбор);
		
		
		ТекФормулаОбъемУслугиПотребленный			= СтрокаФормулы.ФормулаРасчета;
		ПараметрыФормулы 							= СтрокаФормулы.ПараметрыФормулы;		
		ПараметрыРасчетаФормулы                     = СтрокаФормулы.ПараметрыРасчетаФормулы;

		Для Каждого стр Из мПредСтрокДанныеСуточнойВедомости Цикл
			КлючВидПараметра 					= XMLСтрока(стр.ВидПараметра); 
			КлючШкалы 							= XMLСтрока(стр.Шкала);
			Ключ 								= Новый Структура("ТипРасхода, Шкала, ВидПараметра", ТипыРасходов.РасходПоШкалеЗаПредПериод,КлючШкалы, КлючВидПараметра); 
			ТекФормулаОбъемУслуги 				= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОтформатироватьЧисловойПараметр(стр.ЗначениеПараметра));
			ТекФормулаОбъемУслугиПотребленный 	= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОтформатироватьЧисловойПараметр(стр.ЗначениеПараметра));
			
			ПараметрыРасчетаФормулы.КолвоЧасовШтатнойРаботыПУПред = стр.ВНР;
		КонецЦикла;
			
		
		Для Каждого стр Из мТекСтрокДанныеСуточнойВедомости Цикл
			КлючВидПараметра 					= XMLСтрока(стр.ВидПараметра); 
			КлючШкалы 							= XMLСтрока(стр.Шкала);
			Ключ 								= Новый Структура("ТипРасхода, Шкала, ВидПараметра", ТипыРасходов.РасходИзмерителяПоШкале,КлючШкалы, КлючВидПараметра); 
			ТекФормулаОбъемУслуги 				= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОтформатироватьЧисловойПараметр(стр.ЗначениеПараметра));
			ТекФормулаОбъемУслугиПотребленный 	= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОтформатироватьЧисловойПараметр(стр.ЗначениеПараметра));
			
			//Если не было данных за предыдущий период
			Ключ 								= Новый Структура("ТипРасхода, Шкала, ВидПараметра", ТипыРасходов.РасходПоШкалеЗаПредПериод,КлючШкалы, КлючВидПараметра); 
			ТекФормулаОбъемУслуги 				= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",0);
			ТекФормулаОбъемУслугиПотребленный 	= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",0);
			//Если не было данных за предыдущий период
			
			Если ЗначениеЗаполнено(стр.Плотность) Тогда
				ПараметрыРасчетаФормулы.ПлотностьВоды = стр.Плотность;
			КонецЕсли;
			
			ПараметрыРасчетаФормулы.КоличествоЧасовШтатнойРаботыПУ = стр.ВНР;
		КонецЦикла;

		

		//Для Каждого ПараметрФормулы Из НормативыПоУслугам Цикл			
		//	Ключ 									= Новый Структура("ТипРасхода, Услуга", ТипРасходаНорматив, XMLСтрока(ПараметрФормулы.Ключ));			
		//	ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//	ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//КонецЦикла;
		//
		//Ключ 									= ТипРасходаНормативНаПодогрев;	
		//ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрыРасчетаФормулы.НормативНаПодогрев);
		//ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрыРасчетаФормулы.НормативНаПодогрев);
		//
		//Ключ 									= ТипРасходаТемпературныйКоэффициентПоВоздуху;	
		//ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрыРасчетаФормулы.ТемпературныйКоэффициентПоВоздуху);
		//ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрыРасчетаФормулы.ТемпературныйКоэффициентПоВоздуху);
		//
		//
		
		Для каждого КлючЗначение из ПараметрыРасчета Цикл
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(КлючЗначение.Ключ) + "]",ОтформатироватьЧисловойПараметр(ПараметрыРасчетаФормулы[КлючЗначение.Ключ]));
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(КлючЗначение.Ключ) + "]",ОтформатироватьЧисловойПараметр(ПараметрыРасчетаФормулы[КлючЗначение.Ключ]));	
		КонецЦикла;	
		
		Для каждого значениеПеречисления из Метаданные.Перечисления.энргСпособНачислений.ЗначенияПеречисления Цикл
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(значениеПеречисления.Имя) + "]","Перечисления.энргСпособНачислений." + значениеПеречисления.Имя);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(значениеПеречисления.Имя) + "]","Перечисления.энргСпособНачислений." + значениеПеречисления.Имя);
		КонецЦикла;
		
		//ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги," ","");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,Символы.НПП,"");
		РезультатПоФормуламОбъемУслуги				= 0;
		ТекФормулаОбъемУслуги 						= СтрЗаменить(ТекФормулаОбъемУслуги,"[Результат] =","РезультатПоФормуламОбъемУслуги=");
		СпособНачисления = Неопределено;
		Выполнить ТекФормулаОбъемУслуги;
		
		//ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный," ","");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,Символы.НПП,"");
		РезультатПоФормуламОбъемУслугиПотребленный	= 0;
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[Результат] =","РезультатПоФормуламОбъемУслугиПотребленный=");
		Выполнить ТекФормулаОбъемУслугиПотребленный;
		
		//Если РезультатПоФормуламОбъемУслуги = 0 И РезультатПоФормуламОбъемУслугиПотребленный = 0 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		СтрокаНабора 								= Набор.добавить();
		СтрокаНабора.Период 						= СтрокаФормулы.КонецПериода-1;
		СтрокаНабора.Организация 					= СтрокаФормулы.Организация;
		СтрокаНабора.Район 							= СтрокаФормулы.Район;
		СтрокаНабора.МКД 							= СтрокаФормулы.МКД;
		СтрокаНабора.ОбъектРасчета 					= СтрокаФормулы.ОбъектРасчета;
		СтрокаНабора.Услуга 						= СтрокаФормулы.Услуга;
		СтрокаНабора.ТочкаУчета 					= СтрокаФормулы.ТочкаУчета;
		СтрокаНабора.ВидНачисления 					= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.СпособНачисления 				= СпособНачисления;
		СтрокаНабора.ПриборУчета 					= СтрокаФормулы.УзелПриборУчета;
		СтрокаНабора.ТарифнаяЗона 					= Справочники.энргТарифныеЗоны.ПустаяСсылка();
		СтрокаНабора.Поставщик 						= СтрокаФормулы.Поставщик;
		СтрокаНабора.ПериодРасчета 					= СтрокаФормулы.ПериодНачисления;
		СтрокаНабора.ПериодНачисления 				= СтрокаФормулы.ПериодНачисления;
		СтрокаНабора.ОбъемУслуги 					= РезультатПоФормуламОбъемУслуги;		
		СтрокаНабора.ОбъемУслугиПотребленный 		= РезультатПоФормуламОбъемУслугиПотребленный;		
		СтрокаНабора.НачалоПериода 					= СтрокаФормулы.НачалоПериода;
		СтрокаНабора.КонецПериода 					= СтрокаФормулы.КонецПериода;
		СтрокаНабора.Регистратор 					= СтрокаФормулы.ДокументСсылка;
		СтрокаНабора.Договор						= СтрокаФормулы.Договор;
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаФормулы);
	КонецЦикла;
	
КонецПроцедуры

Процедура СнятьСредниеНачисленияНП(Организация, ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие,Договор,Документ) Экспорт
	
	перем ТекМКД,ДокументОбъект; 
	
	Если не ЗначениеЗаполнено(ПериодНачисления) или не ЗначениеЗаполнено(Район) тогда 
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	ПрочитатьНеСписанныйСреднийНП(МВТ,ПериодНачисления,Организация,Район,МКД,ИсключаяОтдельностоящие,НачалоПериодаРасчета,КонецПериодаРасчета);	
	результатЗапроса 								= РезультатЗапросаПерерасчетСреднего(МВТ,Организация, ПериодНачисления, КонецПериодаРасчета-1,Район,МКД); 	
	
	
	УправлящаяВыборка								= РезультатЗапроса[0].выбрать(); 	
	Выборка 										= результатЗапроса[1].Выбрать();
	ЕстьСледующийВыборка 							= Выборка.Следующий();
	
	ВидОперации 									= Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет;
	Сч 												= 0;
	
	Набор 											= Неопределено;
	НаборНачисленныйСредний 						= Неопределено;
	НаборВыполненные 								= Неопределено;
	
	ВидНачисленияПерерасчет 						= Перечисления.энргВидыНачислений.Перерасчет;
	
	Если Выборка.Количество() = 0 Тогда				
		ВыборкаДокументыОтменить 					= РезультатОтменитьСнятьСредниеНачисления(ПериодНачисления,Организация,Район,МКД,ИсключаяОтдельностоящие,НачалоПериодаРасчета,КонецПериодаРасчета);
		Пока ВыборкаДокументыОтменить.Следующий() Цикл
			ДокументОбъектОтменить					= ВыборкаДокументыОтменить.Ссылка.ПолучитьОбъект();
			ДокументОбъектОтменить.УстановитьПометкуУдаления(Истина);
		КонецЦикла; 		
	КонецЕсли;
	Ошибки 											= "";
	
	Пока УправлящаяВыборка.следующий() цикл
		Если ТипЗнч(Документ) = Тип("Структура") И  Документ.Свойство("ОбъемНачислений") Тогда
			НаборНачисленныйСредний 				= Неопределено;
			НаборВыполненные 						= Неопределено;
			Набор 									= Документ.ОбъемНачислений;
		ИначеЕсли Документ = Неопределено тогда
			Если Не ТекМКД = УправлящаяВыборка.МКД тогда 				
				Если Не ТекМКД = Неопределено Тогда					
					Попытка
						Если ДокументОбъект<>Неопределено тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",						Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
							ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);										
						КонецЕсли;
						
						Набор.ДополнительныеСвойства.Вставить("Организация",				Организация);
						Набор.ДополнительныеСвойства.Вставить("Район",						Район);
						Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",			ПериодНачисления);
						Набор.ДополнительныеСвойства.Вставить("МКД",						ТекМКД);
						Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",			КонецПериодаРасчета-1);
						Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний",	НаборНачисленныйСредний);
						Набор.Записать(Ложь);
						НаборНачисленныйСредний.Записать(Ложь);
						
						Если НЕ НаборВыполненные = Неопределено Тогда
							НаборВыполненные.Записать(НаборВыполненные.ДополнительныеСвойства.Замещать);
						КонецЕсли;
						
						ЗафиксироватьТранзакцию();
					Исключение
						ОтменитьТранзакцию();      		
						ИнформацияОбОшибке  					= ИнформацияОбОшибке();
						Ошибки 									= Ошибки +
						Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
					КонецПопытки;
				КонецЕсли;
				НачатьТранзакцию();
				ДокументСсылка 									= УправлящаяВыборка.ДокументПерерасчета;
				ПометкаУдаления 								= УправлящаяВыборка.ДокументПерерасчетаПометкаУдаления;
				ДокументОбъект  								= Неопределено;
				
				Если НЕ ЗначениеЗаполнено(ДокументСсылка)  Тогда
					ДокументСсылка 								= Документы.бестПерерасчетНП.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  							= Документы.бестПерерасчетНП.СоздатьДокумент();
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
					ДокументОбъект.район  						= Район;
					ДокументОбъект.МКД							= УправлящаяВыборка.МКД;
					ДокументОбъект.Дата							= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 					= Организация;
					ДокументОбъект.ВидОперации 					= Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет;
					ДокументОбъект.ПериодНачисления 			= ПериодНачисления;
					ДокументОбъект.ПричинаПерерасчета 			= Справочники.бестПричиныПерерасчета.ПерерасчетСредних;					
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект  							= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 				= Ложь;
				КонецЕсли;
				
				НаборНачисленныйСредний 								= РегистрыНакопления.бестНачисленныйСреднийОбъемНП.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументСсылка);
				Если ДокументОбъект = Неопределено Тогда
					НаборНачисленныйСредний.Прочитать();
					НаборНачисленныйСредний.Очистить();
				КонецЕсли;					
				
				Если ДокументОбъект = Неопределено Тогда
					НаборНачисленныйСредний.Записать();
				КонецЕсли;
				
				Набор											= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);				
				
				Набор.Прочитать();
				Набор.Очистить();
				
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
				КонецЕсли;
				
			КонецЕсли;
		иначе
			Если ДокументОбъект = Неопределено Тогда
				НачатьТранзакцию();
				ДокументСсылка									= Документ.Ссылка;
				ДокументОбъект 									= ДокументСсылка.ПолучитьОбъект();
				
				НаборНачисленныйСредний 						= РегистрыНакопления.бестНачисленныйСреднийОбъемНП.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборНачисленныйСредний.Очистить();
				
				Набор											= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				Набор.Очистить();
				
			КонецЕсли;
		КонецЕсли;	
		
		ОсталосьСписатьОбъем 									= УправлящаяВыборка.ОбъемНадоСписать;
		ОсталосьСписатьОбъемПотребленный						= УправлящаяВыборка.ОбъемПотребленныйНадоСписать;
		
		Пока УправлящаяВыборка.Район = Выборка.Район
			И УправлящаяВыборка.МКД = Выборка.МКД
			И УправлящаяВыборка.ТочкаУчета = Выборка.ТочкаУчета
			И УправлящаяВыборка.Услуга = Выборка.Услуга
			И УправлящаяВыборка.ОбъектРасчета = Выборка.ОбъектРасчета
			И УправлящаяВыборка.ПриборУчета = Выборка.ПриборУчета
			И УправлящаяВыборка.Шкала = Выборка.Шкала
			И УправлящаяВыборка.ТарифнаяЗона = Выборка.ТарифнаяЗона
			И УправлящаяВыборка.Поставщик = Выборка.Поставщик
			И ЕстьСледующийВыборка Цикл
			
			Если НЕ Выборка.ОбъемНадоСписать = 0 ИЛИ НЕ Выборка.ОбъемПотребленныйНадоСписать = 0 Тогда
				ЗначениеТарифа 									= Выборка.ЗначениеТарифа;			
				СтрокаНабора 									= НаборНачисленныйСредний.добавитьРасход();
				ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
				СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП - 1;
				СтрокаНабора.Организация 						= Организация;
				СтрокаНабора.МКД								= МКД;
			КонецЕсли;
			
			//СписываемОбъем 									= Мин(ОсталосьСписатьОбъем, Выборка.ОбъемУслуги);
			//СписываемОбъемПотребленный						= Мин(ОсталосьСписатьОбъемПотребленный, Выборка.ОбъемУслугиПотребленный);
			//Если НЕ СписываемОбъем = 0 ИЛИ НЕ СписываемОбъемПотребленный = 0 Тогда
				
				СтрокаНабора 							= Набор.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
				СтрокаНабора.Организация 					= Организация;
				СтрокаНабора.ВидНачисления 					= ВидНачисленияПерерасчет;
				//СтрокаНабора.ОбъемУслуги 					= -СписываемОбъем;
				//СтрокаНабора.ОбъемУслугиПотребленный 		= -СписываемОбъемПотребленный;
				СтрокаНабора.Договор 						= Выборка.Договор;
				СтрокаНабора.ОбъемУслуги 					= -Выборка.ОбъемУслуги;
				СтрокаНабора.ОбъемУслугиПотребленный 		= -Выборка.ОбъемУслугиПотребленный;
				СтрокаНабора.ПериодРасчета					= ПериодНачисления;
				СтрокаНабора.ПериодНачисления				= Выборка.ПериодНачисления;
				СтрокаНабора.МКД							= МКД;
				
				СтрокаНабора.Сумма		 					= Выборка.ЗначениеТарифа*СтрокаНабора.ОбъемУслуги;				
				
				//ОсталосьСписатьОбъем 						= ОсталосьСписатьОбъем - СписываемОбъем;
				//ОсталосьСписатьОбъемПотребленный 			= ОсталосьСписатьОбъемПотребленный - СписываемОбъемПотребленный;	
			//КонецЕсли;			
			
			ЕстьСледующийВыборка  							= Выборка.Следующий();
		КонецЦикла; 		
		
		ТекМКД												= УправлящаяВыборка.МКД;
		Сч 													= Сч + 1;
	КонецЦикла;	
	
	Если Не ТекМКД = Неопределено И ТипЗнч(Документ) <> Тип("Структура") Тогда					
		Попытка
			Если ДокументОбъект<>Неопределено тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",						Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
				ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);										
			КонецЕсли;
			
			Если Набор.Количество() > 0 Тогда
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.ДополнительныеСвойства.Вставить("МКД",				ТекМКД);
				Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);
				НаборНачисленныйСредний.Записать(Ложь);
				
			КонецЕсли;			
			Набор.Записать(Ложь);
			Если НЕ НаборВыполненные = Неопределено Тогда
				НаборВыполненные.Записать(НаборВыполненные.ДополнительныеСвойства.Замещать);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке  					= ИнформацияОбОшибке();
			Ошибки 									= Ошибки +
			Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;  
	
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьЗакрытьПериода(Организация, ПериодНачисления,Район,МКД) Экспорт 
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 	="ВЫБРАТЬ
	|	энргНачисление.Ссылка
	|ИЗ
	|	Документ.энргНачисление КАК энргНачисление
	|ГДЕ
	|	энргНачисление.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачисление.МКД = &МКД
	|	И энргНачисление.Район = &Район
	|	И энргНачисление.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеМКД.Ссылка
	|ИЗ
	|	Документ.энргНачислениеМКД КАК энргНачислениеМКД
	|ГДЕ
	|	энргНачислениеМКД.Район = &Район
	|	И энргНачислениеМКД.Проведен
	|	И энргНачислениеМКД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Проведен
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПерерасчет.МКД = &МКД
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаПоказаний)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	энргЗакрытиеПериода.Проведен
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	
	Если МКД = Неопределено тогда
		Текст 			= СтрЗаменить(Текст,"И энргНачисление.МКД = &МКД","");
		Текст			= СтрЗаменить(Текст,"И энргПерерасчет.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 		= Текст;
	Результат  			= Запрос.Выполнить();
	Выборка 			= Результат.Выбрать();
	Пока Выборка.Следующий() цикл  		
		ДокОбъект  		= Выборка.ссылка.получитьОбъект();
		ДокОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",истина);
		ДокОбъект.УстановитьПометкуУдаления(Истина);		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗакрытьПериодДляРедактирования(ПериодНачисления,Район,МКД) Экспорт  
	
	Если МКД <> Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ДокуметЗакрытия 				= ДокуметЗакрытияПериода(ПериодНачисления,Район);
	
	Если не ЗначениеЗаполнено(ДокуметЗакрытия) тогда
		ДокументОбъект 				= Документы.энргЗакрытиеПериода.СоздатьДокумент();		
	иначе
		ДокументОбъект 				= ДокуметЗакрытия.ПолучитьОбъект();  
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",Истина);
	ДокументОбъект.Район 			= Район;
	ДокументОбъект.ПериодНачисления = ПериодНачисления;
	ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);	
	
КонецПроцедуры

Процедура СозданиеРеализации(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие,Договор,Документ) Экспорт 
	Обработки.бестФормированиеРеализацийУслуг.СформироватьРеализацииЮЛ(Организация,ПериодНачисления,Район,МКД,,,ИсключаяОтдельностоящие);
	Обработки.бестЗагрузкаРеестровОРЭМ.СформироватьРеализацииОРЭМ(Организация,ПериодНачисления,Район,МКД,,,ИсключаяОтдельностоящие);
КонецПроцедуры

Процедура НачисленияПоСхемамСтруктурыСети(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие, Договор,Документ) Экспорт
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	СпособНачисленияПоПриборам						= Перечисления.энргСпособНачислений.ПоПриборам;
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	РезультатЗапроса 								= ПолучитьРезультатЗапросаСхемыСтруктурыСети(ПериодНачисления,Организация,Район,ИсключаяОтдельностоящие, МКД,НачалоПериодаРасчета,КонецПериодаРасчета);
	
	
	ВыборкаДетальныеЗаписи 							= РезультатЗапроса.Выбрать();
	
	ТекСтруктура 									= Неопределено;
	ТекУслуга                                       = Неопределено;
	ТекМКД 										= Неопределено;
	НаборЗаписей 									= Неопределено;
	ДокументОбъект 									= Неопределено;
	СтрокаНабора 									= Неопределено;
	ТекСтавкаНДС 									= Неопределено;
	ТекНДСВнутри 									= Неопределено;
	ТекЗначениеТарифа 								= Неопределено;
	
	ОбъемыРассчитанныхСтруктур 						= Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если (ТекСтруктура <> ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент ИЛИ ТекУслуга <> ВыборкаДетальныеЗаписи.Услуга) и СтрокаНабора <> Неопределено Тогда
			СтрокаНабора.ОбъемУслуги = ОбъемыРассчитанныхСтруктур[ТекСтруктура][ТекУслуга];
			Если ЗначениеЗаполнено(ТекЗначениеТарифа) и ЗначениеЗаполнено(ТекСтавкаНДС) Тогда
				Если ТекНДСВнутри Тогда 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа - СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
				Иначе 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа;
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / 100
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТекМКД = ВыборкаДетальныеЗаписи.МКД Тогда
			
			Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
				
				НачатьТранзакцию();
				
				НаборОтложенныхДвижений	= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
				НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
				НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
				НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
				НаборОтложенныхДвижений.Отбор.МКД.Установить(ТекМКД);
				
				НаборОтложенныхДвижений.Записать();					
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
				НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
				НаборЗаписей.ДополнительныеСвойства.Вставить("МКД",    				ТекМКД);
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
				НаборЗаписей.Записать();
				
				Если Не ДокументОбъект = Неопределено Тогда
					ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
					ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
				КонецЕсли; 					
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
			ДокументСсылка 							= ВыборкаДетальныеЗаписи.ДокументНачисления;			
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
				ДокументСсылка 						= Документы.бестНачислениеПоСхемамСтруктурыСети.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект 						= Документы.бестНачислениеПоСхемамСтруктурыСети.СоздатьДокумент();
				ДокументОбъект.Район 				= Район;
				ДокументОбъект.МКД 					= ВыборкаДетальныеЗаписи.МКД;
				ДокументОбъект.Дата 				= ГраницыПериода.ЗавершениеОП-1;
				ДокументОбъект.Организация			= Организация;
				ДокументОбъект.ПериодНачисления     = ПериодНачисления;
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
				
			Иначе
				ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления 		= Ложь;
				
				НаборЗаписей 						= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборЗаписей.Записать(); // очищаем набор записей				
			КонецЕсли;
			
			НаборЗаписей 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			
		КонецЕсли;
		
		
		Если  ТекСтруктура <> ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент Тогда
			
			
			ОбъемУжеРассчитанныхЭлементов 	= ОбъемыРассчитанныхСтруктур.Получить(ВыборкаДетальныеЗаписи.СтруктураСетиУчаствующаяВСхеме);
			Если ОбъемУжеРассчитанныхЭлементов <> Неопределено Тогда
				ОбъемУжеРассчитанныхЭлементовУслуга = ОбъемУжеРассчитанныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Услуга);
				Если ОбъемУжеРассчитанныхЭлементовУслуга <> Неопределено Тогда
					Объем  						= ?(ВыборкаДетальныеЗаписи.ВычитатьЭлемент, -ОбъемУжеРассчитанныхЭлементовУслуга, ОбъемУжеРассчитанныхЭлементовУслуга);
				Иначе
					Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
				КонецЕсли;
			Иначе
				Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
			КонецЕсли;
			ОбъемыРассчитанныхСтруктурУслуга = Новый Соответствие;
			ОбъемыРассчитанныхСтруктурУслуга.Вставить(ВыборкаДетальныеЗаписи.Услуга, Объем);
			ОбъемыРассчитанныхСтруктур.Вставить(ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент, ОбъемыРассчитанныхСтруктурУслуга);
			СтрокаНабора 		= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
			СтрокаНабора.Период = КонецПериодаРасчета-1;
			
		ИначеЕсли ТекУслуга <> ВыборкаДетальныеЗаписи.Услуга Тогда
			
			ОбъемУжеРассчитанныхЭлементов 	= ОбъемыРассчитанныхСтруктур.Получить(ВыборкаДетальныеЗаписи.СтруктураСетиУчаствующаяВСхеме);
			Если ОбъемУжеРассчитанныхЭлементов <> Неопределено Тогда
				ОбъемУжеРассчитанныхЭлементовУслуга = ОбъемУжеРассчитанныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Услуга);
				Если ОбъемУжеРассчитанныхЭлементовУслуга <> Неопределено Тогда
					Объем  						= ?(ВыборкаДетальныеЗаписи.ВычитатьЭлемент, -ОбъемУжеРассчитанныхЭлементовУслуга, ОбъемУжеРассчитанныхЭлементовУслуга);
				Иначе
					Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
				КонецЕсли;
			Иначе
				Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
			КонецЕсли;
			ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент].Вставить(ВыборкаДетальныеЗаписи.Услуга, Объем);
			СтрокаНабора 		= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
			СтрокаНабора.Период = КонецПериодаРасчета-1;
			
		Иначе
			
			ОбъемУжеРассчитанныхЭлементов = ОбъемыРассчитанныхСтруктур.Получить(ВыборкаДетальныеЗаписи.СтруктураСетиУчаствующаяВСхеме);
			Если ОбъемУжеРассчитанныхЭлементов <> Неопределено Тогда
				ОбъемУжеРассчитанныхЭлементовУслуга = ОбъемУжеРассчитанныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Услуга);
				Если ОбъемУжеРассчитанныхЭлементовУслуга <> Неопределено Тогда
					ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга]  = ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга] + ?(ВыборкаДетальныеЗаписи.ВычитатьЭлемент, -ОбъемУжеРассчитанныхЭлементовУслуга, ОбъемУжеРассчитанныхЭлементовУслуга);
				Иначе
					ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга]  = ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга] + ВыборкаДетальныеЗаписи.ОбъемУслуги;
				КонецЕсли;	
			Иначе
				ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга]  = ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга] + ВыборкаДетальныеЗаписи.ОбъемУслуги;
			КонецЕсли;
		КонецЕсли;
		
		ТекМКД 				= ВыборкаДетальныеЗаписи.МКД;
		ТекСтруктура 		= ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент;
		ТекУслуга			= ВыборкаДетальныеЗаписи.Услуга;
		ТекСтавкаНДС 		= ВыборкаДетальныеЗаписи.СтавкаНДС;
		ТекНДСВнутри 		= ВыборкаДетальныеЗаписи.НДСВнутри;
		ТекЗначениеТарифа   = ВыборкаДетальныеЗаписи.ЗначениеТарифа;
	КонецЦикла;
	
	Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
		Если СтрокаНабора <> Неопределено Тогда
			СтрокаНабора.ОбъемУслуги = ОбъемыРассчитанныхСтруктур[ТекСтруктура][ТекУслуга];
			Если ЗначениеЗаполнено(ТекЗначениеТарифа) и ЗначениеЗаполнено(ТекСтавкаНДС) Тогда
				Если ТекНДСВнутри Тогда 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа - СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
				Иначе 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа;
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / 100
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НачатьТранзакцию();
		
		НаборОтложенныхДвижений	= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
		НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
		НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
		НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
		НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
		НаборОтложенныхДвижений.Отбор.МКД.Установить(ТекМКД);
		
		НаборОтложенныхДвижений.Записать();					
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
		НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
		НаборЗаписей.ДополнительныеСвойства.Вставить("МКД", 	   			ТекМКД);
		НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
		НаборЗаписей.Записать();
		
		Если Не ДокументОбъект = Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
			ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 					
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнительныеНачисленияЮЛ(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие, Договор,Документ) Экспорт
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	СпособНачисленияПоПриборам						= Перечисления.энргСпособНачислений.ПоПриборам;
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	РезультатЗапроса 								= ПолучитьРезультатЗапросаДополнительныеНачисленияЮЛ(ПериодНачисления,Организация,Район,ИсключаяОтдельностоящие, МКД,НачалоПериодаРасчета,КонецПериодаРасчета);
	
	
	ВыборкаДетальныеЗаписи 		= РезультатЗапроса[3].Выбрать();
	ВыборкаПометитьНаУдаление	= РезультатЗапроса[4].Выбрать();
	
	ТекМКД	 										= Неопределено;
	НаборЗаписей 									= Неопределено;
	ДокументОбъект 									= Неопределено;
	
	Пока ВыборкаПометитьНаУдаление.Следующий() Цикл
		ДокументСсылка 						= ВыборкаПометитьНаУдаление.ДокументНачисления;
		ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления 		= Истина;
		ДокументОбъект.Записать();
	КонецЦикла;	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ТекМКД = ВыборкаДетальныеЗаписи.МКД Тогда
			
			Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
				
				НачатьТранзакцию();
				
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
				НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
				НаборЗаписей.ДополнительныеСвойства.Вставить("МКД",    				ТекМКД);
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
				НаборЗаписей.Записать();
				
				Если Не ДокументОбъект = Неопределено Тогда
					ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
					ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
				КонецЕсли; 					
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
			ДокументСсылка 							= ВыборкаДетальныеЗаписи.ДокументНачисления;			
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
				ДокументСсылка 						= Документы.бестДополнительныеНачисления.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект 						= Документы.бестДополнительныеНачисления.СоздатьДокумент();
				ДокументОбъект.Район 				= Район;
				ДокументОбъект.МКД	 				= ВыборкаДетальныеЗаписи.МКД;
				ДокументОбъект.Дата 				= ГраницыПериода.ЗавершениеОП-1;
				ДокументОбъект.Организация			= Организация;
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
				
			Иначе
				ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления 		= Ложь;
				
				НаборЗаписей 						= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборЗаписей.Записать(); // очищаем набор записей				
			КонецЕсли;
			
			НаборЗаписей 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			
		КонецЕсли;
		
		СтрокаНабора 		= НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
		СтрокаНабора.Период = ГраницыПериода.ЗавершениеОП-1;
		
		ТекМКД 			= ВыборкаДетальныеЗаписи.МКД;
		
	КонецЦикла;
	
	
	Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
		НачатьТранзакцию();					
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
		НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
		НаборЗаписей.ДополнительныеСвойства.Вставить("МКД",    				ТекМКД);
		НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
		НаборЗаписей.Записать();
		
		Если Не ДокументОбъект = Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
			ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 					
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбщиеПроцедурыИФункции

Процедура ВспомогательныеДанныеНачисленияНП(МВТ,Организация,ПериодНачисления,Район,ИсключаяОтдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	 	
	
	
	Запрос.УстановитьПараметр("НачалоВеденияУчета",		Константы.энргДатаНачалаВеденияУчета.Получить());	
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаМинусСекунда",	НачалоПериодаРасчета - 1);	
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериодаРасчетаРегистр",	КонецПериодаРасчета-1);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 
	Запрос.УстановитьПараметр("Организация",			Организация);	 
	Запрос.УстановитьПараметр("Район",					Район);	 
	Запрос.УстановитьПараметр("ДнейВПериоде",			ДнейВПериоде );
	Запрос.УстановитьПараметр("ПериодНовогоТарифа",		ПериодНовогоТарифа); 
	Запрос.УстановитьПараметр("НачалоПредПериодаРасчета",ДобавитьМесяц(НачалоПериодаРасчета, -1));	
	Запрос.УстановитьПараметр("ПроектнаяТемператураПоУмолчанию", Константы.бестПроектнаяТемператураНаружногоВоздухаПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("ТемператураВнутриПомещенияПоУмолчанию", Константы.бестТемператураВнутриПомещенияПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("МКД",					МКД);
	Запрос.УстановитьПараметр("ИспользоватьДанныеДляРасчетаТепловойЭнергии",					Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ"));
	
	
	Запрос.Текст 	= ТекстЗапросаВспомогательныеДанныеНачисления(ИсключаяОтдельностоящие, МКД, Договор);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьСтабильныеПериодыНП(МВТ)  
	
	Текст 							= ТекстПолучитьСтабильныеПериоды();
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачалоВеденияУчета", Константы.энргДатаНачалаВеденияУчета.Получить());
	Запрос.УстановитьПараметр("ТемператураВнутриПомещенияПоУмолчанию", Константы.бестТемператураВнутриПомещенияПоУмолчанию.Получить());
	
	Запрос.МенеджерВременныхТаблиц	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчетаНП(МВТ,РасчетПоФормуле,ЭтоПерерасчет)
	
	Текст 							= ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле);
	Запрос  						= Новый Запрос(Текст); 	
	Запрос.УстановитьПараметр("ПроектнаяТемператураПоУмолчанию", Константы.бестПроектнаяТемператураНаружногоВоздухаПоУмолчанию.Получить());
	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,РасчетПоФормуле); 
	
	Текст  							= ТекстРассчитатьИндивидуальныйОбъемПотребленияНП();
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("РасчетПоФормуле",РасчетПоФормуле);
	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ОтформатироватьЧисловойПараметр(Параметр)
	Если ЗначениеЗаполнено(Параметр) Тогда
		Возврат СтрЗаменить(Строка(Параметр),",",".");
	Иначе
		Возврат	"0";
	КонецЕсли;
КонецФункции

#КонецОбласти 

#Область ТекстЗапросов

Функция ТекстЗапросаВспомогательныеДанныеНачисления(ИсключаяОтдельностоящие, МКД, Договор)
	Текст =  
	"ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Организация КАК Организация,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Район КАК Район,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Коэффициент КАК Коэффициент,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ЗначенияПовышающихКоэффициентов
	|ИЗ
	|	РегистрСведений.энгрЗначенияПовышающихКоэффициентов.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энгрЗначенияПовышающихКоэффициентовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ТипНачисления КАК ТН_Норматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления В (ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления), ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОтдельностояющиеОбъекты))) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНормаСкоростиДвиженияВодыСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргНормаСкоростиДвиженияВодыСрезПоследних.СкоростьДвижения КАК СкоростьДвижения
	|ПОМЕСТИТЬ НормаСкоростиДвиженияВоды
	|ИЗ
	|	РегистрСведений.энргНормаСкоростиДвиженияВоды.СрезПоследних(&КонецПериодаРасчетаРегистр, Организация = &Организация) КАК энргНормаСкоростиДвиженияВодыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	НастройкаСезонностиУслуг.МКД КАК Строение,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	|	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги
	|ПОМЕСТИТЬ ГарантированныеОбъемы
	|ИЗ
	|	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Месяц = МЕСЯЦ(&ПериодНачисления)) КАК бестГарантированныеОбъемыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(&КонецПериодаРасчетаРегистр, НеНачислять И МКД = &МКД) КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТемператураИсточникаСрезПоследних.Организация КАК Организация,
	|	бестТемператураИсточникаСрезПоследних.Район КАК Район,
	|	бестТемператураИсточникаСрезПоследних.Источник КАК Источник,
	|	бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника
	|ПОМЕСТИТЬ ТемпературыИсточника
	|ИЗ
	|	РегистрСведений.бестТемператураИсточника.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестТемператураИсточникаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	энргВидыУслуг.СезонностьНастраивается КАК СезонностьНастраивается
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА &НачалоПериодаРасчета
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ &КонецПериодаРасчета
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета)
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|						&НачалоПериодаРасчета,
	|						Организация = &Организация
	|							И Район = &Район) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(
	|					&ПериодНачисления,
	|					Организация = &Организация
	|						И Район = &Район
	|						И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргСпособыРасчетаПоНаправлениямСрезПоследних
	|			ПО энргВидыУслуг.Ссылка = энргСпособыРасчетаПоНаправлениямСрезПоследних.Услуга
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (ВложенныйЗапрос.НачалоФактическогоПериода МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	|					ИЛИ ВложенныйЗапрос.КонецФактическогоПериода МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|					И ЕСТЬNULL(энргСпособыРасчетаПоНаправлениямСрезПоследних.НачислятьЗаПолныйМесяц, ЛОЖЬ)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифов.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа,
	|	энргЗначенияТарифов.Регистратор КАК Регистратор,
	|	ДОБАВИТЬКДАТЕ(энргЗначенияТарифов.Период, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|ПОМЕСТИТЬ ЗначенияТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргЗначенияТарифовСрезПоследних
	|		ПО энргЗначенияТарифов.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И энргЗначенияТарифов.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|			И (энргЗначенияТарифов.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.НомерПозиции КАК НомерПозиции,
	|	бестПредоставленныеПоказанияНП.Разделитель КАК Разделитель,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора КАК ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор КАК ДокРегистратор,
	|	бестПредоставленныеПоказанияНП.Показания КАК Показания,
	|	бестПредоставленныеПоказанияНП.ВСрок КАК ВСрок
	|ПОМЕСТИТЬ НаборПредоставленныхПоказаний
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ)
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.МКД КАК МКД,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания,
	|	НаборПредоставленныхПоказаний.ВСрок КАК ВСрок
	|ПОМЕСТИТЬ НаборПредоставленныхПоказанийПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказаний КАК НаборПредоставленныхПоказаний
	|ГДЕ
	|	НаборПредоставленныхПоказаний.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезНП.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезНП.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезНП.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезНП.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезНП.Показания КАК Показания,
	|	&НачалоПериодаРасчета КАК Период,
	|	-1 КАК НомерПозиции,
	|	бестМаксимальныеПоказанияСрезНП.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	РегистрСведений.бестМаксимальныеПоказанияСрезНП КАК бестМаксимальныеПоказанияСрезНП
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезНП.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезНП.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|	И бестМаксимальныеПоказанияСрезНП.Район = &Район
	|	И бестМаксимальныеПоказанияСрезНП.МКД = &МКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Показания,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.НомерПозиции,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезНП.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезНП.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезНП.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезНП.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезНП.Показания КАК Показания,
	|	бестМаксимальныеПоказанияСрезНП.ДатаРегистратора КАК ДатаРегистратора,
	|	бестМаксимальныеПоказанияСрезНП.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	РегистрСведений.бестМаксимальныеПоказанияСрезНП КАК бестМаксимальныеПоказанияСрезНП
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезНП.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезНП.ПериодНачисления = &ПериодНачисления
	|	И бестМаксимальныеПоказанияСрезНП.Район = &Район
	|	И бестМаксимальныеПоказанияСрезНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.ОбъектРасчета КАК ОбъектРасчета,
	|	ПоказанияНачало.МКД КАК МКД,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА &КонецПериодаРасчета
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.МКД = ПоказанияКонец.МКД
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|			И ПоказанияНачало.ОбъектРасчета = ПоказанияКонец.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднийОбъемПотребленияНП.Организация КАК Организация,
	|	бестСреднийОбъемПотребленияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСреднийОбъемПотребленияНП.Район КАК Район,
	|	бестСреднийОбъемПотребленияНП.МКД КАК МКД,
	|	бестСреднийОбъемПотребленияНП.Услуга КАК Услуга,
	|	бестСреднийОбъемПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСреднийОбъемПотребленияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестСреднийОбъемПотребленияНП.Шкала КАК Шкала,
	|	бестСреднийОбъемПотребленияНП.Объем КАК СреднийОбъем,
	|	бестСреднийОбъемПотребленияНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ СреднееПотреблениеАбонентов
	|ИЗ
	|	РегистрСведений.бестСреднийОбъемПотребленияНП КАК бестСреднийОбъемПотребленияНП
	|ГДЕ
	|	бестСреднийОбъемПотребленияНП.Организация = &Организация
	|	И бестСреднийОбъемПотребленияНП.ПериодНачисления = &ПериодНачисления
	|	И бестСреднийОбъемПотребленияНП.Район = &Район
	|	И бестСреднийОбъемПотребленияНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериодыМКД.Организация КАК Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район КАК Район,
	|		энргСтабильныеПериодыМКД.МКД КАК МКД,
	|		энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргСтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|	ГДЕ
	|		энргСтабильныеПериодыМКД.Организация = &Организация
	|		И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|		И энргСтабильныеПериодыМКД.Район = &Район
	|		И энргСтабильныеПериодыМКД.МКД = &МКД
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериодыМКД.Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район,
	|		энргСтабильныеПериодыМКД.МКД,
	|		энргСтабильныеПериодыМКД.Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = энргСтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргСтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = энргСтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргСтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериодыМКД.НомерПозиции
	|			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКД.Район = &Район)
	|			И энргСтабильныеПериодыМКД.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКД.Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район,
	|	энргСтабильныеПериодыМКД.МКД,
	|	энргСтабильныеПериодыМКД.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонента) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		бестСтабильныеПериодыНП.Организация КАК Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район КАК Район,
	|		ЛОЖЬ КАК ЧастныйСектор,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.МКД КАК Строение,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|		бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|		МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеПлощади) КАК ПлощадьАбонента,
	|		ВЫБОР
	|			КОГДА бестСтабильныеПериодыНП.Поставщик = бестСтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА бестСтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПлощадьСобственнаяПоставка,
	|		бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|		бестСтабильныеПериодыНП.Договор КАК Договор
	|	ИЗ
	|		(ВЫБРАТЬ
	|			бестСтабильныеПериодыНП.Организация КАК Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район КАК Район,
	|			ЛОЖЬ КАК ЧастныйСектор,
	|			бестСтабильныеПериодыНП.МКД КАК Строение,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|			бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(бестСтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|			бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор КАК Договор
	|		ИЗ
	|			РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|		ГДЕ
	|			бестСтабильныеПериодыНП.Организация = &Организация
	|			И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|			И бестСтабильныеПериодыНП.Район = &Район
	|			И бестСтабильныеПериодыНП.МКД = &МКД
	|			И бестСтабильныеПериодыНП.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бестСтабильныеПериодыНП.Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район,
	|			бестСтабильныеПериодыНП.Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета,
	|			бестСтабильныеПериодыНП.МКД,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение,
	|			бестСтабильныеПериодыНП.ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|			ПО ВложенныйЗапрос.Организация = бестСтабильныеПериодыНП.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = бестСтабильныеПериодыНП.ПериодНачисления
	|				И ВложенныйЗапрос.Район = бестСтабильныеПериодыНП.Район
	|				И ВложенныйЗапрос.Услуга = бестСтабильныеПериодыНП.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = бестСтабильныеПериодыНП.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = бестСтабильныеПериодыНП.НомерПозиции
	|				И (бестСтабильныеПериодыНП.Организация = &Организация)
	|				И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|				И (бестСтабильныеПериодыНП.Район = &Район)
	|				И бестСтабильныеПериодыНП.МКД = &МКД
	|				И ВложенныйЗапрос.Договор = бестСтабильныеПериодыНП.Договор
	|				И ВложенныйЗапрос.ОбъектРасчета = бестСтабильныеПериодыНП.ОбъектРасчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бестСтабильныеПериодыНП.Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район,
	|		бестСтабильныеПериодыНП.Услуга,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.МКД,
	|		ВЫБОР
	|			КОГДА бестСтабильныеПериодыНП.Поставщик = бестСтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА бестСтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		бестСтабильныеПериодыНП.ОбъектРасчета,
	|		бестСтабильныеПериодыНП.Договор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		энргСтабильныеПериоды.Услуга,
	|		МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади),
	|		ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.пустаяссылка),
	|		ЗНАЧЕНИЕ(Справочник.энргдоговорыконтрагентов.пустаяссылка)
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация КАК Организация,
	|			энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|			энргСтабильныеПериоды.Район КАК Район,
	|			энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение КАК Строение,
	|			энргСтабильныеПериоды.Помещение КАК Помещение,
	|			энргСтабильныеПериоды.Услуга КАК Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ГДЕ
	|			энргСтабильныеПериоды.Организация = &Организация
	|			И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|			И энргСтабильныеПериоды.Район = &Район
	|			И энргСтабильныеПериоды.Строение = &МКД
	|			И НЕ энргСтабильныеПериоды.ЧастныйСектор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.ПериодНачисления,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.ЧастныйСектор) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ПО ВложенныйЗапрос.Организация = энргСтабильныеПериоды.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|				И ВложенныйЗапрос.Район = энргСтабильныеПериоды.Район
	|				И ВложенныйЗапрос.Услуга = энргСтабильныеПериоды.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				И (энргСтабильныеПериоды.Организация = &Организация)
	|				И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|				И (энргСтабильныеПериоды.Район = &Район)
	|				И энргСтабильныеПериоды.Строение = &МКД
	|				И ВложенныйЗапрос.Строение = энргСтабильныеПериоды.Строение
	|				И ВложенныйЗапрос.Помещение = энргСтабильныеПериоды.Помещение
	|				И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|	ГДЕ
	|		энргСтабильныеПериоды.Помещение.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.Услуга,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьМОП) КАК ПлощадьМОП,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначенияПлощадейСтроений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначениеПлощадейМКД.Организация КАК Организация,
	|		ЗначениеПлощадейМКД.ПериодНачисления КАК ПериодНачисления,
	|		ЗначениеПлощадейМКД.Район КАК Район,
	|		ЗначениеПлощадейМКД.МКД КАК МКД,
	|		ЗначениеПлощадейМКД.Услуга КАК Услуга,
	|		ЗначениеПлощадейМКД.ПлощадьМОП КАК ПлощадьМОП,
	|		0 КАК ПлощадьАбонентов,
	|		0 КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеПлощадейМКД КАК ЗначениеПлощадейМКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗначениеИндивидуальныхПлощадей.Организация,
	|		ЗначениеИндивидуальныхПлощадей.ПериодНачисления,
	|		ЗначениеИндивидуальныхПлощадей.Район,
	|		ЗначениеИндивидуальныхПлощадей.Строение,
	|		ЗначениеИндивидуальныхПлощадей.Услуга,
	|		0,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьАбонентов,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеИндивидуальныхПлощадей КАК ЗначениеИндивидуальныхПлощадей) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	бестСтабильныеПериодыПриборыУзловУчета.Организация КАК Организация,
	//|	бестСтабильныеПериодыПриборыУзловУчета.ПериодНачисления КАК ПериодНачисления,
	//|	бестСтабильныеПериодыПриборыУзловУчета.Район КАК Район,
	//|	бестСтабильныеПериодыПриборыУзловУчета.МКД КАК МКД,
	//|	бестСтабильныеПериодыПриборыУзловУчета.ОбъектРасчета КАК ОбъектРасчета,
	//|	бестСтабильныеПериодыПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	//|	бестСтабильныеПериодыПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	//|	бестСтабильныеПериодыПриборыУзловУчета.НомерПозиции КАК НомерПозиции,
	//|	бестСтабильныеПериодыПриборыУзловУчета.УзелУчета КАК УзелУчета,
	//|	бестСтабильныеПериодыПриборыУзловУчета.ПриборВведен КАК ПриборВведен,
	//|	бестСтабильныеПериодыПриборыУзловУчета.КоэффициентПУ КАК КоэффициентПУ,
	//|	бестСтабильныеПериодыПриборыУзловУчета.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора
	//|ПОМЕСТИТЬ СтабильныеПериодыПриборыУзловУчета
	//|ИЗ
	//|	РегистрСведений.бестСтабильныеПериодыПриборыУзловУчета КАК бестСтабильныеПериодыПриборыУзловУчета
	//|ГДЕ
	//|	бестСтабильныеПериодыПриборыУзловУчета.Организация = &Организация
	//|	И бестСтабильныеПериодыПриборыУзловУчета.ПериодНачисления = &ПериодНачисления
	//|	И бестСтабильныеПериодыПриборыУзловУчета.Район = &Район
	//|	И бестСтабильныеПериодыПриборыУзловУчета.МКД = &МКД
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтабильныеПериодыШкалыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыШкалыНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыШкалыНП.Район КАК Район,
	|	бестСтабильныеПериодыШкалыНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыШкалыНП.МКД КАК МКД,
	|	бестСтабильныеПериодыШкалыНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСтабильныеПериодыШкалыНП.ПриборУчета КАК ПриборУчета,
	|	бестСтабильныеПериодыШкалыНП.Шкала КАК Шкала,
	|	бестСтабильныеПериодыШкалыНП.НомерПозиции КАК НомерПозиции,
	|	бестСтабильныеПериодыШкалыНП.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыШкалыНП КАК бестСтабильныеПериодыШкалыНП
	|ГДЕ
	|	бестСтабильныеПериодыШкалыНП.Организация = &Организация
	|	И бестСтабильныеПериодыШкалыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыШкалыНП.Район = &Район
	|	И бестСтабильныеПериодыШкалыНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	бестПриборыУзловУчетаНПСрезПоследних.Организация КАК Организация,
	//|	бестПриборыУзловУчетаНПСрезПоследних.Район КАК Район,
	//|	бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	//|	бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	//|	бестПриборыУзловУчетаНПСрезПоследних.УзелУчета КАК УзелУчета,
	//|	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	//|	бестПриборыУзловУчетаНПСрезПоследних.МКД КАК МКД
	//|ПОМЕСТИТЬ ПриборыУзловУчета
	//|ИЗ
	//|	РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	//|			&КонецПериодаРасчетаРегистр,
	//|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД) КАК бестПриборыУзловУчетаНПСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СтабильныеПериодыШкалы.Организация КАК Организация,
	//|	СтабильныеПериодыШкалы.ПериодНачисления КАК ПериодНачисления,
	//|	СтабильныеПериодыШкалы.Район КАК Район,
	//|	СтабильныеПериодыШкалы.ОбъектРасчета КАК ОбъектРасчета,
	//|	СтабильныеПериодыШкалы.МКД КАК МКД,
	//|	СтабильныеПериодыШкалы.ТочкаУчета КАК ТочкаУчета,
	//|	СтабильныеПериодыШкалы.ПриборУчета КАК ПриборУчета,
	//|	СтабильныеПериодыШкалы.Шкала КАК Шкала,
	//|	СтабильныеПериодыШкалы.НомерПозиции КАК НомерПозиции,
	//|	СтабильныеПериодыШкалы.ВидДифференцированности КАК ВидДифференцированности,
	//|	ПриборыУзловУчета.УзелУчета КАК УзелУчета
	//|ПОМЕСТИТЬ СтабильныеПериодыШкалыСУзлом
	//|ИЗ
	//|	СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриборыУзловУчета КАК ПриборыУзловУчета
	//|		ПО СтабильныеПериодыШкалы.Организация = ПриборыУзловУчета.Организация
	//|			И СтабильныеПериодыШкалы.Район = ПриборыУзловУчета.Район
	//|			И СтабильныеПериодыШкалы.ОбъектРасчета = ПриборыУзловУчета.ОбъектРасчета
	//|			И СтабильныеПериодыШкалы.ТочкаУчета = ПриборыУзловУчета.ТочкаУчета
	//|			И СтабильныеПериодыШкалы.ПриборУчета = ПриборыУзловУчета.ПриборУчета
	//|			И СтабильныеПериодыШкалы.МКД = ПриборыУзловУчета.МКД
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета
	|;
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийПредПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.МКД КАК МКД,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийПредПериод.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказанийПредПериод
	|	
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийПредПериод.Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Район,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.МКД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестВыводПриборовУчетаНП.Организация КАК Организация,
	|	бестВыводПриборовУчетаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестВыводПриборовУчетаНП.Район КАК Район,
	|	бестВыводПриборовУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестВыводПриборовУчетаНП.МКД КАК МКД,
	|	бестВыводПриборовУчетаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестВыводПриборовУчетаНП.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	РегистрСведений.бестВыводПриборовУчетаНП КАК бестВыводПриборовУчетаНП
	|ГДЕ
	|	бестВыводПриборовУчетаНП.Организация = &Организация
	|	И бестВыводПриборовУчетаНП.ПериодНачисления = &ПериодНачисления
	|	И бестВыводПриборовУчетаНП.Район = &Район
	|	И бестВыводПриборовУчетаНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоДоговору
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район
	|	И бестПредоставленныеПоказанияНП.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация КАК Организация,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район КАК Район,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература КАК ПроектнаяТемпература
	|ПОМЕСТИТЬ ТемператураНаружногоВоздуха
	|ИЗ
	|	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация КАК Организация,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район КАК Район,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.РасчетныйМесяц = НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ)
	|				ТОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК СреднемесячнаяТемпература,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.РасчетныйМесяц = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -1), МЕСЯЦ)
	|				ТОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК СреднемесячнаяТемператураПред
	|ПОМЕСТИТЬ ФактическаяСреднемесячнаяТемпература
	|ИЗ
	|	РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НАЧАЛОПЕРИОДА(РасчетныйМесяц, МЕСЯЦ) В (НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ), НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -1), МЕСЯЦ))) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация КАК Организация,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.Район КАК Район,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения КАК КатегорияПомещения,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная КАК ТемператураОптимальная
	|ПОМЕСТИТЬ ТемператураКатегорииПомещения
	|ИЗ
	|	РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	энргВидыУслуг.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемМГВ) КАК ОбъемМГВОборот,
	|	СУММА(бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ) КАК КоличествоЧасовШтатнойРаботыПУОборот,
	|	СУММА(бестОбъемНачисленийНП.КоличествоЧасовРаботыТУ) КАК КоличествоЧасовРаботыТУОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемПоПрибору) КАК Объем_ПоПриборуПред
	|ПОМЕСТИТЬ РасходЗаПредПериод
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестОбъемНачисленийНП.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестОбъемНачисленийНП.Организация = &Организация
	|			И бестОбъемНачисленийНП.Район = &Район
	|			И бестОбъемНачисленийНП.МКД = &МКД
	|			И бестОбъемНачисленийНП.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			И НЕ бестОбъемНачисленийНП.ДолевоеРаспределение
	|			И НЕ бестОбъемНачисленийНП.Распределение
	|	И бестОбъемНачисленийНП.Период МЕЖДУ &НачалоПредПериодаРасчета И &НачалоПериодаРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	бестОбъемНачисленийНП.Организация,
	|	бестОбъемНачисленийНП.Район,
	|	бестОбъемНачисленийНП.МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета,
	|	бестОбъемНачисленийНП.ТочкаУчета,
	|	бестОбъемНачисленийНП.Услуга,
	|	энргВидыУслуг.СпособДосчётаРесурса	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ДлительностьПериодов.НачалоФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	//|	ЛОЖЬ КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД
	|			И (бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета.МКД <> Значение(Справочник.энргСтроения.ПустаяСсылка))
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ДлительностьПериодов.КонецФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета, 	
	|	ЗначенияТарифов.ДатаСменыТарифа КАК ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор КАК Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа КАК ЗначениеТарифа,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомераСтрокЗначениеТарифа
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ЗначенияТарифов.ДатаСменыТарифа
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ЗначенияТарифов.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Организация КАК Организация,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Район КАК Район,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ГБП КАК ГБП
	|ПОМЕСТИТЬ РасположениеТУОтносительноГБП
	|ИЗ
	|	РегистрСведений.бестРасположениеТочекУчетаОтносительноГБП.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасположениеТочекУчетаОтносительноГБПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	ТемпературыИсточника.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ТемпературыИсточника.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ЕСТЬNULL(бестПлотностиВоды.Плотность, 1) КАК Плотность
	|ПОМЕСТИТЬ ТемпературыИсточникаТочекУчета
	|ИЗ
	|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТемпературыИсточника КАК ТемпературыИсточника
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
	|			ПО ТемпературыИсточника.ТемператураПодачиИсточника = бестПлотностиВоды.Температура
	|		ПО бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация = ТемпературыИсточника.Организация
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.Район = ТемпературыИсточника.Район
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = ТемпературыИсточника.Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","бестСтабильныеПериодыНП","ПериодРегистрации",Истина,Ложь) + "
	|	ВЫБОР
	|		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&КонецПериодаРасчета КАК ЗавершениеОП,
	|	&ДнейВПериоде КАК ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|ГДЕ
	|	бестСтабильныеПериодыНП.Организация = &Организация
	|	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыНП.Район = &Район
	|	И бестСтабильныеПериодыНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСоставУзла","УзелУчета,ПриборУчета,ЧастьУзлаУчета,Шкала",Истина,Ложь) + "	
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ПриборУчета, СтабильныеПериодыНачалоСоставУзла.ПриборУчета) КАК ПриборУчета,
	|	1 КАК КоэффициентПУ, 
	|	СтабильныеПериодыНачалоСоставУзла.ПриборУчета КАК УзелУчета,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная)) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ЧастьУзлаУчета,
	|	СтабильныеПериодыНачалоСоставУзла.НачалоОП,
	|	СтабильныеПериодыНачалоСоставУзла.ЗавершениеОП,
	|	СтабильныеПериодыНачалоСоставУзла.ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоШкалы
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачалоСоставУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО СтабильныеПериодыНачалоСоставУзла.Организация = СтабильныеПериодыШкалы.Организация
	|			И СтабильныеПериодыНачалоСоставУзла.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСоставУзла.Район = СтабильныеПериодыШкалы.Район
	|			И СтабильныеПериодыНачалоСоставУзла.ОбъектРасчета = СтабильныеПериодыШкалы.ОбъектРасчета
	|			И СтабильныеПериодыНачалоСоставУзла.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСоставУзла.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И СтабильныеПериодыНачалоСоставУзла.ПриборУчета = СтабильныеПериодыШкалы.ПриборУчета
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыНачалоШкалы.Организация КАК Организация,
	|	СтабильныеПериодыНачалоШкалы.Район КАК Район,
	|	СтабильныеПериодыНачалоШкалы.ОбъектРасчета КАК ОбъектРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию) = ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию)
	|			ТОГДА 0
	|		ИНАЧЕ (ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) - ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемператураПред) / (ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) - ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию))
	|	КОНЕЦ КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемператураПред КАК СреднемесячнаяТемператураПред,
	|	ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию) КАК ПроектнаяТемпература,
	|	ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) КАК ТемператураОптимальная
	|ПОМЕСТИТЬ ТемперКоэффициентПоВоздухуПред
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО СтабильныеПериодыНачалоШкалы.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическаяСреднемесячнаяТемпература КАК ФактическаяСреднемесячнаяТемпература
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = ФактическаяСреднемесячнаяТемпература.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = ФактическаяСреднемесячнаяТемпература.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	|				ДОБАВИТЬКДАТЕ(&НачалоПериодаРасчета, СЕКУНДА, -1),
	|				Организация = &Организация
	|					И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	|				ДОБАВИТЬКДАТЕ(&НачалоПериодаРасчета, СЕКУНДА, -1),
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = бестТемпературыВКатегорияхОбъектовСрезПоследних.Район
	|			И (бестОбъектыРасчета.КатегорияПомещения = бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Организация КАК Организация,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Район КАК Район,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВышедшийДопускПриборовККомУчету
	|ИЗ
	|	РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних
	|ГДЕ
	|	&ИспользоватьДанныеДляРасчетаТепловойЭнергии И (бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета < &КонецПериодаРасчета ИЛИ бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.НачалоДействияКоммерскогоУчета > &НачалоПериодаРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
	|	энргЗначенияТарифовСрезПоследних.Район КАК Район,
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеРЭК КАК ЗначениеТарифаРЭК,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	бестТарифныеКатегорииНПСрезПоследних.Организация КАК Организация,
	|	бестТарифныеКатегорииНПСрезПоследних.Район КАК Район,
	|	бестТарифныеКатегорииНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестТарифныеКатегорииНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ТарифныеКатегориии
	|ИЗ
	|	РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК бестТарифныеКатегорииНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЗарегистрированныеОбъемыПотребленияНП.Организация КАК Организация,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Район КАК Район,
	|	бестЗарегистрированныеОбъемыПотребленияНП.МКД КАК МКД,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Услуга КАК Услуга,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ПриборУчета КАК ПриборУчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Период КАК Период,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъемПоПрибору КАК ЗарегистрированныйОбъемПоПрибору,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъемИтоговый КАК ЗарегистрированныйОбъем,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъемМГВ КАК ОбъемМГВ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ РНЗарегистрированныеОбъемы
	|ИЗ
	|	РегистрНакопления.бестЗарегистрированныеОбъемыПотребленияНП КАК бестЗарегистрированныеОбъемыПотребленияНП
	|ГДЕ
	|	бестЗарегистрированныеОбъемыПотребленияНП.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	|	И бестЗарегистрированныеОбъемыПотребленияНП.Организация = &Организация
	|	И бестЗарегистрированныеОбъемыПотребленияНП.Район = &Район
	|	И бестЗарегистрированныеОбъемыПотребленияНП.МКД = &МКД
	|	И бестЗарегистрированныеОбъемыПотребленияНП.ПериодНачисления = &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПриборУчета КАК УзелУчета,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Организация КАК Организация,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Район КАК Район,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ДанныеСуточнойВедомости
	|ИЗ
	|	РегистрСведений.бестИтоговыеЗначенияПараметровСуточнойВедомости.СрезПоследних(
	|			&КонецПериодаРасчетаРегистр,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПериодНачисления = &ПериодНачисления) КАК бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.Организация КАК Организация,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.Район КАК Район,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.МКД КАК МКД,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ЦеновыеКатегорииТочекУчета
	|ИЗ
	|	РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|			&НачалоПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних";
	
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"ОбъектРасчета.МКД = &МКД","ОбъектРасчета.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестПредоставленныеПоказанияНП.МКД = &МКД","бестПредоставленныеПоказанияНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестМаксимальныеПоказанияСрезНП.МКД = &МКД","бестМаксимальныеПоказанияСрезНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестСреднийОбъемПотребленияНП.МКД = &МКД","бестСреднийОбъемПотребленияНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"энргСтабильныеПериодыМКД.МКД = &МКД","энргСтабильныеПериодыМКД.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыНП.МКД = &МКД","бестСтабильныеПериодыНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"энргСтабильныеПериоды.Строение = &МКД","энргСтабильныеПериоды.Строение <> &МКД");
		Текст 		= СтрЗаменить(Текст,"энргСтабильныеПериоды.Строение = &МКД","энргСтабильныеПериоды.Строение <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыШкалыНП.МКД = &МКД","бестСтабильныеПериодыШкалыНП.МКД <> &МКД");
		
		Текст 		= СтрЗаменить(Текст,"бестВыводПриборовУчетаНП.МКД = &МКД","бестВыводПриборовУчетаНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестОбъемНачисленийНП.МКД = &МКД","бестОбъемНачисленийНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД","бестНомераСтрокСтабильногоПериодаНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"бестЗарегистрированныеОбъемыПотребленияНП.МКД = &МКД","бестЗарегистрированныеОбъемыПотребленияНП.МКД <> &МКД");
		
		Текст 		= СтрЗаменить(Текст,"МКД = &МКД","МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"бестПредоставленныеПоказанияНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестМаксимальныеПоказанияСрезНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестСреднийОбъемПотребленияНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"энргСтабильныеПериодыМКД.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"энргСтабильныеПериоды.Строение = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"энргСтабильныеПериоды.Строение = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыШкалыНП.МКД = &МКД","ИСТИНА");
			
			Текст 		= СтрЗаменить(Текст,"бестВыводПриборовУчетаНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестОбъемНачисленийНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестНомераСтрокСтабильногоПериодаНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестЗарегистрированныеОбъемыПотребленияНП.МКД = &МКД","ИСТИНА");
			
			Текст 		= СтрЗаменить(Текст,"ОбъектРасчета.МКД = &МКД","");
			Текст 		= СтрЗаменить(Текст,"МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;	
	
КонецФункции

Функция ТекстПолучитьСтабильныеПериоды()  
	
	Текст 	=
	"ВЫБРАТЬ
	|	НомераСтрокНачалоСезонности.Организация КАК Организация,
	|	НомераСтрокНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокНачалоСезонности.Район КАК Район,
	|	НомераСтрокНачалоСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокНачалоСезонности.МКД КАК МКД,
	|	НомераСтрокНачалоСезонности.Услуга КАК Услуга,
	|	НомераСтрокНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокНачалоСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокНачалоСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокНачалоСезонности КАК НомераСтрокНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокНачалоСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокНачалоСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокНачалоСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокНачалоСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокНачалоСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокНачалоСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокНачалоСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокНачалоСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокКонецСезонности.Организация КАК Организация,
	|	НомераСтрокКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокКонецСезонности.Район КАК Район,
	|	НомераСтрокКонецСезонности.МКД КАК МКД,
	|	НомераСтрокКонецСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокКонецСезонности.Услуга КАК Услуга,
	|	НомераСтрокКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокКонецСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокКонецСезонности КАК НомераСтрокКонецСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокКонецСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокКонецСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокКонецСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокКонецСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокКонецСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокКонецСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокКонецСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокКонецСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоШкалы","",Истина,Ложь) + "	
	|	ВЫБОР
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СезонностьНачало,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ)) КАК НеПрименятьСезонность,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.ОбъемЗаПрошлыйГод, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.ОбъемЗаПрошлыйГод, ЛОЖЬ)) КАК ОбъемЗаПрошлыйГод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ))
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНеПрименятьСезонность, 1))
	|		ИНАЧЕ ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|	КОНЕЦ КАК КоэффициентНорматива,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1)) КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыНачалоШкалы.УзелУчета КАК УзелУчета,
	|	ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0) КАК ГарантированныйОбъем,
	|   ЕСТЬNULL(ТемператураКатегорииПомещения.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоШкалы.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоШкалы.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоШкалы.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоШкалы.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачалоШкалы.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьМКД
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьМКД.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьМКД.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьМКД.Район
	|			И СтабильныеПериодыНачалоШкалы.МКД = УслугиНеПрименятьСезонностьМКД.Строение
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьМКД.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьРайон
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьРайон.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьРайон.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьРайон.Район
	|			И (УслугиНеПрименятьСезонностьРайон.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьРайон.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = ГарантированныеОбъемы.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = ГарантированныеОбъемы.Район
	|			И СтабильныеПериодыНачалоШкалы.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	|			И СтабильныеПериодыНачалоШкалы.Услуга = ГарантированныеОбъемы.Услуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТемператураКатегорииПомещения КАК ТемператураКатегорииПомещения
	|			ПО бестОбъектыРасчета.КатегорияПомещения = ТемператураКатегорииПомещения.КатегорияПомещения
	|		ПО СтабильныеПериодыНачалоШкалы.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" +	бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "	
	|	СтабильныеПериодыНачалоСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.УзелУчета КАК УзелУчета,
	|   СтабильныеПериодыНачалоСезонности.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + ВЫБОР
	|	КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачалоСезонности.СезонностьНачало
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УвеличениеПозиции
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.ПериодРегистрации >= НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И (СтабильныеПериодыНачалоСезонности.ИндивидуальнаяНастройкаУслуги = Значение(Перечисление.бестВидыОпераций.ПустаяСсылка))
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "
	|	НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.УзелУчета КАК УзелУчета,
	|   СтабильныеПериодыНачалоСезонности.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + 1 КАК НомерПозиции,
	|	1 КАК КоэффициентСезоности,
	|	1
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериодыНачалоСезонности.НомерПозиции = НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И (СтабильныеПериодыНачалоСезонности.ИндивидуальнаяНастройкаУслуги = Значение(Перечисление.бестВидыОпераций.ПустаяСсылка))
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "	
	|	СтабильныеПериодыСезонность.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + СтабильныеПериодыСезонность.УвеличениеПозиции > СтабильныеПериодыСезонность.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыСезонность.ПериодРегистрации КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыСезонность.КоэффициентСезоности
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|   СтабильныеПериодыСезонность.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения
	|ПОМЕСТИТЬ СтабильныеКонецСезонности
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.ОбъектРасчета = НомераСтрокКонецСезонностиБезФормулы.ОбъектРасчета
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.ПериодРегистрации >= НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "		
	|	НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + 1,
	|	НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности,
	|	0 КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.УзелУчета,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем,
	|   СтабильныеПериодыСезонность.ТемператураВнутриПомещения
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериодыСезонность.НомерПозиции - СтабильныеПериодыСезонность.УвеличениеПозиции = НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность или СтабильныеПериодыСезонность.РасчетПоФактическомуПотреблению или СтабильныеПериодыСезонность.ИндивидуальнаяНастройкаУслуги = Значение(Перечисление.бестВидыОпераций.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонности","",Истина,Ложь) + "	
	|	СтабильныеКонецСезонности.КоэффициентСезоности,
	|	СтабильныеКонецСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонности.НачалоОП,
	|	СтабильныеКонецСезонности.ЗавершениеОП,
	|	СтабильныеКонецСезонности.ДнейВПериоде,
	|	СтабильныеКонецСезонности.КоэффициентНорматива,
	|	СтабильныеКонецСезонности.КоэффициентНормативаДляФакта,
	|	СтабильныеКонецСезонности.УзелУчета КАК УзелУчета,
	|	СтабильныеКонецСезонности.ГарантированныйОбъем,
	|   СтабильныеКонецСезонности.ТемператураВнутриПомещения,
	|	СтабильныеКонецСезонности.ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА энргВидыДифференцированностиТарифныеЗоны.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона,
	|	СтабильныеКонецСезонности.ИндивидуальнаяНастройкаУслуги <> Значение(Перечисление.бестВидыОпераций.ПустаяСсылка) КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТарифнаяЗона
	|ИЗ
	|	СтабильныеКонецСезонности КАК СтабильныеКонецСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеКонецСезонности.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонностиТарифнаяЗона","",Истина,Ложь) + "
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидДифференцированности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ПериодыПоказаний.Показания, 0) КАК Показания,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеКонецСезонностиТарифнаяЗона.УзелУчета КАК УзелУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|   СтабильныеКонецСезонностиТарифнаяЗона.ТемператураВнутриПомещения  КАК ТемператураВнутриПомещения,
	|   СтабильныеКонецСезонностиТарифнаяЗона.ЭтоИндивидуальныеНастройки  КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	СтабильныеКонецСезонностиТарифнаяЗона КАК СтабильныеКонецСезонностиТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестНачислениеНП
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестЗаключениеДоговоровСЮридическимиЛицами
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСПриборомУчетаНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСУслугамиНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				ИНАЧЕ СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации МЕЖДУ ПериодыПоказаний.НачалоПериодДействия И ПериодыПоказаний.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Организация = ПериодыПоказаний.Организация
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Район = ПериодыПоказаний.Район
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ОбъектРасчета = ПериодыПоказаний.ОбъектРасчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПриборУчета = ПериодыПоказаний.ПриборУчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Шкала = ПериодыПоказаний.Шкала
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона = ПериодыПоказаний.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыПоказанияНачало","НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	СтабильныеПериодыПоказанияНачало.ВидДифференцированности,
	|	СтабильныеПериодыПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,
	|	СтабильныеПериодыПоказанияНачало.Показания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПриборУчета ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.Показания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|					ТОГДА СтабильныеПериодыПоказанияКонец.Показания
	|				ИНАЧЕ СтабильныеПериодыПоказанияНачало.Показания
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания,
	|	ВЫБОР КОГДА СтабильныеПериодыПоказанияНачало.ИндивидуальнаяНастройкаУслуги = Значение(Перечисление.бестВидыОпераций.ПустаяСсылка) 
	|		ТОГДА СтабильныеПериодыПоказанияНачало.КоэффициентСезоности 
	|	КОГДА СтабильныеПериодыПоказанияНачало.ИндивидуальнаяНастройкаУслуги = Значение(Перечисление.бестВидыОпераций.бестИзменениеИндивидуальныхНастроекСезонности_ОграничениеУслуги)
	|		ТОГДА 0
	|	КОГДА СтабильныеПериодыПоказанияНачало.ИндивидуальнаяНастройкаУслуги = Значение(Перечисление.бестВидыОпераций.бестИзменениеИндивидуальныхНастроекСезонности_ВозобновлениеУслуги)
	|		ТОГДА 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыПоказанияНачало.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыПоказанияНачало.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыПоказанияНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПоказанияНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПоказанияНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыПоказанияКонец.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыПоказанияНачало.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыПоказанияНачало.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыПоказанияНачало.ТемператураВнутриПомещения  КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыПоказанияНачало.ЭтоИндивидуальныеНастройки  КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияКонец
	|		ПО (СтабильныеПериодыПоказанияНачало.НомерПозиции = СтабильныеПериодыПоказанияКонец.НомерПозиции - 1)
	|			И СтабильныеПериодыПоказанияНачало.Организация = СтабильныеПериодыПоказанияКонец.Организация
	|			И СтабильныеПериодыПоказанияНачало.ПериодНачисления = СтабильныеПериодыПоказанияКонец.ПериодНачисления
	|			И СтабильныеПериодыПоказанияНачало.Район = СтабильныеПериодыПоказанияКонец.Район
	|			И СтабильныеПериодыПоказанияНачало.ОбъектРасчета = СтабильныеПериодыПоказанияКонец.ОбъектРасчета
	|			И СтабильныеПериодыПоказанияНачало.ТочкаУчета = СтабильныеПериодыПоказанияКонец.ТочкаУчета
	|			И СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|			И СтабильныеПериодыПоказанияНачало.Услуга = СтабильныеПериодыПоказанияКонец.Услуга
	|			И СтабильныеПериодыПоказанияНачало.ТарифнаяЗона = СтабильныеПериодыПоказанияКонец.ТарифнаяЗона
	|			И СтабильныеПериодыПоказанияНачало.Шкала = СтабильныеПериодыПоказанияКонец.Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.ОбъектРасчета КАК ОбъектРасчета,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.УзелУчета КАК УзелУчета,
	|	МАКСИМУМ(Периоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ МаксНомерПозицииПериоды
	|ИЗ
	|	Периоды КАК Периоды
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.ТочкаУчета,
	|	Периоды.УзелУчета,
	|	Периоды.Организация,
	|	Периоды.ПериодНачисления,
	|	Периоды.ОбъектРасчета,
	|	Периоды.Услуга,
	|	Периоды.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЗарегистрированныеОбъемыПотребленияНП.Организация КАК Организация,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Район КАК Район,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Услуга КАК Услуга,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ПриборУчета КАК ПриборУчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Период КАК Период,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ЗарегистрированныйОбъемПоПрибору КАК ЗарегистрированныйОбъемПоПрибору,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ЗарегистрированныйОбъем КАК ЗарегистрированныйОбъем,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъемМГВ КАК ОбъемМГВ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.СпособНачисления КАК СпособНачисления,
	|	бестЗарегистрированныеОбъемыПотребленияНП.МКД КАК МКД,
	|	МаксНомерПозицииПериоды.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ЗарегистрированныеОбъемы
	|ИЗ
	|	РНЗарегистрированныеОбъемы КАК бестЗарегистрированныеОбъемыПотребленияНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомерПозицииПериоды КАК МаксНомерПозицииПериоды
	|		ПО бестЗарегистрированныеОбъемыПотребленияНП.Организация = МаксНомерПозицииПериоды.Организация
	|			И бестЗарегистрированныеОбъемыПотребленияНП.Район = МаксНомерПозицииПериоды.Район
	|			И бестЗарегистрированныеОбъемыПотребленияНП.ОбъектРасчета = МаксНомерПозицииПериоды.ОбъектРасчета
	|			И бестЗарегистрированныеОбъемыПотребленияНП.Услуга = МаксНомерПозицииПериоды.Услуга
	|			И бестЗарегистрированныеОбъемыПотребленияНП.ТочкаУчета = МаксНомерПозицииПериоды.ТочкаУчета";	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле)
	
	Текст   = 
	"ВЫБРАТЬ
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.Договор КАК Договор,
	|	Периоды.МКД КАК МКД,
	|	Периоды.ОбъектРасчета КАК ОбъектРасчета,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.НомерПозиции КАК НомерПозиции,
	|	Периоды.ДоговорЗаключен КАК ДоговорЗаключен,
	|	Периоды.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	|	Периоды.УслугаПодключена КАК УслугаПодключена,
	|	Периоды.ПриборВведен КАК ПриборВведен,
	|	Периоды.УзелУчета КАК УзелУчета,
	|	Периоды.ПриборУчета КАК ПриборУчета,
	//|	ВЫБОР КОГДА КоличествоПУВУзлеУчета.КоличествоПУ > 1 ТОГДА Периоды.УзелУчета ИНАЧЕ Периоды.ПриборУчета КОНЕЦ КАК ПриборУчета,
	//Периоды.ПриборУчета КАК ПриборУчета,
	|	Периоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	Периоды.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	|	Периоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	Периоды.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Периоды.ДатаПоверки КАК ДатаПоверки,
	|	Периоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	Периоды.КоэффициентРасчета КАК КоэффициентРасчета,
	|	Периоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	Периоды.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	Периоды.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	|	Периоды.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	Периоды.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ВЫБОР 
	|		КОГДА ДанныеСуточнойВедомости.ОбъектРасчета ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ Периоды.РасчетПоФормуле
	|	КОНЕЦ КАК РасчетПоФормуле,
	|	Периоды.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	|	Периоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Периоды.КлючНорматива КАК КлючНорматива,
	|	Периоды.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	Периоды.Поставщик КАК Поставщик,
	//|	ВЫБОР КОГДА КоличествоПУВУзлеУчета.КоличествоПУ > 1 ТОГДА ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная) ИНАЧЕ Периоды.Шкала КОНЕЦ КАК Шкала,
	|	Периоды.Шкала КАК Шкала,
	|	Периоды.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	Периоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВЫБОР 
	|		КОГДА ДанныеСуточнойВедомости.ОбъектРасчета ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ Периоды.ФормулаРасчета
	|	КОНЕЦ КАК ФормулаРасчета,
	|	Периоды.НачалоПериода КАК НачалоПериода,
	|	Периоды.КонецПериода КАК КонецПериода,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.НачальныеПоказания КАК НачПок,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, 0) КАК СреднийОбъем,
	|	ВЫБОР
	|			КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|				ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|			ИНАЧЕ Периоды.КонечныеПоказания
	|		КОНЕЦ КАК КонПок,
	|	ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ОбъектРасчета ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПредоставленныеПоказания.ВСрок
	|		КОНЕЦ КАК ПоказанияВСрок,
	|	ВЫБОР
	|			КОГДА ДанныеВыводаПрибораУчета.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ВыводПрибораУчета,
	|	ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ПоказанияПредоставлены,
	|	ЕСТЬNULL(ТаблицаДокумента.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеНП.ПустаяСсылка)) КАК ДокументНачисления,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА (энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|				ИЛИ Периоды.НеПрименятьСезонность)
	|				И НЕ Периоды.ЭтоИндивидуальныеНастройки
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|				И НЕ Периоды.ЭтоИндивидуальныеНастройки
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоностиОбъемПотребленный,
	|	Периоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|	ВЫБОР
	|			КОГДА НЕ ЗарегистрированныеОбъемы.ТочкаУчета ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(ПредоставленныеПоказанияПоДоговору.ПоказанияТекущегоПериода, ЛОЖЬ)
	|		КОНЕЦ КАК ЕстьПоказанияАбонента,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.СледующийРегистратор КАК СледующийРегистратор,
	|	Периоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	Периоды.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	Периоды.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ЕСТЬNULL(ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	|	ЕСТЬNULL(ТемператураНаружногоВоздуха.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию) КАК ПроектнаяТемператураНаружногоВоздуха,
	|	Периоды.ТипСхемыГВС КАК ТипСхемыГВС,
	|	Периоды.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	|	Периоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	Периоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	Периоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	Периоды.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	Периоды.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	Периоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗакрытаяСхемаГВС,
	|	ВЫБОР
	|			КОГДА Периоды.КоличествоЧасовРаботы = 0
	|				ТОГДА 24
	|			ИНАЧЕ Периоды.КоличествоЧасовРаботы
	|		КОНЕЦ КАК КоличествоЧасовРаботы,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	энргВидыУслуг.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	ВЫБОР
	|			КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоСреднесуточномуКоличествуТепловойЭнергии)
	|					И РасходЗаПредПериод.КоличествоЧасовРаботыТУОборот = РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот
	|				ТОГДА ЕСТЬNULL(РасходЗаПредПериод.Объем_ПоПриборуПред, 0)
	|			КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод)
	|					И РасходЗаПредПериод.ОбъемМГВОборот <> 0
	|				ТОГДА ЕСТЬNULL(РасходЗаПредПериод.ОбъемМГВОборот, 0)
	|			КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод)
	|					И РасходЗаПредПериод.ОбъемМГВОборот = 0
	|				ТОГДА ЕСТЬNULL(РасходЗаПредПериод.ОбъемУслугиОборот, 0)
	|		КОНЕЦ КАК РасходЗаПредыдущийПериод,
	|	ВЫБОР
	|		КОГДА ПредоставленныеПоказанияПредПериод.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеПоказанийЗаПредПериод,
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот, 0) КАК ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовРаботыТУОборот, 0) КАК КоличествоЧасовРаботыТУЗаПредыдущийПериод,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0) КАК ПлощадьМОП,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0) КАК ПлощадьАбонентов,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0) КАК ПлощадьСобственнаяПоставка,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ЗарегистрированныйОбъем, -1) КАК ЗарегистрированныйОбъем,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.КоличествоЧасовРаботыТУ, 0) КАК КолЧасовРаботыТУЗарегОбъем,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.КоличествоЧасовШтатнойРаботыПУ, 0) КАК КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ЗарегистрированныйОбъемПоПрибору, 0) КАК ЗарегистрированныйОбъемПоПрибору,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ОбъемМГВ, 0) КАК ОбъемМГВ,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.СпособНачисления, ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.Пустаяссылка)) КАК СпособНачисления,
	|	ВЫБОР
	|			КОГДА ЗарегистрированныеОбъемы.ТочкаУчета ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК НаличиеЗарегистрированногоОбъема,
	|	Периоды.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	Периоды.ДиаметрСечения КАК ДиаметрСечения,
	|	ЕСТЬNULL(НормаСкоростиДвиженияВоды.СкоростьДвижения, 0) КАК СкоростьДвижения,
	|	ЦеновыеКатегорииТочекУчета.ЦеноваяКатегория КАК ЦеноваяКатегория
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормой
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО Периоды.Организация = ПредоставленныеПоказания.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказания.Район
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.ОбъектРасчета = МаксимальныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеНП КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ))
	|			И Периоды.Организация = ТаблицаДокумента.Организация
	|			И Периоды.Район = ТаблицаДокумента.Район
	|			И Периоды.МКД = ТаблицаДокумента.МКД
	|			И ТаблицаДокумента.ТипНачисления = Значение(Перечисление.бестТипыНачисления.Начисление)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеАбонентов КАК СреднееПотреблениеАбонентов
	|		ПО Периоды.Организация = СреднееПотреблениеАбонентов.Организация
	|			И Периоды.ПериодНачисления = СреднееПотреблениеАбонентов.ПериодНачисления
	|			И Периоды.Район = СреднееПотреблениеАбонентов.Район
	|			И Периоды.ОбъектРасчета = СреднееПотреблениеАбонентов.ОбъектРасчета
	|			И Периоды.Услуга = СреднееПотреблениеАбонентов.Услуга
	|			И Периоды.ТочкаУчета = СреднееПотреблениеАбонентов.ТочкаУчета
	|			И Периоды.Шкала = СреднееПотреблениеАбонентов.Шкала
	|			И Периоды.ТарифнаяЗона = СреднееПотреблениеАбонентов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВыводаПрибораУчета КАК ДанныеВыводаПрибораУчета
	|		ПО Периоды.Организация = ДанныеВыводаПрибораУчета.Организация
	|			И Периоды.ПериодНачисления = ДанныеВыводаПрибораУчета.ПериодНачисления
	|			И Периоды.Район = ДанныеВыводаПрибораУчета.Район
	|			И Периоды.ОбъектРасчета = ДанныеВыводаПрибораУчета.ОбъектРасчета
	|			И Периоды.ТочкаУчета = ДанныеВыводаПрибораУчета.ТочкаУчета
	|			И Периоды.ПриборУчета = ДанныеВыводаПрибораУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Периоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Периоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоДоговору КАК ПредоставленныеПоказанияПоДоговору
	|		ПО Периоды.Организация = ПредоставленныеПоказанияПоДоговору.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияПоДоговору.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияПоДоговору.Район
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказанияПоДоговору.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказанияПоДоговору.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказанияПоДоговору.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказанияПоДоговору.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемператураНаружногоВоздуха КАК ТемператураНаружногоВоздуха
	|		ПО Периоды.Организация = ТемператураНаружногоВоздуха.Организация
	|			И Периоды.Район = ТемператураНаружногоВоздуха.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическаяСреднемесячнаяТемпература КАК ФактическаяСреднемесячнаяТемпература
	|		ПО Периоды.Организация = ФактическаяСреднемесячнаяТемпература.Организация
	|			И Периоды.Район = ФактическаяСреднемесячнаяТемпература.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО Периоды.Организация = МКДНеНачислятьТЭ.Организация
	|			И Периоды.Район = МКДНеНачислятьТЭ.Район
	|			И Периоды.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И (ВЫБОР
	|				КОГДА МКДНеНачислятьТЭ.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА Периоды.МКД = МКДНеНачислятьТЭ.МКД
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И Периоды.ТипСхемыГВС = МКДНеНачислятьТЭ.ТипСхемы
	|			И Периоды.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходЗаПредПериод КАК РасходЗаПредПериод
	|		ПО Периоды.Организация = РасходЗаПредПериод.Организация
	|			И Периоды.Район = РасходЗаПредПериод.Район
	|			И Периоды.МКД = РасходЗаПредПериод.МКД
	|			И Периоды.ОбъектРасчета = РасходЗаПредПериод.ОбъектРасчета
	|			И Периоды.ТочкаУчета = РасходЗаПредПериод.ТочкаУчета
	|			И Периоды.Услуга = РасходЗаПредПериод.Услуга
	|		ПОЛНОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПредПериод КАК ПредоставленныеПоказанияПредПериод
	|		ПО Периоды.Район = ПредоставленныеПоказанияПредПериод.Район
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказанияПредПериод.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказанияПредПериод.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСтроений КАК ЗначенияПлощадейСтроений
	|		ПО Периоды.Организация = ЗначенияПлощадейСтроений.Организация
	|			И Периоды.ПериодНачисления = ЗначенияПлощадейСтроений.ПериодНачисления
	|			И Периоды.Район = ЗначенияПлощадейСтроений.Район
	|			И Периоды.МКД = ЗначенияПлощадейСтроений.МКД
	|			И Периоды.Услуга = ЗначенияПлощадейСтроений.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗарегистрированныеОбъемы КАК ЗарегистрированныеОбъемы
	|		ПО Периоды.Организация = ЗарегистрированныеОбъемы.Организация
	|			И Периоды.Район = ЗарегистрированныеОбъемы.Район
	|			И Периоды.МКД = ЗарегистрированныеОбъемы.МКД
	|			И Периоды.ОбъектРасчета = ЗарегистрированныеОбъемы.ОбъектРасчета
	|			И Периоды.Услуга = ЗарегистрированныеОбъемы.Услуга
	|			И Периоды.ТочкаУчета = ЗарегистрированныеОбъемы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НормаСкоростиДвиженияВоды КАК НормаСкоростиДвиженияВоды
	|		ПО Периоды.Организация = НормаСкоростиДвиженияВоды.Организация
	|			И Периоды.ПериодНачисления = НормаСкоростиДвиженияВоды.ПериодНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО (Периоды.Договор = энргДоговорыКонтрагентов.Ссылка
	|				И энргДоговорыКонтрагентов.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСуточнойВедомости КАК ДанныеСуточнойВедомости
	|		ПО Периоды.Организация = ДанныеСуточнойВедомости.Организация
	|			И Периоды.Район = ДанныеСуточнойВедомости.Район
	|			И Периоды.МКД = ДанныеСуточнойВедомости.МКД
	|			И Периоды.ОбъектРасчета = ДанныеСуточнойВедомости.ОбъектРасчета
	|			И Периоды.ПериодНачисления = ДанныеСуточнойВедомости.ПериодНачисления
	|			И Периоды.УзелУчета = ДанныеСуточнойВедомости.УзелУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеновыеКатегорииТочекУчета КАК ЦеновыеКатегорииТочекУчета
	|		ПО Периоды.Организация = ЦеновыеКатегорииТочекУчета.Организация
	|			И Периоды.Район = ЦеновыеКатегорииТочекУчета.Район
	|			И Периоды.МКД = ЦеновыеКатегорииТочекУчета.МКД
	|			И Периоды.ОбъектРасчета = ЦеновыеКатегорииТочекУчета.ОбъектРасчета
	|			И Периоды.ТочкаУчета = ЦеновыеКатегорииТочекУчета.ТочкаУчета
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоПУВУзлеУчета КАК КоличествоПУВУзлеУчета
	//|		ПО Периоды.Организация = КоличествоПУВУзлеУчета.Организация
	//|			И Периоды.Район = КоличествоПУВУзлеУчета.Район
	//|			И Периоды.ОбъектРасчета = КоличествоПУВУзлеУчета.ОбъектРасчета
	//|			И Периоды.ТочкаУчета = КоличествоПУВУзлеУчета.ТочкаУчета
	//|			И Периоды.Услуга = КоличествоПУВУзлеУчета.Услуга
	|ГДЕ
	|	Периоды.ДоговорЗаключен
	|	И Периоды.УслугаПодключена
	|	И Периоды.СпособРасчетаНорматива <> ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.БалансовыйМетод)";
	  	
	
	Если РасчетПоФормуле тогда
		Текст = СтрЗаменить(Текст,
		"И НЕ Периоды.РасчетПоФормуле",
		" И (Периоды.РасчетПоФормуле  ИЛИ НЕ Периоды.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))");
	КонецЕсли; 
	
	Возврат Текст;
	
КонецФункции

Функция ТекстРассчитатьИндивидуальныйОбъемПотребленияНП() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 1
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 2
	|			ИНАЧЕ 3
	|		КОНЕЦ) КАК Приоритет
	|ПОМЕСТИТЬ ПриоритетНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0
	|	И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|			ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга
	|ПОМЕСТИТЬ НедопускПУККомУчету
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВышедшийДопускПриборовККомУчету КАК ВышедшийДопускПриборовККомУчету
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ВышедшийДопускПриборовККомУчету.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ВышедшийДопускПриборовККомУчету.Район
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ВышедшийДопускПриборовККомУчету.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ВышедшийДопускПриборовККомУчету.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.ПриборУчета = ВышедшийДопускПриборовККомУчету.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ТочкиНачисленияНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ПриоритетНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ПриоритетНормы.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ПриоритетНормы.ТочкаУчета
	|			И (ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0)
	|			И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 1
	|					ТОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|							И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				КОГДА ПриоритетНормы.Приоритет = 2
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","ДанныеДляРасчетаПередНормой","ЧастьУзлаУчета,НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор,ФиксированныйОбъем,ИндивидуальнаяНастройкаУслуги",Истина,Ложь) + "	
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.УзелУчета КАК УзелУчета,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ДанныеДляРасчетаПередНормой.КонПок КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок
	|	КОНЕЦ КАК ПоказанияВСрок,
	|	ВЫБОР
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента
	|	КОНЕЦ КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	|		ИНАЧЕ энргВидыУслуг.ЗависитОтУслуги
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоностиОбъемПотребленный КАК КоэффициентСезоностиОбъемПотребленный,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.КоэффициентРасчета = 1
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ТочкиНачисленияНормы.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчетаПередНормой.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература,
	|	ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха КАК ПроектнаяТемператураНаружногоВоздуха,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	//|	ДанныеДляРасчетаПередНормой.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	ЕСТЬNULL(ЗначенияПовышающихКоэффициентов.Коэффициент, 1) КАК ПовышающийКоэффициент,
	|   ДанныеДляРасчетаПередНормой.СпособДосчётаРесурса,
	|	РасположениеТУОтносительноГБП.ГБП КАК ГБП,
	|	ЕСТЬNULL(ДанныеДляРасчетаПередНормой.Услуга.СодержитПотери, ЛОЖЬ) КАК СодержитПотери,
	|	ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураПодачиИсточника, 0) КАК ТемператураПодачиИсточника,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0) КАК ТемператураХолоднойВодыИсточника,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.Плотность, 1) КАК Плотность,
	|	ЕСТЬNULL(ДанныеДляРасчетаПередНормой.РасходЗаПредыдущийПериод,0) КАК РасходЗаПредыдущийПериод,
	|	ДанныеДляРасчетаПередНормой.НаличиеПоказанийЗаПредПериод КАК НаличиеПоказанийЗаПредПериод,
	|	ДанныеДляРасчетаПередНормой.ВремяШтатнойРаботыПУЗаПредыдущийПериод КАК ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботыТУЗаПредыдущийПериод КАК КоличествоЧасовРаботыТУЗаПредыдущийПериод,
	|	ВЫБОР КОГДА ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботы = 24 ТОГДА РАЗНОСТЬДАТ(ДанныеДляРасчетаПередНормой.НачалоПериода, ДанныеДляРасчетаПередНормой.КонецПериода, ЧАС) ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботы КОНЕЦ КАК КоличествоЧасовПредоставленияУслуги,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчетаПередНормой.ЗарегистрированныйОбъем КАК ЗарегистрированныйОбъем,
	|	ДанныеДляРасчетаПередНормой.ЗарегистрированныйОбъемПоПрибору КАК ЗарегистрированныйОбъемПоПрибору,
	|	ДанныеДляРасчетаПередНормой.ОбъемМГВ КАК ОбъемМГВ,
	|	ДанныеДляРасчетаПередНормой.КолЧасовРаботыТУЗарегОбъем КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчетаПередНормой.КоличествоЧасовШтатнойРаботыПУЗарегОбъем КАК КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения <> ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха
	|			ТОГДА (ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения - ДанныеДляРасчетаПередНормой.СреднемесячнаяТемпература) / (ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения - ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТемпературныйКоэффициентПоВоздуху,
	//|	ВЫБОР
	//|		КОГДА ТемпературыПодачиИзСуточнойВедомости.ПриборУчета ЕСТЬ NULL
	//|			ТОГДА (ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураПодачиИсточника, 0) - ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0)) / 1000
	//|		ИНАЧЕ (ЕСТЬNULL(ТемпературыПодачиИзСуточнойВедомости.ЗначениеПараметра, 0) - ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0)) / 1000
	//|	КОНЕЦ КАК РасчетныйНормативНаПодогрев,
	|	1 КАК РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчетаПередНормой.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка) КАК ЯвляетсяОтдельностоящим,
	|	ЕСТЬNULL(ТемперКоэффициентПоВоздухуПред.ТемпературныйКоэффициентПоВоздухуПред,0) КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчетаПередНормой.СпособНачисления КАК СпособНачисления,
	|	ДанныеДляРасчетаПередНормой.СкоростьДвижения КАК СкоростьДвижения,
	|	ЕСТЬNULL(ТарифныеКатегориии.ТарифнаяКатегория, Значение(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ТарифнаяКатегория,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора
	|ПОМЕСТИТЬ ДанныеДляРасчета
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормы КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ТочкиНачисленияНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТочкиНачисленияНормы.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.ЗависимыеУслуги КАК энргВидыУслугЗависимыеУслуги
	|		ПО ДанныеДляРасчетаПередНормой.СоставнаяУслуга = энргВидыУслугЗависимыеУслуги.Ссылка
	|			И ДанныеДляРасчетаПередНормой.Услуга = энргВидыУслугЗависимыеУслуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ДанныеДляРасчетаПередНормой.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			И ВЫБОР
	|				КОГДА ДанныеДляРасчетаПередНормой.ОбъектРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА ЗначенияТекущихНормПотребления.ТН_Норматива = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОтдельностояющиеОбъекты)
	|				ИНАЧЕ ЗначенияТекущихНормПотребления.ТН_Норматива = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|			  КОНЕЦ 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияПовышающихКоэффициентов.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияПовышающихКоэффициентов.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасположениеТУОтносительноГБП КАК РасположениеТУОтносительноГБП
	|		ПО ДанныеДляРасчетаПередНормой.Организация = РасположениеТУОтносительноГБП.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = РасположениеТУОтносительноГБП.Район
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = РасположениеТУОтносительноГБП.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыИсточникаТочекУчета КАК ТемпературыИсточникаТочекУчета
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТемпературыИсточникаТочекУчета.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ТемпературыИсточникаТочекУчета.Район
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТемпературыИсточникаТочекУчета.ОбъектРасчета
	|			 И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТемпературыИсточникаТочекУчета.ТочкаУчета
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыПодачиИзСуточнойВедомости КАК ТемпературыПодачиИзСуточнойВедомости
	//|		ПО ДанныеДляРасчетаПередНормой.Организация = ТемпературыПодачиИзСуточнойВедомости.Организация
	//|			И ДанныеДляРасчетаПередНормой.Район = ТемпературыПодачиИзСуточнойВедомости.Район
	//|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТемпературыПодачиИзСуточнойВедомости.ОбъектРасчета
	//|			И ДанныеДляРасчетаПередНормой.УзелУчета = ТемпературыПодачиИзСуточнойВедомости.УзелУчета
	//|			И ДанныеДляРасчетаПередНормой.ПриборУчета = ТемпературыПодачиИзСуточнойВедомости.ПриборУчета
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоПУВУзлеУчета КАК КоличествоПУВУзлеУчета
	//|		ПО ДанныеДляРасчетаПередНормой.Организация = КоличествоПУВУзлеУчета.Организация
	//|			И ДанныеДляРасчетаПередНормой.Район = КоличествоПУВУзлеУчета.Район
	//|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = КоличествоПУВУзлеУчета.ОбъектРасчета
	//|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = КоличествоПУВУзлеУчета.ТочкаУчета
	//|			И ДанныеДляРасчетаПередНормой.Услуга = КоличествоПУВУзлеУчета.Услуга
	//|			И (КоличествоПУВУзлеУчета.КоличествоПУ <= 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемперКоэффициентПоВоздухуПред КАК ТемперКоэффициентПоВоздухуПред
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТемперКоэффициентПоВоздухуПред.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ТемперКоэффициентПоВоздухуПред.Район
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТемперКоэффициентПоВоздухуПред.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НедопускПУККомУчету КАК НедопускПУККомУчету
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НедопускПУККомУчету.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НедопускПУККомУчету.Район
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = НедопускПУККомУчету.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = НедопускПУККомУчету.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = НедопускПУККомУчету.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифныеКатегориии КАК ТарифныеКатегориии
	|		ПО ДанныеДляРасчетаПередНормой.Услуга = ТарифныеКатегориии.Услуга
	|			И ДанныеДляРасчетаПередНормой.Район = ТарифныеКатегориии.Район
	|			И ДанныеДляРасчетаПередНормой.Организация = ТарифныеКатегориии.Организация
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТарифныеКатегориии.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО ДанныеДляРасчетаПередНормой.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкиРасчетаЭлектроэнергии КАК бестНастройкиРасчетаЭлектроэнергии
	|		ПО ДанныеДляРасчетаПередНормой.Услуга = бестНастройкиРасчетаЭлектроэнергии.Услуга
	|			И ДанныеДляРасчетаПередНормой.ЦеноваяКатегория = бестНастройкиРасчетаЭлектроэнергии.ЦеноваяКатегория
	|ГДЕ
	|	бестНастройкиРасчетаЭлектроэнергии.Услуга ЕСТЬ NULL
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация КАК Организация,
	|	ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчета.Район КАК Район,
	|	ДанныеДляРасчета.Договор КАК Договор,
	|	ДанныеДляРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчета.МКД КАК МКД,
	|	ДанныеДляРасчета.Услуга КАК Услуга,
	|	ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета КАК УзелУчета,
	|	ДанныеДляРасчета.Шкала КАК Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен КАК ПриборВведен,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|								КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|										И ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|									ТОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем * ВЫБОР
	|											КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем <> 0
	|													ИЛИ ДанныеДляРасчета.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|												ТОГДА 1
	|											ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|											ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|										ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|									КОНЕЦ
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленный,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|							И ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|						ТОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем * ВЫБОР
	|								КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем <> 0
	|										ИЛИ ДанныеДляРасчета.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|									ТОГДА 1
	|								ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|								ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|							ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|						КОНЕЦ
	|				КОНЕЦ КАК ЧИСЛО(15, 6))
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|							И ДанныеДляРасчета.ЗарегистрированныйОбъемПоПрибору >= 0
	|						ТОГДА ДанныеДляРасчета.ЗарегистрированныйОбъемПоПрибору
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|								ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|							ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|						КОНЕЦ
	|				КОНЕЦ КАК ЧИСЛО(15, 6))
	|	КОНЕЦ КАК ОбъемПоПрибору,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ДанныеДляРасчета.СпособНачисления
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|	КОНЕЦ КАК СпособНачисления,
	|	ДанныеДляРасчета.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчета.НачПок КАК НачальныеПоказания,
	|	ДанныеДляРасчета.КонПок КАК КонечныеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчета.РасчетПоФормуле
	|	КОНЕЦ КАК РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления КАК НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|			ТОГДА """"
	|		ИНАЧЕ ДанныеДляРасчета.ФормулаРасчета
	|	КОНЕЦ КАК ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	1 КАК ПовыщающийКоэффициент,
	|	ДанныеДляРасчета.ГБП КАК ГБП,
	|	ДанныеДляРасчета.СодержитПотери КАК СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем КАК КоличествоЧасовШтатнойРаботыПУ,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху КАК ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев КАК РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ КАК ОбъемМГВ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0
	|			ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|		ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем
	|	КОНЕЦ КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	ДанныеДляРасчета.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	ДанныеДляРасчета.Плотность КАК Плотность,
	|	ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод КАК КолвоЧасовРаботыТУПред
	|ПОМЕСТИТЬ ПредварительныйРасчет
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	ДанныеДляРасчета.ПриборВведен
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.НедопускПУККоммерческомуУчету
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|				ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|					ТОГДА ДанныеДляРасчета.КоэффициентСезоности
	|				ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|			КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|					ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|					ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|					ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|								ТОГДА ВЫБОР
	|										КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|											ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|						КОНЕЦ
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|					ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|								КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|									ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|								ИНАЧЕ 1
	|							КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|								КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|									ТОГДА ДанныеДляРасчета.КоэффициентНорматива
	|								ИНАЧЕ ДанныеДляРасчета.КоэффициентНормативаДляФакта
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|										И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|												ТОГДА 0
	|											ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|						ИЛИ ДанныеДляРасчета.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|								ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|							ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности
	|						КОНЕЦ * ВЫБОР
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|								ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|								ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|								ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|								ТОГДА ВЫБОР
	|										КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|											ТОГДА ВЫБОР
	|													КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|														ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|													ИНАЧЕ 0
	|												КОНЕЦ
	|										ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|									КОНЕЦ
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|								ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|											КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|												ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|											ИНАЧЕ 1
	|										КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|											КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|												ТОГДА ДанныеДляРасчета.КоэффициентНормативаДляФакта
	|											ИНАЧЕ ДанныеДляРасчета.КоэффициентНорматива
	|										КОНЕЦ * ВЫБОР
	|											КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|													И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|												ТОГДА ВЫБОР
	|														КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|															ТОГДА 0
	|														ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|													КОНЕЦ
	|											ИНАЧЕ 1
	|										КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.ПовышающийКоэффициент = -1
	|				И НЕ ДанныеДляРасчета.НетВозможностьУстановкиПУ
	|			ТОГДА ДанныеДляРасчета.ПовышающийКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0
	|			ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|		ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория,
	|	ДанныеДляРасчета.СпособДосчётаРесурса,
	|	ДанныеДляРасчета.Плотность,
	|	ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|					ТОГДА ДанныеДляРасчета.КоэффициентСезоности
	|				ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|			КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|						И ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)
	|					ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ВЫБОР
	|								КОГДА ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод)
	|									ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|											КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|												ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|											КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|												ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|											ИНАЧЕ 1
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|												ТОГДА 0
	|											ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|				ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|						ИЛИ ДанныеДляРасчета.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|								ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|							ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности
	|						КОНЕЦ * ВЫБОР
	|							КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|									И ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)
	|								ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ВЫБОР
	|											КОГДА ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод)
	|												ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|														КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|															ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|														КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|															ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|														ИНАЧЕ 1
	|													КОНЕЦ
	|											ИНАЧЕ 1
	|										КОНЕЦ * ВЫБОР
	|											КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|												ТОГДА ВЫБОР
	|														КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|															ТОГДА 0
	|														ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|													КОНЕЦ
	|											ИНАЧЕ 1
	|										КОНЕЦ КАК ЧИСЛО(15, 6))
	|							КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|								ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0
	|			ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|		ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория,
	|	ДанныеДляРасчета.СпособДосчётаРесурса,
	|	ДанныеДляРасчета.Плотность,
	|	ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					И ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод > 0
	|			ИНАЧЕ ДанныеДляРасчета.СреднийОбъем > 0
	|		КОНЕЦ
	|	И ДанныеДляРасчета.ПриборВведен
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ВЫБОР
	|								КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|									ТОГДА ДанныеДляРасчета.КоэффициентСезоности
	|								ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|							КОНЕЦ * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|								КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|								КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|								ИНАЧЕ 1
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|												ТОГДА 0
	|											ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|					ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|				ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности
	|			КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|								КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|								КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|								ИНАЧЕ 1
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|												ТОГДА 0
	|											ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|				ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0
	|			ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|		ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория,
	|	ДанныеДляРасчета.СпособДосчётаРесурса,
	|	ДанныеДляРасчета.Плотность,
	|	ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					И ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод > 0
	|			ИНАЧЕ ДанныеДляРасчета.СреднийОбъем > 0
	|		КОНЕЦ
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НеПрименятьСезонность
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|					ТОГДА ДанныеДляРасчета.КоэффициентСезоности
	|				ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|			КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|					ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|					ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|					ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|								ТОГДА ВЫБОР
	|										КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|											ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|										ИНАЧЕ 0
	|									КОНЕЦ
	|							ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|						КОНЕЦ
	|				КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|					ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|								КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|									ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|								ИНАЧЕ 1
	|							КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|								КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|										И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|												ТОГДА 0
	|											ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24) КАК ЧИСЛО(15, 6))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|						ИЛИ ДанныеДляРасчета.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|								ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|							ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности
	|						КОНЕЦ * ВЫБОР
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|								ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|								ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|								ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|								ТОГДА ВЫБОР
	|										КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|											ТОГДА ВЫБОР
	|													КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|														ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|													ИНАЧЕ 0
	|												КОНЕЦ
	|										ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|									КОНЕЦ
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|								ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|											КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|												ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|											ИНАЧЕ 1
	|										КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|											КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|													И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|												ТОГДА ВЫБОР
	|														КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|															ТОГДА 0
	|														ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|													КОНЕЦ
	|											ИНАЧЕ 1
	|										КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0
	|			ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|		ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория,
	|	ДанныеДляРасчета.СпособДосчётаРесурса,
	|	ДанныеДляРасчета.Плотность,
	|	ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					И ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод = 0
	|			ИНАЧЕ ДанныеДляРасчета.СреднийОбъем = 0
	|		КОНЕЦ
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И НЕ ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|					ТОГДА 0
	|				ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ВЫБОР
	|						КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|							ТОГДА ДанныеДляРасчета.КоэффициентСезоности
	|						ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|					КОНЕЦ * ВЫБОР
	|						КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|							ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|						КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|							ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|						КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|							ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|						КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|										ТОГДА ВЫБОР
	|												КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|													ТОГДА (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|												ИНАЧЕ 0
	|											КОНЕЦ
	|									ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|								КОНЕЦ
	|						КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|							ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|										КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|											ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|										ИНАЧЕ 1
	|									КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|										КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|												И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|											ТОГДА ВЫБОР
	|													КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|														ТОГДА 0
	|													ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|												КОНЕЦ
	|										ИНАЧЕ 1
	|									КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24) КАК ЧИСЛО(15, 6))
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Контрагент
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению
	|								ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный
	|							ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности
	|						КОНЕЦ * ВЫБОР
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|								ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|								ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|								ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|								ТОГДА ВЫБОР
	|										КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|											ТОГДА ВЫБОР
	|													КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|														ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|													ИНАЧЕ 0
	|												КОНЕЦ
	|										ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|									КОНЕЦ
	|							КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|								ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|											КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|												ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|											ИНАЧЕ 1
	|										КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|											КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|													И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|												ТОГДА ВЫБОР
	|														КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|															ТОГДА 0
	|														ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|													КОНЕЦ
	|											ИНАЧЕ 1
	|										КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24) КАК ЧИСЛО(15, 6))
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0
	|			ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|		ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория,
	|	ДанныеДляРасчета.СпособДосчётаРесурса,
	|	ДанныеДляРасчета.Плотность,
	|	ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	ДанныеДляРасчета.ПриборВведен
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					И ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод <= 0
	|			ИНАЧЕ ДанныеДляРасчета.СреднийОбъем <= 0
	|		КОНЕЦ
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И НЕ ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныйРасчет.ПлощадьМОП КАК ПлощадьМОП,
	|	ПредварительныйРасчет.Организация КАК Организация,
	|	ПредварительныйРасчет.ПериодНачисления КАК ПериодНачисления,
	|	ПредварительныйРасчет.НачалоПериода КАК НачалоПериода,
	|	ПредварительныйРасчет.КонецПериода КАК КонецПериода,
	|	ПредварительныйРасчет.Район КАК Район,
	|	ПредварительныйРасчет.Договор КАК Договор,
	|	ПредварительныйРасчет.ОбъектРасчета КАК ОбъектРасчета,
	|	ПредварительныйРасчет.МКД КАК МКД,
	|	ПредварительныйРасчет.Услуга КАК Услуга,
	|	ПредварительныйРасчет.ТочкаУчета КАК ТочкаУчета,
	|	ПредварительныйРасчет.УзелУчета КАК УзелПриборУчета,
	|	ПредварительныйРасчет.ПриборУчета КАК ПриборУчета,
	|	ПредварительныйРасчет.Шкала КАК Шкала,
	|	ПредварительныйРасчет.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредварительныйРасчет.ПриборВведен КАК ПриборВведен,
	|	ПредварительныйРасчет.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ПредварительныйРасчет.ОбъемУслуги КАК ОбъемУслуги,
	|	ПредварительныйРасчет.ОбъемПоПрибору КАК ОбъемПоПрибору,
	|	ПредварительныйРасчет.СпособНачисления КАК СпособНачисления,
	|	ПредварительныйРасчет.ДокументНачисления КАК ДокументНачисления,
	|	ПредварительныйРасчет.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ПредварительныйРасчет.НачальныеПоказания КАК НачальныеПоказания,
	|	ПредварительныйРасчет.КонечныеПоказания КАК КонечныеПоказания,
	|	ПредварительныйРасчет.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ПредварительныйРасчет.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ПредварительныйРасчет.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ПредварительныйРасчет.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ПредварительныйРасчет.НормаПотребления КАК НормаПотребления,
	|	ПредварительныйРасчет.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПредварительныйРасчет.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ПредварительныйРасчет.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ПредварительныйРасчет.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПредварительныйРасчет.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ПредварительныйРасчет.ВидПлощади КАК ВидПлощади,
	|	ПредварительныйРасчет.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ПредварительныйРасчет.ФормулаРасчета КАК ФормулаРасчета,
	|	ПредварительныйРасчет.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ПредварительныйРасчет.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ПредварительныйРасчет.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ПредварительныйРасчет.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ПредварительныйРасчет.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ПредварительныйРасчет.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	ПредварительныйРасчет.ГБП КАК ГБП,
	|	ПредварительныйРасчет.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ПредварительныйРасчет.СодержитПотери КАК СодержитПотери,
	|	ПредварительныйРасчет.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ПредварительныйРасчет.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ПредварительныйРасчет.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	ПредварительныйРасчет.ОбъемМГВ КАК ОбъемМГВ,
	|	ПредварительныйРасчет.КолЧасовРаботыТУЗарегОбъем КАК КоличествоЧасовРаботыТУ,
	|	ПредварительныйРасчет.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ПредварительныйРасчет.ТемпературныйКоэффициентПоВоздуху КАК ТемпературныйКоэффициентПоВоздуху,
	|	ПредварительныйРасчет.РасчетныйНормативНаПодогрев КАК РасчетныйНормативНаПодогрев,
	|	ПредварительныйРасчет.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	ПредварительныйРасчет.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ПредварительныйРасчет.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ТемперКоэффициентПоВоздухуПред.ТемпературныйКоэффициентПоВоздухуПред КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	РасходЗаПредПериод.Объем_ПоПриборуПред КАК Объем_ПоПриборуПред,
	|	РасходЗаПредПериод.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	ПредварительныйРасчет.Поставщик КАК Поставщик,
	|	ПредварительныйРасчет.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ПредварительныйРасчет.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ПредварительныйРасчет.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ПредварительныйРасчет.ДиаметрСечения КАК ДиаметрСечения,
	|	ПредварительныйРасчет.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.Значение, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.СтавкаНДС, 0) КАК СтавкаНДС,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.НДСВнутри, 0) КАК НДСВнутри,
	|	ВЫБОР
	|		КОГДА ЗначенияТекущихТарифов.Значение ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ЗначенияТекущихТарифов.НДСВнутри
	|			ТОГДА ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение
	|		ИНАЧЕ ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение + ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение * ЗначенияТекущихТарифов.СтавкаНДС / 100
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЗначенияТекущихТарифов.Значение ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ЗначенияТекущихТарифов.НДСВнутри
	|			ТОГДА ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение * ЗначенияТекущихТарифов.СтавкаНДС / (100 + ЗначенияТекущихТарифов.СтавкаНДС)
	|		ИНАЧЕ ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение * ЗначенияТекущихТарифов.СтавкаНДС / 100
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ПредварительныйРасчет.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|				ИЛИ ПредварительныйРасчет.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)
	|			ТОГДА ВЫБОР
	|					КОГДА ПредварительныйРасчет.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|							ИЛИ ПредварительныйРасчет.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|						ТОГДА 1
	|					ИНАЧЕ 2
	|				КОНЕЦ
	|		КОГДА ПредварительныйРасчет.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			ТОГДА ВЫБОР
	|					КОГДА ПредварительныйРасчет.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод)
	|							И ПредварительныйРасчет.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргвидыуслуг.пустаяссылка)
	|						ТОГДА 1
	|					КОГДА ПредварительныйРасчет.ЗависитОтУслуги = энргВидыУслуг.ЗависитОтУслуги
	|						ТОГДА 2
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ПорядокРасчетаУслуг,
	|	ПредварительныйРасчет.Плотность КАК Плотность,
	|	ПредварительныйРасчет.КолвоЧасовРаботыТУПред КАК КолвоЧасовРаботыТУПред
	|ПОМЕСТИТЬ РезультатБезЗависимости
	|ИЗ
	|	ПредварительныйРасчет КАК ПредварительныйРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемперКоэффициентПоВоздухуПред КАК ТемперКоэффициентПоВоздухуПред
	|		ПО ПредварительныйРасчет.Организация = ТемперКоэффициентПоВоздухуПред.Организация
	|			И ПредварительныйРасчет.Район = ТемперКоэффициентПоВоздухуПред.Район
	|			И ПредварительныйРасчет.ОбъектРасчета = ТемперКоэффициентПоВоздухуПред.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходЗаПредПериод КАК РасходЗаПредПериод
	|		ПО ПредварительныйРасчет.Организация = РасходЗаПредПериод.Организация
	|			И ПредварительныйРасчет.Район = РасходЗаПредПериод.Район
	|			И ПредварительныйРасчет.ОбъектРасчета = РасходЗаПредПериод.ОбъектРасчета
	|			И ПредварительныйРасчет.ТочкаУчета = РасходЗаПредПериод.ТочкаУчета
	|			И ПредварительныйРасчет.Услуга = РасходЗаПредПериод.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|		ПО ПредварительныйРасчет.Организация = ЗначенияТекущихТарифов.Организация
	|			И ПредварительныйРасчет.Район = ЗначенияТекущихТарифов.Район
	|			И ПредварительныйРасчет.ПериодНачисления = ЗначенияТекущихТарифов.ПериодНачисления
	|			И ПредварительныйРасчет.ТарифнаяКатегория = ЗначенияТекущихТарифов.ГруппаПотребителей
	|			И ПредварительныйРасчет.Услуга = ЗначенияТекущихТарифов.Услуга
	|			И ПредварительныйРасчет.Поставщик = ЗначенияТекущихТарифов.Поставщик
	|			И ПредварительныйРасчет.ТарифнаяЗона = ЗначенияТекущихТарифов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ПредварительныйРасчет.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатБезЗависимости.ПлощадьМОП КАК ПлощадьМОП,
	|	РезультатБезЗависимости.Организация КАК Организация,
	|	РезультатБезЗависимости.ПериодНачисления КАК ПериодНачисления,
	|	РезультатБезЗависимости.НачалоПериода КАК НачалоПериода,
	|	РезультатБезЗависимости.КонецПериода КАК КонецПериода,
	|	РезультатБезЗависимости.Район КАК Район,
	|	РезультатБезЗависимости.Договор КАК Договор,
	|	РезультатБезЗависимости.ОбъектРасчета КАК ОбъектРасчета,
	|	РезультатБезЗависимости.МКД КАК МКД,
	|	РезультатБезЗависимости.Услуга КАК Услуга,
	|	РезультатБезЗависимости.ТочкаУчета КАК ТочкаУчета,
	|	РезультатБезЗависимости.УзелПриборУчета КАК УзелПриборУчета,
	|	РезультатБезЗависимости.ПриборУчета КАК ПриборУчета,
	|	РезультатБезЗависимости.Шкала КАК Шкала,
	|	РезультатБезЗависимости.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РезультатБезЗависимости.ПриборВведен КАК ПриборВведен,
	|	РезультатБезЗависимости.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	РезультатБезЗависимости.ОбъемУслуги КАК ОбъемУслуги,
	|	РезультатБезЗависимости.ОбъемПоПрибору КАК ОбъемПоПрибору,
	|	РезультатБезЗависимости.СпособНачисления КАК СпособНачисления,
	|	РезультатБезЗависимости.ДокументНачисления КАК ДокументНачисления,
	|	РезультатБезЗависимости.КоэффициентСезоности КАК КоэффициентСезоности,
	|	РезультатБезЗависимости.НачальныеПоказания КАК НачальныеПоказания,
	|	РезультатБезЗависимости.КонечныеПоказания КАК КонечныеПоказания,
	|	РезультатБезЗависимости.РасчетПоФормуле КАК РасчетПоФормуле,
	|	РезультатБезЗависимости.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	РезультатБезЗависимости.КоэффициентРасчета КАК КоэффициентРасчета,
	|	РезультатБезЗависимости.ЗначениеПлощади КАК ЗначениеПлощади,
	|	РезультатБезЗависимости.НормаПотребления КАК НормаПотребления,
	|	РезультатБезЗависимости.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	РезультатБезЗависимости.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	РезультатБезЗависимости.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	РезультатБезЗависимости.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	РезультатБезЗависимости.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	РезультатБезЗависимости.ВидПлощади КАК ВидПлощади,
	|	РезультатБезЗависимости.ПоказанияВСрок КАК ПоказанияВСрок,
	|	РезультатБезЗависимости.ФормулаРасчета КАК ФормулаРасчета,
	|	РезультатБезЗависимости.СоставнаяУслуга КАК СоставнаяУслуга,
	|	РезультатБезЗависимости.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	РезультатБезЗависимости.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	РезультатБезЗависимости.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	РезультатБезЗависимости.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	РезультатБезЗависимости.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	РезультатБезЗависимости.ГБП КАК ГБП,
	|	РезультатБезЗависимости.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	РезультатБезЗависимости.СодержитПотери КАК СодержитПотери,
	|	РезультатБезЗависимости.ТемператураПодачиИсточника КАК ТемператураПодачи,
	|	РезультатБезЗависимости.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВоды,
	|	РезультатБезЗависимости.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	РезультатБезЗависимости.ОбъемМГВ КАК ОбъемМГВ,
	//|	РезультатБезЗависимости.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	|	РАЗНОСТЬДАТ(РезультатБезЗависимости.НачалоПериода, РезультатБезЗависимости.КонецПериода, ЧАС) КАК КоличествоЧасовРаботыТУ,
	|	РезультатБезЗависимости.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	РезультатБезЗависимости.ТемпературныйКоэффициентПоВоздуху КАК ТемпературныйКоэффициентПоВоздуху,
	|	РезультатБезЗависимости.РасчетныйНормативНаПодогрев КАК РасчетныйНормативНаПодогрев,
	|	РезультатБезЗависимости.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	ВЫБОР
	|		КОГДА РезультатБезЗависимости.ПорядокРасчетаУслуг = 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргвидыуслуг.пустаяссылка)
	|		КОГДА РезультатБезЗависимости1.Услуга ЕСТЬ NULL
	|			ТОГДА РезультатБезЗависимости.ЗависитОтУслуги
	|		ИНАЧЕ РезультатБезЗависимости1.Услуга
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	РезультатБезЗависимости.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	РезультатБезЗависимости.ТемпературныйКоэффициентПоВоздухуПред КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	РезультатБезЗависимости.Объем_ПоПриборуПред КАК Объем_ПоПриборуПред,
	|	РезультатБезЗависимости.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	РезультатБезЗависимости.Поставщик КАК Поставщик,
	|	РезультатБезЗависимости.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	РезультатБезЗависимости.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	РезультатБезЗависимости.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	РезультатБезЗависимости.ДиаметрСечения КАК ДиаметрСечения,
	|	РезультатБезЗависимости.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	РезультатБезЗависимости.ЗначениеТарифа КАК ЗначениеТарифа,
	|	РезультатБезЗависимости.СтавкаНДС КАК СтавкаНДС,
	|	РезультатБезЗависимости.НДСВнутри КАК НДСВнутри,
	|	РезультатБезЗависимости.Сумма КАК Сумма,
	|	РезультатБезЗависимости.СуммаНДС КАК СуммаНДС,
	|	РезультатБезЗависимости.ПорядокРасчетаУслуг КАК ПорядокРасчетаУслуг,
	|	РезультатБезЗависимости.Плотность КАК ПлотностьВоды,
	|	РезультатБезЗависимости.КолвоЧасовРаботыТУПред КАК КолвоЧасовРаботыТУПред,
	|	РезультатБезЗависимости.ОбъемУслуги КАК РасчетПоНормативу
	|ИЗ
	|	РезультатБезЗависимости КАК РезультатБезЗависимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатБезЗависимости КАК РезультатБезЗависимости1
	|		ПО РезультатБезЗависимости.ТочкаУчета = РезультатБезЗависимости1.ТочкаУчета
	|			И РезультатБезЗависимости.Организация = РезультатБезЗависимости1.Организация
	|			И РезультатБезЗависимости.Район = РезультатБезЗависимости1.Район
	|			И РезультатБезЗависимости.ОбъектРасчета = РезультатБезЗависимости1.ОбъектРасчета
	|			И (РезультатБезЗависимости.Шкала = РезультатБезЗависимости1.Шкала
	|				И РезультатБезЗависимости.ПорядокРасчетаУслуг = 2
	|				И РезультатБезЗависимости1.ПорядокРасчетаУслуг = 1)
	|			И РезультатБезЗависимости.Шкала = РезультатБезЗависимости1.Шкала
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД,
	|	ОбъектРасчета,
	|	СодержитПотери,
	|	РасчетПоФормуле,
	|	ТочкаУчета,
	|	НачалоПериода,
	|	КонецПериода,
	|	ПорядокРасчетаУслуг,
	|	ЗависитОтУслуги
	|ИТОГИ ПО
	|	МКД,
	|	ДокументНачисления";
	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСхемыСтруктурыСети()
	Возврат "ВЫБРАТЬ
	|	бестСтабильныеПериодыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыНП.Район КАК Район,
	|	бестСтабильныеПериодыНП.МКД КАК МКД,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.Договор) КАК Договор,
	|	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ПриборУчета) КАК ПриборУчета,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ДатаПоверки) КАК ДатаПоверки,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ЗависимаяТочкаУчета) КАК ЗависимаяТочкаУчета,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.КоэффициентРасчета) КАК КоэффициентРасчета,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеНормативаЗаДень) КАК ЗначениеНормативаЗаДень,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ОбъектУчаствуетВРаспределенииМКД) КАК ОбъектУчаствуетВРаспределенииМКД,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.СпособРасчетаНорматива) КАК СпособРасчетаНорматива,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.Поставщик) КАК Поставщик,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.Шкала) КАК Шкала,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.СоставнаяУслуга) КАК СоставнаяУслуга,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.КоличествоЧасовРаботы) КАК КоличествоЧасовРаботы,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.РасчетПоФактическомуПотреблению) КАК РасчетПоФактическомуПотреблению,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ФиксированныйОбъем) КАК ФиксированныйОбъем,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.ДиаметрСечения) КАК ДиаметрСечения
	|ПОМЕСТИТЬ СтабильныеПериоды
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|ГДЕ
	|	бестСтабильныеПериодыНП.Организация = &Организация
	|	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыНП.Район = &Район
	|	И бестСтабильныеПериодыНП.МКД = &МКД
	|	И бестСтабильныеПериодыНП.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.БалансовыйМетод)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСтабильныеПериодыНП.Организация,
	|	бестСтабильныеПериодыНП.ПериодНачисления,
	|	бестСтабильныеПериодыНП.Район,
	|	бестСтабильныеПериодыНП.МКД,
	|	бестСтабильныеПериодыНП.ОбъектРасчета,
	|	бестСтабильныеПериодыНП.Услуга,
	|	бестСтабильныеПериодыНП.ТочкаУчета,
	|	ВЫБОР
	|		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	ЕСТЬNULL(бестСхемаРасчетаПоСтруктуреСети.Услуга, ЗНАЧЕНИЕ(Справочник.энргвидыуслуг.пустаяссылка)) КАК УслугаПоРассчитываемуЭлементу
	|ПОМЕСТИТЬ СтруктураСетиРассчитываемыхТочек
	|ИЗ
	|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			(Организация, Район, Услуга, ОбъектРасчета, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					СтабильныеПериоды.Организация КАК Организация,
	|					СтабильныеПериоды.Район КАК Район,
	|					СтабильныеПериоды.Услуга КАК Услуга,
	|					СтабильныеПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|					СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета
	|				ИЗ
	|					СтабильныеПериоды КАК СтабильныеПериоды)) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСхемаРасчетаПоСтруктуреСети КАК бестСхемаРасчетаПоСтруктуреСети
	|		ПО бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = бестСхемаРасчетаПоСтруктуреСети.РассчитываемыйЭлемент
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация = бестСхемаРасчетаПоСтруктуреСети.Организация
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.Район = бестСхемаРасчетаПоСтруктуреСети.Район
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета = бестСхемаРасчетаПоСтруктуреСети.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	|	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.ЭлементСтруктурыСети КАК ЭлементСтруктурыСети,
	|	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.ВычитатьЭлемент КАК ВычитатьЭлемент,
	|	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ Схема
	|ИЗ
	|	РегистрСведений.бестСхемаРасчетаПоСтруктуреСети.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			РассчитываемыйЭлемент В
	|				(ВЫБРАТЬ
	|					СтруктураСетиРассчитываемыхТочек.СтруктураСети КАК СтруктураСети
	|				ИЗ
	|					СтруктураСетиРассчитываемыхТочек КАК СтруктураСетиРассчитываемыхТочек)) КАК бестСхемаРасчетаПоСтруктуреСетиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Схема.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Схема1.РассчитываемыйЭлемент) КАК Приоритет,
	|	Схема.Услуга КАК Услуга
	|ПОМЕСТИТЬ ПриоритетыРасчета
	|ИЗ
	|	Схема КАК Схема
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Схема КАК Схема1
	|		ПО Схема.РассчитываемыйЭлемент = Схема1.ЭлементСтруктурыСети
	|			И Схема.Услуга = Схема1.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	Схема.РассчитываемыйЭлемент,
	|	Схема.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	Схема.ВычитатьЭлемент КАК ВычитатьЭлемент,
	|	Схема.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	|	Схема.Услуга КАК УслугаПоРассчитываемуЭлементу
	|ПОМЕСТИТЬ СтруктураСетиТочекДляРасчета
	|ИЗ
	|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Схема КАК Схема
	|		ПО бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = Схема.ЭлементСтруктурыСети
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураСетиТочекДляРасчета.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	|	СтруктураСетиТочекДляРасчета.УслугаПоРассчитываемуЭлементу КАК Услуга,
	|	СтруктураСетиТочекДляРасчета.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	|ПОМЕСТИТЬ УслугиВРасчете
	|ИЗ
	|	СтруктураСетиТочекДляРасчета КАК СтруктураСетиТочекДляРасчета
	|ГДЕ
	|	СтруктураСетиТочекДляРасчета.Услуга.бестОсновнаяУслугаДляРасчетаБалансовымМетодом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеБалансовыхУслуг.Услуга КАК Услуга,
	|	УслугиВРасчете.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	|	УслугиВРасчете.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	|ПОМЕСТИТЬ УслугиВРасчетеОтбор
	|ИЗ
	|	УслугиВРасчете КАК УслугиВРасчете
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеБалансовыхУслуг КАК энргВидыУслугСоставляющиеБалансовыхУслуг
	|		ПО УслугиВРасчете.Услуга = энргВидыУслугСоставляющиеБалансовыхУслуг.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УслугиВРасчете.Услуга,
	|	УслугиВРасчете.РассчитываемыйЭлемент,
	|	УслугиВРасчете.УслугаПоРассчитываемуЭлементу
	|ИЗ
	|	УслугиВРасчете КАК УслугиВРасчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктураСетиТочекДляРасчета.Организация КАК Организация,
	|	СтруктураСетиТочекДляРасчета.Район КАК Район,
	|	СтруктураСетиТочекДляРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	СтруктураСетиТочекДляРасчета.Услуга КАК Услуга,
	|	СтруктураСетиТочекДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	СтруктураСетиТочекДляРасчета.СтруктураСети КАК СтруктураСети,
	|	СтруктураСетиТочекДляРасчета.ВычитатьЭлемент КАК ВычитатьЭлемент,
	|	СтруктураСетиТочекДляРасчета.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	|	УслугиВРасчетеОтбор.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	|ПОМЕСТИТЬ СтруктураСетиТочекДляРасчетаОтбор
	|ИЗ
	|	УслугиВРасчетеОтбор КАК УслугиВРасчетеОтбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктураСетиТочекДляРасчета КАК СтруктураСетиТочекДляРасчета
	|		ПО УслугиВРасчетеОтбор.Услуга = СтруктураСетиТочекДляРасчета.Услуга
	|			И УслугиВРасчетеОтбор.РассчитываемыйЭлемент = СтруктураСетиТочекДляРасчета.РассчитываемыйЭлемент
	|			И УслугиВРасчетеОтбор.УслугаПоРассчитываемуЭлементу = СтруктураСетиТочекДляРасчета.УслугаПоРассчитываемуЭлементу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА СтруктураСетиТочекДляРасчетаОтбор.ВычитатьЭлемент
	|				ТОГДА -ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот, 0)
	|			ИНАЧЕ ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот, 0)
	|		КОНЕЦ) КАК ОбъемУслуги,
	|	СтруктураСетиТочекДляРасчетаОтбор.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	|	СтруктураСетиТочекДляРасчетаОтбор.СтруктураСети КАК СтруктураСети,
	|	СтруктураСетиТочекДляРасчетаОтбор.ВычитатьЭлемент КАК ВычитатьЭлемент,
	|	СтруктураСетиТочекДляРасчетаОтбор.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	|ПОМЕСТИТЬ ОбъемыНачислений
	|ИЗ
	|	СтруктураСетиТочекДляРасчетаОтбор КАК СтруктураСетиТочекДляРасчетаОтбор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП.Обороты(&НачалоПериодаРасчета, &КонецПериодаРасчета, , ) КАК бестОбъемНачисленийНПОбороты
	|		ПО (бестОбъемНачисленийНПОбороты.Организация = СтруктураСетиТочекДляРасчетаОтбор.Организация)
	|			И (бестОбъемНачисленийНПОбороты.Район = СтруктураСетиТочекДляРасчетаОтбор.Район)
	|			И (бестОбъемНачисленийНПОбороты.ОбъектРасчета = СтруктураСетиТочекДляРасчетаОтбор.ОбъектРасчета)
	|			И (бестОбъемНачисленийНПОбороты.Услуга = СтруктураСетиТочекДляРасчетаОтбор.Услуга)
	|			И (бестОбъемНачисленийНПОбороты.ТочкаУчета = СтруктураСетиТочекДляРасчетаОтбор.ТочкаУчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтруктураСетиТочекДляРасчетаОтбор.РассчитываемыйЭлемент,
	|	СтруктураСетиТочекДляРасчетаОтбор.СтруктураСети,
	|	СтруктураСетиТочекДляРасчетаОтбор.ВычитатьЭлемент,
	|	СтруктураСетиТочекДляРасчетаОтбор.УслугаПоРассчитываемуЭлементу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.МКД КАК МКД,
	|	СтабильныеПериоды.Договор КАК Договор,
	|	СтабильныеПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериоды.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериоды.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	СтабильныеПериоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериоды.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	СтабильныеПериоды.ДатаПоверки КАК ДатаПоверки,
	|	СтабильныеПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	СтабильныеПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	|	СтабильныеПериоды.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	СтабильныеПериоды.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	СтабильныеПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СтабильныеПериоды.Поставщик КАК Поставщик,
	|	СтабильныеПериоды.Шкала КАК Шкала,
	|	СтабильныеПериоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериоды.КоличествоЧасовРаботы КАК КоличествоЧасовРаботыТУ,
	|	СтабильныеПериоды.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	СтабильныеПериоды.ФиксированныйОбъем КАК ФиксированныйОбъем,
	|	СтабильныеПериоды.ДиаметрСечения КАК ДиаметрСечения,
	|	ЕСТЬNULL(ПриоритетыРасчета.Приоритет, 0) КАК Приоритет,
	|	ОбъемыНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	СтруктураСетиРассчитываемыхТочек.СтруктураСети КАК РассчитываемыйЭлемент,
	|	ОбъемыНачислений.СтруктураСети КАК СтруктураСетиУчаствующаяВСхеме,
	|	бестНачислениеПоСхемамСтруктурыСети.Ссылка КАК ДокументНачисления,
	|	ОбъемыНачислений.ВычитатьЭлемент КАК ВычитатьЭлемент,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КАК СпособНачисления,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа
	|ИЗ
	|	СтабильныеПериоды КАК СтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктураСетиРассчитываемыхТочек КАК СтруктураСетиРассчитываемыхТочек
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетыРасчета КАК ПриоритетыРасчета
	|			ПО СтруктураСетиРассчитываемыхТочек.СтруктураСети = ПриоритетыРасчета.РассчитываемыйЭлемент
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыНачислений КАК ОбъемыНачислений
	|			ПО СтруктураСетиРассчитываемыхТочек.СтруктураСети = ОбъемыНачислений.РассчитываемыйЭлемент
	|				И СтруктураСетиРассчитываемыхТочек.УслугаПоРассчитываемуЭлементу = ОбъемыНачислений.УслугаПоРассчитываемуЭлементу
	|		ПО СтабильныеПериоды.Организация = СтруктураСетиРассчитываемыхТочек.Организация
	|			И СтабильныеПериоды.Район = СтруктураСетиРассчитываемыхТочек.Район
	|			И СтабильныеПериоды.ОбъектРасчета = СтруктураСетиРассчитываемыхТочек.ОбъектРасчета
	|			И СтабильныеПериоды.Услуга = СтруктураСетиРассчитываемыхТочек.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = СтруктураСетиРассчитываемыхТочек.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеПоСхемамСтруктурыСети КАК бестНачислениеПоСхемамСтруктурыСети
	|		ПО СтабильныеПериоды.Организация = бестНачислениеПоСхемамСтруктурыСети.Организация
	|			И СтабильныеПериоды.Район = бестНачислениеПоСхемамСтруктурыСети.Район
	|			И СтабильныеПериоды.ПериодНачисления = бестНачислениеПоСхемамСтруктурыСети.ПериодНачисления
	|			И СтабильныеПериоды.МКД = бестНачислениеПоСхемамСтруктурыСети.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|				&КонецПериодаРасчета,
	|				Район = &Район
	|					И Организация = &Организация
	|					И ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)) КАК энргЗначенияТарифовСрезПоследних
	|		ПО СтабильныеПериоды.Организация = энргЗначенияТарифовСрезПоследних.Организация
	|			И СтабильныеПериоды.Район = энргЗначенияТарифовСрезПоследних.Район
	|			И СтабильныеПериоды.ТарифнаяГруппа = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И СтабильныеПериоды.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|			И СтабильныеПериоды.Поставщик = энргЗначенияТарифовСрезПоследних.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ,
	|	МКД,
	|	РассчитываемыйЭлемент,
	|	Услуга";
КонецФункции

Функция ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(ИсключаяОтдельностоящие,МКД,Договор = Неопределено)
	
	Текст = "ВЫБРАТЬ
	|	бестОтложенныеДвиженияДокументовНП.Организация КАК Организация,
	|	бестОтложенныеДвиженияДокументовНП.Район КАК Район,
	|	бестОтложенныеДвиженияДокументовНП.МКД КАК МКД,
	|	бестОтложенныеДвиженияДокументовНП.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ДокументыДляРаспределения
	|ИЗ
	|	РегистрСведений.бестОтложенныеДвиженияДокументовНП КАК бестОтложенныеДвиженияДокументовНП
	|ГДЕ
	|	бестОтложенныеДвиженияДокументовНП.Организация = &Организация
	|	И бестОтложенныеДвиженияДокументовНП.ПериодНачисления = &ПериодНачисления
	|	И бестОтложенныеДвиженияДокументовНП.Район = &Район
	|	И бестОтложенныеДвиженияДокументовНП.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам)
	|	И бестОтложенныеДвиженияДокументовНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления В (ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления), ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОтдельностояющиеОбъекты))) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтабильныеПериодыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыНП.Район КАК Район,
	|	бестСтабильныеПериодыНП.МКД КАК МКД,
	|	бестСтабильныеПериодыНП.Договор КАК Договор,
	|	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСтабильныеПериодыНП.НомерПозиции КАК НомерПозиции,
	|	бестСтабильныеПериодыНП.ПериодРегистрации КАК ПериодРегистрации,
	|	бестСтабильныеПериодыНП.ДатаРегистратора КАК ДатаРегистратора,
	|	бестСтабильныеПериодыНП.ДокРегистратор КАК ДокРегистратор,
	|	бестСтабильныеПериодыНП.ДоговорЗаключен КАК ДоговорЗаключен,
	|	бестСтабильныеПериодыНП.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	|	бестСтабильныеПериодыНП.УслугаПодключена КАК УслугаПодключена,
	|	бестСтабильныеПериодыНП.ПриборВведен КАК ПриборВведен,
	|	бестСтабильныеПериодыНП.ПриборУчета КАК ПриборУчета,
	|	бестСтабильныеПериодыНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	бестСтабильныеПериодыНП.ЗначениеПлощади КАК ЗначениеПлощади,
	|	бестСтабильныеПериодыНП.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	бестСтабильныеПериодыНП.ДатаПоверки КАК ДатаПоверки,
	|	бестСтабильныеПериодыНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	бестСтабильныеПериодыНП.КоэффициентРасчета КАК КоэффициентРасчета,
	|	бестСтабильныеПериодыНП.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	бестСтабильныеПериодыНП.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	бестСтабильныеПериодыНП.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	|	бестСтабильныеПериодыНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	бестСтабильныеПериодыНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	бестСтабильныеПериодыНП.РасчетПоФормуле КАК РасчетПоФормуле,
	|	бестСтабильныеПериодыНП.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	|	бестСтабильныеПериодыНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	бестСтабильныеПериодыНП.КлючНорматива КАК КлючНорматива,
	|	бестСтабильныеПериодыНП.Поставщик КАК Поставщик,
	|	бестСтабильныеПериодыНП.Шкала КАК Шкала,
	|	бестСтабильныеПериодыНП.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	бестСтабильныеПериодыНП.СоставнаяУслуга КАК СоставнаяУслуга,
	|	бестСтабильныеПериодыНП.ФормулаРасчета КАК ФормулаРасчета,
	|	бестСтабильныеПериодыНП.ТипСхемыГВС КАК ТипСхемыГВС,
	|	бестСтабильныеПериодыНП.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	бестСтабильныеПериодыНП.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	|	бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	|	бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	бестСтабильныеПериодыНП.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	бестСтабильныеПериодыНП.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	бестСтабильныеПериодыНП.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	бестСтабильныеПериодыНП.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	бестСтабильныеПериодыНП.ФиксированныйОбъем КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ СтабПериоды
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО бестСтабильныеПериодыНП.Организация = ДокументыДляРаспределения.Организация
	|			И бестСтабильныеПериодыНП.Район = ДокументыДляРаспределения.Район
	|			И бестСтабильныеПериодыНП.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И бестСтабильныеПериодыНП.МКД = ДокументыДляРаспределения.МКД
	|			И (бестСтабильныеПериодыНП.Организация = &Организация)
	|			И (бестСтабильныеПериодыНП.Район = &Район)
	|			И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестСтабильныеПериодыНП.МКД = &МКД)
	|			И (бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабПериоды.Организация КАК Организация,
	|	СтабПериоды.Район КАК Район,
	|	СтабПериоды.МКД КАК МКД,
	|	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|	СтабПериоды.Услуга КАК Услуга,
	|	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	|	МИНИМУМ(СтабПериоды.НомерПозиции) КАК НомерПозиции,
	|	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета
	|ПОМЕСТИТЬ СтабПериодыМинНомерПозиции
	|ИЗ
	|	СтабПериоды КАК СтабПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО СтабПериоды.Организация = ДокументыДляРаспределения.Организация
	|			И СтабПериоды.Район = ДокументыДляРаспределения.Район
	|			И СтабПериоды.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И СтабПериоды.МКД = ДокументыДляРаспределения.МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабПериоды.Организация,
	|	СтабПериоды.Район,
	|	СтабПериоды.МКД,
	|	СтабПериоды.ОбъектРасчета,
	|	СтабПериоды.Услуга,
	|	СтабПериоды.ТочкаУчета,
	|	СтабПериоды.ЗависимаяТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабПериоды.Организация КАК Организация,
	|	СтабПериоды.Район КАК Район,
	|	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|	СтабПериоды.Услуга КАК Услуга,
	|	СтабПериоды.МКД КАК МКД,
	|	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	|	СтабПериоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	СтабПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	|	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	СтабПериоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	СтабПериоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабПериоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	СтабПериоды.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	СтабПериоды.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	СтабПериоды.ФиксированныйОбъем КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ УслугиДолевойТУ
	|ИЗ
	|	СтабПериоды КАК СтабПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериодыМинНомерПозиции КАК СтабПериодыМинНомерПозиции
	|		ПО СтабПериоды.Организация = СтабПериодыМинНомерПозиции.Организация
	|			И СтабПериоды.Район = СтабПериодыМинНомерПозиции.Район
	|			И СтабПериоды.МКД = СтабПериодыМинНомерПозиции.МКД
	|			И СтабПериоды.ОбъектРасчета = СтабПериодыМинНомерПозиции.ОбъектРасчета
	|			И СтабПериоды.Услуга = СтабПериодыМинНомерПозиции.Услуга
	|			И СтабПериоды.ТочкаУчета = СтабПериодыМинНомерПозиции.ТочкаУчета
	|			И СтабПериоды.НомерПозиции = СтабПериодыМинНомерПозиции.НомерПозиции
	|			И (СтабПериоды.ТочкаУчета = СтабПериоды.ЗависимаяТочкаУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДолевойТУ.Организация КАК Организация,
	|	УслугиДолевойТУ.Район КАК Район,
	|	УслугиДолевойТУ.ОбъектРасчета КАК ОбъектРасчета,
	|	УслугиДолевойТУ.Услуга КАК Услуга,
	|	УслугиДолевойТУ.МКД КАК МКД,
	|	УслугиДолевойТУ.ТочкаУчета КАК ТочкаУчета,
	|	УслугиДолевойТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	УслугиДолевойТУ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	УслугиДолевойТУ.КоэффициентРасчета КАК КоэффициентРасчета,
	|	УслугиДолевойТУ.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	УслугиДолевойТУ.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	УслугиДолевойТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	|	УслугиДолевойТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	УслугиДолевойТУ.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	УслугиДолевойТУ.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	ЕСТЬNULL(бестУровниВложенностиРасчетныхСхемСрезПоследних.Уровень, 0) КАК Уровень,
	|	УслугиДолевойТУ.ФиксированныйОбъем КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ УровеньДолевыхТУ
	|ИЗ
	|	УслугиДолевойТУ КАК УслугиДолевойТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУровниВложенностиРасчетныхСхем.СрезПоследних(&КонецПериода, ) КАК бестУровниВложенностиРасчетныхСхемСрезПоследних
	|		ПО УслугиДолевойТУ.Организация = бестУровниВложенностиРасчетныхСхемСрезПоследних.Организация
	|			И УслугиДолевойТУ.Район = бестУровниВложенностиРасчетныхСхемСрезПоследних.Район
	|			И УслугиДолевойТУ.ОбъектРасчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ОбъектРасчета
	|			И УслугиДолевойТУ.Услуга = бестУровниВложенностиРасчетныхСхемСрезПоследних.Услуга
	|			И УслугиДолевойТУ.ТочкаУчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Район КАК Район,
	|	СтабПериодыПоМинПозиции.МКД КАК МКД,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента КАК УслугаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределения КАК СпособРаспределения,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СхемаПриВыводеПодчиненногоПУ КАК СхемаПриВыводеПодчиненногоПУ,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Коэффициент КАК Коэффициент,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределенияОстатка КАК СпособРаспределенияОстатка,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УчитыватьИндивидуальноеПотребление КАК УчитыватьИндивидуальноеПотребление,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ФиксированныйОбъем КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ ТочкиСубабонентов
	|ИЗ
	|	УслугиДолевойТУ КАК СтабПериодыПоМинПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	|		ПО СтабПериодыПоМинПозиции.Организация = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Организация
	|			И СтабПериодыПоМинПозиции.Район = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Район
	|			И СтабПериодыПоМинПозиции.ОбъектРасчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	|			И СтабПериодыПоМинПозиции.ТочкаУчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	ТочкиСубабонентов.МКД КАК МКДДолевойТУ,
	|	ТочкиСубабонентов.ОбъектРасчета КАК ОбъектРасчетаДолевойТУ,
	|	ТочкиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	ТочкиСубабонентов.Услуга КАК УслугаДолевойТУ,
	|	ТочкиСубабонентов.СпособРаспределения КАК СпособРаспределения,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ПоследниеНомераСтрок
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	|		ПО бестНомераСтрокСтабильногоПериодаНП.Организация = ТочкиСубабонентов.Организация
	|			И бестНомераСтрокСтабильногоПериодаНП.Район = ТочкиСубабонентов.Район
	|			И бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	|			И бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ТочкиСубабонентов.УслугаСубабонента
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	ТочкиСубабонентов.МКД,
	|	ТочкиСубабонентов.ОбъектРасчета,
	|	ТочкиСубабонентов.ГоловнаяТочкаУчета,
	|	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	|	ТочкиСубабонентов.Услуга,
	|	ТочкиСубабонентов.СпособРаспределения,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	ТочкиСубабонентов.МКД КАК МКДДолевойТУ,
	|	ТочкиСубабонентов.ОбъектРасчета КАК ОбъектРасчетаДолевойТУ,
	|	ТочкиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ТочкиСубабонентов.Услуга КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ ПоследниеНомераСтрокСуб
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	|		ПО бестНомераСтрокСтабильногоПериодаНП.Организация = ТочкиСубабонентов.Организация
	|			И бестНомераСтрокСтабильногоПериодаНП.Район = ТочкиСубабонентов.Район
	|			И бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ТочкиСубабонентов.УслугаСубабонента
	|			И бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	|ГДЕ
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ТочкиСубабонентов.МКД,
	|	ТочкиСубабонентов.ОбъектРасчета,
	|	ТочкиСубабонентов.ГоловнаяТочкаУчета,
	|	ТочкиСубабонентов.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	|	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги
	|ПОМЕСТИТЬ ГарантированныеОбъемы
	|ИЗ
	|	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета) В
	|					(ВЫБРАТЬ
	|						ТочкиСубабонентов.ОбъектРасчетаСубабонента
	|					ИЗ
	|						ТочкиСубабонентов КАК ТочкиСубабонентов)
	|				И Месяц = МЕСЯЦ(&ПериодНачисления)) КАК бестГарантированныеОбъемыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабПериоды.Организация КАК Организация,
	|	СтабПериоды.Район КАК Район,
	|	СтабПериоды.МКД КАК МКД,
	|	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|	СтабПериоды.Услуга КАК Услуга,
	|	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	|	ТочкиСубабонентов.Коэффициент КАК КоэффициентРасчета,
	|	ТочкиСубабонентов.СпособРаспределения КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ТочкиСубабонентов.СпособРаспределенияОстатка КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	МАКСИМУМ(СтабПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	МАКСИМУМ(СтабПериоды.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	|	ПоследниеНомераСтрок.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПоследниеНомераСтрок.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПоследниеНомераСтрок.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВЫБОР
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	|			ТОГДА 2
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	МАКСИМУМ(ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0)) КАК ЗначениеНорматива,
	|	СтабПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	МАКСИМУМ(ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0)) КАК ДоговорнойОбъем,
	|	СУММА(ВЫБОР
	|			КОГДА СтабПериоды.ПриборВведен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриборов,
	|	ТочкиСубабонентов.УчитыватьИндивидуальноеПотребление КАК РасчетИндивидуальногоПотребления,
	|	ТочкиСубабонентов.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ КАК СхемаРасчетаПриВыходеПУ,
	|	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ПоследниеНомераСтрок.УслугаДолевойТУ КАК УслугаДолевойТУ,
	|	ТочкиСубабонентов.ФиксированныйОбъем КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ ПараметрыСубабонентов
	|ИЗ
	|	ПоследниеНомераСтрок КАК ПоследниеНомераСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериоды КАК СтабПериоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|			ПО СтабПериоды.Организация = ЗначенияТекущихНормПотребления.Организация
	|				И СтабПериоды.Район = ЗначенияТекущихНормПотребления.Район
	|				И СтабПериоды.Услуга = ЗначенияТекущихНормПотребления.Район
	|				И СтабПериоды.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	|			ПО СтабПериоды.Организация = ГарантированныеОбъемы.Организация
	|				И СтабПериоды.Район = ГарантированныеОбъемы.Район
	|				И СтабПериоды.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	|				И СтабПериоды.Услуга = ГарантированныеОбъемы.Услуга
	|		ПО ПоследниеНомераСтрок.Организация = СтабПериоды.Организация
	|			И ПоследниеНомераСтрок.Район = СтабПериоды.Район
	|			И ПоследниеНомераСтрок.МКД = СтабПериоды.МКД
	|			И ПоследниеНомераСтрок.ОбъектРасчета = СтабПериоды.ОбъектРасчета
	|			И ПоследниеНомераСтрок.Услуга = СтабПериоды.Услуга
	|			И ПоследниеНомераСтрок.НомерПозиции = СтабПериоды.НомерПозиции
	|			И ПоследниеНомераСтрок.ТочкаУчета = СтабПериоды.ТочкаУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ПоследниеНомераСтрок.Услуга = энргВидыУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	|		ПО ПоследниеНомераСтрок.Организация = ТочкиСубабонентов.Организация
	|			И ПоследниеНомераСтрок.Район = ТочкиСубабонентов.Район
	|			И ПоследниеНомераСтрок.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	|			И ПоследниеНомераСтрок.Услуга = ТочкиСубабонентов.УслугаСубабонента
	|			И ПоследниеНомераСтрок.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабПериоды.Организация,
	|	СтабПериоды.Район,
	|	СтабПериоды.МКД,
	|	СтабПериоды.ОбъектРасчета,
	|	СтабПериоды.Услуга,
	|	СтабПериоды.ТочкаУчета,
	|	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ,
	|	СтабПериоды.ЗависимаяТочкаУчета,
	|	ПоследниеНомераСтрок.МКДДолевойТУ,
	|	ПоследниеНомераСтрок.ОбъектРасчетаДолевойТУ,
	|	ПоследниеНомераСтрок.ГоловнаяТочкаУчета,
	|	СтабПериоды.СпособРасчетаНорматива,
	|	ВЫБОР
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	|			ТОГДА 2
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	энргВидыУслуг.ЗависитОтУслуги,
	|	ПоследниеНомераСтрок.УслугаДолевойТУ,
	|	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	|	ТочкиСубабонентов.СпособРаспределения,
	|	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ,
	|	ТочкиСубабонентов.Коэффициент,
	|	ТочкиСубабонентов.УчитыватьИндивидуальноеПотребление,
	|	ТочкиСубабонентов.СпособРаспределенияОстатка,
	|	ТочкиСубабонентов.КоэффициентДолевогоРаспределения,
	|	ТочкиСубабонентов.ФиксированныйОбъем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабПериоды.Организация КАК Организация,
	|	СтабПериоды.Район КАК Район,
	|	СтабПериоды.МКД КАК МКД,
	|	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|	СтабПериоды.Услуга КАК Услуга,
	|	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	|	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	МАКСИМУМ(СтабПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	МАКСИМУМ(СтабПериоды.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	|	ВЫБОР
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	|			ТОГДА 2
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	МАКСИМУМ(ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0)) КАК ЗначениеНорматива,
	|	СтабПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	МАКСИМУМ(ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0)) КАК ДоговорнойОбъем,
	|	СУММА(ВЫБОР
	|			КОГДА СтабПериоды.ПриборВведен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриборов,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ПоследниеНомераСтрокСуб.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	СтабПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	|	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	СтабПериоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ПоследниеНомераСтрокСуб.УслугаДолевойТУ КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ ПараметрыСтабПериодовСуб
	|ИЗ
	|	ПоследниеНомераСтрокСуб КАК ПоследниеНомераСтрокСуб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериоды КАК СтабПериоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|			ПО СтабПериоды.Организация = ЗначенияТекущихНормПотребления.Организация
	|				И СтабПериоды.Район = ЗначенияТекущихНормПотребления.Район
	|				И СтабПериоды.Услуга = ЗначенияТекущихНормПотребления.Район
	|				И СтабПериоды.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	|			ПО СтабПериоды.Организация = ГарантированныеОбъемы.Организация
	|				И СтабПериоды.Район = ГарантированныеОбъемы.Район
	|				И СтабПериоды.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	|				И СтабПериоды.Услуга = ГарантированныеОбъемы.Услуга
	|		ПО ПоследниеНомераСтрокСуб.Организация = СтабПериоды.Организация
	|			И ПоследниеНомераСтрокСуб.Район = СтабПериоды.Район
	|			И ПоследниеНомераСтрокСуб.МКД = СтабПериоды.МКД
	|			И ПоследниеНомераСтрокСуб.ОбъектРасчета = СтабПериоды.ОбъектРасчета
	|			И ПоследниеНомераСтрокСуб.Услуга = СтабПериоды.Услуга
	|			И ПоследниеНомераСтрокСуб.НомерПозиции = СтабПериоды.НомерПозиции
	|			И ПоследниеНомераСтрокСуб.ТочкаУчета = СтабПериоды.ТочкаУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ПоследниеНомераСтрокСуб.Услуга = энргВидыУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабПериоды.Организация,
	|	СтабПериоды.Район,
	|	СтабПериоды.МКД,
	|	СтабПериоды.ОбъектРасчета,
	|	СтабПериоды.Услуга,
	|	СтабПериоды.ТочкаУчета,
	|	СтабПериоды.ЗависимаяТочкаУчета,
	|	СтабПериоды.СпособРасчетаНорматива,
	|	ВЫБОР
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	|			ТОГДА 2
	|		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	энргВидыУслуг.ЗависитОтУслуги,
	|	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ,
	|	ПоследниеНомераСтрокСуб.МКДДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета,
	|	СтабПериоды.КоэффициентРасчета,
	|	СтабПериоды.РасчетИндивидуальногоПотребления,
	|	ПоследниеНомераСтрокСуб.УслугаДолевойТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	ПараметрыСтабПериодовСуб.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПараметрыСтабПериодовСуб.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	ПараметрыСтабПериодовСуб.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПараметрыСтабПериодовСуб.ДоговорнойОбъем КАК ДоговорнойОбъем,
	|	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	|	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот,
	|	СУММА(бестОбъемНачисленийНП.КоличествоЧасовРаботыТУ) КАК КоличествоЧасовРаботыТУОборот,
	|	СУММА(бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ) КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	МАКСИМУМ(бестОбъемНачисленийНП.ТарифнаяЗона) КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестОбъемНачисленийНП.Поставщик) КАК Поставщик
	|ПОМЕСТИТЬ ОбъемНачисленийСубабонентов
	|ИЗ
	|	ПараметрыСтабПериодовСуб КАК ПараметрыСтабПериодовСуб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ПО ПараметрыСтабПериодовСуб.Организация = бестОбъемНачисленийНП.Организация
	|			И ПараметрыСтабПериодовСуб.Район = бестОбъемНачисленийНП.Район
	|			И ПараметрыСтабПериодовСуб.МКД = бестОбъемНачисленийНП.МКД
	|			И ПараметрыСтабПериодовСуб.ОбъектРасчета = бестОбъемНачисленийНП.ОбъектРасчета
	|			И ПараметрыСтабПериодовСуб.Услуга = бестОбъемНачисленийНП.Услуга
	|			И ПараметрыСтабПериодовСуб.ТочкаУчета = бестОбъемНачисленийНП.ТочкаУчета
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПараметрыСтабПериодовСуб.РасчетИндивидуальногоПотребления
	|				ТОГДА ПараметрыСтабПериодовСуб.ТочкаУчета <> ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И бестОбъемНачисленийНП.Организация = &Организация
	|	И бестОбъемНачисленийНП.Район = &Район
	|	И НЕ бестОбъемНачисленийНП.Распределение
	|	И НЕ бестОбъемНачисленийНП.ДолевоеРаспределение
	|	И бестОбъемНачисленийНП.Период >= &НачалоПериода
	|	И бестОбъемНачисленийНП.Период <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	бестОбъемНачисленийНП.Организация,
	|	бестОбъемНачисленийНП.Район,
	|	бестОбъемНачисленийНП.МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета,
	|	бестОбъемНачисленийНП.Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета,
	|	бестОбъемНачисленийНП.ВидНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета,
	|	ПараметрыСтабПериодовСуб.МКДДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета,
	|	ПараметрыСтабПериодовСуб.КоэффициентРасчета,
	|	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ,
	|	бестОбъемНачисленийНП.СпособНачисления,
	|	ПараметрыСтабПериодовСуб.ЗначениеНагрузки,
	|	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива,
	|	ПараметрыСтабПериодовСуб.ДоговорнойОбъем,
	|	бестОбъемНачисленийНП.ПериодРасчета,
	|	бестОбъемНачисленийНП.ПериодНачисления,
	|	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабПериоды.Организация КАК Организация,
	|	СтабПериоды.Район КАК Район,
	|	СтабПериоды.МКД КАК МКД,
	|	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|	СтабПериоды.Услуга КАК Услуга,
	|	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	|	ПоследниеНомераСтрокСуб.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПоследниеНомераСтрокСуб.УслугаДолевойТУ КАК УслугаДолевойТУ,
	|	СтабПериоды.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ СубабонентыСПрибором
	|ИЗ
	|	ПоследниеНомераСтрокСуб КАК ПоследниеНомераСтрокСуб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериоды КАК СтабПериоды
	|		ПО ПоследниеНомераСтрокСуб.Организация = СтабПериоды.Организация
	|			И ПоследниеНомераСтрокСуб.Район = СтабПериоды.Район
	|			И ПоследниеНомераСтрокСуб.МКД = СтабПериоды.МКД
	|			И ПоследниеНомераСтрокСуб.ОбъектРасчета = СтабПериоды.ОбъектРасчета
	|			И ПоследниеНомераСтрокСуб.Услуга = СтабПериоды.Услуга
	|			И ПоследниеНомераСтрокСуб.НомерПозиции = СтабПериоды.НомерПозиции
	|			И ПоследниеНомераСтрокСуб.ТочкаУчета = СтабПериоды.ТочкаУчета
	|ГДЕ
	|	СтабПериоды.ПриборВведен
	|	И СтабПериоды.ДоговорЗаключен
	|	И СтабПериоды.УслугаПодключена
	|	И СтабПериоды.ОбъектРасчетаПодключен
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабПериоды.Организация,
	|	СтабПериоды.Район,
	|	СтабПериоды.МКД,
	|	СтабПериоды.ОбъектРасчета,
	|	СтабПериоды.Услуга,
	|	СтабПериоды.ТочкаУчета,
	|	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ,
	|	ПоследниеНомераСтрокСуб.МКДДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ,
	|	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета,
	|	ПоследниеНомераСтрокСуб.УслугаДолевойТУ,
	|	СтабПериоды.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СубабонентыСПрибором.Организация КАК Организация,
	|	СубабонентыСПрибором.Район КАК Район,
	|	СубабонентыСПрибором.МКД КАК МКД,
	|	СубабонентыСПрибором.ОбъектРасчета КАК ОбъектРасчета,
	|	СубабонентыСПрибором.Услуга КАК Услуга,
	|	СубабонентыСПрибором.ТочкаУчета КАК ТочкаУчета,
	|	СубабонентыСПрибором.ПриборУчета КАК ПриборУчета,
	|	СубабонентыСПрибором.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	СубабонентыСПрибором.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	СубабонентыСПрибором.УслугаДолевойТУ КАК УслугаДолевойТУ,
	|	СубабонентыСПрибором.МКДДолевойТУ КАК МКДДолевойТУ
	|ПОМЕСТИТЬ СубабонентыСПриборомБезПоказаний
	|ИЗ
	|	СубабонентыСПрибором КАК СубабонентыСПрибором
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	|		ПО СубабонентыСПрибором.Организация = ОбъемНачисленийСубабонентов.Организация
	|			И СубабонентыСПрибором.Район = ОбъемНачисленийСубабонентов.Район
	|			И СубабонентыСПрибором.МКД = ОбъемНачисленийСубабонентов.МКД
	|			И СубабонентыСПрибором.ОбъектРасчета = ОбъемНачисленийСубабонентов.ОбъектРасчета
	|			И СубабонентыСПрибором.ТочкаУчета = ОбъемНачисленийСубабонентов.ТочкаУчета
	|			И (СубабонентыСПрибором.ОбъектРасчета = СубабонентыСПрибором.ОбъектРасчетаДолевойТУ)
	|			И (СубабонентыСПрибором.ГоловнаяТочкаУчета = СубабонентыСПрибором.ТочкаУчета)
	|			И СубабонентыСПрибором.Услуга = ОбъемНачисленийСубабонентов.Услуга
	|ГДЕ
	|	ОбъемНачисленийСубабонентов.СпособНачисления <> ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|	И ОбъемНачисленийСубабонентов.СпособНачисления <> ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.Начислениепосреднему)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыУзловУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестПриборыУзловУчетаНПСрезПоследних.Район КАК Район,
	|	СубабонентыСПрибором.МКД КАК МКД,
	|	бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.УзелУчета КАК УзелУчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.ТипИзмерителя КАК ТипИзмерителя,
	|	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	СубабонентыСПрибором.МКДДолевойТУ КАК МКДДолевойТУ,
	|	СубабонентыСПрибором.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	СубабонентыСПрибором.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	СубабонентыСПрибором.УслугаДолевойТУ КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ ПриборыУзловУчетаСубабонентов
	|ИЗ
	|	СубабонентыСПрибором КАК СубабонентыСПрибором
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ТочкаУчета В
	|						(ВЫБРАТЬ
	|							СубабонентыСПрибором.ТочкаУчета
	|						ИЗ
	|							СубабонентыСПрибором)) КАК бестПриборыУзловУчетаНПСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|					&КонецПериода,
	|					Организация = &Организация
	|						И Район = &Район
	|						И ТочкаУчета В
	|							(ВЫБРАТЬ
	|								СубабонентыСПрибором.ТочкаУчета
	|							ИЗ
	|								СубабонентыСПрибором)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|			ПО бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета = бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета
	|				И бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета = бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета
	|				И бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета = бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета
	|		ПО СубабонентыСПрибором.Организация = бестПриборыУзловУчетаНПСрезПоследних.Организация
	|			И СубабонентыСПрибором.Район = бестПриборыУзловУчетаНПСрезПоследних.Район
	|			И СубабонентыСПрибором.ОбъектРасчета = бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета
	|			И СубабонентыСПрибором.ТочкаУчета = бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета
	|			И СубабонентыСПрибором.ПриборУчета = бестПриборыУзловУчетаНПСрезПоследних.УзелУчета
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СубабонентыСПрибором.Организация КАК Организация,
	|	СубабонентыСПрибором.Район КАК Район,
	|	СубабонентыСПрибором.МКД КАК МКД,
	|	СубабонентыСПрибором.ОбъектРасчета КАК ОбъектРасчета,
	|	СубабонентыСПрибором.Услуга КАК Услуга,
	|	СубабонентыСПрибором.ТочкаУчета КАК ТочкаУчета,
	|	СубабонентыСПрибором.ПриборУчета КАК ПриборУчета,
	|	энргТипыУзловУчетаСоставУзла.ТипИзмерителя КАК ТипИзмерителя
	|ПОМЕСТИТЬ СоставИзмерителейПоТипуУзлаУчета
	|ИЗ
	|	СубабонентыСПрибором КАК СубабонентыСПрибором
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.СоставУзла КАК энргТипыУзловУчетаСоставУзла
	|		ПО СубабонентыСПрибором.ПриборУчета.ТипУзлаУчета = энргТипыУзловУчетаСоставУзла.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыУзловУчетаСубабонентов.Организация КАК Организация,
	|	ПриборыУзловУчетаСубабонентов.Район КАК Район,
	|	ПриборыУзловУчетаСубабонентов.МКД КАК МКД,
	|	ПриборыУзловУчетаСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	ПриборыУзловУчетаСубабонентов.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыУзловУчетаСубабонентов.УзелУчета КАК УзелУчета,
	|	ПриборыУзловУчетаСубабонентов.ТипИзмерителя КАК ТипИзмерителя,
	|	ПриборыУзловУчетаСубабонентов.ПриборУчета КАК ПриборУчета,
	|	ПриборыУзловУчетаСубабонентов.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ ПриборыУзлаУчетаКомУчет
	|ИЗ
	|	ПриборыУзловУчетаСубабонентов КАК ПриборыУзловУчетаСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставИзмерителейПоТипуУзлаУчета КАК СоставИзмерителейПоТипуУзлаУчета
	|		ПО ПриборыУзловУчетаСубабонентов.Организация = СоставИзмерителейПоТипуУзлаУчета.Организация
	|			И ПриборыУзловУчетаСубабонентов.Район = СоставИзмерителейПоТипуУзлаУчета.Район
	|			И ПриборыУзловУчетаСубабонентов.МКД = СоставИзмерителейПоТипуУзлаУчета.МКД
	|			И ПриборыУзловУчетаСубабонентов.ОбъектРасчета = СоставИзмерителейПоТипуУзлаУчета.ОбъектРасчета
	|			И ПриборыУзловУчетаСубабонентов.ТочкаУчета = СоставИзмерителейПоТипуУзлаУчета.ТочкаУчета
	|			И ПриборыУзловУчетаСубабонентов.УзелУчета = СоставИзмерителейПоТипуУзлаУчета.ПриборУчета
	|			И ПриборыУзловУчетаСубабонентов.ТипИзмерителя = СоставИзмерителейПоТипуУзлаУчета.ТипИзмерителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыУзлаУчетаКомУчет.Организация КАК Организация,
	|	ПриборыУзлаУчетаКомУчет.Район КАК Район,
	|	ПриборыУзлаУчетаКомУчет.МКД КАК МКД,
	|	ПриборыУзлаУчетаКомУчет.ОбъектРасчета КАК ОбъектРасчета,
	|	ПриборыУзлаУчетаКомУчет.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыУзлаУчетаКомУчет.УзелУчета КАК УзелУчета,
	|	ПриборыУзлаУчетаКомУчет.ТипИзмерителя КАК ТипИзмерителя,
	|	ПриборыУзлаУчетаКомУчет.ПриборУчета КАК ПриборУчета,
	|	ПриборыУзлаУчетаКомУчет.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПриборыУзлаУчетаКомУчет.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПриборыУзлаУчетаКомУчет.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПриборыУзлаУчетаКомУчет.УслугаДолевойТУ КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ ДанныеВыводаЧастиУзлаУчета
	|ИЗ
	|	ПриборыУзлаУчетаКомУчет КАК ПриборыУзлаУчетаКомУчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестВыводПриборовУчетаНП КАК бестВыводПриборовУчетаНП
	|		ПО ПриборыУзлаУчетаКомУчет.Организация = бестВыводПриборовУчетаНП.Организация
	|			И ПриборыУзлаУчетаКомУчет.Район = бестВыводПриборовУчетаНП.Район
	|			И ПриборыУзлаУчетаКомУчет.ОбъектРасчета = бестВыводПриборовУчетаНП.ОбъектРасчета
	|			И ПриборыУзлаУчетаКомУчет.ТочкаУчета = бестВыводПриборовУчетаНП.ТочкаУчета
	|			И ПриборыУзлаУчетаКомУчет.ПриборУчета = бестВыводПриборовУчетаНП.ПриборУчета
	|			И (ПриборыУзлаУчетаКомУчет.ОбъектРасчета = ПриборыУзлаУчетаКомУчет.ОбъектРасчетаДолевойТУ)
	|			И (ПриборыУзлаУчетаКомУчет.ГоловнаяТочкаУчета = ПриборыУзлаУчетаКомУчет.ТочкаУчета)
	|ГДЕ
	|	бестВыводПриборовУчетаНП.Организация = &Организация
	|	И бестВыводПриборовУчетаНП.ПериодНачисления = &ПериодНачисления
	|	И бестВыводПриборовУчетаНП.Район = &Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыУзловУчетаСубабонентов.Организация КАК Организация,
	|	ПриборыУзловУчетаСубабонентов.Район КАК Район,
	|	ПриборыУзловУчетаСубабонентов.МКД КАК МКД,
	|	ПриборыУзловУчетаСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	ПриборыУзловУчетаСубабонентов.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыУзловУчетаСубабонентов.УзелУчета КАК УзелУчета,
	|	ПриборыУзловУчетаСубабонентов.ТипИзмерителя КАК ТипИзмерителя,
	|	ПриборыУзловУчетаСубабонентов.ПриборУчета КАК ПриборУчета,
	|	ПриборыУзловУчетаСубабонентов.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ ИстекшаяДатаКомУчета
	|ИЗ
	|	ПриборыУзловУчетаСубабонентов КАК ПриборыУзловУчетаСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район
	|					И (ТочкаУчета, ПриборУчета) В
	|						(ВЫБРАТЬ
	|							ПриборыУзловУчетаСубабонентов.ТочкаУчета,
	|							ПриборыУзловУчетаСубабонентов.ПриборУчета
	|						ИЗ
	|							ПриборыУзловУчетаСубабонентов)) КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних
	|		ПО ПриборыУзловУчетаСубабонентов.Организация = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Организация
	|			И ПриборыУзловУчетаСубабонентов.Район = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Район
	|			И ПриборыУзловУчетаСубабонентов.ТочкаУчета = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ТочкаУчета
	|			И ПриборыУзловУчетаСубабонентов.ПриборУчета = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета < &КонецПериода
	|			КОНЕЦ)
	|			И (ПриборыУзловУчетаСубабонентов.ОбъектРасчета = ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ)
	|			И (ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета = ПриборыУзловУчетаСубабонентов.ТочкаУчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыУзловУчетаСубабонентов.Организация КАК Организация,
	|	ПриборыУзловУчетаСубабонентов.Район КАК Район,
	|	ПриборыУзловУчетаСубабонентов.МКД КАК МКД,
	|	ПриборыУзловУчетаСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	ПриборыУзловУчетаСубабонентов.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыУзловУчетаСубабонентов.УзелУчета КАК УзелУчета,
	|	ПриборыУзловУчетаСубабонентов.ТипИзмерителя КАК ТипИзмерителя,
	|	ПриборыУзловУчетаСубабонентов.ПриборУчета КАК ПриборУчета,
	|	ПриборыУзловУчетаСубабонентов.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ НачисленоНеПоПрибору
	|ИЗ
	|	ПриборыУзловУчетаСубабонентов КАК ПриборыУзловУчетаСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	|		ПО ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ = ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ
	|			И ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ = ОбъемНачисленийСубабонентов.Услуга
	|			И (ВЫБОР
	|				КОГДА ОбъемНачисленийСубабонентов.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.Среднеепонормативу)
	|						И ОбъемНачисленийСубабонентов.НаличиеЗарегистрированногоОбъема
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ОбъемНачисленийСубабонентов.ТочкаУчета = ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета)
	|			И (ОбъемНачисленийСубабонентов.ОбъектРасчета = ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ)
	|			И ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета = ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеВыводаЧастиУзлаУчета.Организация КАК Организация,
	|	ДанныеВыводаЧастиУзлаУчета.Район КАК Район,
	|	ДанныеВыводаЧастиУзлаУчета.МКД КАК МКД,
	|	ДанныеВыводаЧастиУзлаУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеВыводаЧастиУзлаУчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеВыводаЧастиУзлаУчета.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ДанныеВыводаЧастиУзлаУчета.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ДанныеВыводаЧастиУзлаУчета.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДанныеВыводаЧастиУзлаУчета.УслугаДолевойТУ КАК УслугаДолевойТУ
	|ПОМЕСТИТЬ СубабонентыСВышедшимИзСтрояПУОбъединение
	|ИЗ
	|	ДанныеВыводаЧастиУзлаУчета КАК ДанныеВыводаЧастиУзлаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СубабонентыСПриборомБезПоказаний.Организация,
	|	СубабонентыСПриборомБезПоказаний.Район,
	|	СубабонентыСПриборомБезПоказаний.МКД,
	|	СубабонентыСПриборомБезПоказаний.ОбъектРасчета,
	|	СубабонентыСПриборомБезПоказаний.ТочкаУчета,
	|	СубабонентыСПриборомБезПоказаний.МКДДолевойТУ,
	|	СубабонентыСПриборомБезПоказаний.ОбъектРасчетаДолевойТУ,
	|	СубабонентыСПриборомБезПоказаний.ГоловнаяТочкаУчета,
	|	СубабонентыСПриборомБезПоказаний.УслугаДолевойТУ
	|ИЗ
	|	СубабонентыСПриборомБезПоказаний КАК СубабонентыСПриборомБезПоказаний
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИстекшаяДатаКомУчета.Организация,
	|	ИстекшаяДатаКомУчета.Район,
	|	ИстекшаяДатаКомУчета.МКД,
	|	ИстекшаяДатаКомУчета.ОбъектРасчета,
	|	ИстекшаяДатаКомУчета.ТочкаУчета,
	|	ИстекшаяДатаКомУчета.МКДДолевойТУ,
	|	ИстекшаяДатаКомУчета.ОбъектРасчетаДолевойТУ,
	|	ИстекшаяДатаКомУчета.ГоловнаяТочкаУчета,
	|	ИстекшаяДатаКомУчета.УслугаДолевойТУ
	|ИЗ
	|	ИстекшаяДатаКомУчета КАК ИстекшаяДатаКомУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленоНеПоПрибору.Организация,
	|	НачисленоНеПоПрибору.Район,
	|	НачисленоНеПоПрибору.МКД,
	|	НачисленоНеПоПрибору.ОбъектРасчета,
	|	НачисленоНеПоПрибору.ТочкаУчета,
	|	НачисленоНеПоПрибору.МКДДолевойТУ,
	|	НачисленоНеПоПрибору.ОбъектРасчетаДолевойТУ,
	|	НачисленоНеПоПрибору.ГоловнаяТочкаУчета,
	|	НачисленоНеПоПрибору.УслугаДолевойТУ
	|ИЗ
	|	НачисленоНеПоПрибору КАК НачисленоНеПоПрибору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СубабонентыСВышедшимИзСтрояПУОбъединение.МКДДолевойТУ КАК МКДДолевойТУ,
	|	СубабонентыСВышедшимИзСтрояПУОбъединение.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	СубабонентыСВышедшимИзСтрояПУОбъединение.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	СубабонентыСВышедшимИзСтрояПУОбъединение.УслугаДолевойТУ КАК УслугаДолевойТУ,
	|	СубабонентыСВышедшимИзСтрояПУОбъединение.Организация КАК Организация,
	|	СубабонентыСВышедшимИзСтрояПУОбъединение.Район КАК Район
	|ПОМЕСТИТЬ СхемыСВышедшимИзСтрояПУ
	|ИЗ
	|	СубабонентыСВышедшимИзСтрояПУОбъединение КАК СубабонентыСВышедшимИзСтрояПУОбъединение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкаОсновнойУслуги.Организация КАК Организация,
	|	ТочкаОсновнойУслуги.Район КАК Район,
	|	ТочкаОсновнойУслуги.МКД КАК МКД,
	|	ТочкаОсновнойУслуги.ОбъектРасчета КАК ОбъектРасчета,
	|	ТочкаОсновнойУслуги.Услуга КАК Услуга,
	|	ТочкаОсновнойУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ТочкаЗависимойУслуги.ЗначениеНагрузки КАК ЗначениеНагрузки
	|ПОМЕСТИТЬ ЗначениеНагрузкиЗависимойУслуги
	|ИЗ
	|	ПараметрыСубабонентов КАК ТочкаОсновнойУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыСубабонентов КАК ТочкаЗависимойУслуги
	|		ПО ТочкаОсновнойУслуги.Организация = ТочкаЗависимойУслуги.Организация
	|			И ТочкаОсновнойУслуги.Район = ТочкаЗависимойУслуги.Район
	|			И ТочкаОсновнойУслуги.МКД = ТочкаЗависимойУслуги.МКД
	|			И ТочкаОсновнойУслуги.ОбъектРасчета = ТочкаЗависимойУслуги.ОбъектРасчета
	|			И ТочкаОсновнойУслуги.ТочкаУчета = ТочкаЗависимойУслуги.ТочкаУчета
	|			И ТочкаОсновнойУслуги.Услуга = ТочкаЗависимойУслуги.ЗависитОтУслуги
	|ГДЕ
	|	ТочкаОсновнойУслуги.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке)
	|	И ТочкаОсновнойУслуги.ЗначениеНагрузки = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСубабонентов.МКД КАК МКД,
	|	ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	ПараметрыСубабонентов.Услуга КАК Услуга,
	|	ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета,
	|	ПараметрыСубабонентов.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ГарантированныеОбъемы.ОбъемУслуги КАК ДоговорнойОбъем
	|ПОМЕСТИТЬ ЗначенияПараметровОсновныхТочек
	|ИЗ
	|	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	|		ПО ПараметрыСубабонентов.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	|			И ПараметрыСубабонентов.Услуга = ГарантированныеОбъемы.Услуга
	|ГДЕ
	|	ПараметрыСубабонентов.Услуга.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот
	|ПОМЕСТИТЬ ОбъемыДолевойТУДляРаспределения
	|ИЗ
	|	УровеньДолевыхТУ КАК УровеньДолевыхТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ПО УровеньДолевыхТУ.Организация = бестОбъемНачисленийНП.Организация
	|			И УровеньДолевыхТУ.Район = бестОбъемНачисленийНП.Район
	|			И УровеньДолевыхТУ.МКД = бестОбъемНачисленийНП.МКД
	|			И УровеньДолевыхТУ.ОбъектРасчета = бестОбъемНачисленийНП.ОбъектРасчета
	|			И УровеньДолевыхТУ.Услуга = бестОбъемНачисленийНП.Услуга
	|			И УровеньДолевыхТУ.ТочкаУчета = бестОбъемНачисленийНП.ТочкаУчета
	|ГДЕ
	|	бестОбъемНачисленийНП.Организация = &Организация
	|	И бестОбъемНачисленийНП.Район = &Район
	|	И бестОбъемНачисленийНП.ПериодНачисления = &ПериодНачисления
	|	И НЕ бестОбъемНачисленийНП.Распределение
	|	И НЕ бестОбъемНачисленийНП.ДолевоеРаспределение
	|
	|СГРУППИРОВАТЬ ПО
	|	бестОбъемНачисленийНП.Район,
	|	бестОбъемНачисленийНП.МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета,
	|	бестОбъемНачисленийНП.Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета,
	|	бестОбъемНачисленийНП.СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника
	|ПОМЕСТИТЬ ТемпературыИсточника
	|ИЗ
	|	РегистрСведений.бестТемператураИсточника.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестТемператураИсточникаСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район
	|					И (ОбъектРасчета, ТочкаУчета) В
	|						(ВЫБРАТЬ
	|							ТочкиСубабонентов.ОбъектРасчетаСубабонента,
	|							ТочкиСубабонентов.ТочкаУчетаСубабонента
	|						ИЗ
	|							ТочкиСубабонентов КАК ТочкиСубабонентов)) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	|		ПО бестТемператураИсточникаСрезПоследних.Организация = бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация
	|			И бестТемператураИсточникаСрезПоследних.Район = бестСтруктураСетиТочекУчетаНПСрезПоследних.Район
	|			И бестТемператураИсточникаСрезПоследних.Источник = бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, 0) КАК ПроектнаяТемпература,
	|	ЕСТЬNULL(бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	|	ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, 0) КАК ТемператураОптимальная,
	|	ТочкиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ТочкиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ЕСТЬNULL(ТемпературыИсточника.ТемператураПодачиИсточника, 0) КАК ТемператураПодачиИсточника,
	|	ЕСТЬNULL(ТемпературыИсточника.ТемператураХолоднойВодыИсточника, 0) КАК ТемператураХолоднойВодыИсточника,
	|	ТочкиСубабонентов.УслугаСубабонента КАК УслугаСубабонента
	|ПОМЕСТИТЬ ДанныеПоТемпературам
	|ИЗ
	|	ТочкиСубабонентов КАК ТочкиСубабонентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район
	|					И РасчетныйМесяц = &ПериодНачисления) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	|		ПО ТочкиСубабонентов.Организация = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация
	|			И ТочкиСубабонентов.Район = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район
	|			И ТочкиСубабонентов.Услуга.Сезонность = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.ВидПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	|		ПО ТочкиСубабонентов.Организация = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация
	|			И ТочкиСубабонентов.Район = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	|		ПО ТочкиСубабонентов.Организация = бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация
	|			И ТочкиСубабонентов.Район = бестТемпературыВКатегорияхОбъектовСрезПоследних.Район
	|			И ТочкиСубабонентов.ОбъектРасчетаСубабонента.КатегорияПомещения = бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыИсточника КАК ТемпературыИсточника
	|		ПО ТочкиСубабонентов.Организация = ТемпературыИсточника.Организация
	|			И ТочкиСубабонентов.Район = ТемпературыИсточника.Район
	|			И ТочкиСубабонентов.ОбъектРасчетаСубабонента = ТемпературыИсточника.ОбъектРасчета
	|			И ТочкиСубабонентов.ТочкаУчетаСубабонента = ТемпературыИсточника.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТочкиСубабонентов.Организация КАК Организация,
	|	ТочкиСубабонентов.Район КАК Район,
	|	ТочкиСубабонентов.МКД КАК МКД,
	|	ТочкиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ТочкиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ТочкиСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	|	ТочкиСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	ТочкиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ТочкиСубабонентов.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиСубабонентов
	|ИЗ
	|	ТочкиСубабонентов КАК ТочкиСубабонентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиСубабонентов.Организация КАК Организация,
	|	УслугиСубабонентов.Район КАК Район,
	|	УслугиСубабонентов.МКД КАК МКД,
	|	УслугиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	УслугиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	УслугиСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	|	УслугиСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	УслугиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	УслугиСубабонентов.Услуга КАК Услуга,
	|	УслугиСубабонентов.УслугаСубабонента.ЗависитОтУслуги КАК ЗависимаяУслуга
	|ПОМЕСТИТЬ ЗависимыеУслугиСуб
	|ИЗ
	|	УслугиСубабонентов КАК УслугиСубабонентов
	|ГДЕ
	|	УслугиСубабонентов.УслугаСубабонента.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиСубабонентов.Организация КАК Организация,
	|	УслугиСубабонентов.Район КАК Район,
	|	УслугиСубабонентов.МКД КАК МКД,
	|	УслугиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	УслугиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	УслугиСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	|	УслугиСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	УслугиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	УслугиСубабонентов.Услуга КАК Услуга,
	|	энргВидыУслуг.Ссылка КАК ЗависимаяУслуга
	|ПОМЕСТИТЬ ОбратноЗависимыеУслугиСуб
	|ИЗ
	|	УслугиСубабонентов КАК УслугиСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО УслугиСубабонентов.УслугаСубабонента = энргВидыУслуг.ЗависитОтУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимыеУслугиСуб.Организация КАК Организация,
	|	ЗависимыеУслугиСуб.Район КАК Район,
	|	ЗависимыеУслугиСуб.МКД КАК МКД,
	|	ЗависимыеУслугиСуб.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ЗависимыеУслугиСуб.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ЗависимыеУслугиСуб.УслугаСубабонента КАК УслугаСубабонента,
	|	ЗависимыеУслугиСуб.ОбъектРасчета КАК ОбъектРасчета,
	|	ЗависимыеУслугиСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ЗависимыеУслугиСуб.Услуга КАК Услуга,
	|	ЗависимыеУслугиСуб.ЗависимаяУслуга КАК ЗависимаяУслуга
	|ПОМЕСТИТЬ ВзаимозависимыеУслугиСуб
	|ИЗ
	|	ЗависимыеУслугиСуб КАК ЗависимыеУслугиСуб
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбратноЗависимыеУслугиСуб.Организация,
	|	ОбратноЗависимыеУслугиСуб.Район,
	|	ОбратноЗависимыеУслугиСуб.МКД,
	|	ОбратноЗависимыеУслугиСуб.ОбъектРасчетаСубабонента,
	|	ОбратноЗависимыеУслугиСуб.ТочкаУчетаСубабонента,
	|	ОбратноЗависимыеУслугиСуб.УслугаСубабонента,
	|	ОбратноЗависимыеУслугиСуб.ОбъектРасчета,
	|	ОбратноЗависимыеУслугиСуб.ГоловнаяТочкаУчета,
	|	ОбратноЗависимыеУслугиСуб.Услуга,
	|	ОбратноЗависимыеУслугиСуб.ЗависимаяУслуга
	|ИЗ
	|	ОбратноЗависимыеУслугиСуб КАК ОбратноЗависимыеУслугиСуб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимозависимыеУслугиСуб.Организация КАК Организация,
	|	ВзаимозависимыеУслугиСуб.Район КАК Район,
	|	ВзаимозависимыеУслугиСуб.МКД КАК МКД,
	|	ВзаимозависимыеУслугиСуб.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВзаимозависимыеУслугиСуб.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВзаимозависимыеУслугиСуб.УслугаСубабонента КАК УслугаСубабонента,
	|	ВзаимозависимыеУслугиСуб.ОбъектРасчета КАК ОбъектРасчета,
	|	ВзаимозависимыеУслугиСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВзаимозависимыеУслугиСуб.Услуга КАК Услуга,
	|	ВзаимозависимыеУслугиСуб.ЗависимаяУслуга КАК ЗависимаяУслуга,
	|	бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка КАК Нагрузка
	|ПОМЕСТИТЬ НагрузкиЗависимыхУслуг
	|ИЗ
	|	ВзаимозависимыеУслугиСуб КАК ВзаимозависимыеУслугиСуб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНагрузкаПоУслугамНП.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район
	|					И (ОбъектРасчета) В
	|						(ВЫБРАТЬ
	|							ВзаимозависимыеУслугиСуб.ОбъектРасчетаСубабонента
	|						ИЗ
	|							ВзаимозависимыеУслугиСуб КАК ВзаимозависимыеУслугиСуб)) КАК бестНагрузкаПоУслугамНПСрезПоследних
	|		ПО ВзаимозависимыеУслугиСуб.Организация = бестНагрузкаПоУслугамНПСрезПоследних.Организация
	|			И ВзаимозависимыеУслугиСуб.Район = бестНагрузкаПоУслугамНПСрезПоследних.Район
	|			И ВзаимозависимыеУслугиСуб.ОбъектРасчетаСубабонента = бестНагрузкаПоУслугамНПСрезПоследних.ОбъектРасчета
	|			И ВзаимозависимыеУслугиСуб.ЗависимаяУслуга = бестНагрузкаПоУслугамНПСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъемНачисленийСубабонентов.Организация КАК Организация,
	|	ОбъемНачисленийСубабонентов.Район КАК Район,
	|	ОбъемНачисленийСубабонентов.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ОбъемНачисленийСубабонентов.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|	ОбъемНачисленийСубабонентов.Услуга КАК Услуга,
	|	ОбъемНачисленийСубабонентов.МКД КАК МКД,
	|	ОбъемНачисленийСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	ОбъемНачисленийСубабонентов.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачисленийСубабонентов.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ОбъемНачисленийСубабонентов.ПриборУчета КАК ПриборУчета,
	|	NULL КАК Нагрузка,
	|	NULL КАК ТемператураПодачиИсточника,
	|	NULL КАК ТемператураХолоднойВодыИсточника
	|ПОМЕСТИТЬ ОбъемСубабонентовНачисленныйИРассчитанный
	|ИЗ
	|	ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	|ГДЕ
	|	ОбъемНачисленийСубабонентов.СпособРаспределенияОбъемаДолевойТУ <> ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъемНачисленийСубабонентов.Организация,
	|	ОбъемНачисленийСубабонентов.Район,
	|	ОбъемНачисленийСубабонентов.МКДДолевойТУ,
	|	ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ,
	|	ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета,
	|	ВЫБОР
	|		КОГДА ОбъемНачисленийСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ОбъемНачисленийСубабонентов.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|						ТОГДА ОбъемНачисленийСубабонентов.ЗначениеНагрузки * ОбъемНачисленийСубабонентов.КоличествоЧасовРаботыТУОборот * ((ДанныеПоТемпературам.ТемператураОптимальная - ДанныеПоТемпературам.СреднемесячнаяТемпература) / (ДанныеПоТемпературам.ТемператураОптимальная - ДанныеПоТемпературам.ПроектнаяТемпература))
	|					ИНАЧЕ ОбъемНачисленийСубабонентов.ЗначениеНагрузки * ОбъемНачисленийСубабонентов.КоличествоЧасовРаботыТУОборот
	|				КОНЕЦ
	|		КОГДА ОбъемНачисленийСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ТемпературныйКоэффициент)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеПоТемпературам.ТемператураПодачиИсточника - ДанныеПоТемпературам.ТемператураХолоднойВодыИсточника = 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(НагрузкиЗависимыхУслуг.Нагрузка, 0) * ОбъемНачисленийСубабонентов.КоличествоЧасовРаботыТУОборот / (ДанныеПоТемпературам.ТемператураПодачиИсточника - ДанныеПоТемпературам.ТемператураХолоднойВодыИсточника) * 1000
	|				КОНЕЦ
	|		КОГДА ОбъемНачисленийСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ОбъемНачисленийСубабонентов.ДоговорнойОбъем
	|	КОНЕЦ,
	|	ОбъемНачисленийСубабонентов.Услуга,
	|	ОбъемНачисленийСубабонентов.МКД,
	|	ОбъемНачисленийСубабонентов.ОбъектРасчета,
	|	ОбъемНачисленийСубабонентов.ТочкаУчета,
	|	ОбъемНачисленийСубабонентов.КоэффициентРасчета,
	|	ОбъемНачисленийСубабонентов.ПриборУчета,
	|	НагрузкиЗависимыхУслуг.Нагрузка,
	|	ДанныеПоТемпературам.ТемператураПодачиИсточника,
	|	ДанныеПоТемпературам.ТемператураХолоднойВодыИсточника
	|ИЗ
	|	ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НагрузкиЗависимыхУслуг КАК НагрузкиЗависимыхУслуг
	|		ПО ОбъемНачисленийСубабонентов.ОбъектРасчета = НагрузкиЗависимыхУслуг.ОбъектРасчетаСубабонента
	|			И ОбъемНачисленийСубабонентов.ТочкаУчета = НагрузкиЗависимыхУслуг.ТочкаУчетаСубабонента
	|			И ОбъемНачисленийСубабонентов.Услуга = НагрузкиЗависимыхУслуг.УслугаСубабонента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоТемпературам КАК ДанныеПоТемпературам
	|		ПО ОбъемНачисленийСубабонентов.ОбъектРасчета = ДанныеПоТемпературам.ОбъектРасчетаСубабонента
	|			И ОбъемНачисленийСубабонентов.ТочкаУчета = ДанныеПоТемпературам.ТочкаУчетаСубабонента
	|			И ОбъемНачисленийСубабонентов.Услуга = ДанныеПоТемпературам.УслугаСубабонента
	|ГДЕ
	|	ОбъемНачисленийСубабонентов.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Организация КАК Организация,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Район КАК Район,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	СУММА(ОбъемСубабонентовНачисленныйИРассчитанный.ОбъемУслугиОборот) КАК ОбъемУслугиОборот,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Услуга КАК Услуга
	|ПОМЕСТИТЬ СуммарныйОбъемСубабонентов
	|ИЗ
	|	ОбъемСубабонентовНачисленныйИРассчитанный КАК ОбъемСубабонентовНачисленныйИРассчитанный
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Организация,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Район,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.МКДДолевойТУ,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчетаДолевойТУ,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ГоловнаяТочкаУчета,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Организация КАК Организация,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Район КАК Район,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъемУслугиОборот * ОбъемСубабонентовНачисленныйИРассчитанный.КоэффициентРасчета КАК ОбъемСуб,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.МКД КАК МКД,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчета КАК ОбъектРасчета,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.Услуга КАК Услуга,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.КоэффициентРасчета КАК КоэффициентРасчета
	|ПОМЕСТИТЬ СубабонентыКРаспределению
	|ИЗ
	|	ОбъемСубабонентовНачисленныйИРассчитанный КАК ОбъемСубабонентовНачисленныйИРассчитанный
	|ГДЕ
	|	ОбъемСубабонентовНачисленныйИРассчитанный.КоэффициентРасчета <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СубабонентыКРаспределению.Организация КАК Организация,
	|	СубабонентыКРаспределению.Район КАК Район,
	|	СубабонентыКРаспределению.МКДДолевойТУ КАК МКДДолевойТУ,
	|	СубабонентыКРаспределению.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	СубабонентыКРаспределению.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	СУММА(СубабонентыКРаспределению.ОбъемСуб) КАК ОбъемСуб,
	|	СубабонентыКРаспределению.Услуга КАК Услуга
	|ПОМЕСТИТЬ ОбъемСубКРаспределению
	|ИЗ
	|	СубабонентыКРаспределению КАК СубабонентыКРаспределению
	|
	|СГРУППИРОВАТЬ ПО
	|	СубабонентыКРаспределению.Организация,
	|	СубабонентыКРаспределению.Район,
	|	СубабонентыКРаспределению.МКДДолевойТУ,
	|	СубабонентыКРаспределению.ОбъектРасчетаДолевойТУ,
	|	СубабонентыКРаспределению.ГоловнаяТочкаУчета,
	|	СубабонентыКРаспределению.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСубабонентов.Организация КАК Организация,
	|	ПараметрыСубабонентов.Район КАК Район,
	|	ПараметрыСубабонентов.МКД КАК МКД,
	|	ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|	ПараметрыСубабонентов.Услуга КАК Услуга,
	|	ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета,
	|	ПараметрыСубабонентов.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ПараметрыСубабонентов.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ПараметрыСубабонентов.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ПараметрыСубабонентов.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ПараметрыСубабонентов.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПараметрыСубабонентов.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПараметрыСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПараметрыСубабонентов.Приоритет КАК Приоритет,
	|	ПараметрыСубабонентов.ЗначениеНорматива КАК ЗначениеНорматива,
	|	ПараметрыСубабонентов.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПараметрыСубабонентов.ДоговорнойОбъем КАК ДоговорнойОбъем,
	|	ПараметрыСубабонентов.КоличествоПриборов КАК КоличествоПриборов,
	|	ПараметрыСубабонентов.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ПараметрыСубабонентов.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	ПараметрыСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	ПараметрыСубабонентов.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ПараметрыСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ,
	|	ПараметрыСубабонентов.ФиксированныйОбъем КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ ПараметрыСубабонентовСУчетомВыходаПУ
	|ИЗ
	|	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	|		ПО ПараметрыСубабонентов.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	|			И ПараметрыСубабонентов.Район = СхемыСВышедшимИзСтрояПУ.Район
	|			И ПараметрыСубабонентов.МКДДолевойТУ = СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ
	|			И ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	|			И ПараметрыСубабонентов.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	|			И ПараметрыСубабонентов.УслугаДолевойТУ = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	|ГДЕ
	|	ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПараметрыСубабонентов.Организация,
	|	ПараметрыСубабонентов.Район,
	|	ПараметрыСубабонентов.МКД,
	|	ПараметрыСубабонентов.ОбъектРасчета,
	|	ПараметрыСубабонентов.Услуга,
	|	ПараметрыСубабонентов.ТочкаУчета,
	|	ПараметрыСубабонентов.КоэффициентРасчета,
	|	ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ,
	|	ПараметрыСубабонентов.СпособРаспределенияОстаткаДолевыеСхемы,
	|	ПараметрыСубабонентов.ЗависимаяТочкаУчета,
	|	ПараметрыСубабонентов.ЗначениеПлощади,
	|	ПараметрыСубабонентов.ЗначениеНагрузки,
	|	ПараметрыСубабонентов.МКДДолевойТУ,
	|	ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ,
	|	ПараметрыСубабонентов.ГоловнаяТочкаУчета,
	|	ПараметрыСубабонентов.Приоритет,
	|	ПараметрыСубабонентов.ЗначениеНорматива,
	|	ПараметрыСубабонентов.СпособРасчетаНорматива,
	|	ПараметрыСубабонентов.ДоговорнойОбъем,
	|	ПараметрыСубабонентов.КоличествоПриборов,
	|	ПараметрыСубабонентов.РасчетИндивидуальногоПотребления,
	|	ПараметрыСубабонентов.КоэффициентДолевогоРаспределения,
	|	ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ,
	|	ПараметрыСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	|	ПараметрыСубабонентов.ЗависитОтУслуги,
	|	ПараметрыСубабонентов.УслугаДолевойТУ,
	|	ПараметрыСубабонентов.ФиксированныйОбъем
	|ИЗ
	|	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	|		ПО ПараметрыСубабонентов.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	|			И ПараметрыСубабонентов.Район = СхемыСВышедшимИзСтрояПУ.Район
	|			И ПараметрыСубабонентов.МКДДолевойТУ = СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ
	|			И ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	|			И ПараметрыСубабонентов.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	|			И ПараметрыСубабонентов.УслугаДолевойТУ = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	|ГДЕ
	|	НЕ ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ
	|	И СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСтабПериодовСуб.Организация КАК Организация,
	|	ПараметрыСтабПериодовСуб.Район КАК Район,
	|	ПараметрыСтабПериодовСуб.МКД КАК МКД,
	|	ПараметрыСтабПериодовСуб.ОбъектРасчета КАК ОбъектРасчета,
	|	ПараметрыСтабПериодовСуб.Услуга КАК Услуга,
	|	ПараметрыСтабПериодовСуб.ТочкаУчета КАК ТочкаУчета,
	|	ПараметрыСтабПериодовСуб.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ТочкиСубабонентов.СпособРаспределенияОстатка КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ПараметрыСтабПериодовСуб.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ПараметрыСтабПериодовСуб.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ПараметрыСтабПериодовСуб.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПараметрыСтабПериодовСуб.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПараметрыСтабПериодовСуб.Приоритет КАК Приоритет,
	|	ПараметрыСтабПериодовСуб.ЗначениеНорматива КАК ЗначениеНорматива,
	|	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПараметрыСтабПериодовСуб.ДоговорнойОбъем КАК ДоговорнойОбъем,
	|	ПараметрыСтабПериодовСуб.КоличествоПриборов КАК КоличествоПриборов,
	|	ПараметрыСтабПериодовСуб.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ТочкиСубабонентов.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ КАК СхемаРасчетаПриВыходеПУ,
	|	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	ПараметрыСтабПериодовСуб.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ПараметрыСтабПериодовСуб.УслугаДолевойТУ КАК УслугаДолевойТУ,
	|	ТочкиСубабонентов.ФиксированныйОбъем КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ ПараметрыСубСУчетомВыходаПУ
	|ИЗ
	|	ПараметрыСтабПериодовСуб КАК ПараметрыСтабПериодовСуб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	|		ПО ПараметрыСтабПериодовСуб.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	|			И ПараметрыСтабПериодовСуб.Район = СхемыСВышедшимИзСтрояПУ.Район
	|			И ПараметрыСтабПериодовСуб.МКДДолевойТУ = СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ
	|			И ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	|			И ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	|		ПО ПараметрыСтабПериодовСуб.Организация = ТочкиСубабонентов.Организация
	|			И ПараметрыСтабПериодовСуб.Район = ТочкиСубабонентов.Район
	|			И ПараметрыСтабПериодовСуб.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	|			И ПараметрыСтабПериодовСуб.Услуга = ТочкиСубабонентов.УслугаСубабонента
	|			И ПараметрыСтабПериодовСуб.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	|ГДЕ
	|	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПараметрыСтабПериодовСуб.Организация,
	|	ПараметрыСтабПериодовСуб.Район,
	|	ПараметрыСтабПериодовСуб.МКД,
	|	ПараметрыСтабПериодовСуб.ОбъектРасчета,
	|	ПараметрыСтабПериодовСуб.Услуга,
	|	ПараметрыСтабПериодовСуб.ТочкаУчета,
	|	ПараметрыСтабПериодовСуб.КоэффициентРасчета,
	|	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ,
	|	ТочкиСубабонентов.СпособРаспределенияОстатка,
	|	ПараметрыСтабПериодовСуб.ЗависимаяТочкаУчета,
	|	ПараметрыСтабПериодовСуб.ЗначениеПлощади,
	|	ПараметрыСтабПериодовСуб.ЗначениеНагрузки,
	|	ПараметрыСтабПериодовСуб.МКДДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ,
	|	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета,
	|	ПараметрыСтабПериодовСуб.Приоритет,
	|	ПараметрыСтабПериодовСуб.ЗначениеНорматива,
	|	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива,
	|	ПараметрыСтабПериодовСуб.ДоговорнойОбъем,
	|	ПараметрыСтабПериодовСуб.КоличествоПриборов,
	|	ПараметрыСтабПериодовСуб.РасчетИндивидуальногоПотребления,
	|	ТочкиСубабонентов.КоэффициентДолевогоРаспределения,
	|	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ,
	|	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	|	ПараметрыСтабПериодовСуб.ЗависитОтУслуги,
	|	ПараметрыСтабПериодовСуб.УслугаДолевойТУ,
	|	ТочкиСубабонентов.ФиксированныйОбъем
	|ИЗ
	|	ПараметрыСтабПериодовСуб КАК ПараметрыСтабПериодовСуб
	|		ЛЕВОЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	|		ПО ПараметрыСтабПериодовСуб.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	|			И ПараметрыСтабПериодовСуб.Район = СхемыСВышедшимИзСтрояПУ.Район
	|			И ПараметрыСтабПериодовСуб.МКДДолевойТУ = СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ
	|			И ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	|			И ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	|			И ПараметрыСтабПериодовСуб.УслугаДолевойТУ = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	|		ПО ПараметрыСтабПериодовСуб.Организация = ТочкиСубабонентов.Организация
	|			И ПараметрыСтабПериодовСуб.Район = ТочкиСубабонентов.Район
	|			И ПараметрыСтабПериодовСуб.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	|			И ПараметрыСтабПериодовСуб.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	|			И ПараметрыСтабПериодовСуб.Услуга = ТочкиСубабонентов.УслугаСубабонента
	|ГДЕ
	|	СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ ЕСТЬ NULL
	|	И НЕ ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыСубабонентовСУчетомВыходаПУ.Организация КАК Организация,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.Район КАК Район,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.МКД КАК МКД,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета КАК ОбъектРасчета,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.Услуга КАК Услуга,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета КАК ТочкаУчета,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВЫБОР
	|		КОГДА ЗначенияПараметровОсновныхТочек.ТочкаУчета ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНагрузки = 0
	|						ТОГДА ЗначениеНагрузкиЗависимойУслуги.ЗначениеНагрузки
	|					ИНАЧЕ ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНагрузки
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыСубабонентовСУчетомВыходаПУ.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|					ТОГДА ЗначенияПараметровОсновныхТочек.ЗначениеНагрузки * ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНорматива
	|				ИНАЧЕ ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНагрузки
	|			КОНЕЦ
	|	КОНЕЦ КАК ЗначениеНагрузки,
	|	ВЫБОР
	|		КОГДА ЗначенияПараметровОсновныхТочек.ТочкаУчета ЕСТЬ NULL
	|			ТОГДА ПараметрыСубабонентовСУчетомВыходаПУ.ДоговорнойОбъем
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПараметрыСубабонентовСУчетомВыходаПУ.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|					ТОГДА ЗначенияПараметровОсновныхТочек.ДоговорнойОбъем * ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНорматива
	|				ИНАЧЕ ПараметрыСубабонентовСУчетомВыходаПУ.ДоговорнойОбъем
	|			КОНЕЦ
	|	КОНЕЦ КАК ДоговорнойОбъем,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.Приоритет КАК Приоритет,
	|	ОбъемСубабонентовНачисленныйИРассчитанный.ПриборУчета КАК ПриборУчета,
	|	ЕСТЬNULL(ОбъемСубабонентовНачисленныйИРассчитанный.ОбъемУслугиОборот, 0) КАК ОбъемУслугиОборот,
	|	ВЫБОР
	|		КОГДА ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчета ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИндивидуальныеНачисления,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.КоличествоПриборов КАК КоличествоПриборов,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ЕСТЬNULL(бестУровниВложенностиРасчетныхСхемСрезПоследних.Уровень, 0) КАК Уровень,
	|	ЕСТЬNULL(ОбъемНачисленийСубабонентов.ОбъемУслугиОборот, 0) КАК ИндивидуальныйОбъемСуб,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.УслугаДолевойТУ КАК УслугаДолевойТУ,
	|	ОбъемНачисленийСубабонентов.ВидНачисления КАК ВидНачисления,
	|	ОбъемНачисленийСубабонентов.СпособНачисления КАК СпособНачисления,
	|	ОбъемНачисленийСубабонентов.ПериодРасчета КАК ПериодРасчета,
	|	ОбъемНачисленийСубабонентов.ПериодНачисления КАК ПериодНачисления,
	|	ПараметрыСубабонентовСУчетомВыходаПУ.ФиксированныйОбъем КАК ФиксированныйОбъем,
	|	ОбъемНачисленийСубабонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемНачисленийСубабонентов.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ДанныеПоСубабонентам
	|ИЗ
	|	ПараметрыСубабонентовСУчетомВыходаПУ КАК ПараметрыСубабонентовСУчетомВыходаПУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемСубабонентовНачисленныйИРассчитанный КАК ОбъемСубабонентовНачисленныйИРассчитанный
	|		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Организация = ОбъемСубабонентовНачисленныйИРассчитанный.Организация
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.Район = ОбъемСубабонентовНачисленныйИРассчитанный.Район
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.МКД = ОбъемСубабонентовНачисленныйИРассчитанный.МКД
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчета
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = ОбъемСубабонентовНачисленныйИРассчитанный.Услуга
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ОбъемСубабонентовНачисленныйИРассчитанный.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметровОсновныхТочек КАК ЗначенияПараметровОсновныхТочек
	|		ПО ПараметрыСубабонентовСУчетомВыходаПУ.МКД = ЗначенияПараметровОсновныхТочек.МКД
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ЗначенияПараметровОсновныхТочек.ОбъектРасчета
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ЗначенияПараметровОсновныхТочек.ТочкаУчета
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга.ЗависитОтУслуги = ЗначенияПараметровОсновныхТочек.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначениеНагрузкиЗависимойУслуги КАК ЗначениеНагрузкиЗависимойУслуги
	|		ПО ПараметрыСубабонентовСУчетомВыходаПУ.МКД = ЗначениеНагрузкиЗависимойУслуги.МКД
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ЗначениеНагрузкиЗависимойУслуги.ОбъектРасчета
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = ЗначениеНагрузкиЗависимойУслуги.Услуга
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ЗначениеНагрузкиЗависимойУслуги.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУровниВложенностиРасчетныхСхем.СрезПоследних(&КонецПериода, ) КАК бестУровниВложенностиРасчетныхСхемСрезПоследних
	|		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Организация = бестУровниВложенностиРасчетныхСхемСрезПоследних.Организация
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.Район = бестУровниВложенностиРасчетныхСхемСрезПоследних.Район
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчетаДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.ОбъектРасчета
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ГоловнаяТочкаУчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ТочкаУчета
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.УслугаДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	|		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Организация = ОбъемНачисленийСубабонентов.Организация
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.Район = ОбъемНачисленийСубабонентов.Район
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.МКД = ОбъемНачисленийСубабонентов.МКД
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ОбъемНачисленийСубабонентов.ОбъектРасчета
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = ОбъемНачисленийСубабонентов.Услуга
	|			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ОбъемНачисленийСубабонентов.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УровеньДолевыхТУ.Организация КАК Организация,
	|	УровеньДолевыхТУ.Район КАК Район,
	|	УровеньДолевыхТУ.ОбъектРасчета КАК ОбъектРасчета,
	|	УровеньДолевыхТУ.Услуга КАК Услуга,
	|	УровеньДолевыхТУ.МКД КАК МКД,
	|	УровеньДолевыхТУ.ТочкаУчета КАК ТочкаУчета,
	|	УровеньДолевыхТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	УровеньДолевыхТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ЕСТЬNULL(ПлощадьСубабонентов.ЗначениеПлощади, 0) КАК СуммарноеЗначениеПлощадиСубабонентов,
	|	ЕСТЬNULL(ДоговорныеОбъемыНагрузка.ЗначениеНагрузки, 0) КАК СуммарноеЗначениеНагрузкиСубабонентов,
	|	ЕСТЬNULL(ДоговорныеОбъемыНагрузка.ДоговорнойОбъем, 0) КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	|	КоличествоПриборов.КоличествоТУ КАК ВсегоТочекУчетаСубабонентов,
	|	КоличествоПриборов.КоличествоПУ КАК ВсегоПриборовУчетаСубабонентов,
	|	УровеньДолевыхТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ОбъемСубКРаспределению.ОбъемСуб КАК ОбъемСубКРАспределению,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	УровеньДолевыхТУ.Уровень КАК Уровень,
	|	ВЫБОР
	|		КОГДА СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СхемаРасчетаПриВыходеПУ
	|ПОМЕСТИТЬ ДанныеПоДолевымТУ
	|ИЗ
	|	УровеньДолевыхТУ КАК УровеньДолевыхТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|			ВложенныйЗапрос.МКДДолевойТУ КАК МКДДолевойТУ,
	|			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|			СУММА(ВложенныйЗапрос.ЗначениеПлощади) КАК ЗначениеПлощади
	|		ИЗ
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|				ПараметрыСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|				ПараметрыСубабонентов.МКДДолевойТУ КАК МКДДолевойТУ,
	|				ПараметрыСубабонентов.ЗначениеПлощади КАК ЗначениеПлощади,
	|				ПараметрыСубабонентов.МКД КАК МКД,
	|				ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	|				ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета
	|			ИЗ
	|				ПараметрыСубабонентов КАК ПараметрыСубабонентов
	|			ГДЕ
	|				ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ <> ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПустаяСсылка)) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ,
	|			ВложенныйЗапрос.ГоловнаяТочкаУчета,
	|			ВложенныйЗапрос.МКДДолевойТУ) КАК ПлощадьСубабонентов
	|		ПО УровеньДолевыхТУ.МКД = ПлощадьСубабонентов.МКДДолевойТУ
	|			И УровеньДолевыхТУ.ОбъектРасчета = ПлощадьСубабонентов.ОбъектРасчетаДолевойТУ
	|			И УровеньДолевыхТУ.ТочкаУчета = ПлощадьСубабонентов.ГоловнаяТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|			ДанныеПоСубабонентам.МКДДолевойТУ КАК МКДДолевойТУ,
	|			ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|			СУММА(ДанныеПоСубабонентам.ДоговорнойОбъем) КАК ДоговорнойОбъем,
	|			ДанныеПоСубабонентам.Услуга КАК Услуга,
	|			СУММА(ДанныеПоСубабонентам.ЗначениеНагрузки) КАК ЗначениеНагрузки
	|		ИЗ
	|			ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ,
	|			ДанныеПоСубабонентам.ГоловнаяТочкаУчета,
	|			ДанныеПоСубабонентам.МКДДолевойТУ,
	|			ДанныеПоСубабонентам.Услуга) КАК ДоговорныеОбъемыНагрузка
	|		ПО УровеньДолевыхТУ.МКД = ДоговорныеОбъемыНагрузка.МКДДолевойТУ
	|			И УровеньДолевыхТУ.ОбъектРасчета = ДоговорныеОбъемыНагрузка.ОбъектРасчетаДолевойТУ
	|			И УровеньДолевыхТУ.ТочкаУчета = ДоговорныеОбъемыНагрузка.ГоловнаяТочкаУчета
	|			И УровеньДолевыхТУ.Услуга = ДоговорныеОбъемыНагрузка.Услуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.Район КАК Район,
	|			ВложенныйЗапрос.МКДДолевойТУ КАК МКДДолевойТУ,
	|			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|			ВложенныйЗапрос.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|			СУММА(ВложенныйЗапрос.КоличествоТУ) КАК КоличествоТУ,
	|			СУММА(ВложенныйЗапрос.КоличествоПУ) КАК КоличествоПУ,
	|			ВложенныйЗапрос.УслугаДолевойТУ КАК УслугаДолевойТУ
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ДанныеПоСубабонентам.Организация КАК Организация,
	|				ДанныеПоСубабонентам.Район КАК Район,
	|				ДанныеПоСубабонентам.МКД КАК МКД,
	|				ДанныеПоСубабонентам.Услуга КАК Услуга,
	|				ДанныеПоСубабонентам.ОбъектРасчета КАК ОбъектРасчета,
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПоСубабонентам.ТочкаУчета) КАК КоличествоТУ,
	|				ДанныеПоСубабонентам.МКДДолевойТУ КАК МКДДолевойТУ,
	|				ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|				ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|				СУММА(ДанныеПоСубабонентам.КоличествоПриборов) КАК КоличествоПУ,
	|				ДанныеПоСубабонентам.УслугаДолевойТУ КАК УслугаДолевойТУ
	|			ИЗ
	|				ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДанныеПоСубабонентам.Организация,
	|				ДанныеПоСубабонентам.Район,
	|				ДанныеПоСубабонентам.МКД,
	|				ДанныеПоСубабонентам.Услуга,
	|				ДанныеПоСубабонентам.ОбъектРасчета,
	|				ДанныеПоСубабонентам.МКДДолевойТУ,
	|				ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ,
	|				ДанныеПоСубабонентам.ГоловнаяТочкаУчета,
	|				ДанныеПоСубабонентам.УслугаДолевойТУ) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.Район,
	|			ВложенныйЗапрос.МКДДолевойТУ,
	|			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ,
	|			ВложенныйЗапрос.ГоловнаяТочкаУчета,
	|			ВложенныйЗапрос.УслугаДолевойТУ) КАК КоличествоПриборов
	|		ПО УровеньДолевыхТУ.Организация = КоличествоПриборов.Организация
	|			И УровеньДолевыхТУ.Район = КоличествоПриборов.Район
	|			И УровеньДолевыхТУ.МКД = КоличествоПриборов.МКДДолевойТУ
	|			И УровеньДолевыхТУ.ОбъектРасчета = КоличествоПриборов.ОбъектРасчетаДолевойТУ
	|			И УровеньДолевыхТУ.ТочкаУчета = КоличествоПриборов.ГоловнаяТочкаУчета
	|			И УровеньДолевыхТУ.Услуга = КоличествоПриборов.УслугаДолевойТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемСубКРаспределению КАК ОбъемСубКРаспределению
	|		ПО УровеньДолевыхТУ.Организация = ОбъемСубКРаспределению.Организация
	|			И УровеньДолевыхТУ.Район = ОбъемСубКРаспределению.Район
	|			И УровеньДолевыхТУ.МКД = ОбъемСубКРаспределению.МКДДолевойТУ
	|			И УровеньДолевыхТУ.ОбъектРасчета = ОбъемСубКРаспределению.ОбъектРасчетаДолевойТУ
	|			И УровеньДолевыхТУ.ТочкаУчета = ОбъемСубКРаспределению.ГоловнаяТочкаУчета
	|			И УровеньДолевыхТУ.Услуга = ОбъемСубКРаспределению.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО УровеньДолевыхТУ.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	|		ПО УровеньДолевыхТУ.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	|			И УровеньДолевыхТУ.Район = СхемыСВышедшимИзСтрояПУ.Район
	|			И УровеньДолевыхТУ.МКД = СхемыСВышедшимИзСтрояПУ.МКДДолевойТУ
	|			И УровеньДолевыхТУ.ОбъектРасчета = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	|			И УровеньДолевыхТУ.Услуга = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	|			И УровеньДолевыхТУ.ТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета";
	
	
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"И (бестСтабильныеПериодыНП.МКД = &МКД)","И (бестСтабильныеПериодыНП.МКД <> &МКД)");
		Текст 		= СтрЗаменить(Текст,"И бестОтложенныеДвиженияДокументовНП.МКД = &МКД","И бестОтложенныеДвиженияДокументовНП.МКД <> &МКД");
		
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"И (бестСтабильныеПериодыНП.МКД = &МКД)","");
			Текст 		= СтрЗаменить(Текст,"бестОтложенныеДвиженияДокументовНП.МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам()
	Текст 							= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.ОбъемУслугиОборот КАК ОбъемУслуги,
	|	ВложенныйЗапрос.ДокументНачисленияПоДолевымСхемам КАК ДокументНачисленияПоДолевымСхемам,
	|	ВложенныйЗапрос.ОбъемПотребленияСубабонентов КАК ОбъемПотребленияСубабонентов,
	|	ВложенныйЗапрос.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ВложенныйЗапрос.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВложенныйЗапрос.СуммарноеЗначениеПлощадиСубабонентов КАК СуммарноеЗначениеПлощадиСубабонентов,
	|	ВложенныйЗапрос.СуммарноеЗначениеНагрузкиСубабонентов КАК СуммарноеЗначениеНагрузкиСубабонентов,
	|	ВложенныйЗапрос.СуммарноеЗначениеДоговорногоОбъемаСуб КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	|	ВложенныйЗапрос.ВсегоТочекУчетаСубабонентов КАК ВсегоТочекУчетаСубабонентов,
	|	ВложенныйЗапрос.ВсегоПриборовУчетаСубабонентов КАК ВсегоПриборовУчетаСубабонентов,
	|	ВложенныйЗапрос.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ВложенныйЗапрос.ОбъемСубКРАспределению КАК ОбъемСубКРаспределению,
	|	ВложенныйЗапрос.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ВложенныйЗапрос.Уровень КАК Уровень,
	|	ВложенныйЗапрос.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоДолевымТУ.Организация КАК Организация,
	|		ДанныеПоДолевымТУ.Район КАК Район,
	|		ДанныеПоДолевымТУ.МКД КАК МКД,
	|		ДанныеПоДолевымТУ.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеПоДолевымТУ.Услуга КАК Услуга,
	|		ДанныеПоДолевымТУ.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоДолевымТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|		ДанныеПоДолевымТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	|		ОбъемыДолевойТУДляРаспределения.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|		ОбъемыДолевойТУДляРаспределения.ПриборУчета КАК ПриборУчета,
	|		ОбъемыДолевойТУДляРаспределения.СпособНачисления КАК СпособНачисления,
	|		ЕСТЬNULL(ДокументНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеПоДолевымСхемам.ПустаяСсылка)) КАК ДокументНачисленияПоДолевымСхемам,
	|		СуммарныйОбъемСубабонентов.МКДДолевойТУ КАК МКДДолевойТУ,
	|		СуммарныйОбъемСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|		СуммарныйОбъемСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|		СуммарныйОбъемСубабонентов.ОбъемУслугиОборот КАК ОбъемПотребленияСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеПлощадиСубабонентов КАК СуммарноеЗначениеПлощадиСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеНагрузкиСубабонентов КАК СуммарноеЗначениеНагрузкиСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеДоговорногоОбъемаСуб КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	|		ДанныеПоДолевымТУ.ВсегоТочекУчетаСубабонентов КАК ВсегоТочекУчетаСубабонентов,
	|		ДанныеПоДолевымТУ.ВсегоПриборовУчетаСубабонентов КАК ВсегоПриборовУчетаСубабонентов,
	|		ДанныеПоДолевымТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|		ЕСТЬNULL(ДанныеПоДолевымТУ.ОбъемСубКРАспределению, 0) КАК ОбъемСубКРАспределению,
	|		ДанныеПоДолевымТУ.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|		ЕСТЬNULL(ДанныеПоДолевымТУ.Уровень, 0) КАК Уровень,
	|		ДанныеПоДолевымТУ.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ
	|	ИЗ
	|		ДанныеПоДолевымТУ КАК ДанныеПоДолевымТУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыДолевойТУДляРаспределения КАК ОбъемыДолевойТУДляРаспределения
	|			ПО ДанныеПоДолевымТУ.Район = ОбъемыДолевойТУДляРаспределения.Район
	|				И ДанныеПоДолевымТУ.МКД = ОбъемыДолевойТУДляРаспределения.МКД
	|				И ДанныеПоДолевымТУ.ОбъектРасчета = ОбъемыДолевойТУДляРаспределения.ОбъектРасчета
	|				И ДанныеПоДолевымТУ.Услуга = ОбъемыДолевойТУДляРаспределения.Услуга
	|				И ДанныеПоДолевымТУ.ТочкаУчета = ОбъемыДолевойТУДляРаспределения.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеПоДолевымСхемам КАК ДокументНачисления
	|			ПО (ДокументНачисления.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И ДанныеПоДолевымТУ.Организация = ДокументНачисления.Организация
	|				И ДанныеПоДолевымТУ.Район = ДокументНачисления.Район
	|				И ДанныеПоДолевымТУ.МКД = ДокументНачисления.МКД
	|			ЛЕВОЕ СОЕДИНЕНИЕ СуммарныйОбъемСубабонентов КАК СуммарныйОбъемСубабонентов
	|			ПО ДанныеПоДолевымТУ.МКД = СуммарныйОбъемСубабонентов.МКДДолевойТУ
	|				И ДанныеПоДолевымТУ.ОбъектРасчета = СуммарныйОбъемСубабонентов.ОбъектРасчетаДолевойТУ
	|				И ДанныеПоДолевымТУ.ТочкаУчета = СуммарныйОбъемСубабонентов.ГоловнаяТочкаУчета
	|				И ДанныеПоДолевымТУ.Услуга = СуммарныйОбъемСубабонентов.Услуга) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКД,
	|	ОбъектРасчета,
	|	Уровень,
	|	ТочкаУчета,
	|	ЗависитОтУслуги,
	|	Услуга
	|ИТОГИ
	|	МАКСИМУМ(ДокументНачисленияПоДолевымСхемам)
	|ПО
	|	МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоСубабонентам.Организация КАК Организация,
	|	ДанныеПоСубабонентам.Район КАК Район,
	|	ДанныеПоСубабонентам.МКД КАК МКД,
	|	ДанныеПоСубабонентам.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеПоСубабонентам.Услуга КАК Услуга,
	|	ДанныеПоСубабонентам.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПоСубабонентам.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеПоСубабонентам.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ДанныеПоСубабонентам.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ДанныеПоСубабонентам.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеПоСубабонентам.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеПоСубабонентам.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДанныеПоСубабонентам.ДоговорнойОбъем КАК ДоговорнойОбъем,
	|	ДанныеПоСубабонентам.МКДДолевойТУ КАК МКДДолевойТУ,
	|	ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДанныеПоСубабонентам.Приоритет КАК Приоритет,
	|	ДанныеПоСубабонентам.ПриборУчета КАК ПриборУчета,
	|	ДанныеПоСубабонентам.ОбъемУслугиОборот КАК ОбъемУслуги,
	|	ДанныеПоСубабонентам.ИндивидуальныйОбъемСуб КАК ИндивидуальныйОбъемСуб,
	|	ДанныеПоСубабонентам.ВидНачисления КАК ВидНачисления,
	|	ДанныеПоСубабонентам.СпособНачисления КАК СпособНачисления,
	|	ДанныеПоСубабонентам.ПериодРасчета КАК ПериодРасчета,
	|	ДанныеПоСубабонентам.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеПоСубабонентам.ЕстьИндивидуальныеНачисления КАК ЕстьИндивидуальныеНачисления,
	|	ДанныеПоСубабонентам.КоличествоПриборов КАК КоличествоПриборов,
	|	ДанныеПоСубабонентам.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ДанныеПоСубабонентам.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ДанныеПоСубабонентам.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	ДанныеПоСубабонентам.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеПоСубабонентам.Уровень КАК Уровень,
	|	ДанныеПоСубабонентам.ФиксированныйОбъем КАК ФиксированныйОбъем,
	|	ДанныеПоСубабонентам.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеПоСубабонентам.Поставщик КАК Поставщик
	|ИЗ
	|	ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКДДолевойТУ,
	|	ОбъектРасчетаДолевойТУ,
	|	Уровень,
	|	ГоловнаяТочкаУчета,
	|	ЗависитОтУслуги,
	|	Услуга,
	|	Приоритет";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДополнительныеНачисленияЮЛ()
	Возврат 
	"ВЫБРАТЬ
	|	бестПревышениеПДКСрезПоследних.Организация КАК Организация,
	|	бестПревышениеПДКСрезПоследних.Район КАК Район,
	|	бестПревышениеПДКСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПревышениеПДКСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПревышениеПДКСрезПоследних.Услуга КАК Услуга,
	|	бестПревышениеПДКСрезПоследних.КоличествоЗагрязняющихВеществ КАК Коэффициент,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_ПревышениеПДК) КАК ВидДопНачисления
	|ПОМЕСТИТЬ ДанныеДляДопНачисления
	|ИЗ
	|	РегистрСведений.бестПревышениеПДК.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПериодНачисления = &ПериодНачисления) КАК бестПревышениеПДКСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПромывкаОтопительнойСистемыСрезПоследних.Организация,
	|	бестПромывкаОтопительнойСистемыСрезПоследних.Район,
	|	бестПромывкаОтопительнойСистемыСрезПоследних.ОбъектРасчета,
	|	бестПромывкаОтопительнойСистемыСрезПоследних.ТочкаУчета,
	|	бестПромывкаОтопительнойСистемыСрезПоследних.Услуга,
	|	бестПромывкаОтопительнойСистемыСрезПоследних.Процент / 100,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_ПромывкаОтопительнойСистемы)
	|ИЗ
	|	РегистрСведений.бестПромывкаОтопительнойСистемы.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПериодНачисления = &ПериодНачисления) КАК бестПромывкаОтопительнойСистемыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПриемЛивневыхСтоковСрезПоследних.Организация,
	|	бестПриемЛивневыхСтоковСрезПоследних.Район,
	|	бестПриемЛивневыхСтоковСрезПоследних.ОбъектРасчета,
	|	бестПриемЛивневыхСтоковСрезПоследних.ТочкаУчета,
	|	бестПриемЛивневыхСтоковСрезПоследних.Услуга,
	|	бестПриемЛивневыхСтоковСрезПоследних.Процент / 100,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_ПриемЛивневыхСтоков)
	|ИЗ
	|	РегистрСведений.бестПриемЛивневыхСтоков.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПериодНачисления = &ПериодНачисления) КАК бестПриемЛивневыхСтоковСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестНегативноеВоздействиеСрезПоследних.Организация,
	|	бестНегативноеВоздействиеСрезПоследних.Район,
	|	бестНегативноеВоздействиеСрезПоследних.ОбъектРасчета,
	|	бестНегативноеВоздействиеСрезПоследних.ТочкаУчета,
	|	бестНегативноеВоздействиеСрезПоследних.Услуга,
	|	бестНегативноеВоздействиеСрезПоследних.Коэффициент,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие)
	|ИЗ
	|	РегистрСведений.бестНегативноеВоздействие.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПериодНачисления = &ПериодНачисления) КАК бестНегативноеВоздействиеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	|	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	|	бестОбъемНачисленийНП.Распределение КАК Распределение,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.ДолевоеРаспределение КАК ДолевоеРаспределение,
	|	бестОбъемНачисленийНП.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВЫБОР
	|		КОГДА ДанныеДляДопНачисления.ВидДопНачисления <> ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие)
	|			ТОГДА бестОбъемНачисленийНП.ОбъемУслуги * ДанныеДляДопНачисления.Коэффициент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА ДанныеДляДопНачисления.ВидДопНачисления <> ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие)
	|			ТОГДА бестОбъемНачисленийНП.ОбъемУслугиПотребленный * ДанныеДляДопНачисления.Коэффициент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленный,
	|	бестОбъемНачисленийНП.Сумма * ДанныеДляДопНачисления.Коэффициент КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДанныеДляДопНачисления.ВидДопНачисления <> ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие)
	|			ТОГДА бестОбъемНачисленийНП.СуммаНДС * ДанныеДляДопНачисления.Коэффициент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС,
	|	бестОбъемНачисленийНП.НачалоПериода КАК НачалоПериода,
	|	бестОбъемНачисленийНП.КонецПериода КАК КонецПериода,
	|	бестОбъемНачисленийНП.НачальныеПоказания КАК НачальныеПоказания,
	|	бестОбъемНачисленийНП.КонечныеПоказания КАК КонечныеПоказания,
	|	бестОбъемНачисленийНП.ЗначениеПлощади КАК ЗначениеПлощади,
	|	бестОбъемНачисленийНП.НормаПотребления КАК НормаПотребления,
	|	бестОбъемНачисленийНП.РасчетПоФормуле КАК РасчетПоФормуле,
	|	бестОбъемНачисленийНП.ДатаПоверки КАК ДатаПоверки,
	|	бестОбъемНачисленийНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	бестОбъемНачисленийНП.КоэффициентРасчета КАК КоэффициентРасчета,
	|	бестОбъемНачисленийНП.ВидДифференцированности КАК ВидДифференцированности,
	|	бестОбъемНачисленийНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	бестОбъемНачисленийНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	бестОбъемНачисленийНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	бестОбъемНачисленийНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	бестОбъемНачисленийНП.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	бестОбъемНачисленийНП.СписатьИзНормы КАК СписатьИзНормы,
	|	бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	бестОбъемНачисленийНП.СоставнаяУслуга КАК СоставнаяУслуга,
	|	бестОбъемНачисленийНП.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	бестОбъемНачисленийНП.ПлощадьМОП КАК ПлощадьМОП,
	|	бестОбъемНачисленийНП.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	бестОбъемНачисленийНП.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	бестОбъемНачисленийНП.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	бестОбъемНачисленийНП.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	бестОбъемНачисленийНП.ДиаметрСечения КАК ДиаметрСечения,
	|	бестОбъемНачисленийНП.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	бестОбъемНачисленийНП.СтавкаНДС КАК СтавкаНДС,
	|	бестОбъемНачисленийНП.НДСВнутри КАК НДСВнутри,
	|	ДанныеДляДопНачисления.ВидДопНачисления КАК ВидДопНачисления
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляДопНачисления КАК ДанныеДляДопНачисления
	|		ПО бестОбъемНачисленийНП.Организация = ДанныеДляДопНачисления.Организация
	|			И бестОбъемНачисленийНП.Район = ДанныеДляДопНачисления.Район
	|			И бестОбъемНачисленийНП.ОбъектРасчета = ДанныеДляДопНачисления.ОбъектРасчета
	|			И бестОбъемНачисленийНП.Услуга = ДанныеДляДопНачисления.Услуга
	|			И (бестОбъемНачисленийНП.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление))
	|			И (бестОбъемНачисленийНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестОбъемНачисленийНП.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|			И (бестОбъемНачисленийНП.ВидДопНачисления = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПустаяСсылка))
	|			И (бестОбъемНачисленийНП.ОбъемУслуги <> 0
	|				ИЛИ бестОбъемНачисленийНП.ОбъемУслугиПотребленный <> 0)
	|			И бестОбъемНачисленийНП.ТочкаУчета = ДанныеДляДопНачисления.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДополнительныеНачисления.Ссылка КАК Ссылка,
	|	бестДополнительныеНачисления.Организация КАК Организация,
	|	бестДополнительныеНачисления.Район КАК Район,
	|	бестДополнительныеНачисления.МКД КАК МКД,
	|	ДОБАВИТЬКДАТЕ(&КонецПериодаРасчета, СЕКУНДА, -1) КАК Дата
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	Документ.бестДополнительныеНачисления КАК бестДополнительныеНачисления
	|ГДЕ
	|	бестДополнительныеНачисления.Организация = &Организация
	|	И бестДополнительныеНачисления.Район = &Район
	|	И бестДополнительныеНачисления.МКД = &МКД
	|	И бестДополнительныеНачисления.Дата = ДОБАВИТЬКДАТЕ(&КонецПериодаРасчета, СЕКУНДА, -1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результат.Организация КАК Организация,
	|	Результат.Район КАК Район,
	|	Результат.Договор КАК Договор,
	|	Результат.ОбъектРасчета КАК ОбъектРасчета,
	|	Результат.Услуга КАК Услуга,
	|	Результат.ТочкаУчета КАК ТочкаУчета,
	|	Результат.ВидНачисления КАК ВидНачисления,
	|	Результат.СпособНачисления КАК СпособНачисления,
	|	Результат.ПриборУчета КАК ПриборУчета,
	|	Результат.Шкала КАК Шкала,
	|	Результат.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Результат.ПериодРасчета КАК ПериодРасчета,
	|	Результат.ПериодНачисления КАК ПериодНачисления,
	|	Результат.Распределение КАК Распределение,
	|	Результат.Поставщик КАК Поставщик,
	|	Результат.МКД КАК МКД,
	|	Результат.ДолевоеРаспределение КАК ДолевоеРаспределение,
	|	Результат.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Результат.НачалоПериода КАК НачалоПериода,
	|	Результат.КонецПериода КАК КонецПериода,
	|	Результат.НачальныеПоказания КАК НачальныеПоказания,
	|	Результат.КонечныеПоказания КАК КонечныеПоказания,
	|	Результат.ЗначениеПлощади КАК ЗначениеПлощади,
	|	Результат.НормаПотребления КАК НормаПотребления,
	|	Результат.РасчетПоФормуле КАК РасчетПоФормуле,
	|	Результат.ДатаПоверки КАК ДатаПоверки,
	|	Результат.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	Результат.КоэффициентРасчета КАК КоэффициентРасчета,
	|	Результат.ВидДифференцированности КАК ВидДифференцированности,
	|	Результат.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	Результат.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	Результат.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	Результат.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Результат.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	Результат.СписатьИзНормы КАК СписатьИзНормы,
	|	Результат.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	Результат.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Результат.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	Результат.ПлощадьМОП КАК ПлощадьМОП,
	|	Результат.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	Результат.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	Результат.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	Результат.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	Результат.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	Результат.ДиаметрСечения КАК ДиаметрСечения,
	|	Результат.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Результат.СтавкаНДС КАК СтавкаНДС,
	|	Результат.НДСВнутри КАК НДСВнутри,
	|	Результат.ВидДопНачисления КАК ВидДопНачисления,
	|	Результат.ОбъемУслуги КАК ОбъемУслуги,
	|	Результат.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	Результат.Сумма КАК Сумма,
	|	Результат.СуммаНДС КАК СуммаНДС,
	|	ДокументыНачислений.Ссылка КАК ДокументНачисления
	|ИЗ
	|	Результат КАК Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО Результат.Организация = ДокументыНачислений.Организация
	|			И Результат.Район = ДокументыНачислений.Район
	|			И Результат.МКД = ДокументыНачислений.МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыНачислений.Ссылка КАК ДокументНачисления
	|ИЗ
	|	ДокументыНачислений КАК ДокументыНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Результат КАК Результат
	|		ПО ДокументыНачислений.Организация = Результат.Организация
	|			И ДокументыНачислений.Район = Результат.Район
	|			И ДокументыНачислений.МКД = Результат.МКД
	|ГДЕ
	|	Результат.Организация ЕСТЬ NULL";
	
КонецФункции

#КонецОбласти 

#Область Начислить_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,ИсключаяОтдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде)
	
	МВТ  = Новый МенеджерВременныхТаблиц;
	ВспомогательныеДанныеНачисленияНП(МВТ,Организация, ПериодНачисления,Район,ИсключаяОтдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде);
	ПолучитьСтабильныеПериодыНП(МВТ);
	ПолучитьДанныеДляРасчетаНП(МВТ,ЛОЖЬ,Ложь);
	Возврат РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,Ложь);
	
	
КонецФункции

#КонецОбласти


#Область ЗакрытьПериодДляРедактирования_ВспомогательныеФункции

Функция ДокуметЗакрытияПериода(ПериодНачисления,Район)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	НЕ энргЗакрытиеПериода.ПометкаУдаления
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат  Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.энргЗакрытиеПериода.ПустаяСсылка();	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляОтладкиИТестирования

Функция ПрочитатьДанныеВременнойТаблицы(МВТ,ТекстЗапроса) 
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область НачислениеПоДолевымСхемам

Процедура НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, МКД, ТочкаУчета, Услуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке)
	
	ПустаяТочкаУчета 					= Справочники.энргТочкиУчета.ПустаяСсылка();
	ВидНачисления 						= Перечисления.энргВидыНачислений.Начисление;
	
	кРаспределения                      = 0;
	
	Для Каждого СтрокаНачисленийСуб Из ДанныеПоУслуге.ДанныеНачисленийСубабонентов Цикл
		СтрокаНабора  					= НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийСуб);
		СтрокаНабора.ОбъемУслуги 		= -СтрокаНабора.ОбъемУслуги;
		СтрокаНабора.Распределение 		= Истина;
		СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
	КонецЦикла;
	
	Если ДанныеПоУслуге.СхемаРасчетаПриВыходеПУ  Тогда
		ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги;
	Иначе
		ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги + ДанныеПоУслуге.ОбъемСубКРаспределению;
	КонецЕсли;
	
	Если ОсталосьРаспределить <= 0 Тогда						
		Возврат;
	КонецЕсли;	
	
	Субабоненты   = ДанныеПоУслуге.Субабоненты;
	Распределили  = 0;
	
	СубабонентыОстаток = Новый Массив;
	
	
	Для Сч = 0 По Субабоненты.ВГраница() Цикл
		
		ДанныеСубабонента 					= Субабоненты[Сч];
		ТекОбъемУслуги						= НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга];
		
		Если Не ЗначениеЗаполнено(ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ)  Тогда
			
			ТекОбъемУслуги.ОбъемУслугиГоловнойТУ = ТекОбъемУслуги.ОбъемУслугиГоловнойТУ + ДанныеПоУслуге.ОбъемУслуги;
			Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета] <> Неопределено Тогда	
				Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] <> Неопределено Тогда
					РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] = РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] + ДанныеСубабонента.ОбъемУслуги;
				Иначе
					РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета].Вставить(Услуга, ДанныеСубабонента.ОбъемУслуги);
				КонецЕсли;
			Иначе
				РассчитанныеОбъемыПоУслуге = Новый Соответствие;
				РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ДанныеСубабонента.ОбъемУслуги); 
				РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ОбъектРасчета, РассчитанныеОбъемыПоУслуге);
			КонецЕсли;
			
			
			Продолжить;
		КонецЕсли;
		
		Если Сч = Субабоненты.ВГраница() Тогда
			ОбъемУслуги 				= ОсталосьРаспределить - Распределили;
		Иначе
			Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение Тогда
				ОбъемУслуги 				= ОсталосьРаспределить * ДанныеСубабонента.КоэффициентДолевогоРаспределения;	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноПлощади Тогда
				ОбъемУслуги 				= ?( ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ЗначениеПлощади / ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ЗначениеНагрузки / ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноДоговорномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ДоговорнойОбъем / ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.ВсегоТочекУчетаСубабонентов = ДанныеПоУслуге.ВсегоПриборовУчетаСубабонентов Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему Тогда
				
				Если ДанныеСубабонента.ТочкаУчета = ДанныеСубабонента.ЗависимаяТочкаУчета   Тогда
					ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеПоУслуге.ОбъемУслуги /  ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				Иначе
					ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги /  ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				КонецЕсли;
				
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги  Тогда
				
				Если  НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга.ЗависитОтУслуги] <> Неопределено Тогда
					ОбъемУслугиОсновной 			= НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга.ЗависитОтУслуги];
					ОбъемУслуги 				    = ?(ОбъемУслугиОсновной.ОбъемУслугиГоловнойТУ = 0, 0, ОсталосьРаспределить * ОбъемУслугиОсновной.ОбъемУслуги / ОбъемУслугиОсновной.ОбъемУслугиГоловнойТУ);	
				Иначе
					ОбъемУслуги 					= 0;
				КонецЕсли;
				
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ФиксированныйОбъем Тогда
				ОбъемУслуги 				= ?(ОсталосьРаспределить < ДанныеСубабонента.ФиксированныйОбъем, ОсталосьРаспределить, ДанныеСубабонента.ФиксированныйОбъем);
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета] <> Неопределено Тогда	
			Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] <> Неопределено Тогда
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] = РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] + ОбъемУслуги;
			Иначе
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета].Вставить(Услуга, ОбъемУслуги);
			КонецЕсли;
		Иначе
			РассчитанныеОбъемыПоУслуге = Новый Соответствие;
			РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
			РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ОбъектРасчета, РассчитанныеОбъемыПоУслуге);
		КонецЕсли;
		
		//РассчитанныеОбъемыПоУслуге = Новый Соответствие;
		//РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
		//РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, РассчитанныеОбъемыПоУслуге);
		
		Если ЗначениеЗаполнено(ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы) Тогда
			СубабонентыОстаток.Добавить(ДанныеСубабонента);
			
			Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.Остаток Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		Если НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета] = Неопределено Тогда
			НачисленияПоУслуге = Новый Соответствие;
		Иначе
			НачисленияПоУслуге = НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета];
		КонецЕсли;
		
		ТекОбъемУслуги.ОбъемУслуги = ТекОбъемУслуги.ОбъемУслуги + ОбъемУслуги;
		ТекОбъемУслуги.ОбъемУслугиГоловнойТУ = ТекОбъемУслуги.ОбъемУслугиГоловнойТУ + ДанныеПоУслуге.ОбъемУслуги;
		
		//НачисленияПоУслуге.Вставить(Услуга, Новый Структура("ОбъемУслуги, ОбъемУслугиГоловнойТУ", ОбъемУслуги, ДанныеПоУслуге.ОбъемУслуги));
		//
		//НачисленияПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, НачисленияПоУслуге);
		
		СтрокаНабора  							= НаборЗаписей.Добавить();
		СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 						= Район;
		СтрокаНабора.Организация				= Организация;
		//СтрокаНабора.Договор 					= ДанныеСубабонента.Договор;
		СтрокаНабора.ОбъектРасчета              = ДанныеСубабонента.ОбъектРасчета;
		СтрокаНабора.МКД              			= ДанныеСубабонента.МКД;
		СтрокаНабора.Услуга						= Услуга;
		СтрокаНабора.ТочкаУчета					= ДанныеСубабонента.ТочкаУчета;
		СтрокаНабора.ВидНачисления 				= ВидНачисления;
		СтрокаНабора.СпособНачисления 			= ДанныеПоУслуге.СпособНачисления;
		СтрокаНабора.ДолевоеРаспределение 		= Истина;
		СтрокаНабора.Распределение 				= Истина;
		СтрокаНабора.ПериодРасчета				= ПериодНачисления;
		СтрокаНабора.ПериодНачисления			= ПериодНачисления;
		СтрокаНабора.ТарифнаяЗона 				= ДанныеСубабонента.ТарифнаяЗона;
		СтрокаНабора.Поставщик 					= ДанныеСубабонента.Поставщик;
		
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 			= ДанныеСубабонента.ЗначениеПлощади;
		Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ФиксированныйОбъем Тогда
			ОсталосьРаспределить = ОсталосьРаспределить - ОбъемУслуги;
		Иначе
			Распределили 							= Распределили + СтрокаНабора.ОбъемУслуги;	
		КонецЕсли;
		
		
	КонецЦикла;	
	
	//распределить остаток
	
	ОсталосьРаспределитьОстаток = ОсталосьРаспределить - Распределили;
	
	РаспределилиОстаток 		= 0;
	
	Для Сч = 0 По СубабонентыОстаток.ВГраница() Цикл
		
		ДанныеСубабонента 					= СубабонентыОстаток[Сч];
		
		Если Сч = СубабонентыОстаток.ВГраница() Тогда
			ОбъемУслуги 				= ОсталосьРаспределитьОстаток - РаспределилиОстаток;
		Иначе
			Если ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение Тогда
				ОбъемУслуги 				= ОсталосьРаспределить * ДанныеСубабонента.КоэффициентРасчета;	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноПлощади Тогда
				ОбъемУслуги 				= ?( ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ЗначениеПлощади / ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ЗначениеНагрузки / ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноДоговорномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ДоговорнойОбъем / ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.ВсегоТочекУчетаСубабонентов = ДанныеПоУслуге.ВсегоПриборовУчетаСубабонентов Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему Тогда
				Если ДанныеСубабонента.ТочкаУчета = ДанныеСубабонента.ЗависимаяТочкаУчета   Тогда
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеПоУслуге.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				Иначе
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ОбъемУслуги /  ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета] <> Неопределено Тогда	
			Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] <> Неопределено Тогда
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] = РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] + ОбъемУслуги;
			Иначе
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета].Вставить(Услуга, ОбъемУслуги);
			КонецЕсли;
		Иначе
			РассчитанныеОбъемыПоУслуге = Новый Соответствие;
			РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
			РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ОбъектРасчета, РассчитанныеОбъемыПоУслуге);
		КонецЕсли;
		
		
		//РассчитанныеОбъемыПоУслуге = Новый Соответствие;
		//РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
		//РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, РассчитанныеОбъемыПоУслуге);
		
		
		СтрокаНабора  							= НаборЗаписей.Добавить();
		СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 						= Район;
		СтрокаНабора.Организация				= Организация;
		СтрокаНабора.МКД 						= ДанныеСубабонента.МКД;
		СтрокаНабора.ОбъектРасчета              = ДанныеСубабонента.ОбъектРасчета;
		СтрокаНабора.Услуга						= Услуга;
		СтрокаНабора.ТочкаУчета					= ДанныеСубабонента.ТочкаУчета;
		СтрокаНабора.ВидНачисления 				= ВидНачисления;
		СтрокаНабора.СпособНачисления 			= ДанныеПоУслуге.СпособНачисления;
		СтрокаНабора.ДолевоеРаспределение 		= Истина;
		СтрокаНабора.ПериодРасчета				= ПериодНачисления;
		СтрокаНабора.ПериодНачисления			= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 			= ДанныеСубабонента.ЗначениеПлощади;
		СтрокаНабора.ТарифнаяЗона 				= ДанныеСубабонента.ТарифнаяЗона;
		СтрокаНабора.Поставщик 					= ДанныеСубабонента.Поставщик;
		РаспределилиОстаток 					= РаспределилиОстаток + СтрокаНабора.ОбъемУслуги;								
		
	КонецЦикла;	 
	
	
КонецПроцедуры


#КонецОбласти

#Область НачислениеПоДолевымСхемам_ВспомогательныеПроцедуры

Процедура ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ, Организация,ПериодНачисления,Район,ИсключаяОтдельностоящие,МКД,ГраницыПериода)	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("НачалоПериода",		ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",		ГраницыПериода.ЗавершениеОП - 1);
	Запрос.УстановитьПараметр("МКД", 				МКД);
	
	Запрос.Текст 					= ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(ИсключаяОтдельностоящие,МКД);
	Запрос.Выполнить();
КонецПроцедуры

#КонецОбласти

#Область СнятьСредниеНачисления_ВспомогательныеПроцедурыИФункции

Процедура ПрочитатьНеСписанныйСреднийНП(МВТ,ПериодНачисления,Организация,Район,МКД,ИсключаяОтдельностоящие,НачалоПериодаРасчета,КонецПериодаРасчета,ТаблицаПриемник = Неопределено)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 							=
	"ВЫБРАТЬ
	|	бестНачислениеНП.Ссылка КАК ДокументНачисления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	Документ.бестНачислениеНП КАК бестНачислениеНП
	|ГДЕ
	|	бестНачислениеНП.Организация = &Организация
	|	И бестНачислениеНП.Район = &Район
	|	И бестНачислениеНП.МКД = &МКД
	|	И бестНачислениеНП.Дата = &КонецПериода
	|	И НЕ бестНачислениеНП.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПерерасчетНП.Организация КАК Организация,
	|	бестПерерасчетНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПерерасчетНП.Район КАК Район,
	|	бестПерерасчетНП.Ссылка КАК ДокументНачисления,
	|	бестПерерасчетНП.ПометкаУдаления КАК ПометкаУдаления,
	|	бестПерерасчетНП.МКД КАК МКД
	|ПОМЕСТИТЬ ДокументыСвязанныйПерерасчет
	|ИЗ
	|	Документ.бестПерерасчетНП КАК бестПерерасчетНП
	|ГДЕ
	|	бестПерерасчетНП.Организация = &Организация
	|	И бестПерерасчетНП.ПериодНачисления = &ПериодНачисления
	|	И бестПерерасчетНП.Район = &Район
	|	И бестПерерасчетНП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет)
	|	И бестПерерасчетНП.ПричинаПерерасчета = ЗНАЧЕНИЕ(Справочник.бестПричиныПерерасчета.ПерерасчетСредних)
	|	И бестПерерасчетНП.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНачисленныйСреднийОбъемНПОстатки.Организация КАК Организация,
	|	бестНачисленныйСреднийОбъемНПОстатки.Район КАК Район,
	|	бестНачисленныйСреднийОбъемНПОстатки.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.МКД КАК МКД,
	|	бестНачисленныйСреднийОбъемНПОстатки.ПериодНачисления КАК ПериодНачисления,
	|	бестНачисленныйСреднийОбъемНПОстатки.ТочкаУчета КАК ТочкаУчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.Услуга КАК Услуга,
	|	бестНачисленныйСреднийОбъемНПОстатки.ЗначениеТарифа КАК ЗначениеТарифа,
	|	бестНачисленныйСреднийОбъемНПОстатки.ПриборУчета КАК ПриборУчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестНачисленныйСреднийОбъемНПОстатки.Поставщик КАК Поставщик,
	|	бестНачисленныйСреднийОбъемНПОстатки.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.ПриборЗависимой КАК ПриборЗависимой,
	|	бестНачисленныйСреднийОбъемНПОстатки.СпособНачисления КАК СпособНачисления,
	|	бестНачисленныйСреднийОбъемНПОстатки.СуммаОстаток КАК Сумма,
	|	бестНачисленныйСреднийОбъемНПОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги,
	|	бестНачисленныйСреднийОбъемНПОстатки.ОбъемУслугиПотребленныйОстаток КАК ОбъемУслугиПотребленный,
	|	бестНачисленныйСреднийОбъемНПОстатки.Шкала КАК Шкала
	|ПОМЕСТИТЬ НеСписанныйСредний
	|ИЗ
	|	РегистрНакопления.бестНачисленныйСреднийОбъемНП.Остатки(
	|			&НачалоПериодаРасчетаГраница,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК бестНачисленныйСреднийОбъемНПОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СУММА(бестОбъемНачисленийНП.Сумма) КАК СуммаОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленныйОборот,
	|	МАКСИМУМ(бестОбъемНачисленийНП.ЗначениеТарифа) КАК ЗначениеТарифа
	|ПОМЕСТИТЬ НачисленныйОбъем
	|ИЗ
	|	ДокументыНачислений КАК ДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ПО (бестОбъемНачисленийНП.Период = &КонецПериода)
	|			И ДокументыНачислений.ДокументНачисления = бестОбъемНачисленийНП.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестОбъемНачисленийНП.Организация,
	|	бестОбъемНачисленийНП.ПериодНачисления,
	|	бестОбъемНачисленийНП.Район,
	|	бестОбъемНачисленийНП.ОбъектРасчета,
	|	бестОбъемНачисленийНП.МКД,
	|	бестОбъемНачисленийНП.Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета,
	|	бестОбъемНачисленийНП.СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона,
	|	бестОбъемНачисленийНП.Поставщик";
	
	
	Если ИсключаяОтдельностоящие тогда		
		Текст 		= СтрЗаменить(Текст,"И бестНачислениеНП.МКД = &МКД","И бестНачислениеНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"И бестПерерасчетНП.МКД = &МКД","И бестПерерасчетНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"И МКД = &МКД","И МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 			
			Текст 		= СтрЗаменить(Текст,"бестНачислениеНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"бестПерерасчетНП.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаГраница",Новый Граница(НачалоПериодаРасчета,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",					КонецПериодаРасчета - 1);
	Запрос.УстановитьПараметр("ПериодНачисления",				ПериодНачисления);
	Запрос.УстановитьПараметр("Район",							Район);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("МКД", 							МКД);
	Запрос.Текст 			= Текст;
	
	Если ТаблицаПриемник = Неопределено тогда
		Запрос.Выполнить();
	иначе
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"ПОМЕСТИТЬ НеСписанныйСредний","");
		Результат  			= Запрос.Выполнить();
		Выборка 			= Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПриемник.добавить(),Выборка);
		КонецЦикла;  		 
	КонецЕсли; 
	
КонецПроцедуры

Функция РезультатЗапросаПерерасчетСреднего(МВТ,Организация,ПериодНачисления,КонецПериодаРасчета,Район,МКД,НачисленныйСреднийОбъем=Неопределено)
	
	Текст 			=  
	"ВЫБРАТЬ
	|	НеСписанныйСредний.Организация КАК Организация,
	|	НеСписанныйСредний.Район КАК Район,
	|	НеСписанныйСредний.ОбъектРасчета КАК ОбъектРасчета,
	|	НеСписанныйСредний.МКД КАК МКД,
	|	НеСписанныйСредний.ПериодНачисления КАК ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета КАК ТочкаУчета,
	|	НеСписанныйСредний.Услуга КАК Услуга,
	|	НеСписанныйСредний.ЗначениеТарифа КАК ЗначениеТарифа,
	|	НеСписанныйСредний.ПриборУчета КАК ПриборУчета,
	|	НеСписанныйСредний.Шкала КАК Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НеСписанныйСредний.Сумма КАК Сумма,
	|	НеСписанныйСредний.ОбъемУслуги КАК ОбъемУслуги,
	|	НеСписанныйСредний.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	НеСписанныйСредний.ОбъемУслуги КАК ОбъемНадоСписать,
	|	НеСписанныйСредний.ОбъемУслугиПотребленный КАК ОбъемПотребленныйНадоСписать,
	|	НеСписанныйСредний.Поставщик КАК Поставщик,
	|	НеСписанныйСредний.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДляСписания
	|ИЗ
	|	НеСписанныйСредний КАК НеСписанныйСредний
	|ГДЕ
	|	(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ОбъектРасчета, НеСписанныйСредний.МКД, НеСписанныйСредний.ТочкаУчета, НеСписанныйСредний.Услуга, НеСписанныйСредний.Шкала, НеСписанныйСредний.ТарифнаяЗона) В
	|			(ВЫБРАТЬ
	|				НачисленныйОбъем.Организация,
	|				НачисленныйОбъем.Район,
	|				НачисленныйОбъем.ОбъектРасчета,
	|				НачисленныйОбъем.МКД,
	|				НачисленныйОбъем.ТочкаУчета,
	|				НачисленныйОбъем.Услуга,
	|				НачисленныйОбъем.Шкала,
	|				НачисленныйОбъем.ТарифнаяЗона
	|			ИЗ
	|				НачисленныйОбъем КАК НачисленныйОбъем
	|			ГДЕ
	|				НачисленныйОбъем.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам))
	|	И НЕ НеСписанныйСредний.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|";
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НачисленныйОбъем.Организация,
	//|	НачисленныйОбъем.Район,
	//|	НачисленныйОбъем.ОбъектРасчета,
	//|	НачисленныйОбъем.МКД,
	//|	НачисленныйОбъем.ПериодНачисления,
	//|	НачисленныйОбъем.ТочкаУчета,
	//|	НачисленныйОбъем.Услуга,
	//|	НачисленныйОбъем.ЗначениеТарифа,
	//|	НачисленныйОбъем.ПриборУчета,
	//|	НачисленныйОбъем.Шкала,
	//|	НачисленныйОбъем.ТарифнаяЗона,
	//|	НачисленныйОбъем.СуммаОборот,
	//|	НачисленныйОбъем.ОбъемУслугиОборот,
	//|	НачисленныйОбъем.ОбъемУслугиПотребленныйОборот,
	//|	0,
	//|	0,
	//|	НачисленныйОбъем.Поставщик,
	//|	НачисленныйОбъем.СпособНачисления
	//|ИЗ
	//|	НачисленныйОбъем КАК НачисленныйОбъем
	//|ГДЕ
	//|	НачисленныйОбъем.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	//|	И (НачисленныйОбъем.Организация, НачисленныйОбъем.Район, НачисленныйОбъем.ОбъектРасчета, НачисленныйОбъем.МКД, НачисленныйОбъем.ТочкаУчета, НачисленныйОбъем.Услуга, НачисленныйОбъем.Шкала, НачисленныйОбъем.ТарифнаяЗона) В
	//|			(ВЫБРАТЬ
	//|				НеСписанныйСредний.Организация,
	//|				НеСписанныйСредний.Район,
	//|				НеСписанныйСредний.ОбъектРасчета,
	//|				НеСписанныйСредний.МКД,
	//|				НеСписанныйСредний.ТочкаУчета,
	//|				НеСписанныйСредний.Услуга,
	//|				НеСписанныйСредний.Шкала,
	//|				НеСписанныйСредний.ТарифнаяЗона
	//|			ИЗ
	//|				НеСписанныйСредний КАК НеСписанныйСредний
	//|			ГДЕ
	//|				НЕ НеСписанныйСредний.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам))
	//|";
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НеСписанныйСредний.Организация,
	//|	НеСписанныйСредний.Район,
	//|	НеСписанныйСредний.ОбъектРасчета,
	//|	НеСписанныйСредний.Договор,
	//|	НеСписанныйСредний.ПериодНачисления,
	//|	НеСписанныйСредний.ТочкаУчета,
	//|	НеСписанныйСредний.Услуга,
	//|	НеСписанныйСредний.ЗначениеТарифа,
	//|	НеСписанныйСредний.ПриборУчета,
	//|	НеСписанныйСредний.Шкала,
	//|	НеСписанныйСредний.ТарифнаяЗона,
	//|	НеСписанныйСредний.Сумма,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.Поставщик,
	//|	НеСписанныйСредний.СпособНачисления
	//|ИЗ
	//|	НеСписанныйСредний КАК НеСписанныйСредний
	//|ГДЕ
	//|	(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ОбъектРасчета, НеСписанныйСредний.Договор, НеСписанныйСредний.ТочкаУчета, НеСписанныйСредний.Услуга) В
	//|			(ВЫБРАТЬ
	//|				НачисленныйОбъем.Организация,
	//|				НачисленныйОбъем.Район,
	//|				НачисленныйОбъем.ОбъектРасчета,
	//|				НачисленныйОбъем.Договор,
	//|				НачисленныйОбъем.ТочкаУчета,
	//|				НачисленныйОбъем.Услуга
	//|			ИЗ
	//|				НачисленныйОбъем КАК НачисленныйОбъем
	//|			ГДЕ
	//|				НачисленныйОбъем.СниматьНачисленныйСреднийЗависимыхТочек)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НеСписанныйСредний.Организация,
	//|	НеСписанныйСредний.Район,
	//|	НеСписанныйСредний.ОбъектРасчета,
	//|	НеСписанныйСредний.Договор,
	//|	НеСписанныйСредний.ПериодНачисления,
	//|	НеСписанныйСредний.ТочкаУчета,
	//|	НеСписанныйСредний.Услуга,
	//|	НеСписанныйСредний.ЗначениеТарифа,
	//|	НеСписанныйСредний.ПриборУчета,
	//|	НеСписанныйСредний.Шкала,
	//|	НеСписанныйСредний.ТарифнаяЗона,
	//|	НеСписанныйСредний.Сумма,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.Поставщик,
	//|	НеСписанныйСредний.СпособНачисления
	//|ИЗ
	//|	НеСписанныйСредний КАК НеСписанныйСредний
	//|ГДЕ
	//|	(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ОбъектРасчета, НеСписанныйСредний.Договор, НеСписанныйСредний.Услуга, НеСписанныйСредний.СпособНачисления) В
	//|			(ВЫБРАТЬ
	//|				НачисленныйОбъем.Организация,
	//|				НачисленныйОбъем.Район,
	//|				НачисленныйОбъем.ОбъектРасчета,
	//|				НачисленныйОбъем.Договор,
	//|				НачисленныйОбъем.Услуга,
	//|				ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	//|			ИЗ
	//|				НачисленныйОбъем КАК НачисленныйОбъем
	//|			ГДЕ
	//|				НачисленныйОбъем.ЕстьСреднийПоВсемТочкамУслуги)
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ОбъемНадоСписать КАК ОбъемНадоСписать,
	|	ВложенныйЗапрос.ОбъемПотребленныйНадоСписать КАК ОбъемПотребленныйНадоСписать,
	|	ЕСТЬNULL(ДокументыСвязанныйПерерасчет.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргПерерасчет.Пустаяссылка)) КАК ДокументПерерасчета,
	|	ЕСТЬNULL(ДокументыСвязанныйПерерасчет.ПометкаУдаления, ЛОЖЬ) КАК ДокументПерерасчетаПометкаУдаления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДляСписания.Организация КАК Организация,
	|		ДанныеДляСписания.Район КАК Район,
	|		ДанныеДляСписания.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеДляСписания.МКД КАК МКД,
	|		ДанныеДляСписания.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеДляСписания.Услуга КАК Услуга,
	|		ДанныеДляСписания.ПриборУчета КАК ПриборУчета,
	|		ДанныеДляСписания.Шкала КАК Шкала,
	|		ДанныеДляСписания.ТарифнаяЗона КАК ТарифнаяЗона,
	|		СУММА(ДанныеДляСписания.ОбъемНадоСписать) КАК ОбъемНадоСписать,
	|		СУММА(ДанныеДляСписания.ОбъемПотребленныйНадоСписать) КАК ОбъемПотребленныйНадоСписать,
	|		ДанныеДляСписания.Поставщик КАК Поставщик
	|	ИЗ
	|		ДанныеДляСписания КАК ДанныеДляСписания
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДляСписания.МКД,
	|		ДанныеДляСписания.Шкала,
	|		ДанныеДляСписания.ТочкаУчета,
	|		ДанныеДляСписания.Район,
	|		ДанныеДляСписания.ОбъектРасчета,
	|		ДанныеДляСписания.ПриборУчета,
	|		ДанныеДляСписания.Поставщик,
	|		ДанныеДляСписания.Услуга,
	|		ДанныеДляСписания.Организация,
	|		ДанныеДляСписания.ТарифнаяЗона) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыСвязанныйПерерасчет КАК ДокументыСвязанныйПерерасчет
	|		ПО ВложенныйЗапрос.Организация = ДокументыСвязанныйПерерасчет.Организация
	|			И ВложенныйЗапрос.Район = ДокументыСвязанныйПерерасчет.Район
	|			И ВложенныйЗапрос.МКД = ДокументыСвязанныйПерерасчет.МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ОбъектРасчета,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписания.Организация КАК Организация,
	|	ДанныеДляСписания.Район КАК Район,
	|	ДанныеДляСписания.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляСписания.МКД КАК МКД,
	|	ДанныеДляСписания.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписания.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписания.Услуга КАК Услуга,
	|	ДанныеДляСписания.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ДанныеДляСписания.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписания.Шкала КАК Шкала,
	|	ДанныеДляСписания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписания.Сумма КАК Сумма,
	|	ДанныеДляСписания.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписания.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ДанныеДляСписания.ОбъемНадоСписать КАК ОбъемНадоСписать,
	|	ДанныеДляСписания.ОбъемПотребленныйНадоСписать КАК ОбъемПотребленныйНадоСписать,
	|	ДанныеДляСписания.Поставщик КАК Поставщик,
	|	ДанныеДляСписания.СпособНачисления КАК СпособНачисления,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	|ИЗ
	|	ДанныеДляСписания КАК ДанныеДляСписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(&КонецПериодаРасчета, ) КАК бестДоговорыТочекУчетаСрезПоследних
	|		ПО ДанныеДляСписания.Организация = бестДоговорыТочекУчетаСрезПоследних.Организация
	|			И ДанныеДляСписания.Район = бестДоговорыТочекУчетаСрезПоследних.Район
	|			И ДанныеДляСписания.ОбъектРасчета = бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ДанныеДляСписания.Услуга = бестДоговорыТочекУчетаСрезПоследних.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДляСписания.Район,
	|	ДанныеДляСписания.ОбъектРасчета,
	|	ДанныеДляСписания.МКД,
	|	ДанныеДляСписания.ТочкаУчета,
	|	ДанныеДляСписания.Услуга,
	|	ДанныеДляСписания.ПриборУчета,
	|	ДанныеДляСписания.Шкала,
	|	ДанныеДляСписания.ТарифнаяЗона,
	|	ДанныеДляСписания.Поставщик,
	|	ДанныеДляСписания.ПериодНачисления УБЫВ";
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецПериодаРасчета);
	Результат  						= Запрос.ВыполнитьПакет();  
	Возврат Результат;  	
	
КонецФункции

Функция РезультатОтменитьСнятьСредниеНачисления(ПериодНачисления, Организация, Район, МКД, ИсключаяОтдельностоящие, НачалоПериодаРасчета, КонецПериодаРасчета)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	 ПериодНачисления);
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("Организация",		 Организация);
	Запрос.УстановитьПараметр("Район",				 Район);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	бестПерерасчетНП.Ссылка КАК ДокументНачисления
	|ИЗ
	|	Документ.бестПерерасчетНП КАК бестПерерасчетНП
	|ГДЕ
	|	бестПерерасчетНП.Организация = &Организация
	|	И бестПерерасчетНП.ПериодНачисления = &ПериодНачисления
	|	И бестПерерасчетНП.Район = &Район
	|	И бестПерерасчетНП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет)
	|	И бестПерерасчетНП.ПричинаПерерасчета = ЗНАЧЕНИЕ(Справочник.бестПричиныПерерасчета.ПерерасчетСредних)
	|	И бестПерерасчетНП.МКД = &МКД";
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"И ОбъектРасчета.МКД = &МКД","И ОбъектРасчета.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"И бестПерерасчетНП.МКД = &МКД","И бестПерерасчетНП.МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"И ОбъектРасчета.МКД = &МКД","");
			Текст 		= СтрЗаменить(Текст,"И бестПерерасчетНП.МКД = &МКД","");
			
		КонецЕсли;
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("МКД", 	МКД);
	
	Результат  = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

#КонецОбласти

#Область НачислениеПоДолевымСхемам

Функция ПолучитьРезультатЗапросаСхемыСтруктурыСети(ПериодНачисления,Организация,Район,ИсключаяОтдельностоящие, МКД,НачалоПериодаРасчета,КонецПериодаРасчета)
	Запрос = Новый Запрос;	
	
	Запрос.Текст = ТекстЗапросаСхемыСтруктурыСети();
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыНП.МКД = &МКД","И бестСтабильныеПериодыНП.МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыНП.МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КонецПериодаРасчета", 	КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", 	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("МКД", 					МКД);
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 		ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 					Район);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область ДополнительныеНачисления

Функция ПолучитьРезультатЗапросаДополнительныеНачисленияЮЛ(ПериодНачисления,Организация,Район,ИсключаяОтдельностоящие, МКД,НачалоПериодаРасчета,КонецПериодаРасчета)
	Запрос = Новый Запрос;
	
	Текст = ТекстЗапросаДополнительныеНачисленияЮЛ();
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"бестДополнительныеНачисления.МКД = &МКД","бестДополнительныеНачисления.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"МКД = &МКД","МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"бестДополнительныеНачисления.МКД = &МКД","ИСТИНА");
			Текст 		= СтрЗаменить(Текст,"МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("КонецПериодаРасчета", 	КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", 	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 		ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 					Район);
	Запрос.УстановитьПараметр("МКД", 					МКД);
	
	Возврат Запрос.ВыполнитьПакет();
КонецФункции

#КонецОбласти




