#Область СлужебныйИнтерфейс

// Процедура - Начислить
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура Начислить(Организация,ПериодНачисления,Район,МКД,Отдельностоящие, Договор,Документ) Экспорт
	                                                                    
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	СпособНачисленияПоПриборам						= Перечисления.энргСпособНачислений.ПоПриборам;
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	ПериодНовогоТарифа 								= Константы.энргДеньНачалаПримененияНовогоТарифа.Получить();
	результатЗапроса 								= РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,Отдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде); 	
	КонецПериода  									= КонецМесяца(ПериодНачисления);
	Сч 												= 0;
	ТекДоговор  									= Неопределено;
	ТекОбъектРасчета 								= Неопределено;
	ТекТочкаУчета									= Неопределено;
	ТекНачалоПериода								= Неопределено;
	ТекУслуга 										= Неопределено;
	ТекШкала 										= Неопределено;
	ДокументОбъект									= Неопределено;
	Набор 											= Неопределено;
	ВидНачисления 									= Перечисления.энргВидыНачислений.Начисление;
	ФормулыРасчет 									= Неопределено;
	ПараметрыФормулы 								= Неопределено;
	ТекСпособНачисленияПоФормуле 					= Неопределено;
	СпособРасчетаПоФормуле 							= Неопределено;
	НормативыПоУслугам 								= Неопределено;
	НормативыНаПодогрев 							= Неопределено;
	КоэффициентыПоВоздуху 							= Неопределено;
	КоэффициентыПоВоде 								= Неопределено;
	ПлотностиВоды 									= Неопределено;
	
	НачисляемПоФормуле 								= Ложь;	
	СтрокиНабораДоЗаписи 							= Неопределено;	
	НачисленияПоУслугам 							= Новый Соответствие;
	НачисленияПоУслугамОбъекта						= Новый Соответствие;
	УдалитьСтрокиПоРегистрацииОбъема				= Новый Соответствие;
	УдалитьСтрокиПоСреднемуПоНормативу				= Новый Соответствие;
	НормативНаПодогрев = 0;
	ТемпературныйКоэффициентПоВоздуху = 0;
	ТемпературныйКоэффициентПоВоде = 0;
	ПлотностьВоды = 0;
	
	ИсклНачисленияНорматива 						= Новый Массив();
	ИсклНачисленияНорматива.Добавить(Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина);
	ИсклНачисленияНорматива.Добавить(Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке);

	
	СтрокаОписанияФормулы 											= Неопределено;
	МассивФормулРасчета												= Неопределено;	
	КлючСтруктурыФормулы 											= "
	|Услуга, ФормулаРасчета, Поставщик,
	|СпособНачисления, УзелПриборУчета, НеПрименятьСезонность,
	|НачалоПериода, КонецПериода, ОбъемЗаПрошлыйГод, КоэффициентПропорциональности";

	
	ПараметрыРасчета = Неопределено;
	
	ТипыРасходов  						= энргНачисления.ТипыРасходовВФормулахРасчета();
	
	ВыборкаДоговор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговор.Следующий() Цикл 
		Если ВыборкаДоговор.Договор.ТипДоговора  = Перечисления.бестТипыДоговоров.УправляющаяКомпания Тогда
			Продолжить;
		КонецЕсли;
		НаборРасчетСреднегоОбъемаНП						= Неопределено;	
		ТекДокумент = Неопределено;
		
		ВыборкаДок = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ДокументСсылка 									= Неопределено;
		
		Пока ВыборкаДок.Следующий() Цикл
			
			Если Документ = Неопределено и ДокументСсылка = Неопределено Тогда					
				ДокументСсылка											= ВыборкаДок.ДокументНачисления;
				ДокументОбъект 											= Неопределено;
				ПометкаУдаления 										= ВыборкаДок.ДокументНачисления.ПометкаУдаления;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
					
					ДокументСсылка 										= Документы.бестНачислениеНП.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  									= Документы.бестНачислениеНП.СоздатьДокумент();
					ДокументОбъект.район  								= Район;
					ДокументОбъект.Дата									= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 							= Организация;
					ДокументОбъект.Договор	 							= ВыборкаДок.Договор;
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект										= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 						= Ложь;
				КонецЕсли;
				
				Набор 													= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				
				НаборРасчетСреднегоОбъемаНП = РегистрыСведений.бестРасчетСреднегоОбъемаНП.СоздатьНаборЗаписей();
				НаборРасчетСреднегоОбъемаНП.Отбор.ДокРегистратор.установить(ДокументСсылка);

				
				Если НЕ Договор = Неопределено Тогда
					Набор.ДополнительныеСвойства.Вставить("Договор",	Договор);
					Если ДокументОбъект = Неопределено Тогда
						Набор.Прочитать();
						СтрокиНабораДоЗаписи 							= Набор.Выгрузить();
						СтрокиУдалить 									= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Договор", Договор));
						Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
							СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						Набор.Очистить();
					КонецЕсли;
				КонецЕсли;	
				
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
					НаборРасчетСреднегоОбъемаНП.Записать();
				КонецЕсли;		
			ИначеЕсли Не Документ = Неопределено Тогда
				Набор 													= Документ.Движения.бестОбъемНачисленийНП;
				Если ЗначениеЗаполнено(ДокументСсылка) Тогда
					ДокОбъект = ДокументСсылка.ПолучитьОбъект();
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецЕсли;
			
			Выборка  										= ВыборкаДок.выбрать();
			
			Пока Выборка.следующий() цикл 
				
				
				Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ Не ТекНачалоПериода = Выборка.НачалоПериода Тогда
					
					Если ТекОбъектРасчета <> Выборка.ОбъектРасчета Тогда
						НачисленияПоУслугамОбъекта = Новый Соответствие;	
					КонецЕсли; 
					
					Если НЕ ТекОбъектРасчета = Неопределено Тогда
						СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
						МассивФормулРасчета.Добавить(СтрокаОписанияФормулы); 				
						
						ДобавитьСтрокиНачисленияНППоФормуле(ПериодНачисления, Организация, Район, ТекДоговор, ТекОбъектРасчета, ТекТочкаУчета, КонецПериодаРасчета, ДокументСсылка, МассивФормулРасчета, НормативыПоУслугам, НормативНаПодогрев,  ТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициентПоВоде, ПлотностьВоды, Набор);
					КонецЕсли;
					
					МассивФормулРасчета 									= Новый Массив;
					СтрокаОписанияФормулы 									= Новый Структура(КлючСтруктурыФормулы);
					СтрокаОписанияФормулы.Услуга 							= Выборка.Услуга;
					СтрокаОписанияФормулы.ФормулаРасчета 					= Выборка.ФормулаРасчета;
					СтрокаОписанияФормулы.Поставщик 						= Выборка.Поставщик;
					//Константы.энргПоставщикПоУмолчанию.Получить();;
					СтрокаОписанияФормулы.СпособНачисления 					= Выборка.СпособНачисления;
					СтрокаОписанияФормулы.УзелПриборУчета 					= Выборка.УзелПриборУчета;
					СтрокаОписанияФормулы.НеПрименятьСезонность 			= Выборка.НеПрименятьСезонность;
					СтрокаОписанияФормулы.НачалоПериода 					= Выборка.НачалоПериода;
					СтрокаОписанияФормулы.КонецПериода 						= Выборка.КонецПериода;
					СтрокаОписанияФормулы.ОбъемЗаПрошлыйГод 				= Выборка.ОбъемЗаПрошлыйГод;
					СтрокаОписанияФормулы.КоэффициентПропорциональности     = Выборка.КоэффициентПропорциональности;

					
					НачисленияПоУслугамТочки 								= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					ПараметрыФормулы 										= Новый Соответствие;
					НормативыПоУслугам  									= Новый Соответствие;
					КоэффициентыПоУслугам  									= Новый Соответствие;
					
					
					НормативыПоУслугам  									= Новый Соответствие;
					НормативыПоУслугам.Вставить(Выборка.Услуга, 			Выборка.НормаПотребления);	
					
					НормативНаПодогрев  									= Выборка.РасчетныйНормативНаПодогрев;
					//НормативыНаПодогрев.Вставить(Выборка.Услуга, 			Выборка.РасчетныйНормативНаПодогрев);	
					
					КоэффициентыПоВоздуху  									= Новый Соответствие;
					КоэффициентыПоВоздуху.Вставить(Выборка.Услуга, 			Выборка.ТемпературныйКоэффициентПоВоздуху);	
					
					КоэффициентыПоВоде  									= Новый Соответствие;
					КоэффициентыПоВоде.Вставить(Выборка.Услуга, 			Выборка.ТемпературныйКоэффициентПоВоде);	
					
					ПлотностиВоды  											= Новый Соответствие;
					//ПлотностиВоды.Вставить(Выборка.Услуга, 					Выборка.ПлотностьВоды);	
					ПлотностиВоды.Вставить(Выборка.Услуга, 					0);	
					
					ТемпературныйКоэффициентПоВоздуху = Выборка.ТемпературныйКоэффициентПоВоздуху;
					ТемпературныйКоэффициентПоВоде = Выборка.ТемпературныйКоэффициентПоВоде;
					ПлотностьВоды = 0;

					
									
				ИначеЕсли НЕ ТекУслуга = Выборка.Услуга Тогда
									
					СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
					МассивФормулРасчета.Добавить(СтрокаОписанияФормулы);
					НачисленияПоУслугамТочки.Вставить(ТекУслуга, НачисленияПоШкале);
					
					ПараметрыФормулы 										= Новый Соответствие;
					НачисленияПоШкале 										= Новый Соответствие;
					
					СтрокаОписанияФормулы 									= Новый Структура(КлючСтруктурыФормулы);
					СтрокаОписанияФормулы.Услуга 							= Выборка.Услуга;
					СтрокаОписанияФормулы.ФормулаРасчета 					= Выборка.ФормулаРасчета;
					СтрокаОписанияФормулы.Поставщик 						= Выборка.Поставщик;
					СтрокаОписанияФормулы.СпособНачисления 					= Выборка.СпособНачисления;
					СтрокаОписанияФормулы.УзелПриборУчета 					= Выборка.УзелПриборУчета;
					СтрокаОписанияФормулы.НеПрименятьСезонность 			= Выборка.НеПрименятьСезонность;
					СтрокаОписанияФормулы.НачалоПериода 					= Выборка.НачалоПериода;
					СтрокаОписанияФормулы.КонецПериода 						= Выборка.КонецПериода;
					СтрокаОписанияФормулы.ОбъемЗаПрошлыйГод 				= Выборка.ОбъемЗаПрошлыйГод;
					СтрокаОписанияФормулы.КоэффициентПропорциональности     = Выборка.КоэффициентПропорциональности;

					
					НормативыПоУслугам.Вставить(Выборка.Услуга, 		Выборка.НормаПотребления);			
					//НормативыНаПодогрев.Вставить(Выборка.Услуга, 		Выборка.РасчетныйНормативНаПодогрев);
					НормативНаПодогрев  									= Выборка.РасчетныйНормативНаПодогрев;
					КоэффициентыПоВоздуху.Вставить(Выборка.Услуга, 		Выборка.ТемпературныйКоэффициентПоВоздуху);	
					КоэффициентыПоВоде.Вставить(Выборка.Услуга, 		Выборка.ТемпературныйКоэффициентПоВоде);	
					//ПлотностиВоды.Вставить(Выборка.Услуга, 					Выборка.ПлотностьВоды);	
					ПлотностиВоды.Вставить(Выборка.Услуга, 				0);
					
					ТемпературныйКоэффициентПоВоздуху = Выборка.ТемпературныйКоэффициентПоВоздуху;
					ТемпературныйКоэффициентПоВоде = Выборка.ТемпературныйКоэффициентПоВоде;
					ПлотностьВоды = 0
					
				ИначеЕсли НЕ ТекШкала = Выборка.Шкала Тогда
					НачисленияПоШкале 										= Новый Соответствие;
				КонецЕсли; 

								
				Если НЕ ЗначениеЗаполнено(Выборка.ФормулаРасчета) Тогда
					//
					Если Выборка.НаличиеЗарегистрированногоОбъема Тогда
						Если УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления] <> Неопределено
							И УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга] <> Неопределено
							И УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ТочкаУчета] <> Неопределено Тогда
							
							Продолжить;
						ИначеЕсли Выборка.ОбъемУслуги <> 0 или Выборка.ОбъемУслугиПотребленный <> 0 Тогда										
							Если УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления] = Неопределено Тогда
								СоотвествиеПрибора = Новый Соответствие;
								СоотвествиеПрибора.Вставить(Выборка.ТочкаУчета,Истина);
								СоотвествиеУслуги = Новый Соответствие;
								СоотвествиеУслуги.Вставить(Выборка.Услуга,СоотвествиеПрибора);
								УдалитьСтрокиПоРегистрацииОбъема.Вставить(Выборка.СпособНачисления,СоотвествиеУслуги);
								
							ИначеЕсли УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга] = Неопределено Тогда
								СоотвествиеПрибора = Новый Соответствие;
								СоотвествиеПрибора.Вставить(Выборка.ТочкаУчета,Истина);
								УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления].Вставить(Выборка.Услуга,СоотвествиеПрибора);	
							Иначе 
								УдалитьСтрокиПоРегистрацииОбъема[Выборка.СпособНачисления][Выборка.Услуга].Вставить(Выборка.ТочкаУчета,Истина);
							КонецЕсли;
							
							
							СтрокаНабораРасчетСреднего = НаборРасчетСреднегоОбъемаНП.добавить();
							ЗаполнитьЗначенияСвойств(СтрокаНабораРасчетСреднего, Выборка);
							СтрокаНабораРасчетСреднего.ОбъемУслуги = Выборка.ОбъемУслуги * Выборка.КоэффициентПропорциональности;
							СтрокаНабораРасчетСреднего.ДокРегистратор = ДокументСсылка;

						Иначе
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					//
					
					
					Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.СреднееПоНормативу или Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоНормативу Тогда
						
						Если НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления] = Неопределено 
							И НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга] = Неопределено 
							И НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета] = Неопределено
							И НЕ УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета][Выборка.НачалоПериода] = Неопределено Тогда
							
							Продолжить;					
						КонецЕсли;
						
						
						Если УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления] = Неопределено Тогда
							СоотвествиеНачалоПериода = Новый Соответствие;
							СоотвествиеНачалоПериода.Вставить(Выборка.НачалоПериода,Истина);
							СоотвествиеПрибора = Новый Соответствие;
							СоотвествиеПрибора.Вставить(Выборка.ОбъектРасчета,СоотвествиеНачалоПериода);
							СоотвествиеУслуги = Новый Соответствие;
							СоотвествиеУслуги.Вставить(Выборка.Услуга,СоотвествиеПрибора);
							УдалитьСтрокиПоСреднемуПоНормативу.Вставить(Выборка.СпособНачисления,СоотвествиеУслуги);
							
						ИначеЕсли УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга] = Неопределено Тогда
							СоотвествиеНачалоПериода = Новый Соответствие;
							СоотвествиеНачалоПериода.Вставить(Выборка.НачалоПериода,Истина);
							СоотвествиеПрибора = Новый Соответствие;
							СоотвествиеПрибора.Вставить(Выборка.ОбъектРасчета,СоотвествиеНачалоПериода);
							УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления].Вставить(Выборка.Услуга,СоотвествиеПрибора);	
						ИначеЕсли УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета] = Неопределено Тогда
							СоотвествиеНачалоПериода = Новый Соответствие;
							СоотвествиеНачалоПериода.Вставить(Выборка.НачалоПериода,Истина);
							УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга].Вставить(Выборка.ОбъектРасчета,СоотвествиеНачалоПериода);
						ИначеЕсли УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета][Выборка.НачалоПериода] = Неопределено Тогда
							УдалитьСтрокиПоСреднемуПоНормативу[Выборка.СпособНачисления][Выборка.Услуга][Выборка.ОбъектРасчета].Вставить(Выборка.НачалоПериода,Истина);
						КонецЕсли;				
					КонецЕсли;
					
					
					
					
					СтрокаНабора 											= Набор.добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
					СтрокаНабора.Период 									= КонецПериодаРасчета-1;
					СтрокаНабора.Регистратор 								= ДокументСсылка;
					СтрокаНабора.ВидНачисления 								= Перечисления.энргВидыНачислений.Начисление;
					СтрокаНабора.ПериодРасчета 								= ПериодНачисления;
					СтрокаНабора.Поставщик	 								= Выборка.Поставщик;
 					СтрокаНабора.ОбъемУслуги 								= Выборка.ОбъемУслуги * Выборка.КоэффициентПропорциональности;
					СтрокаНабора.ОбъемУслугиПотребленный 					= Выборка.ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
					
					Если Выборка.СодержитПотери И ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) Тогда 
						
						Если Выборка.ГБП = Перечисления.энргРасположениеРесурса.ДоГБП Или Выборка.ГБП = Перечисления.энргРасположениеРесурса.НаГБП Тогда
							ОбъемУслугиОсновной = НачисленияПоУслугамОбъекта.Получить(Выборка.ЗависитОтУслуги);
							Если Не ЗначениеЗаполнено(ОбъемУслугиОсновной) Тогда
								СтрокаНабора.ОбъемУслуги					= 0;
								СтрокаНабора.ОбъемУслугиПотребленный       	= 0;
								ОбъемУслуги									= 0;
								ОбъемУслугиПотребленный       				= 0;
							КонецЕсли;							 
						КонецЕсли;
						
					//ИначеЕсли Выборка.ЯвляетсяОтдельностоящим И НЕ Выборка.НаличиеЗарегистрированногоОбъема	И ЗначениеЗаполнено(Выборка.Объем_ПоПриборуПред) И ЗначениеЗаполнено(Выборка.СпособДосчётаРесурса) 
					//			И (ЗначениеЗаполнено(Выборка.КоличествоЧасовШтатнойРаботыПУ_ПоПриборуПред) Или Выборка.ПриборУчета <> Выборка.УзелПриборУчета) Тогда 
					//	
					//	ОбъемУслуги = 0;									
					//	Если Выборка.ПриборУчета <> Выборка.УзелПриборУчета Тогда
					//	
					//		ОбъемУслуги = Выборка.ОбъемУслугиПотребленный_ПоПриборуПред;
					//	
					//	ИначеЕсли Выборка.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоСреднесуточномуКоличествуТепловойЭнергии Тогда
					//		
					//		Если ЗначениеЗаполнено(Выборка.ТемпературныйКоэффициентПоВоздухуПред) Тогда
					//			
					//			ОбъемУслуги = Выборка.Объем_ПоПриборуПред * Выборка.КоличествоЧасовШтатнойРаботыПУ * Выборка.ТемпературныйКоэффициентПоВоздуху
					//				/ (Выборка.ТемпературныйКоэффициентПоВоздухуПред * Выборка.КоличествоЧасовШтатнойРаботыПУ_ПоПриборуПред);
					//		КонецЕсли;
					//	ИначеЕсли Выборка.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод Тогда
					//		
					//		ОбъемУслуги = Выборка.Объем_ПоПриборуПред * Выборка.КоличествоЧасовШтатнойРаботыПУ / Выборка.КоличествоЧасовШтатнойРаботыПУ_ПоПриборуПред;
					//	КонецЕсли;                                                                                         
					//	
					//	СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги;
					//	СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслуги;
					//	СтрокаНабора.СпособНачисления						= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	
					//ИначеЕсли ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и (НЕ Выборка.ПривязанаКШкале ИЛИ Выборка.ПриборУчета <> Выборка.УзелПриборУчета ИЛИ Выборка.ЗависитОтУслугиШапка)
					//	и НЕ Выборка.РасчетПоФормуле И Выборка.ЯвляетсяОтдельностоящим И НЕ Выборка.НаличиеЗарегистрированногоОбъема Тогда
					//	
					//	ОбъемПоПрибору = Неопределено;
					//	Если (ИсклНачисленияНорматива.Найти(Выборка.СпособРасчетаНорматива) = Неопределено Или Выборка.СпособНачисления = СпособНачисленияПоПриборам)
					//			И НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
					//		Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
					//			
					//			ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
					//			
					//			ТемпературныйКоэффициент = (Выборка.ТемператураПодачиИсточника - Выборка.ТемператураХолоднойВодыИсточника) / 1000;
					//			
					//			
					//			//Если Выборка.Услуга.ЗависитОтУслуги = Выборка.ЗависитОтУслуги Тогда
					//			//	ОбъемУслуги = ОбъемУслугиОсновной.ОбъемУслуги * ТемпературныйКоэффициент;
					//			//	ОбъемУслугиПотребленный = ОбъемУслугиОсновной.ОбъемУслугиПотребленный * ТемпературныйКоэффициент;
					//			//	
					//			//Иначе
					//			//	ОбъемУслуги =  ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ТемпературныйКоэффициент);
					//			//	ОбъемУслугиПотребленный = ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ТемпературныйКоэффициент);
					//			//	
					//			//КонецЕсли;
					//			
					//			Если ?(Выборка.СпособНачисления = СпособНачисленияПоПриборам, Выборка.ПриоритетСпособаРасчетаЗАвисимойУслуги = 1, Выборка.ПриоритетСпособаРасчета = 1)  Тогда
					//				
					//				Если Выборка.Услуга.ЗависитОтУслуги = Выборка.ЗависитОтУслуги Тогда
					//					ОбъемУслуги = ОбъемУслугиОсновной.ОбъемУслуги * ТемпературныйКоэффициент;
					//					ОбъемУслугиПотребленный = ОбъемУслугиОсновной.ОбъемУслугиПотребленный * ТемпературныйКоэффициент;
					//					
					//				Иначе
					//					ОбъемУслуги = ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ТемпературныйКоэффициент);
					//					ОбъемУслугиПотребленный = ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ТемпературныйКоэффициент);
					//					
					//				КонецЕсли;	
					//			Иначе
					//				ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
					//				ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
					//				
					//				
					//			КонецЕсли;
					//			ОбъемПоПрибору									= ОбъемУслуги;
					//			
					//		КонецЕсли;
					//	Иначе
					//		ОбъемУслуги 										= Выборка.ОбъемУслуги;
					//		ОбъемУслугиПотребленный 							= Выборка.ОбъемУслугиПотребленный;
					//		
					//	КонецЕсли;
					//	СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
					//	СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
					//	Если ОбъемПоПрибору <> Неопределено Тогда
					//		СтрокаНабора.ОбъемПоПрибору			 			= ОбъемПоПрибору * Выборка.КоэффициентПропорциональности;	
					//	КонецЕсли;
						
							
							
					ИначеЕсли ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и (НЕ Выборка.ПривязанаКШкале ИЛИ Выборка.ЗависитОтУслугиШапка) и НЕ Выборка.РасчетПоФормуле И Не Выборка.НаличиеЗарегистрированногоОбъема И НЕ Выборка.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
						
						Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено и НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено 
							И (ИсклНачисленияНорматива.Найти(Выборка.СпособРасчетаНорматива) = Неопределено Или Выборка.СпособНачисления = СпособНачисленияПоПриборам) Тогда
								
								ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
								
								ТемпературныйКоэффициент = (Выборка.ТемператураПодачиИсточника - Выборка.ТемператураХолоднойВодыИсточника) / 1000;
								
								Если (Выборка.ПриоритетСпособаРасчета = 1 или Выборка.ПриоритетСпособаРасчетаЗАвисимойУслуги = 1) и Выборка.ЗависитОтУслугиШапка Тогда
									
									Если Выборка.Услуга.ЗависитОтУслуги = Выборка.ЗависитОтУслуги Тогда
										ОбъемУслуги = ОбъемУслугиОсновной.ОбъемУслуги * ТемпературныйКоэффициент;
										ОбъемУслугиПотребленный = ОбъемУслугиОсновной.ОбъемУслугиПотребленный * ТемпературныйКоэффициент;
										
									Иначе
										ОбъемУслуги = ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслуги / ТемпературныйКоэффициент);
										ОбъемУслугиПотребленный = ?(ТемпературныйКоэффициент = 0, 0, ОбъемУслугиОсновной.ОбъемУслугиПотребленный / ТемпературныйКоэффициент);
										
									КонецЕсли;
									
								Иначе
									Если Выборка.ЗависитОтУслугиШапка Тогда
										 ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги* Выборка.НормаПотребления;
	                                     ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный* Выборка.НормаПотребления;
									Иначе
										 //Для водоотведения
									ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги;
									//* Выборка.НормаПотребления;
									ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный;
									//* Выборка.НормаПотребления;

										КонецЕсли;
																		
								КонецЕсли;
								
								
							Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
								СтрокаНабора.ОбъемПоПрибору = ОбъемУслуги;
							КонецЕсли;
						Иначе
							ОбъемУслуги 										= Выборка.ОбъемУслуги;
							ОбъемУслугиПотребленный 							= Выборка.ОбъемУслугиПотребленный;
							
						КонецЕсли;
						СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги * Выборка.КоэффициентПропорциональности;
						СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * Выборка.КоэффициентПропорциональности;
						
					КонецЕсли;
					
				КонецЕсли;
				
				КлючШкалы 													= Выборка.Шкала.УникальныйИдентификатор();
				КлючЧастиУзла 												= Выборка.ПриборУчета.УникальныйИдентификатор();

				Если ПараметрыФормулы[КлючЧастиУзла] = Неопределено Тогда
					СоотвествиеШкалы 										= Новый Соответствие;
					СоотвествиеШкалы.Вставить(КлючШкалы, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
					ПараметрыФормулы.Вставить(КлючЧастиУзла, СоотвествиеШкалы);
				ИначеЕсли ПараметрыФормулы[КлючЧастиУзла][КлючШкалы] = Неопределено Тогда
					ПараметрыФормулы[КлючЧастиУзла].Вставить(КлючШкалы, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
				Иначе
					ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслуги 				= ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслуги + Выборка.ОбъемУслуги;
					ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслугиПотребленный 	= ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
  				КонецЕсли;
				
				Если НЕ НачисленияПоШкале[Выборка.Шкала] = Неопределено Тогда
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги 			 = НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги + Выборка.ОбъемУслуги;
					НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный = НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
				Иначе
					НачисленияПоШкале.Вставить(Выборка.Шкала, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
				КонецЕсли;
				
								
				
				НачисленияПоУслугам.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				//НормативыНаПодогрев.Вставить(Выборка.Услуга, 		Выборка.РасчетныйНормативНаПодогрев);
				НормативНаПодогрев  									= Выборка.РасчетныйНормативНаПодогрев;
				
				КоэффициентыПоВоздуху.Вставить(Выборка.Услуга, 		Выборка.ТемпературныйКоэффициентПоВоздуху);	
				КоэффициентыПоВоде.Вставить(Выборка.Услуга, 		Выборка.ТемпературныйКоэффициентПоВоде);	
				//	ПлотностиВоды.Вставить(Выборка.Услуга, 					Выборка.ПлотностьВоды);	
				ПлотностиВоды.Вставить(Выборка.Услуга, 				0);
				НачисленияПоУслугамОбъекта.Вставить(Выборка.Услуга, Выборка.ОбъемУслуги);
				
				ТемпературныйКоэффициентПоВоздуху = Выборка.ТемпературныйКоэффициентПоВоздуху;
				ТемпературныйКоэффициентПоВоде = Выборка.ТемпературныйКоэффициентПоВоде;
				ПлотностьВоды = 0;
				
				//закрытая схема
				Если Выборка.ЗакрытаяСхемаГВС Тогда
					СтрокаНабора.ОбъемУслуги = 0;
				КонецЕсли;
				
			//	ТекДоговор									= Выборка.Договор;
				ТекОбъектРасчета 							= Выборка.ОбъектРасчета;
				ТекТочкаУчета								= Выборка.ТочкаУчета;
				ТекНачалоПериода							= Выборка.НачалоПериода;
				ТекУслуга 									= Выборка.Услуга;
				//ТекКонецПериода							= Выборка.КонецПериода;
				ТекШкала 									= Выборка.Шкала;
				
				Сч 	= Сч+1;
				
			КонецЦикла;	
			
			//добавить строки с формулами
			Если Не МассивФормулРасчета = Неопределено Тогда
				СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
				МассивФормулРасчета.Добавить(СтрокаОписанияФормулы);
				
				ДобавитьСтрокиНачисленияНППоФормуле(ПериодНачисления, Организация, Район, ВыборкаДоговор.Договор, ТекОбъектРасчета, ТекТочкаУчета, КонецПериодаРасчета, ДокументСсылка, МассивФормулРасчета, НормативыПоУслугам, НормативНаПодогрев, ТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициентПоВоде, ПлотностьВоды, Набор);
			КонецЕсли;

			
			Если Документ = Неопределено и НЕ Набор = Неопределено и (Набор.Количество() > 0 ИЛИ НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0) тогда
				НачатьТранзакцию();
				Попытка 			
					Если НЕ ДокументОбъект  = Неопределено Тогда
						ДокументОбъект.ПометкаУдаления = Ложь;
						ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
						ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
					
					Если НЕ Договор = Неопределено и НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
						Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
							ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
						КонецЦикла;				
					КонецЕсли;
					
					Набор.Записать(Ложь);
					
					Если ЗначениеЗаполнено(НаборРасчетСреднегоОбъемаНП) Тогда
						ТЗСвернуть = НаборРасчетСреднегоОбъемаНП.выгрузить();
						ТЗСвернуть.свернуть("Организация,ПериодНачисления,Район,Договор,ОбъектРасчета,ТочкаУчета,Шкала,ТарифнаяЗона,Разделитель,ДокРегистратор,МКД","ОбъемУслуги");
						НаборРасчетСреднегоОбъемаНП.Очистить();
						НаборРасчетСреднегоОбъемаНП.Загрузить(ТЗСвернуть);
						НаборРасчетСреднегоОбъемаНП.Записать();
					КонецЕсли;
					
					ЗафиксироватьТранзакцию();
				Исключение
					ОписаниеОшибки 											= ИнформацияОбОшибке();
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
			
			ТекДокумент = ВыборкаДок.ДокументНачисления;
			
		КонецЦикла;
		
		ТекДоговор 									= ВыборкаДоговор.Договор;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачисленияПоДолевымСхемам(Организация,ПериодНачисления,Район,МКД,Отдельностоящие,Договор,Документ)  Экспорт 
	
	ГраницыПериода  									= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);	
	МВТ 												= Новый МенеджерВременныхТаблиц;
	ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ,Организация,ПериодНачисления,Район,Отдельностоящие,МКД,Договор,ГраницыПериода);
	
	МассивПропроциональныхНачислений					= Новый Массив;
	МассивПропроциональныхНачислений.Добавить(Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему);
	МассивПропроциональныхНачислений.Добавить(Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги);
	МассивПропроциональныхНачислений.Добавить(Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему);
	
	Запрос 												= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 						= МВТ;
	Запрос.Текст 										= ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам();
	Запрос.УстановитьПараметр("НачалоПериода",			ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",			ГраницыПериода.ЗавершениеОП);
	
	Результат  											= Запрос.ВыполнитьПакет();
	ВыборкаДолевойОбъем									= Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСубабоненты									= Результат[1].Выбрать();
	
	ТекДоговор											= Неопределено;
	ТекОбъектРасчета                                    = Неопределено;
	ТекТочкаУчета                                       = Неопределено;
	
	НаборЗаписей 										= Неопределено;
	
	ДокументОбъект 										= Неопределено;
	ДанныеПоУслуге 										= Неопределено;
	НаборВыполненные 									= Неопределено;
	ЗамещатьНаборВыполненные 							= Истина;
	
	НачисленияПоТочке = Новый Соответствие;
	РассчитанныеОбъемыПоТочке = Новый Соответствие;
	СторнированныеОбъемыПоТочке = Новый Соответствие;
	
	ТаблицаСторнированныхОбъемов = Новый ТаблицаЗначений;
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ТаблицаСторнированныхОбъемов.Колонки.Добавить("ОбъемУслуги", Новый ОписаниеТипов("Число"));
	
	
	Если ВыборкаДолевойОбъем.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСубабоненты.следующий();
	
	Пока ВыборкаДолевойОбъем.Следующий() Цикл
		
		ТекУслуга 										= Неопределено;
		
		Если НЕ ТекДоговор = ВыборкаДолевойОбъем.Договор Тогда
			
			Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
				
				НачатьТранзакцию();
				
				НаборОтложенныхДвижений	= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
				НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
				НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
				НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
				НаборОтложенныхДвижений.Отбор.Договор.Установить(ТекДоговор);
				
				НаборОтложенныхДвижений.Записать();					
				
				Попытка 					
					НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
					НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
					НаборЗаписей.ДополнительныеСвойства.Вставить("Договор",    			ТекДоговор);
					НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
					НаборЗаписей.Записать();
					
					Если Не ДокументОбъект = Неопределено Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
						ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
					КонецЕсли; 					
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
			
			ДокументСсылка 							= ВыборкаДолевойОбъем.ДокументНачисленияПоДолевымСхемам;			
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
				ДокументСсылка 						= Документы.бестНачислениеПоДолевымСхемам.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект 						= Документы.бестНачислениеПоДолевымСхемам.СоздатьДокумент();
				ДокументОбъект.Район 				= Район;
				ДокументОбъект.Договор 				= ВыборкаДолевойОбъем.Договор;
				ДокументОбъект.Дата 				= ГраницыПериода.ЗавершениеОП-1;
				ДокументОбъект.Организация			= Организация;
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
				
			Иначе
				ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления 		= Ложь;
				
				НаборЗаписей 						= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборЗаписей.Записать(); // очищаем набор записей
				
				//ДокОбъект = ДокументСсылка.ПолучитьОбъект();
				//ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
			НаборЗаписей 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			
			ВыборкаТочкиУчета = ВыборкаДолевойОбъем.Выбрать();
			
			Пока ВыборкаТочкиУчета.Следующий() Цикл
				
				Если НЕ ТекТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета Или НЕ ТекУслуга = ВыборкаТочкиУчета.Услуга Тогда
					
					Если Не ТекУслуга  = Неопределено Тогда
						НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, ?(ТекДоговор = Неопределено, ВыборкаДолевойОбъем.Договор, ТекДоговор), ТекТочкаУчета, ТекУслуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке);
					КонецЕсли;
									
					ДанныеПоУслуге  												= Новый Структура;
					
										
					ДанныеПоУслуге.Вставить("РасчетИндивидуальногоПотребления",		ВыборкаТочкиУчета.РасчетИндивидуальногоПотребления);
					ДанныеПоУслуге.Вставить("СуммарныйОбъемСубабонентов",			ВыборкаТочкиУчета.ОбъемПотребленияСубабонентов);
					ДанныеПоУслуге.Вставить("Субабоненты", 							Новый Массив);
					ДанныеПоУслуге.Вставить("ЗначениеНагрузки", 					ВыборкаТочкиУчета.ЗначениеНагрузки);
					ДанныеПоУслуге.Вставить("ЗначениеПлощади", 						ВыборкаТочкиУчета.ЗначениеПлощади);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеНагрузкиСубабонентов",ВыборкаТочкиУчета.СуммарноеЗначениеНагрузкиСубабонентов);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеПлощадиСубабонентов", ВыборкаТочкиУчета.СуммарноеЗначениеПлощадиСубабонентов);
					ДанныеПоУслуге.Вставить("СуммарноеЗначениеДоговорногоОбъемаСуб",ВыборкаТочкиУчета.СуммарноеЗначениеДоговорногоОбъемаСуб);
					ДанныеПоУслуге.Вставить("ВсегоТочекУчетаСубабонентов", 			ВыборкаТочкиУчета.ВсегоТочекУчетаСубабонентов);
					ДанныеПоУслуге.Вставить("ВсегоПриборовУчетаСубабонентов", 		ВыборкаТочкиУчета.ВсегоПриборовУчетаСубабонентов);
					ДанныеПоУслуге.Вставить("ДанныеНачисленийСубабонентов", 		бестНачисленияНП.ОписаниеТаблицыОбъемов());
					ДанныеПоУслуге.Вставить("СпособНачисления", 					ВыборкаТочкиУчета.СпособНачисления);
					ДанныеПоУслуге.Вставить("ПотреблениеСубабонентов", 				0);
					ДанныеПоУслуге.Вставить("ОбъемСубКРаспределению", 				ВыборкаТочкиУчета.ОбъемСубКРаспределению);
					ДанныеПоУслуге.Вставить("СхемаРасчетаПриВыходеПУ", 				ВыборкаТочкиУчета.СхемаРасчетаПриВыходеПУ);
					
					мСубабоненты 											= ДанныеПоУслуге.Субабоненты;
					ПотреблениеСубабонентов 								= ДанныеПоУслуге.ПотреблениеСубабонентов;

					ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Очистить();
					
					Если ВыборкаТочкиУчета.Уровень = 0 Тогда
						ДанныеПоУслуге.Вставить("ОбъемУслуги",							ВыборкаТочкиУчета.ОбъемУслуги);
					Иначе
						Если РассчитанныеОбъемыПоТочке[ВыборкаТочкиУчета.ОбъектРасчета] <> Неопределено Тогда
							РассчитанныйОбъемУслуги 	= РассчитанныеОбъемыПоТочке[ВыборкаТочкиУчета.ОбъектРасчета][ВыборкаТочкиУчета.Услуга];
							ДанныеПоУслуге.Вставить("ОбъемУслуги",	?(РассчитанныйОбъемУслуги = Неопределено, ВыборкаТочкиУчета.ОбъемУслуги,РассчитанныйОбъемУслуги) );
							
							НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаТочкиУчета.ТочкаУчета,ВыборкаТочкиУчета.Услуга,РассчитанныйОбъемУслуги));
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаТочкиУчета);
								СтрокаСписатьИндивидуальные.ОбъемУслуги		= РассчитанныйОбъемУслуги;
								
								СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаТочкиУчета);
								СтрокаСторнированныхОбъемов.ОбъемУслуги		= РассчитанныйОбъемУслуги;
											
							КонецЕсли;
														
						Иначе
							//Продолжить;
							ДанныеПоУслуге.Вставить("ОбъемУслуги",							0);
						КонецЕсли;
					КонецЕсли;
					
					
					// Двигаем выборку абонентов
					Пока НЕ ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета ИЛИ НЕ ВыборкаСубабоненты.Услуга = ВыборкаТочкиУчета.Услуга Цикл
						Если НЕ ВыборкаСубабоненты.Следующий() Тогда
							Прервать;
							ВыборкаСубабоненты.сбросить();
						КонецЕсли;				
					КонецЦикла;
					
					ТекСубабонент	 									= Неопределено;
					ДанныеСубабонента 									= Неопределено;
					
					Пока ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаТочкиУчета.ТочкаУчета и ВыборкаСубабоненты.Услуга = ВыборкаТочкиУчета.Услуга Цикл
						Если НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета] = Неопределено Тогда
							НачисленияПоТочке.Вставить(ВыборкаСубабоненты.ОбъектРасчета, Новый Соответствие);
						КонецЕсли;
						Если НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета][ВыборкаСубабоненты.Услуга] = Неопределено Тогда
							НачисленияПоУслуге = Новый Структура("ОбъемУслугиГоловнойТУ, ОбъемУслуги", 0, 0);
							НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета].Вставить(ВыборкаСубабоненты.Услуга, НачисленияПоУслуге);
						КонецЕсли;
						
						НачисленияПоУслуге = НачисленияПоТочке[ВыборкаСубабоненты.ОбъектРасчета][ВыборкаСубабоненты.Услуга];
						НачисленияПоУслуге.ОбъемУслуги = НачисленияПоУслуге.ОбъемУслуги + ВыборкаСубабоненты.ОбъемУслуги;
						
						Если НЕ ТекСубабонент = ВыборкаСубабоненты.ТочкаУчета Тогда
							Если Не ТекСубабонент = Неопределено Тогда
								мСубабоненты.Добавить(ДанныеСубабонента);
							КонецЕсли;
							
							
							ДанныеСубабонента 								= Новый Структура("Договор, ОбъектРасчета, ТочкаУчета, ОбъемУслуги, ЗначениеПлощади, КоэффициентДолевогоРаспределения, СпособРаспределенияОбъемаДолевойТУ, СпособРаспределенияОстаткаДолевыеСхемы, ЗависимаяТочкаУчета, ЗначениеНагрузки, ДоговорнойОбъем, ФиксированныйОбъем,ТарифнаяЗона,Поставщик",
							ВыборкаСубабоненты.Договор, ВыборкаСубабоненты.ОбъектРасчета, ВыборкаСубабоненты.ТочкаУчета, ВыборкаСубабоненты.ОбъемУслуги, ВыборкаСубабоненты.ЗначениеПлощади, ВыборкаСубабоненты.КоэффициентДолевогоРаспределения, ВыборкаСубабоненты.СпособРаспределенияОбъемаДолевойТУ, 
							ВыборкаСубабоненты.СпособРаспределенияОстаткаДолевыеСхемы, ВыборкаСубабоненты.ЗависимаяТочкаУчета, ВыборкаСубабоненты.ЗначениеНагрузки, ВыборкаСубабоненты.ДоговорнойОбъем, ВыборкаСубабоненты.ФиксированныйОбъем, ВыборкаСубабоненты.ТарифнаяЗона, ВыборкаСубабоненты.Поставщик);
							
							
						КонецЕсли;
						
						Если ВыборкаСубабоненты.ГоловнаяТочкаУчета = ВыборкаСубабоненты.ТочкаУчета Тогда
							
							НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаСубабоненты.ТочкаУчета,ВыборкаСубабоненты.Услуга,РассчитанныйОбъемУслуги));
							НачисленияПоУслуге.ОбъемУслуги = НачисленияПоУслуге.ОбъемУслуги - ВыборкаСубабоненты.ОбъемУслуги;
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаСубабоненты);
								СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
								
								СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаСубабоненты);
								СтрокаСторнированныхОбъемов.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;

							КонецЕсли;
				
						Иначе
							Если ВыборкаСубабоненты.СторнироватьОбъемИндивидуальногоПотребления Тогда
								
								НачисленияПоУслуге.ОбъемУслуги = НачисленияПоУслуге.ОбъемУслуги - ВыборкаСубабоненты.ОбъемУслуги;
								НайденныеСтроки  = ТаблицаСторнированныхОбъемов.НайтиСтроки(Новый Структура("ТочкаУчета, Услуга, ОбъемУслуги", ВыборкаСубабоненты.ТочкаУчета,ВыборкаСубабоненты.Услуга,РассчитанныйОбъемУслуги));
								Если НайденныеСтроки.Количество() = 0 Тогда
									СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийСубабонентов.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаСубабоненты);
									СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
									
									СтрокаСторнированныхОбъемов = ТаблицаСторнированныхОбъемов.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаСторнированныхОбъемов, ВыборкаСубабоненты);
									СтрокаСторнированныхОбъемов.ОбъемУслуги		= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
								КонецЕсли;
								
								
							КонецЕсли;
						КонецЕсли;
						
						ПотреблениеАбонентов 							= ВыборкаСубабоненты.ИндивидуальныйОбъемСуб;
						
						ТекСубабонент 									= ВыборкаСубабоненты.ТочкаУчета;
						
						Если МассивПропроциональныхНачислений.Найти(ВыборкаСубабоненты.СпособРаспределенияОбъемаДолевойТУ) = Неопределено Тогда
							ДанныеПоУслуге.СуммарныйОбъемСубабонентов = ДанныеПоУслуге.СуммарныйОбъемСубабонентов - ВыборкаСубабоненты.ОбъемУслуги;
						КонецЕсли;
						
						Если НЕ ВыборкаСубабоненты.Следующий() Тогда
							Прервать;
							ВыборкаСубабоненты.сбросить();
						КонецЕсли; 				
					КонецЦикла; 			
					
					Если Не ТекСубабонент = Неопределено Тогда
						мСубабоненты.Добавить(ДанныеСубабонента);
					КонецЕсли;
					
				КонецЕсли;		
				
				ТекТочкаУчета 											= ВыборкаТочкиУчета.ТочкаУчета;
				ТекУслуга 												= ВыборкаТочкиУчета.Услуга;
			КонецЦикла;
			
			Если Не НаборЗаписей = Неопределено Тогда
				
				НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, ТекДоговор, ТекТочкаУчета, ТекУслуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке);
				
				Если НаборЗаписей.Количество() > 0 Тогда
					НачатьТранзакцию();
					Попытка				
						Если Не ДокументОбъект = Неопределено Тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						
						НаборОтложенныхДвижений 					= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
						НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
						НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
						НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
						НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
						НаборОтложенныхДвижений.Отбор.Договор.Установить(ТекДоговор);
						НаборОтложенныхДвижений.Записать();				
						
						НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
						НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
						НаборЗаписей.ДополнительныеСвойства.Вставить("Договор",    			ТекДоговор);
						НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
						НаборЗаписей.Записать(Ложь);	
						
						ЗафиксироватьТранзакцию();
					Исключение
						ОписаниеОшибки 								= ОписаниеОшибки();
						ОтменитьТранзакцию();
					КонецПопытки;
				КонецЕсли;		
			КонецЕсли; 			
			
			
			ТекДоговор = ВыборкаДолевойОбъем.Договор;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура НачислитьПеню(Организация,ПериодНачисления,Район,МКД,Отдельностоящие,Договор,Документ) Экспорт  
	
	//НачислятьПеню = Константы.энргНачислятьПеню.Получить();
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	энргПрименениеНачисленияПениСрезПоследних.Период КАК Период,
	|	энргПрименениеНачисленияПениСрезПоследних.Организация КАК Организация,
	|	энргПрименениеНачисленияПениСрезПоследних.НачислятьПеню КАК НачислятьПеню
	|ИЗ
	|	РегистрСведений.энргПрименениеНачисленияПени.СрезПоследних(&Период, Организация = &Организация) КАК энргПрименениеНачисленияПениСрезПоследних";
	Запрос.УстановитьПараметр("Период", 		ГраницыПериода.ЗАвершениеОП-1);
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	НачислятьПеню = Ложь;
	Если Выборка.Следующий() Тогда
		НачислятьПеню = Выборка.НачислятьПеню;	
	КонецЕсли;	
	
	Если не НачислятьПеню тогда
		Запрос  								= Новый Запрос;
		Запрос.Текст 							=
		"ВЫБРАТЬ
		|	МАКСИМУМ(бестНачислениеПениНП.Ссылка) КАК Ссылка
		|ИЗ
		|	Документ.бестНачислениеПениНП КАК бестНачислениеПениНП
		|ГДЕ
		|	бестНачислениеПениНП.Организация = &Организация
		|	И бестНачислениеПениНП.Район = &Район
		|	И бестНачислениеПениНП.ПериодНачисления = &ПериодНачисления
		|	И НЕ бестНачислениеПениНП.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ПериодНачисления", 		ПериодНачисления);
		Запрос.УстановитьПараметр("Организация", 			Организация);
		Запрос.УстановитьПараметр("Район", 					Район);
		
		Результат = Запрос.Выполнить();
		Выборка		= Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				ДокОб = Выборка.Ссылка.ПолучитьОбъект();
				ДокОб.ПометкаУдаления = Истина;
				ДокОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройки системы не предполагают начисление пени");		
		Возврат;	
	КонецЕсли;
	                   
	Если не НачислятьПеню тогда		
		Возврат;
	КонецЕсли;
	
	ОсновнойПроизводственныйКалендарь = Константы.бестОсновнойПроизводственныйКалендарь.Получить();
	                   
	Если НЕ ЗначениеЗаполнено(ОсновнойПроизводственныйКалендарь) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен основной производственный календарь");
		Возврат;
	КонецЕсли;

	
	Если МКД = Неопределено тогда
		МКД = Справочники.энргСтроения.ПустаяСсылка();
	КонецЕсли;
	
	// Ставки рефинансирования
	Запрос  								= Новый Запрос;
	Запрос.Текст 							=
	"ВЫБРАТЬ
	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&Период, ) КАК энргСтавкиРефинансированияСрезПоследних";
	Запрос.УстановитьПараметр("Период", ПериодНачисления);
	
	Результат  								= Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена информация по ставке рефинансирования,
		|	 Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка  								= Результат.Выбрать();
	Выборка.Следующий();
	СтавкаРефинансирования  				= Выборка.Коэффициент; 
	
	// Настройка расчет пени
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНастройкаРасчетаПениСрезПоследних.КатегорияПотребителя КАК КатегорияПотребителя,
		|	бестНастройкаРасчетаПениСрезПоследних.От КАК От,
		|	бестНастройкаРасчетаПениСрезПоследних.До КАК До,
		|	бестНастройкаРасчетаПениСрезПоследних.Числитель КАК Числитель,
		|	бестНастройкаРасчетаПениСрезПоследних.Знаменатель КАК Знаменатель
		|ИЗ
		|	РегистрСведений.бестНастройкаРасчетаПениНП.СрезПоследних(&Период,) КАК бестНастройкаРасчетаПениСрезПоследних
		|ИТОГИ ПО
		|	КатегорияПотребителя";
	
	Запрос.УстановитьПараметр("Период", ПериодНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки расчет пени, Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	
	ВыборкаКатегорияПотребителя = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеИтог =Новый Соответствие; 
	Пока ВыборкаКатегорияПотребителя.Следующий() Цикл
		МаксЗначение = 0;
		СоответствиеКатегория = Новый Соответствие;
		РангКоэффициента = 1;
		
		Строка = ВыборкаКатегорияПотребителя.Выбрать();
		
		Пока Строка.Следующий() Цикл
			Если Строка.До = 0 Тогда
				НСтр = Новый Структура;
				НСтр.Вставить("Числитель", Строка.Числитель);
				НСтр.Вставить("Знаменатель", Строка.Знаменатель);
				НСтр.Вставить("РангКоэффициента", РангКоэффициента);
				
				СоответствиеКатегория.Вставить(Строка.До, НСтр);
			Иначе
				Для Сч = Строка.От По Строка.До Цикл
					НСтр = Новый Структура;
					НСтр.Вставить("Числитель", Строка.Числитель);
					НСтр.Вставить("Знаменатель", Строка.Знаменатель);
					НСтр.Вставить("РангКоэффициента", РангКоэффициента);
					
					СоответствиеКатегория.Вставить(Сч, НСтр);
					
					МаксЗначение = Макс(МаксЗначение, Сч);
				КонецЦикла;
			КонецЕсли;
			
			РангКоэффициента = РангКоэффициента + 1;
			
		КонецЦикла;
		СоответствиеИтог.Вставить(ВыборкаКатегорияПотребителя.КатегорияПотребителя,СоответствиеКатегория);
	КонецЦикла;
	
	// Настройки начисления пени.
	Запрос  									= Новый Запрос;
	Запрос.Текст 								=
	"ВЫБРАТЬ
	|	бестОстановленныеРасчетыПени.Договор КАК Договор
	|ПОМЕСТИТЬ ДоговорыСОстановкойПени
	|ИЗ
	|	РегистрСведений.бестОстановленныеРасчетыПени КАК бестОстановленныеРасчетыПени
	|ГДЕ
	|	бестОстановленныеРасчетыПени.Организация = &Организация
	|	И бестОстановленныеРасчетыПени.Район = &Район
	|	И ВЫБОР
	|			КОГДА &НачалоПериода >= бестОстановленныеРасчетыПени.От
	|						И &НачалоПериода < бестОстановленныеРасчетыПени.До
	|					ИЛИ &КонецПериода >= бестОстановленныеРасчетыПени.От
	|						И &КонецПериода < бестОстановленныеРасчетыПени.До
	|				ТОГДА ИСТИНА
	|			КОГДА бестОстановленныеРасчетыПени.От >= &НачалоПериода
	|						И бестОстановленныеРасчетыПени.От < &КонецПериода
	|					ИЛИ бестОстановленныеРасчетыПени.До >= &НачалоПериода
	|						И бестОстановленныеРасчетыПени.До < &КонецПериода
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Район КАК Район,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Организация КАК Организация,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Договор КАК Договор,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Услуга КАК Услуга,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.Период КАК Период,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаНачальныйОстаток + бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаНДСНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаКонечныйОстаток + бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты.СуммаНДСКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ДанныеЗадолженности
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчётыПоУслугамЮрЛица.ОстаткиИОбороты(
	|			,
	|			&КонецПериода,
	|			День,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ Договор В
	|						(ВЫБРАТЬ
	|							ДоговорыСОстановкойПени.Договор КАК Договор
	|						ИЗ
	|							ДоговорыСОстановкойПени КАК ДоговорыСОстановкойПени)
	|				И НЕ ЗНАЧЕНИЕ(справочник.бестдоговорыконтрагентов.пустаяссылка) В
	|						(ВЫБРАТЬ
	|							ДоговорыСОстановкойПени.Договор КАК Договор
	|						ИЗ
	|							ДоговорыСОстановкойПени КАК ДоговорыСОстановкойПени)) КАК бестВзаиморасчётыПоУслугамЮрЛицаОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.Организация КАК Организация,
	|	ДанныеЗадолженности.Договор КАК Договор,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	МИНИМУМ(ДанныеЗадолженности.Период) КАК Период,
	|	МИНИМУМ(ЕСТЬNULL(бестНастройкиОплатыПоЮрЛицамСрезПоследних.СрокОплаты, 0)) КАК ДеньНачалаОплаты
	|ПОМЕСТИТЬ ДатаНачала
	|ИЗ
	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкиОплатыПоЮрЛицам.СрезПоследних(
	|				&КонецПериода,
	|				ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический)
	|					И Район = &Район
	|					И Организация = &Организация) КАК бестНастройкиОплатыПоЮрЛицамСрезПоследних
	|		ПО ДанныеЗадолженности.Договор = бестНастройкиОплатыПоЮрЛицамСрезПоследних.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗадолженности.Договор,
	|	ДанныеЗадолженности.Услуга,
	|	ДанныеЗадолженности.ПериодНачисления,
	|	ДанныеЗадолженности.Район,
	|	ДанныеЗадолженности.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(бестНачислениеПениНП.Ссылка) КАК Ссылка,
	|	бестНачислениеПениНП.Район КАК Район,
	|	бестНачислениеПениНП.Организация КАК Организация
	|ПОМЕСТИТЬ ДокументыНачисления
	|ИЗ
	|	Документ.бестНачислениеПениНП КАК бестНачислениеПениНП
	|ГДЕ
	|	бестНачислениеПениНП.Организация = &Организация
	|	И бестНачислениеПениНП.Район = &Район
	|	И бестНачислениеПениНП.ПериодНачисления = &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНачислениеПениНП.Район,
	|	бестНачислениеПениНП.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.Организация КАК Организация,
	|	ДанныеЗадолженности.Договор КАК Договор,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеЗадолженности.Период КАК Период,
	|	ДанныеЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДанныеЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачала.Период КАК НачальныйПериод,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ДатаНачала.Период) + 1 = МЕСЯЦ(&ПериодНачисления)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДанныеЗадолженности.ПериодНачисления, МЕСЯЦ, 1), ДЕНЬ, ДатаНачала.ДеньНачалаОплаты)
	//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДатаНачала.Период, МЕСЯЦ, 1)
	|		ИНАЧЕ &НачалоПериода
	|	КОНЕЦ КАК ДатаНачалаНачисленияПени,
	|	ЕСТЬNULL(ДокументыНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеПениНП.ПустаяСсылка)) КАК ДокументНачисления,
	|	ДанныеЗадолженности.Договор.КатегорияПотребителя КАК КатегорияПотребителя,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДанныеЗадолженности.ПериодНачисления, МЕСЯЦ, 1), ДЕНЬ, ДатаНачала.ДеньНачалаОплаты) КАК ИзначальнаяДатаНачисленияПени
	|ИЗ
	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачала КАК ДатаНачала
	|		ПО ДанныеЗадолженности.Район = ДатаНачала.Район
	|			И ДанныеЗадолженности.Организация = ДатаНачала.Организация
	|			И ДанныеЗадолженности.Договор = ДатаНачала.Договор
	|			И ДанныеЗадолженности.Услуга = ДатаНачала.Услуга
	|			И ДанныеЗадолженности.ПериодНачисления = ДатаНачала.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачисления КАК ДокументыНачисления
	|		ПО ДанныеЗадолженности.Район = ДокументыНачисления.Район
	|			И ДанныеЗадолженности.Организация = ДокументыНачисления.Организация
	|ГДЕ
	|	ДанныеЗадолженности.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеЗадолженности.СуммаНачальныйОстаток > 0";
	
		
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Для каждого стр из ТЗ Цикл
		
		мДат = Новый Массив();
		мДат.Добавить(стр.ДатаНачалаНачисленияПени);
		мДат.Добавить(стр.ИзначальнаяДатаНачисленияПени);
		РабочаяДата = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ОсновнойПроизводственныйКалендарь,мДат,,Ложь);
		
		Если РабочаяДата <> Неопределено Тогда
			Если стр.ИзначальнаяДатаНачисленияПени = стр.ДатаНачалаНачисленияПени Тогда
				стр.ДатаНачалаНачисленияПени 		= РабочаяДата[стр.ДатаНачалаНачисленияПени];
			КонецЕсли;
			стр.ИзначальнаяДатаНачисленияПени 	= РабочаяДата[стр.ИзначальнаяДатаНачисленияПени];
		КонецЕсли;
	
	КонецЦикла;
	
	Запрос  									= Новый Запрос;
	Запрос.Текст 								=
	"ВЫБРАТЬ
	|	ТЗ.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	ТЗ.Период КАК Период,
	|	ТЗ.ДокументНачисления КАК ДокументНачисления,
	|	ТЗ.Договор КАК Договор,
	|	ТЗ.Услуга КАК Услуга,
	|	ТЗ.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ТЗ.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ТЗ.НачальныйПериод КАК НачальныйПериод,
	|	ТЗ.КатегорияПотребителя КАК КатегорияПотребителя,
	|	ТЗ.ИзначальнаяДатаНачисленияПени КАК ИзначальнаяДатаНачисленияПени
	|ПОМЕСТИТЬ ДатаНачальногоПериода
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаНачальногоПериода.ДокументНачисления КАК ДокументНачисления,
	|	ДатаНачальногоПериода.Договор КАК Договор,
	|	ДатаНачальногоПериода.Услуга КАК Услуга,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДатаНачальногоПериода.Период КАК Период,
	|	ДатаНачальногоПериода.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДатаНачальногоПериода.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ИзначальнаяДатаНачисленияПени, ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ДЕНЬ) КАК ДнейНаДеньНачала,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ИзначальнаяДатаНачисленияПени, ДатаНачальногоПериода.Период, ДЕНЬ) КАК ДнейПросрочкиСДатыНачалаНачисленийПени,
	|	ДЕНЬ(ДатаНачальногоПериода.Период) КАК ДеньПериода,
	|	ДЕНЬ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени) КАК ДеньНачала,
	|	ДатаНачальногоПериода.НачальныйПериод КАК НачальныйПериод,
	|	ДатаНачальногоПериода.КатегорияПотребителя КАК КатегорияПотребителя,
	|	ДатаНачальногоПериода.ИзначальнаяДатаНачисленияПени КАК ИзначальнаяДатаНачисленияПени
	|ИЗ
	|	ДатаНачальногоПериода КАК ДатаНачальногоПериода
	|ГДЕ
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени < &КонецПериода
	|	И ДатаНачальногоПериода.Период >= ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Период
	|ИТОГИ
	|	МАКСИМУМ(ДнейНаДеньНачала),
	|	МАКСИМУМ(ДеньНачала)
	|ПО
	|	ДокументНачисления,
	|	ПериодНачисления,
	|	Договор,
	|	Услуга";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументНачисления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументНачисления.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДокументНачисления.ДокументНачисления) Тогда
			ДокументОбъект = ВыборкаДокументНачисления.ДокументНачисления.ПолучитьОбъект();
			ДокументОбъект.Дата = КонецПериодаРасчета - 1;
			ДокументОбъект.ПометкаУдаления  = Ложь;
			ДокументОбъект.ДанныеНачислений.Очистить();
		Иначе
			ДокументОбъект = Документы.бестНачислениеПениНП.СоздатьДокумент();
			ДокументОбъект.Дата = КонецПериодаРасчета - 1;
			ДокументОбъект.Район = Район;
			ДокументОбъект.Организация = Организация;
			ДокументОбъект.ПериодНачисления = ПериодНачисления;
			ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
		
		ПараметрыШапки = Новый Структура;
		ПараметрыШапки.Вставить("ПериодНачисления", ПериодНачисления);
		ПараметрыШапки.Вставить("Организация", ДокументОбъект.Организация);
		ПараметрыШапки.Вставить("Район", ДокументОбъект.Район);
		ПараметрыШапки.Вставить("ЭтоОплата", Ложь);
		ПараметрыШапки.Вставить("Кассир", ДокументОбъект.Ответственный);
		ПараметрыШапки.Вставить("ИсточникПоступления", Неопределено);
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПараметрыПроведения", ПараметрыШапки);
	
		ВыборкаПериодНачисления = ВыборкаДокументНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаПериодНачисления.Следующий() Цикл
			ВыборкаДоговор = ВыборкаПериодНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаДоговор.Следующий() Цикл
				ВыборкаУслуга = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				Пока ВыборкаУслуга.Следующий() Цикл
					
					//ДеньНачалаДляРасчета = ВыборкаУслуга.ДеньНачала + 1;
					//ДнейНаДеньНачалаДляРасчета = ВыборкаУслуга.ДнейНаДеньНачала + 1;
					
					ВыборкаДетальныеЗаписи = ВыборкаУслуга.Выбрать();	
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ДеньНачалаДляРасчета = ВыборкаДетальныеЗаписи.ДнейНаДеньНачала + 1;
						//ДнейНаДеньНачалаДляРасчета = ВыборкаДетальныеЗаписи.ДнейНаДеньНачала + 1;
	
						ДнейПросрочки = 0;
						СуммаЗадолженности = ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток;
						КоэффициентЧислитель = 1;
						КоэффициентЗнаменатель = 1;
						ПредКоэффициентЧислитель = 1;
						ПредКоэффициентЗнаменатель = 1;
						РангКоэффициента = 0;
						ПредыдущийРанг = Неопределено;
						
						Для Сч = ДеньНачалаДляРасчета По ВыборкаДетальныеЗаписи.ДнейПросрочкиСДатыНачалаНачисленийПени Цикл
							
							ДнейПросрочки = ДнейПросрочки + 1;
							Соответствие = СоответствиеИтог.Получить(ВыборкаДетальныеЗаписи.КатегорияПотребителя);
							СтруктураКоэффициента = Соответствие.Получить(?(ДеньНачалаДляРасчета <= МаксЗначение, ДеньНачалаДляРасчета, 0));
							Если СтруктураКоэффициента = Неопределено Тогда
								КоэффициентЧислитель = 1;
								КоэффициентЗнаменатель = 1;
								РангКоэффициента = 0;
							Иначе
								КоэффициентЧислитель = СтруктураКоэффициента.Числитель;
								КоэффициентЗнаменатель = СтруктураКоэффициента.Знаменатель;
								РангКоэффициента = СтруктураКоэффициента.РангКоэффициента;
							КонецЕсли;
							
							Если НЕ РангКоэффициента = ПредыдущийРанг И НЕ ПредыдущийРанг = Неопределено Тогда
								НСтр = ДокументОбъект.ДанныеНачислений.Добавить();
								ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
								НСтр.КоэффициентЧислитель = ПредКоэффициентЧислитель;
								НСтр.КоэффициентЗнаменатель = ПредКоэффициентЗнаменатель;
								НСтр.СуммаЗадолженности = СуммаЗадолженности;
								НСтр.ДнейПросрочки = ДнейПросрочки;
								НСтр.СтавкаРефинансирования = СтавкаРефинансирования;							
								НСтр.ДатаНачисления = ВыборкаДетальныеЗаписи.НачальныйПериод;
								НСтр.ПериодНачисления = НачалоМесяца(ВыборкаДетальныеЗаписи.НачальныйПериод);
								НСтр.СуммаПени = НСтр.СуммаЗадолженности * (НСтр.КоэффициентЧислитель / НСтр.КоэффициентЗнаменатель) * НСтр.СтавкаРефинансирования / 100 * НСтр.ДнейПросрочки;
								
								ДнейПросрочки = 0;
							КонецЕсли;
							
							ПредыдущийРанг = РангКоэффициента;
							ПредКоэффициентЧислитель = КоэффициентЧислитель;
							ПредКоэффициентЗнаменатель = КоэффициентЗнаменатель;
							ДеньНачалаДляРасчета = ДеньНачалаДляРасчета + 1;
							
						КонецЦикла;
						Если ДнейПросрочки > 0 Тогда
							НСтр = ДокументОбъект.ДанныеНачислений.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							НСтр.КоэффициентЧислитель = КоэффициентЧислитель;
							НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
							НСтр.СуммаЗадолженности = СуммаЗадолженности;
							НСтр.ДнейПросрочки = ДнейПросрочки;
							НСтр.СтавкаРефинансирования = СтавкаРефинансирования;							
							НСтр.ДатаНачисления = ВыборкаДетальныеЗаписи.НачальныйПериод;
							НСтр.ПериодНачисления = НачалоМесяца(ВыборкаДетальныеЗаписи.НачальныйПериод);
							НСтр.СуммаПени = НСтр.СуммаЗадолженности * (НСтр.КоэффициентЧислитель / НСтр.КоэффициентЗнаменатель) * НСтр.СтавкаРефинансирования / 100 * НСтр.ДнейПросрочки;
							
							ДеньНачалаДляРасчета = ВыборкаДетальныеЗаписи.ДнейНаДеньНачала + 1;
						КонецЕсли;
					КонецЦикла;				
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	//Результат = Запрос.Выполнить();
	//
	//Выборка  									= Результат.Выбрать();
	//ТекМКД  									= Неопределено; 
	//ДокументОбъект 							= Неопределено;
	//Пока Выборка.Следующий() цикл
	//	
	//	Если ТекМКД <> Выборка.МКД тогда
	//		Если ТекМКД<> Неопределено тогда
	//			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//		КонецЕсли;
	//		
	//		Если ЗначениеЗаполнено(Выборка.ДокументНачисления) тогда
	//			ДокументОбъект  				= Выборка.ДокументНачисления.ПолучитьОбъект();
	//			ДокументОбъект.ПометкаУдаления  = Ложь;
	//			ТабЧасть 						= ДокументОбъект.ДанныеНачислений;
	//		иначе
	//			ДокументОбъект  				= Документы.энргНачислениеПени.СоздатьДокумент();
	//			ТабЧасть 						= ДокументОбъект.ДанныеНачислений;
	//		КонецЕсли;		
	//		ТабЧасть.очистить();			
	//	КонецЕсли;	
	//	
	//	СтрокаНачислений  						= ТабЧасть.добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаНачислений,Выборка);
	//	
	//	ТекМКД 									= Выборка.МКД;		
	//КонецЦикла; 
	//
	//Если ТекМКД<> Неопределено тогда
	//	ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
	//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//КонецЕсли;
	//
	//Если МКД = Неопределено тогда
	//	//Набор 									= РегистрыСведений.энргВыполненныеНачисления.СоздатьНаборЗаписей();
	//	//Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	//	//Набор.Отбор.Район.установить(Район);
	//	//Набор.Отбор.ВидОперацииНачисления.установить(Перечисления.энргВидыОперацийНачисления.НачислениеПени);
	//	//Набор.ДополнительныеСвойства.Вставить("ЗаписьРазрешена");
	//	//Запись 								= Набор.Добавить();
	//	//Запись.ПериодНачисления 				= ПериодНачисления;
	//	//Запись.Район							= Район;
	//	//Запись.ВидОперацииНачисления			= Перечисления.энргВидыОперацийНачисления.НачислениеПени;
	//	//Набор.Записать();
	//КонецЕсли; 	 
	
КонецПроцедуры

Процедура ДобавитьСтрокиНачисленияНППоФормуле(ПериодНачисления, Организация, Район, Договор, ОбъектРасчета, ТочкаУчета, КонецПериодаРасчета, ДокументСсылка, ОписаниеУслуг, НормативыПоУслугам, НормативНаПодогрев, ТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициентПоВоде, ПлотностьВоды, Набор)
	
	ТипыРасходов 									= энргНачисления.ТипыРасходовВФормулахРасчета();
	ТипРасходаПоШкале  								= ТипыРасходов["РасходИзмерителяПоШкале"];	
	ТипРасходаНорматив 								= ТипыРасходов["ЗначениеНормативаПоУслуге"];
	ТипРасходаНормативНаПодогрев 					= ТипыРасходов["ЗначениеНормативаНаПодогрев"];
	ТипРасходаТемпературныйКоэффициентПоВоздуху 	= ТипыРасходов["ЗначениеТемпературногоКоэффициентаПоВоздуху"];
	ТипРасходаТемпературныйКоэффициентПоВоде 		= ТипыРасходов["ЗначениеТемпературногоКоэффициентаПоВоде"];
	ТипРасходаПлотностьВоды 						= ТипыРасходов["ЗначениеПлотностиВоды"];


	Для Каждого СтрокаФормулы Из ОписаниеУслуг Цикл			
		ТекФормулаОбъемУслуги	 					= СтрокаФормулы.ФормулаРасчета;
		
		Если Не ЗначениеЗаполнено(ТекФормулаОбъемУслуги) Тогда
			Продолжить;
		КонецЕсли;
			
		ТекФормулаОбъемУслугиПотребленный			= СтрокаФормулы.ФормулаРасчета;
		ПараметрыФормулы 							= СтрокаФормулы.ПараметрыФормулы;
		
		Для Каждого КлючЗначениеЧастьУзла Из ПараметрыФормулы Цикл
			Шкалы 									= КлючЗначениеЧастьУзла.Значение;
			КлючЧастьУзлаПриборУчета 				= XMLСтрока(КлючЗначениеЧастьУзла.Ключ); 
			Для Каждого КлючЗначениеШкала Из Шкалы Цикл
				КлючШкалы 							= XMLСтрока(КлючЗначениеШкала.Ключ);
				ОписаниеОбъема 						= КлючЗначениеШкала.Значение;
				Ключ 								= Новый Структура("ТипРасхода, ПриборУчета, Шкала", ТипРасходаПоШкале, КлючЧастьУзлаПриборУчета,КлючШкалы); 
				ТекФормулаОбъемУслуги 				= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОписаниеОбъема.ОбъемУслуги);
				ТекФормулаОбъемУслугиПотребленный 	= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОписаниеОбъема.ОбъемУслугиПотребленный);
			КонецЦикла; 			
		КонецЦикла;
		
		Для Каждого ПараметрФормулы Из НормативыПоУслугам Цикл			
			Ключ 									= Новый Структура("ТипРасхода, Услуга", ТипРасходаНорматив, XMLСтрока(ПараметрФормулы.Ключ));			
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		КонецЦикла;
		
		//Для Каждого ПараметрФормулы Из НормативыНаПодогрев Цикл			
		//	Ключ 									= Новый Структура("ТипРасхода, Услуга", ТипРасходаНормативНаПодогрев, XMLСтрока(ПараметрФормулы.Ключ));	
			Ключ 									= ТипРасходаНормативНаПодогрев;	
			//ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",НормативНаПодогрев);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",НормативНаПодогрев);
		//КонецЦикла;
		
		Ключ 									= ТипРасходаТемпературныйКоэффициентПоВоздуху;	
		ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ТемпературныйКоэффициентПоВоздуху);
		ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ТемпературныйКоэффициентПоВоздуху);
		
				Ключ 									= ТипРасходаТемпературныйКоэффициентПоВоде;	
		ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ТемпературныйКоэффициентПоВоде);
		ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ТемпературныйКоэффициентПоВоде);

		
				Ключ 									= ТипРасходаПлотностьВоды;	
		ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПлотностьВоды);
		ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПлотностьВоды);



		//Для Каждого ПараметрФормулы Из КоэффициентыПоВоздуху Цикл			
		//	Ключ 									= Новый Структура("ТипРасхода, Услуга", ТипРасходаТемпературныйКоэффициентПоВоздуху, XMLСтрока(ПараметрФормулы.Ключ));			
		//	ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//	ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//КонецЦикла;
		//
		//Для Каждого ПараметрФормулы Из КоэффициентыПоВоде Цикл			
		//	Ключ 									= Новый Структура("ТипРасхода, Услуга", ТипРасходаТемпературныйКоэффициентПоВоде, XMLСтрока(ПараметрФормулы.Ключ));			
		//	ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//	ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//КонецЦикла;

		//Для Каждого ПараметрФормулы Из ПлотностиВоды Цикл			
		//	Ключ 									= Новый Структура("ТипРасхода, Услуга", ТипРасходаПлотностьВоды, XMLСтрока(ПараметрФормулы.Ключ));			
		//	ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//	ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		//КонецЦикла;


		
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги," ","");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,Символы.НПП,"");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,",",".");
		РезультатПоФормуламОбъемУслуги				= 0;
		ТекФормулаОбъемУслуги 						= СтрЗаменить(ТекФормулаОбъемУслуги,"[Результат]=","РезультатПоФормуламОбъемУслуги=");
		Выполнить ТекФормулаОбъемУслуги;
		
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный," ","");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,Символы.НПП,"");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,",",".");
		РезультатПоФормуламОбъемУслугиПотребленный	= 0;
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[Результат]=","РезультатПоФормуламОбъемУслугиПотребленный=");
		Выполнить ТекФормулаОбъемУслугиПотребленный;
		
		Если РезультатПоФормуламОбъемУслуги = 0 И РезультатПоФормуламОбъемУслугиПотребленный = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНабора 								= Набор.добавить();
		СтрокаНабора.Период 						= СтрокаФормулы.КонецПериода-1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.Район 							= Район;
		СтрокаНабора.Договор 						= Договор;
		СтрокаНабора.ОбъектРасчета 					= ОбъектРасчета;
		СтрокаНабора.Услуга 						= СтрокаФормулы.Услуга;
		СтрокаНабора.ТочкаУчета 					= ТочкаУчета;
		СтрокаНабора.ВидНачисления 					= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.СпособНачисления 				= СтрокаФормулы.СпособНачисления;
		СтрокаНабора.ПриборУчета 					= СтрокаФормулы.УзелПриборУчета;
		СтрокаНабора.ТарифнаяЗона 					= Справочники.энргТарифныеЗоны.ПустаяСсылка();
		СтрокаНабора.Поставщик 						= СтрокаФормулы.Поставщик;
		СтрокаНабора.ПериодРасчета 					= ПериодНачисления;
		СтрокаНабора.ПериодНачисления 				= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги 					= РезультатПоФормуламОбъемУслуги * СтрокаФормулы.КоэффициентПропорциональности;		
		СтрокаНабора.ОбъемУслугиПотребленный 		= РезультатПоФормуламОбъемУслугиПотребленный * СтрокаФормулы.КоэффициентПропорциональности;		
		СтрокаНабора.НачалоПериода 					= СтрокаФормулы.НачалоПериода;
		СтрокаНабора.КонецПериода 					= СтрокаФормулы.КонецПериода;
		СтрокаНабора.Регистратор 					= ДокументСсылка;		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Снять средние начисления
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисленияНП(Организация, ПериодНачисления,Район,МКД,Договор,Документ) Экспорт
		
	перем ТекДоговор,ДокументОбъект; 
	
	Если не ЗначениеЗаполнено(ПериодНачисления) или не ЗначениеЗаполнено(Район) или НЕ ЗначениеЗаполнено(МКД) тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	ПрочитатьНеСписанныйСреднийНП(МВТ,ПериодНачисления,Организация,Район,МКД,Договор,НачалоПериодаРасчета,КонецПериодаРасчета);	
	результатЗапроса 								= РезультатЗапросаПерерасчетСреднего(МВТ,Организация, ПериодНачисления, КонецПериодаРасчета-1,Район,Договор); 	
	
	
	УправлящаяВыборка								= РезультатЗапроса[0].выбрать(); 	
	Выборка 										= результатЗапроса[1].Выбрать();
	ЕстьСледующийВыборка 							= Выборка.Следующий();
	
	ВидОперации 									= Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет;
	Сч 												= 0;
	
	Набор 											= Неопределено;
	НаборПомещения									= Неопределено;
	НаборНачисленныйСредний 						= Неопределено;
	НаборВыполненные 								= Неопределено;
	
	ВидНачисленияПерерасчет 						= Перечисления.энргВидыНачислений.Перерасчет;
	
	Если Выборка.Количество() = 0 Тогда				
		ВыборкаДокументыОтменить 					= РезультатОтменитьСнятьСредниеНачисления(ПериодНачисления,Организация,Район,МКД,Договор,КонецПериодаРасчета);
		Пока ВыборкаДокументыОтменить.Следующий() Цикл
			ДокументОбъектОтменить					= ВыборкаДокументыОтменить.Ссылка.ПолучитьОбъект();
			ДокументОбъектОтменить.УстановитьПометкуУдаления(Истина);
		КонецЦикла; 		
	КонецЕсли;
	
	СтрокиНабораДоЗаписи 							= Неопределено;
	СтрокиНабораПомещенияДоЗаписи 					= Неопределено;
	СтрокиНаборНачисленныйСреднийДоЗаписи 			= Неопределено;
	Ошибки 											= "";
	
	Пока УправлящаяВыборка.следующий() цикл
		Если ТипЗнч(Документ) = Тип("Структура") И  Документ.Свойство("ОбъемНачислений") Тогда
			НаборНачисленныйСредний 				= Неопределено;
			НаборВыполненные 						= Неопределено;
			Набор 									= Документ.ОбъемНачислений;
		ИначеЕсли Документ = Неопределено тогда
			Если Не ТекДоговор = УправлящаяВыборка.Договор тогда 				
				Если Не ТекДоговор = Неопределено Тогда					
					Попытка
						Если ДокументОбъект<>Неопределено тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",						Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
							ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);										
						КонецЕсли;
						
						Набор.ДополнительныеСвойства.Вставить("Организация",				Организация);
						Набор.ДополнительныеСвойства.Вставить("Район",						Район);
						Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",			ПериодНачисления);
						Набор.ДополнительныеСвойства.Вставить("Договор",					ТекДоговор);
						Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",			КонецПериодаРасчета-1);
						Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний",	НаборНачисленныйСредний);
						
						НаборПомещения.ДополнительныеСвойства.Вставить("Организация",		Организация);
						НаборПомещения.ДополнительныеСвойства.Вставить("Район",				Район);
						НаборПомещения.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
						НаборПомещения.ДополнительныеСвойства.Вставить("Договор",			ТекДоговор);
						НаборПомещения.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);						
						Если Набор.Количество() = 0 Тогда
							НаборПомещения.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
						КонецЕсли;					
					
						Набор.Записать(Ложь);
						НаборПомещения.Записать(Ложь);
						
						Если НЕ НаборВыполненные = Неопределено Тогда
							НаборВыполненные.Записать(НаборВыполненные.ДополнительныеСвойства.Замещать);
						КонецЕсли;
						
						ЗафиксироватьТранзакцию();
					Исключение
						ОтменитьТранзакцию();      		
						ИнформацияОбОшибке  					= ИнформацияОбОшибке();
						Ошибки 									= Ошибки +
						Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
					КонецПопытки;
				КонецЕсли;
				НачатьТранзакцию();
				ДокументСсылка 									= УправлящаяВыборка.ДокументПерерасчета;
				ПометкаУдаления 								= УправлящаяВыборка.ДокументПерерасчетаПометкаУдаления;
				ДокументОбъект  								= Неопределено;
				
				ДоговорДляЗаписи = УправлящаяВыборка.Договор;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка)  Тогда
					ДокументСсылка 								= Документы.бестПерерасчетНП.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  							= Документы.бестПерерасчетНП.СоздатьДокумент();
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
					ДокументОбъект.район  						= Район;
					ДокументОбъект.Договор						= ДоговорДляЗаписи;
					ДокументОбъект.Дата							= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 					= Организация;
					ДокументОбъект.ВидОперации 					= Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет;
					ДокументОбъект.ПериодНачисления 			= ПериодНачисления;
					ДокументОбъект.ПричинаПерерасчета 			= Справочники.бестПричиныПерерасчета.ПерерасчетСредних;
					
					//НаборЗаписей 								= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
					//НаборЗаписей.Отбор.Организация.Установить(УправлящаяВыборка.Организация);
					//НаборЗаписей.Отбор.Район.Установить(УправлящаяВыборка.Район);
					//НаборЗаписей.Отбор.ПериодНачисления.Установить(ПериодНачисления);
					//НаборЗаписей.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);

					//НаборЗаписей.Отбор.Договор.Установить(ДоговорДляЗаписи);
					//НаборЗаписей.Записать(); 
					
					
					//НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
					//НаборВыполненныеДопСвойства 				= НаборВыполненные.ДополнительныеСвойства;
					//НаборВыполненныеДопСвойства.Вставить("Замещать", ЛОЖЬ);
					//ЗаписьВыполненные							= НаборВыполненные.Добавить();
					//ЗаписьВыполненные.Организация 				= УправлящаяВыборка.Организация;
					//ЗаписьВыполненные.Район		 				= УправлящаяВыборка.Район;
					//ЗаписьВыполненные.ПериодНачисления 			= ПериодНачисления;
					//ЗаписьВыполненные.ВидОперацийНачисления		= Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних;
					//ЗаписьВыполненные.Договор 						= ДоговорДляЗаписи;
					//ЗаписьВыполненные.ДокументНачисления 		= ДокументСсылка;
					
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект  							= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 				= Ложь;
					
					//НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
					//
					//НаборВыполненные.Отбор.Организация.Установить(УправлящаяВыборка.Организация);
					//НаборВыполненные.Отбор.ПериодНачисления.Установить(ПериодНачисления);
					//НаборВыполненные.Отбор.Район.Установить(УправлящаяВыборка.Район);
					//НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
					//НаборВыполненные.Отбор.Договор.Установить(ДоговорДляЗаписи);
					//НаборВыполненныеДопСвойства 						= НаборВыполненные.ДополнительныеСвойства;
					//НаборВыполненныеДопСвойства.Вставить("Замещать", Истина);
					//
					//ЗаписьВыполненные							= НаборВыполненные.Добавить();
					//ЗаписьВыполненные.Организация 				= УправлящаяВыборка.Организация;
					//ЗаписьВыполненные.Район		 				= УправлящаяВыборка.Район;
					//ЗаписьВыполненные.ПериодНачисления 			= ПериодНачисления;
					//ЗаписьВыполненные.ВидОперацийНачисления 	= Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних;
					//ЗаписьВыполненные.Договор 						= ДоговорДляЗаписи;
					//ЗаписьВыполненные.ДокументНачисления 		= ДокументСсылка;
					//ЗаписьВыполненные.ПометкаУдаления	 		= Ложь;
					
				Иначе
	  //  			НаборЗаписей = РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
	  //

	  // 				НаборЗаписей.Отбор.Организация.Установить(УправлящаяВыборка.Организация);
	  //              НаборЗаписей.Отбор.Район.Установить(УправлящаяВыборка.Район);
	  //  			НаборЗаписей.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	  //  			НаборЗаписей.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);

	  //  			НаборЗаписей.Отбор.Договор.Установить(ДоговорДляЗаписи);
	  // 				НаборЗаписей.Записать();
	  //  			
	  //  			НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
	  //  			НаборВыполненныеДопСвойства 				= НаборВыполненные.ДополнительныеСвойства;
	  //  			НаборВыполненныеДопСвойства.Вставить("Замещать", ЛОЖЬ);
	  //  			ЗаписьВыполненные							= НаборВыполненные.Добавить();
	  //  			ЗаписьВыполненные.Организация 				= УправлящаяВыборка.Организация;
	  //  			ЗаписьВыполненные.Район		 				= УправлящаяВыборка.Район;
	  //  			ЗаписьВыполненные.ПериодНачисления 			= ПериодНачисления;
	  //  			ЗаписьВыполненные.ВидОперацийНачисления		= Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних;
	  //  			ЗаписьВыполненные.Договор 						= ДоговорДляЗаписи;
	  //  			ЗаписьВыполненные.ДокументНачисления 		= ДокументСсылка;
				КонецЕсли;
				 							 
				НаборНачисленныйСредний 								= РегистрыНакопления.бестНачисленныйСреднийОбъемНП.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументСсылка);
				
				//Если Не Помещение = Неопределено Тогда					
					//НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
					Если ДокументОбъект = Неопределено Тогда
						НаборНачисленныйСредний.Прочитать();
						СтрокиНаборНачисленныйСреднийДоЗаписи 	= НаборНачисленныйСредний.Выгрузить();
						//СтрокиУдалить 							= СтрокиНаборНачисленныйСреднийДоЗаписи.НайтиСтроки(Новый Структура("Помещение", Помещение));
						Для Каждого СтрокаУдалить ИЗ СтрокиНаборНачисленныйСреднийДоЗаписи Цикл
							СтрокиНаборНачисленныйСреднийДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						НаборНачисленныйСредний.Очистить();
					КонецЕсли;					
				//КонецЕсли;
								
				Если ДокументОбъект = Неопределено Тогда
					НаборНачисленныйСредний.Записать();
				КонецЕсли;
								
				Набор											= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);				
								
				//Если Не Помещение = Неопределено Тогда					
				//	Набор.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
				//	Если ДокументОбъект = Неопределено Тогда
						Набор.Прочитать();
						СтрокиНабораДоЗаписи 					= Набор.Выгрузить();
						//СтрокиУдалить 							= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Помещение", Помещение));
						Для Каждого СтрокаУдалить ИЗ СтрокиНабораДоЗаписи Цикл
							СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						Набор.Очистить();
				//	КонецЕсли;					
				//КонецЕсли;
								
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
				КонецЕсли;
								
			КонецЕсли;
		иначе
			Если ДокументОбъект = Неопределено Тогда
				НачатьТранзакцию();
				ДокументСсылка									= Документ.Ссылка;
				ДокументОбъект 									= ДокументСсылка.ПолучитьОбъект();
				
				НаборНачисленныйСредний 						= РегистрыНакопления.бестНачисленныйСреднийОбъемНП.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборНачисленныйСредний.Очистить();
				
				Набор											= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				Набор.Очистить();
				 				
			КонецЕсли;
		КонецЕсли;	
		
		ОсталосьСписатьОбъем 									= УправлящаяВыборка.ОбъемНадоСписать;
		ОсталосьСписатьОбъемПотребленный						= УправлящаяВыборка.ОбъемПотребленныйНадоСписать;
		
		Пока УправлящаяВыборка.Район = Выборка.Район
			И УправлящаяВыборка.Договор = Выборка.Договор
			И УправлящаяВыборка.ТочкаУчета = Выборка.ТочкаУчета
			И УправлящаяВыборка.Услуга = Выборка.Услуга
			И УправлящаяВыборка.ОбъектРасчета = Выборка.ОбъектРасчета
			И УправлящаяВыборка.ПриборУчета = Выборка.ПриборУчета
			И УправлящаяВыборка.Шкала = Выборка.Шкала
			И УправлящаяВыборка.ТарифнаяЗона = Выборка.ТарифнаяЗона
			И УправлящаяВыборка.Поставщик = Выборка.Поставщик
			И ЕстьСледующийВыборка Цикл
			
			Если НЕ Выборка.ОбъемНадоСписать = 0 ИЛИ НЕ Выборка.ОбъемПотребленныйНадоСписать = 0 Тогда
				ЗначениеТарифа 									= Выборка.ЗначениеТарифа;			
				СтрокаНабора 									= НаборНачисленныйСредний.добавитьРасход();
				ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
				СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП - 1;
				СтрокаНабора.Организация 						= Организация;
				СтрокаНабора.МКД								= МКД;
			КонецЕсли;
		
			СписываемОбъем 									= Мин(ОсталосьСписатьОбъем, Выборка.ОбъемУслуги);
			СписываемОбъемПотребленный						= Мин(ОсталосьСписатьОбъемПотребленный, Выборка.ОбъемУслугиПотребленный);
			Если НЕ СписываемОбъем = 0 ИЛИ НЕ СписываемОбъемПотребленный = 0 Тогда
					
				СтрокаНабора 							= Набор.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
				СтрокаНабора.Организация 					= Организация;
				СтрокаНабора.ВидНачисления 					= ВидНачисленияПерерасчет;
				СтрокаНабора.ОбъемУслуги 					= -СписываемОбъем;
				СтрокаНабора.ОбъемУслугиПотребленный 		= -СписываемОбъемПотребленный;
				СтрокаНабора.ПериодРасчета					= ПериодНачисления;
				СтрокаНабора.ПериодНачисления				= Выборка.ПериодНачисления;
				СтрокаНабора.МКД							= МКД;
								
				СтрокаНабора.Сумма		 					= Выборка.ЗначениеТарифа*СтрокаНабора.ОбъемУслуги;				
				
				ОсталосьСписатьОбъем 						= ОсталосьСписатьОбъем - СписываемОбъем;
				ОсталосьСписатьОбъемПотребленный 			= ОсталосьСписатьОбъемПотребленный - СписываемОбъемПотребленный;	
			КонецЕсли;			
			
			ЕстьСледующийВыборка  							= Выборка.Следующий();
		КонецЦикла; 		
				
		ТекДоговор											= УправлящаяВыборка.Договор;
		Сч 													= Сч + 1;
	КонецЦикла;	
		 
	Если Не ТекДоговор = Неопределено И ТипЗнч(Документ) <> Тип("Структура") Тогда					
		Попытка
			Если ДокументОбъект<>Неопределено тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",						Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
				ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);										
			КонецЕсли;
			
			Если Набор.Количество() > 0 Тогда
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.ДополнительныеСвойства.Вставить("Договор",			ТекДоговор);
				Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);
				//Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
				НаборНачисленныйСредний.Записать(Ложь);
								
				Если НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
					//Набор.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
					Для Каждого СтрокаДобавить Из СтрокиНаборНачисленныйСреднийДоЗаписи Цикл
						ЗаполнитьЗначенияСвойств(НаборНачисленныйСредний.Добавить(), СтрокаДобавить);
					КонецЦикла;
					
					Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
						ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
					КонецЦикла;	
									
				КонецЕсли; 				
							
				Набор.Записать(Ложь);				
			КонецЕсли;			
			
			Если НЕ НаборВыполненные = Неопределено Тогда
				НаборВыполненные.Записать(НаборВыполненные.ДополнительныеСвойства.Замещать);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке  					= ИнформацияОбОшибке();
			Ошибки 									= Ошибки +
			Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;  
	 	
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьЗакрытьПериода(Организация, ПериодНачисления,Район,МКД) Экспорт 
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 	="ВЫБРАТЬ
	|	энргНачисление.Ссылка
	|ИЗ
	|	Документ.энргНачисление КАК энргНачисление
	|ГДЕ
	|	энргНачисление.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачисление.МКД = &МКД
	|	И энргНачисление.Район = &Район
	|	И энргНачисление.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеМКД.Ссылка
	|ИЗ
	|	Документ.энргНачислениеМКД КАК энргНачислениеМКД
	|ГДЕ
	|	энргНачислениеМКД.Район = &Район
	|	И энргНачислениеМКД.Проведен
	|	И энргНачислениеМКД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Проведен
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПерерасчет.МКД = &МКД
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаПоказаний)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	энргЗакрытиеПериода.Проведен
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	
	Если МКД = Неопределено тогда
		Текст 			= СтрЗаменить(Текст,"И энргНачисление.МКД = &МКД","");
		Текст			= СтрЗаменить(Текст,"И энргПерерасчет.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 		= Текст;
	Результат  			= Запрос.Выполнить();
	Выборка 			= Результат.Выбрать();
	Пока Выборка.Следующий() цикл  		
		ДокОбъект  		= Выборка.ссылка.получитьОбъект();
		ДокОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",истина);
		ДокОбъект.УстановитьПометкуУдаления(Истина);		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗакрытьПериодДляРедактирования(ПериодНачисления,Район,МКД) Экспорт  
	
	Если МКД <> Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ДокуметЗакрытия 				= ДокуметЗакрытияПериода(ПериодНачисления,Район);
	
	Если не ЗначениеЗаполнено(ДокуметЗакрытия) тогда
		ДокументОбъект 				= Документы.энргЗакрытиеПериода.СоздатьДокумент();		
	иначе
		ДокументОбъект 				= ДокуметЗакрытия.ПолучитьОбъект();  
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",Истина);
	ДокументОбъект.Район 			= Район;
	ДокументОбъект.ПериодНачисления = ПериодНачисления;
	ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);	
	
КонецПроцедуры

Процедура СозданиеРеализации(Организация,ПериодНачисления,Район,МКД,Отдельностоящие,Договор,Документ) Экспорт 
	  Обработки.бестФормированиеРеализацийУслуг.СформироватьРеализацииЮЛ(Организация,ПериодНачисления,Район,МКД,,,Отдельностоящие);
	  Обработки.бестЗагрузкаРеестровОРЭМ.СформироватьРеализацииОРЭМ(Организация,ПериодНачисления,Район,МКД,,,Отдельностоящие);
КонецПроцедуры

Процедура НачисленияПоСхемамСтруктурыСети(Организация,ПериодНачисления,Район,МКД,Отдельностоящие, Договор,Документ) Экспорт
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	СпособНачисленияПоПриборам						= Перечисления.энргСпособНачислений.ПоПриборам;
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	РезультатЗапроса 								= ПолучитьРезультатЗапросаСхемыСтруктурыСети(ПериодНачисления,Организация,Район,Отдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета);
	
	
	ВыборкаДетальныеЗаписи 							= РезультатЗапроса.Выбрать();
	
	ТекСтруктура 									= Неопределено;
	ТекУслуга                                       = Неопределено;
	ТекДоговор 										= Неопределено;
	НаборЗаписей 									= Неопределено;
	ДокументОбъект 									= Неопределено;
	СтрокаНабора 									= Неопределено;
	ТекСтавкаНДС 									= Неопределено;
	ТекНДСВнутри 									= Неопределено;
	ТекЗначениеТарифа 								= Неопределено;
	
	ОбъемыРассчитанныхСтруктур 						= Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если (ТекСтруктура <> ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент ИЛИ ТекУслуга <> ВыборкаДетальныеЗаписи.Услуга) и СтрокаНабора <> Неопределено Тогда
			СтрокаНабора.ОбъемУслуги = ОбъемыРассчитанныхСтруктур[ТекСтруктура][ТекУслуга];
			Если ЗначениеЗаполнено(ТекЗначениеТарифа) и ЗначениеЗаполнено(ТекСтавкаНДС) Тогда
				Если ТекНДСВнутри Тогда 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа - СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
				Иначе 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа;
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / 100
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТекДоговор = ВыборкаДетальныеЗаписи.Договор Тогда
			
			Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
				
				НачатьТранзакцию();
				
				НаборОтложенныхДвижений	= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
				НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
				НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
				НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
				НаборОтложенныхДвижений.Отбор.Договор.Установить(ТекДоговор);
				
				НаборОтложенныхДвижений.Записать();					
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
				НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
				НаборЗаписей.ДополнительныеСвойства.Вставить("Договор",    			ТекДоговор);
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
				НаборЗаписей.Записать();
				
				Если Не ДокументОбъект = Неопределено Тогда
					ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
					ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
				КонецЕсли; 					
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
			ДокументСсылка 							= ВыборкаДетальныеЗаписи.ДокументНачисления;			
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
				ДокументСсылка 						= Документы.бестНачислениеПоСхемамСтруктурыСети.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект 						= Документы.бестНачислениеПоСхемамСтруктурыСети.СоздатьДокумент();
				ДокументОбъект.Район 				= Район;
				ДокументОбъект.Договор 				= ВыборкаДетальныеЗаписи.Договор;
				ДокументОбъект.Дата 				= ГраницыПериода.ЗавершениеОП-1;
				ДокументОбъект.Организация			= Организация;
				ДокументОбъект.ПериодНачисления     = ПериодНачисления;
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
				
			Иначе
				ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления 		= Ложь;
				
				НаборЗаписей 						= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборЗаписей.Записать(); // очищаем набор записей				
			КонецЕсли;
			
			НаборЗаписей 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			
		КонецЕсли;
		
		
		Если  ТекСтруктура <> ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент Тогда
			
			
			ОбъемУжеРассчитанныхЭлементов 	= ОбъемыРассчитанныхСтруктур.Получить(ВыборкаДетальныеЗаписи.СтруктураСетиУчаствующаяВСхеме);
			Если ОбъемУжеРассчитанныхЭлементов <> Неопределено Тогда
				ОбъемУжеРассчитанныхЭлементовУслуга = ОбъемУжеРассчитанныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Услуга);
				Если ОбъемУжеРассчитанныхЭлементовУслуга <> Неопределено Тогда
					Объем  						= ?(ВыборкаДетальныеЗаписи.ВычитатьЭлемент, -ОбъемУжеРассчитанныхЭлементовУслуга, ОбъемУжеРассчитанныхЭлементовУслуга);
				Иначе
					Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
				КонецЕсли;
			Иначе
				Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
			КонецЕсли;
			ОбъемыРассчитанныхСтруктурУслуга = Новый Соответствие;
			ОбъемыРассчитанныхСтруктурУслуга.Вставить(ВыборкаДетальныеЗаписи.Услуга, Объем);
			ОбъемыРассчитанныхСтруктур.Вставить(ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент, ОбъемыРассчитанныхСтруктурУслуга);
			СтрокаНабора 		= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
			СтрокаНабора.Период = КонецПериодаРасчета-1;

		ИначеЕсли ТекУслуга <> ВыборкаДетальныеЗаписи.Услуга Тогда

			ОбъемУжеРассчитанныхЭлементов 	= ОбъемыРассчитанныхСтруктур.Получить(ВыборкаДетальныеЗаписи.СтруктураСетиУчаствующаяВСхеме);
			Если ОбъемУжеРассчитанныхЭлементов <> Неопределено Тогда
				ОбъемУжеРассчитанныхЭлементовУслуга = ОбъемУжеРассчитанныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Услуга);
				Если ОбъемУжеРассчитанныхЭлементовУслуга <> Неопределено Тогда
					Объем  						= ?(ВыборкаДетальныеЗаписи.ВычитатьЭлемент, -ОбъемУжеРассчитанныхЭлементовУслуга, ОбъемУжеРассчитанныхЭлементовУслуга);
				Иначе
					Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
				КонецЕсли;
			Иначе
				Объем = ВыборкаДетальныеЗаписи.ОбъемУслуги;
			КонецЕсли;
			ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент].Вставить(ВыборкаДетальныеЗаписи.Услуга, Объем);
			СтрокаНабора 		= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
			СтрокаНабора.Период = КонецПериодаРасчета-1;
			
		Иначе
			
			ОбъемУжеРассчитанныхЭлементов = ОбъемыРассчитанныхСтруктур.Получить(ВыборкаДетальныеЗаписи.СтруктураСетиУчаствующаяВСхеме);
			Если ОбъемУжеРассчитанныхЭлементов <> Неопределено Тогда
				ОбъемУжеРассчитанныхЭлементовУслуга = ОбъемУжеРассчитанныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Услуга);
				Если ОбъемУжеРассчитанныхЭлементовУслуга <> Неопределено Тогда
					ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга]  = ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга] + ?(ВыборкаДетальныеЗаписи.ВычитатьЭлемент, -ОбъемУжеРассчитанныхЭлементовУслуга, ОбъемУжеРассчитанныхЭлементовУслуга);
				Иначе
					ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга]  = ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга] + ВыборкаДетальныеЗаписи.ОбъемУслуги;
				КонецЕсли;	
			Иначе
				ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга]  = ОбъемыРассчитанныхСтруктур[ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент][ВыборкаДетальныеЗаписи.Услуга] + ВыборкаДетальныеЗаписи.ОбъемУслуги;
			КонецЕсли;
		КонецЕсли;
		
		ТекДоговор 			= ВыборкаДетальныеЗаписи.Договор;
		ТекСтруктура 		= ВыборкаДетальныеЗаписи.РассчитываемыйЭлемент;
		ТекУслуга			= ВыборкаДетальныеЗаписи.Услуга;
		ТекСтавкаНДС 		= ВыборкаДетальныеЗаписи.СтавкаНДС;
		ТекНДСВнутри 		= ВыборкаДетальныеЗаписи.НДСВнутри;
		ТекЗначениеТарифа   = ВыборкаДетальныеЗаписи.ЗначениеТарифа;
	КонецЦикла;
	
	Если Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0 Тогда
		Если СтрокаНабора <> Неопределено Тогда
			СтрокаНабора.ОбъемУслуги = ОбъемыРассчитанныхСтруктур[ТекСтруктура][ТекУслуга];
			Если ЗначениеЗаполнено(ТекЗначениеТарифа) и ЗначениеЗаполнено(ТекСтавкаНДС) Тогда
				Если ТекНДСВнутри Тогда 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа - СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / (100 + ТекСтавкаНДС);
				Иначе 
					СтрокаНабора.Сумма 		= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа;
					СтрокаНабора.СуммаНДС 	= СтрокаНабора.ОбъемУслуги * ТекЗначениеТарифа * ТекСтавкаНДС / 100
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НачатьТранзакцию();
		
		НаборОтложенныхДвижений	= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
		НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
		НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
		НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
		НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам);
		НаборОтложенныхДвижений.Отбор.Договор.Установить(ТекДоговор);
		
		НаборОтложенныхДвижений.Записать();					
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
		НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
		НаборЗаписей.ДополнительныеСвойства.Вставить("Договор",    			ТекДоговор);
		НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
		НаборЗаписей.Записать();
		
		Если Не ДокументОбъект = Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
			ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 					
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбщиеПроцедурыИФункции

Процедура ВспомогательныеДанныеНачисленияНП(МВТ,Организация,ПериодНачисления,Район,Отдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	
	
	Если Отдельностоящие тогда
		Запрос.УстановитьПараметр("Строение",	Справочники.энргСтроения.ПустаяСсылка());
		Запрос.УстановитьПараметр("МКД", 		Справочники.энргСтроения.ПустаяСсылка());
		Если ЗначениеЗаполнено(Договор) Тогда
			Запрос.УстановитьПараметр("Договор", Договор);
		КонецЕсли;
	Иначе
		Если Не МКД = Неопределено Тогда 
			Запрос.УстановитьПараметр("МКД",			МКД);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Договор) Тогда
			Запрос.УстановитьПараметр("Договор", 	Договор);
		КонецЕсли;
		
	КонецЕсли; 	

	
	Запрос.УстановитьПараметр("НачалоВеденияУчета",		Константы.энргДатаНачалаВеденияУчета.Получить());	 // Дата
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаМинусСекунда",	НачалоПериодаРасчета - 1);	 // Дата
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 // Дата
	Запрос.УстановитьПараметр("Организация",			Организация);	 // Дата
	Запрос.УстановитьПараметр("Район",					Район);	 // Районы
	Запрос.УстановитьПараметр("ДнейВПериоде",			ДнейВПериоде );
	Запрос.УстановитьПараметр("ПериодНовогоТарифа",		ПериодНовогоТарифа); // Число;
	Запрос.УстановитьПараметр("НачалоПредПериодаРасчета",ДобавитьМесяц(НачалоПериодаРасчета, -1));	 // Дата
	Запрос.УстановитьПараметр("ПроектнаяТемператураПоУмолчанию", Константы.бестПроектнаяТемператураНаружногоВоздухаПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("ТемператураВнутриПомещенияПоУмолчанию", Константы.бестТемператураВнутриПомещенияПоУмолчанию.Получить());
	
	Запрос.Текст 	= ТекстЗапросаВспомогательныеДанныеНачисления(Отдельностоящие, МКД, Договор);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьСтабильныеПериодыНП(МВТ,Организация,ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета)  
	
	Текст 							= ТекстПолучитьСтабильныеПериоды(Договор);
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 // Дата
	Запрос.УстановитьПараметр("Организация",			Организация);	 // Дата
	Запрос.УстановитьПараметр("Район",					Район);	 // Районы
	Запрос.УстановитьПараметр("НачалоВеденияУчета", Константы.энргДатаНачалаВеденияУчета.Получить());
	Запрос.УстановитьПараметр("ТемператураВнутриПомещенияПоУмолчанию", Константы.бестТемператураВнутриПомещенияПоУмолчанию.Получить());
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Запрос.УстановитьПараметр("Договор", 	Договор);
	КонецЕсли;

	Запрос.МенеджерВременныхТаблиц	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчетаНП(МВТ,РасчетПоФормуле,ЭтоПерерасчет,КонецПериодаРасчета)
	
	Текст 							= ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле);
	Запрос  						= Новый Запрос(Текст); 	
	Запрос.УстановитьПараметр("ПроектнаяТемператураПоУмолчанию", Константы.бестПроектнаяТемператураНаружногоВоздухаПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецПериодаРасчета);
	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,РасчетПоФормуле); 
	
	Текст  							= ТекстРассчитатьИндивидуальныйОбъемПотребленияНП();
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("РасчетПоФормуле",РасчетПоФормуле);
	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область ТекстЗапросов

Функция ТекстЗапросаВспомогательныеДанныеНачисления(Отдельностоящие, МКД, Договор)
	Если (Отдельностоящие = Ложь И МКД = Неопределено) И Договор = Неопределено  тогда
		Текст = "";
	Иначе
		Текст = бестНачисленияНП.ПолучитьОтборПоМКД(Новый Структура("Отдельностоящие,МКД,Договор", Отдельностоящие,МКД,Договор),,Истина);  
		ОтборДоговора 												= " И Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)";
		ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП 			= " И бестНомераСтрокСтабильногоПериодаНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)"  + Символы.ПС;
		ОтборДоговора_бестСтабильныеПериодыНП 						= " И бестСтабильныеПериодыНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестПредоставленныеПоказанияНП 				= " И бестПредоставленныеПоказанияНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестОбъемНачисленийНП 						= " И бестОбъемНачисленийНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестМаксимальныеПоказанияСрезНП 				= " И бестМаксимальныеПоказанияСрезНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестВыводПриборовУчетаНП 						= " И бестВыводПриборовУчетаНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестСреднийОбъемПотребленияНП 				= " И бестСреднийОбъемПотребленияНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестСтабильныеПериодыШкалыНП 					= " И бестСтабильныеПериодыШкалыНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестСтабильныеПериодыПриборыУзловУчета 		= " И бестСтабильныеПериодыПриборыУзловУчета.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		ОтборДоговора_бестИндивидуальныеНастройкиСезонностиУслуг 	= " И бестИндивидуальныеНастройкиСезонностиУслуг.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;
		
		ОтборМКД 													= " И МКД В (ВЫБРАТЬ ОтборМКД.МКД КАК МКД ИЗ ОтборМКД КАК ОтборМКД)";
		ОтборМКД_энргСтабильныеПериодыМКД 							= " И энргСтабильныеПериодыМКД.МКД В (ВЫБРАТЬ ОтборМКД.МКД КАК МКД ИЗ ОтборМКД КАК ОтборМКД)"  + Символы.ПС;
		ОтборМКД_энргСтабильныеПериоды                      		= " И энргСтабильныеПериоды.Строение В (ВЫБРАТЬ ОтборМКД.МКД КАК МКД ИЗ ОтборМКД КАК ОтборМКД)"  + Символы.ПС;
		ОтборМКД_бестСтабильныеПериодыНП 							= " И бестСтабильныеПериодыНП.МКД В (ВЫБРАТЬ ОтборМКД.МКД КАК МКД ИЗ ОтборМКД КАК ОтборМКД)"  + Символы.ПС;
		
	КонецЕсли;
	Текст = Текст + 
	"ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Организация КАК Организация,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Район КАК Район,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Коэффициент КАК Коэффициент,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ЗначенияПовышающихКоэффициентов
	|ИЗ
	|	РегистрСведений.энгрЗначенияПовышающихКоэффициентов.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энгрЗначенияПовышающихКоэффициентовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ТипНачисления КАК ТН_Норматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления В (ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления), ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.НежилыеПомещения))) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНормаСкоростиДвиженияВодыСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргНормаСкоростиДвиженияВодыСрезПоследних.СкоростьДвижения КАК СкоростьДвижения
	|ПОМЕСТИТЬ НормаСкоростиДвиженияВоды
	|ИЗ
	|	РегистрСведений.энргНормаСкоростиДвиженияВоды.СрезПоследних(&КонецПериодаРасчета, Организация = &Организация) КАК энргНормаСкоростиДвиженияВодыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	НастройкаСезонностиУслуг.МКД КАК Строение,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район " + ОтборМКД + ?(ЗначениеЗаполнено(ОтборМКД), " ИЛИ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)", "")+ "
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	|	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	|	бестГарантированныеОбъемыСрезПоследних.Договор КАК Договор,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги
	|ПОМЕСТИТЬ ГарантированныеОбъемы
	|ИЗ
	|	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район" + ОтборДоговора + "
	|				И МЕСЯЦ(Месяц) = МЕСЯЦ(&ПериодНачисления)) КАК бестГарантированныеОбъемыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(&КонецПериодаРасчета, НеНачислять " + ОтборМКД + ") КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТемператураИсточникаСрезПоследних.Организация КАК Организация,
	|	бестТемператураИсточникаСрезПоследних.Район КАК Район,
	|	бестТемператураИсточникаСрезПоследних.Источник КАК Источник,
	|	бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника
	|ПОМЕСТИТЬ ТемпературыИсточника
	|ИЗ
	|	РегистрСведений.бестТемператураИсточника.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестТемператураИсточникаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНастройкиОбратногоРасчетаПоГВС.Организация КАК Организация,
	|	бестНастройкиОбратногоРасчетаПоГВС.Район КАК Район,
	|	бестНастройкиОбратногоРасчетаПоГВС.Услуга КАК Услуга,
	|	бестНастройкиОбратногоРасчетаПоГВС.ОбратныйРасчет КАК ОбратныйРасчет,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги
	|ПОМЕСТИТЬ НастройкиГВС
	|ИЗ
	|	РегистрСведений.бестНастройкиОбратногоРасчетаПоГВС КАК бестНастройкиОбратногоРасчетаПоГВС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестНастройкиОбратногоРасчетаПоГВС.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестНастройкиОбратногоРасчетаПоГВС.Организация = &Организация
	|	И бестНастройкиОбратногоРасчетаПоГВС.Район = &Район
	|	И бестНастройкиОбратногоРасчетаПоГВС.ОбратныйРасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	энргВидыУслуг.СезонностьНастраивается КАК СезонностьНастраивается
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА &НачалоПериодаРасчета
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ &КонецПериодаРасчета
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета)
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|						&НачалоПериодаРасчета,
	|						Организация = &Организация
	|							И Район = &Район) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(
	|					&ПериодНачисления,
	|					Организация = &Организация
	|						И Район = &Район
	|						И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргСпособыРасчетаПоНаправлениямСрезПоследних
	|			ПО энргВидыУслуг.Ссылка = энргСпособыРасчетаПоНаправлениямСрезПоследних.Услуга
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (ВложенныйЗапрос.НачалоФактическогоПериода МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	|					ИЛИ ВложенныйЗапрос.КонецФактическогоПериода МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|					И ЕСТЬNULL(энргСпособыРасчетаПоНаправлениямСрезПоследних.НачислятьЗаПолныйМесяц, ЛОЖЬ)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|ПОМЕСТИТЬ ОтопительныйПериод
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргДлительностиПериодов.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА ДЕНЬ(НАЧАЛОПЕРИОДА(&НачалоПериодаРасчета, ГОД))
	|		КОНЕЦ КАК ДеньНачала,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА МЕСЯЦ(НАЧАЛОПЕРИОДА(&НачалоПериодаРасчета, ГОД))
	|		КОНЕЦ КАК МесяцНачала,
	|		ДЕНЬ(энргДлительностиПериодов.КонецПериода) КАК ДеньОкончания,
	|		МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|		ГОД(&КонецПериодаРасчета) КАК ГодНачало,
	|		ГОД(&КонецПериодаРасчета) КАК ГодОкончания
	|	ИЗ
	|		РегистрСведений.энргДлительностиПериодов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргДлительностиПериодов
	|	ГДЕ
	|		энргДлительностиПериодов.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтопительныйПериод)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргДлительностиПериодов.Сезонность,
	|		ДЕНЬ(энргДлительностиПериодов.НачалоПериода),
	|		МЕСЯЦ(энргДлительностиПериодов.НачалоПериода),
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА ДЕНЬ(КОНЕЦПЕРИОДА(&КонецПериодаРасчета, ГОД))
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|				ТОГДА МЕСЯЦ(КОНЕЦПЕРИОДА(&КонецПериодаРасчета, ГОД))
	|		КОНЕЦ,
	|		ГОД(&КонецПериодаРасчета),
	|		ГОД(&КонецПериодаРасчета)
	|	ИЗ
	|		РегистрСведений.энргДлительностиПериодов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргДлительностиПериодов
	|	ГДЕ
	|		энргДлительностиПериодов.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтопительныйПериод)) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифов.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа,
	|	энргЗначенияТарифов.Регистратор КАК Регистратор,
	|	ДОБАВИТЬКДАТЕ(энргЗначенияТарифов.Период, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|ПОМЕСТИТЬ ЗначенияТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргЗначенияТарифовСрезПоследних
	|		ПО энргЗначенияТарифов.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И энргЗначенияТарифов.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|			И (энргЗначенияТарифов.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.НомерПозиции КАК НомерПозиции,
	|	бестПредоставленныеПоказанияНП.Разделитель КАК Разделитель,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора КАК ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор КАК ДокРегистратор,
	|	бестПредоставленныеПоказанияНП.Показания КАК Показания,
	|	бестПредоставленныеПоказанияНП.ВСрок КАК ВСрок
	|ПОМЕСТИТЬ НаборПредоставленныхПоказаний
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ)
	|	И бестПредоставленныеПоказанияНП.Район = &Район" + ОтборДоговора_бестПредоставленныеПоказанияНП + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказаний.Организация КАК Организация,
	|	НаборПредоставленныхПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказаний.Договор КАК Договор,
	|	НаборПредоставленныхПоказаний.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказаний.Район КАК Район,
	|	НаборПредоставленныхПоказаний.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказаний.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборПредоставленныхПоказаний.НомерПозиции КАК НомерПозиции,
	|	НаборПредоставленныхПоказаний.Разделитель КАК Разделитель,
	|	НаборПредоставленныхПоказаний.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборПредоставленныхПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	НаборПредоставленныхПоказаний.Показания КАК Показания,
	|	НаборПредоставленныхПоказаний.ВСрок КАК ВСрок
	|ПОМЕСТИТЬ НаборПредоставленныхПоказанийПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказаний КАК НаборПредоставленныхПоказаний
	|ГДЕ
	|	НаборПредоставленныхПоказаний.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезНП.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезНП.Договор КАК Договор,
	|	бестМаксимальныеПоказанияСрезНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезНП.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезНП.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезНП.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезНП.Показания КАК Показания,
	|	&НачалоПериодаРасчета КАК Период,
	|	-1 КАК НомерПозиции,
	|	бестМаксимальныеПоказанияСрезНП.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	РегистрСведений.бестМаксимальныеПоказанияСрезНП КАК бестМаксимальныеПоказанияСрезНП
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезНП.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезНП.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|	И бестМаксимальныеПоказанияСрезНП.Район = &Район" + ОтборДоговора_бестМаксимальныеПоказанияСрезНП + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Показания,
	|	бестПредоставленныеПоказанияНП.ДатаРегистратора,
	|	бестПредоставленныеПоказанияНП.НомерПозиции,
	|	бестПредоставленныеПоказанияНП.ДокРегистратор
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район" + ОтборДоговора_бестПредоставленныеПоказанияНП + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестМаксимальныеПоказанияСрезНП.Район КАК Район,
	|	бестМаксимальныеПоказанияСрезНП.Договор КАК Договор,
	|	бестМаксимальныеПоказанияСрезНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезНП.МКД КАК МКД,
	|	бестМаксимальныеПоказанияСрезНП.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезНП.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрезНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрезНП.Показания КАК Показания,
	|	бестМаксимальныеПоказанияСрезНП.ДатаРегистратора КАК ДатаРегистратора,
	|	бестМаксимальныеПоказанияСрезНП.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	РегистрСведений.бестМаксимальныеПоказанияСрезНП КАК бестМаксимальныеПоказанияСрезНП
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезНП.Организация = &Организация
	|	И бестМаксимальныеПоказанияСрезНП.ПериодНачисления = &ПериодНачисления
	|	И бестМаксимальныеПоказанияСрезНП.Район = &Район" + ОтборДоговора_бестМаксимальныеПоказанияСрезНП + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.Договор КАК Договор,
	|	ПоказанияНачало.ОбъектРасчета КАК ОбъектРасчета,
	|	ПоказанияНачало.МКД КАК МКД,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА &КонецПериодаРасчета
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|			И ПоказанияНачало.Договор = ПоказанияКонец.Договор
	|			И ПоказанияНачало.ОбъектРасчета = ПоказанияКонец.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднийОбъемПотребленияНП.Организация КАК Организация,
	|	бестСреднийОбъемПотребленияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСреднийОбъемПотребленияНП.Район КАК Район,
	|	бестСреднийОбъемПотребленияНП.МКД КАК МКД,
	|	бестСреднийОбъемПотребленияНП.Услуга КАК Услуга,
	|	бестСреднийОбъемПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСреднийОбъемПотребленияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестСреднийОбъемПотребленияНП.Шкала КАК Шкала,
	|	бестСреднийОбъемПотребленияНП.Объем КАК СреднийОбъем,
	|	бестСреднийОбъемПотребленияНП.Договор КАК Договор,
	|	бестСреднийОбъемПотребленияНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ СреднееПотреблениеАбонентов
	|ИЗ
	|	РегистрСведений.бестСреднийОбъемПотребленияНП КАК бестСреднийОбъемПотребленияНП
	|ГДЕ
	|	бестСреднийОбъемПотребленияНП.Организация = &Организация
	|	И бестСреднийОбъемПотребленияНП.ПериодНачисления = &ПериодНачисления
	|	И бестСреднийОбъемПотребленияНП.Район = &Район" + ОтборДоговора_бестСреднийОбъемПотребленияНП + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериодыМКД.Организация КАК Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район КАК Район,
	|		энргСтабильныеПериодыМКД.МКД КАК МКД,
	|		энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргСтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|	ГДЕ
	|		энргСтабильныеПериодыМКД.Организация = &Организация
	|		И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|		И энргСтабильныеПериодыМКД.Район = &Район" + ОтборМКД_энргСтабильныеПериодыМКД + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериодыМКД.Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район,
	|		энргСтабильныеПериодыМКД.МКД,
	|		энргСтабильныеПериодыМКД.Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = энргСтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргСтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = энргСтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргСтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериодыМКД.НомерПозиции
	|			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКД.Район = &Район)" + ОтборМКД_энргСтабильныеПериодыМКД + "
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКД.Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район,
	|	энргСтабильныеПериодыМКД.МКД,
	|	энргСтабильныеПериодыМКД.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонента) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		бестСтабильныеПериодыНП.Организация КАК Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район КАК Район,
	|		ЛОЖЬ КАК ЧастныйСектор,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.МКД КАК Строение,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|		бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|		МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеПлощади) КАК ПлощадьАбонента,
	|		ВЫБОР
	|			КОГДА бестСтабильныеПериодыНП.Поставщик = бестСтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА бестСтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПлощадьСобственнаяПоставка,
	|		бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|		бестСтабильныеПериодыНП.Договор КАК Договор
	|	ИЗ
	|		(ВЫБРАТЬ
	|			бестСтабильныеПериодыНП.Организация КАК Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район КАК Район,
	|			ЛОЖЬ КАК ЧастныйСектор,
	|			бестСтабильныеПериодыНП.МКД КАК Строение,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|			бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(бестСтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|			бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор КАК Договор
	|		ИЗ
	|			РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|		ГДЕ
	|			бестСтабильныеПериодыНП.Организация = &Организация
	|			И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|			И бестСтабильныеПериодыНП.Район = &Район" + ОтборМКД_бестСтабильныеПериодыНП + "
	|			И бестСтабильныеПериодыНП.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бестСтабильныеПериодыНП.Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район,
	|			бестСтабильныеПериодыНП.Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета,
	|			бестСтабильныеПериодыНП.МКД,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение,
	|			бестСтабильныеПериодыНП.ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|			ПО ВложенныйЗапрос.Организация = бестСтабильныеПериодыНП.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = бестСтабильныеПериодыНП.ПериодНачисления
	|				И ВложенныйЗапрос.Район = бестСтабильныеПериодыНП.Район
	|				И ВложенныйЗапрос.Услуга = бестСтабильныеПериодыНП.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = бестСтабильныеПериодыНП.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = бестСтабильныеПериодыНП.НомерПозиции
	|				И (бестСтабильныеПериодыНП.Организация = &Организация)
	|				И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|				И (бестСтабильныеПериодыНП.Район = &Район)" + ОтборМКД_бестСтабильныеПериодыНП + "
	|				И ВложенныйЗапрос.Договор = бестСтабильныеПериодыНП.Договор
	|				И ВложенныйЗапрос.ОбъектРасчета = бестСтабильныеПериодыНП.ОбъектРасчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бестСтабильныеПериодыНП.Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район,
	|		бестСтабильныеПериодыНП.Услуга,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.МКД,
	|		ВЫБОР
	|			КОГДА бестСтабильныеПериодыНП.Поставщик = бестСтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА бестСтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		бестСтабильныеПериодыНП.ОбъектРасчета,
	|		бестСтабильныеПериодыНП.Договор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		энргСтабильныеПериоды.Услуга,
	|		МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади),
	|		ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.пустаяссылка),
	|		ЗНАЧЕНИЕ(Справочник.бестДоговорыконтрагентов.пустаяссылка)
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация КАК Организация,
	|			энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|			энргСтабильныеПериоды.Район КАК Район,
	|			энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение КАК Строение,
	|			энргСтабильныеПериоды.Помещение КАК Помещение,
	|			энргСтабильныеПериоды.Услуга КАК Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ГДЕ
	|			энргСтабильныеПериоды.Организация = &Организация
	|			И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|			И энргСтабильныеПериоды.Район = &Район" + ОтборМКД_энргСтабильныеПериоды + "
	|			И НЕ энргСтабильныеПериоды.ЧастныйСектор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.ПериодНачисления,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.ЧастныйСектор) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ПО ВложенныйЗапрос.Организация = энргСтабильныеПериоды.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|				И ВложенныйЗапрос.Район = энргСтабильныеПериоды.Район
	|				И ВложенныйЗапрос.Услуга = энргСтабильныеПериоды.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				И (энргСтабильныеПериоды.Организация = &Организация)
	|				И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|				И (энргСтабильныеПериоды.Район = &Район)" + ОтборМКД_энргСтабильныеПериоды + "
	|				И ВложенныйЗапрос.Строение = энргСтабильныеПериоды.Строение
	|				И ВложенныйЗапрос.Помещение = энргСтабильныеПериоды.Помещение
	|				И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|	ГДЕ
	|		энргСтабильныеПериоды.Помещение.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.Услуга,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьМОП) КАК ПлощадьМОП,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначенияПлощадейСтроений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначениеПлощадейМКД.Организация КАК Организация,
	|		ЗначениеПлощадейМКД.ПериодНачисления КАК ПериодНачисления,
	|		ЗначениеПлощадейМКД.Район КАК Район,
	|		ЗначениеПлощадейМКД.МКД КАК МКД,
	|		ЗначениеПлощадейМКД.Услуга КАК Услуга,
	|		ЗначениеПлощадейМКД.ПлощадьМОП КАК ПлощадьМОП,
	|		0 КАК ПлощадьАбонентов,
	|		0 КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеПлощадейМКД КАК ЗначениеПлощадейМКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗначениеИндивидуальныхПлощадей.Организация,
	|		ЗначениеИндивидуальныхПлощадей.ПериодНачисления,
	|		ЗначениеИндивидуальныхПлощадей.Район,
	|		ЗначениеИндивидуальныхПлощадей.Строение,
	|		ЗначениеИндивидуальныхПлощадей.Услуга,
	|		0,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьАбонентов,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеИндивидуальныхПлощадей КАК ЗначениеИндивидуальныхПлощадей) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтабильныеПериодыПриборыУзловУчета.Организация КАК Организация,
	|	бестСтабильныеПериодыПриборыУзловУчета.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыПриборыУзловУчета.Район КАК Район,
	|	бестСтабильныеПериодыПриборыУзловУчета.Договор КАК Договор,
	|	бестСтабильныеПериодыПриборыУзловУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.НомерПозиции КАК НомерПозиции,
	|	бестСтабильныеПериодыПриборыУзловУчета.УзелУчета КАК УзелУчета,
	|	бестСтабильныеПериодыПриборыУзловУчета.ПриборВведен КАК ПриборВведен,
	|	бестСтабильныеПериодыПриборыУзловУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	бестСтабильныеПериодыПриборыУзловУчета.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора
	|ПОМЕСТИТЬ СтабильныеПериодыПриборыУзловУчета
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыПриборыУзловУчета КАК бестСтабильныеПериодыПриборыУзловУчета
	|ГДЕ
	|	бестСтабильныеПериодыПриборыУзловУчета.Организация = &Организация
	|	И бестСтабильныеПериодыПриборыУзловУчета.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыПриборыУзловУчета.Район = &Район" + ОтборДоговора_бестСтабильныеПериодыПриборыУзловУчета + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтабильныеПериодыШкалыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыШкалыНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыШкалыНП.Район КАК Район,
	|	бестСтабильныеПериодыШкалыНП.Договор КАК Договор,
	|	бестСтабильныеПериодыШкалыНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтабильныеПериодыШкалыНП.МКД КАК МКД,
	|	бестСтабильныеПериодыШкалыНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСтабильныеПериодыШкалыНП.ПриборУчета КАК ПриборУчета,
	|	бестСтабильныеПериодыШкалыНП.Шкала КАК Шкала,
	|	бестСтабильныеПериодыШкалыНП.НомерПозиции КАК НомерПозиции,
	|	бестСтабильныеПериодыШкалыНП.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыШкалыНП КАК бестСтабильныеПериодыШкалыНП
	|ГДЕ
	|	бестСтабильныеПериодыШкалыНП.Организация = &Организация
	|	И бестСтабильныеПериодыШкалыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыШкалыНП.Район = &Район" + ОтборДоговора_бестСтабильныеПериодыШкалыНП + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район" + ОтборДоговора_бестПредоставленныеПоказанияНП + "
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета
	|;
	|ВЫБРАТЬ
	|	НаборПредоставленныхПоказанийПредПериод.Организация КАК Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления КАК ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Район КАК Район,
	|	НаборПредоставленныхПоказанийПредПериод.Договор КАК Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета КАК ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета.МКД КАК МКД,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета КАК ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала КАК Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(НаборПредоставленныхПоказанийПредПериод.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПредПериод
	|ИЗ
	|	НаборПредоставленныхПоказанийПредПериод КАК НаборПредоставленныхПоказанийПредПериод
	|	
	|СГРУППИРОВАТЬ ПО
	|	НаборПредоставленныхПоказанийПредПериод.Организация,
	|	НаборПредоставленныхПоказанийПредПериод.ПериодНачисления,
	|	НаборПредоставленныхПоказанийПредПериод.Район,
	|	НаборПредоставленныхПоказанийПредПериод.ПриборУчета,
	|	НаборПредоставленныхПоказанийПредПериод.ТарифнаяЗона,
	|	НаборПредоставленныхПоказанийПредПериод.Шкала,
	|	НаборПредоставленныхПоказанийПредПериод.Договор,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета,
	|	НаборПредоставленныхПоказанийПредПериод.ОбъектРасчета.МКД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестВыводПриборовУчетаНП.Организация КАК Организация,
	|	бестВыводПриборовУчетаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестВыводПриборовУчетаНП.Район КАК Район,
	|	бестВыводПриборовУчетаНП.Договор КАК Договор,
	|	бестВыводПриборовУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестВыводПриборовУчетаНП.МКД КАК МКД,
	|	бестВыводПриборовУчетаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестВыводПриборовУчетаНП.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	РегистрСведений.бестВыводПриборовУчетаНП КАК бестВыводПриборовУчетаНП
	|ГДЕ
	|	бестВыводПриборовУчетаНП.Организация = &Организация
	|	И бестВыводПриборовУчетаНП.ПериодНачисления = &ПериодНачисления
	|	И бестВыводПриборовУчетаНП.Район = &Район" + ОтборДоговора_бестВыводПриборовУчетаНП + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПредоставленныеПоказанияНП.Организация КАК Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район КАК Район,
	|	бестПредоставленныеПоказанияНП.Договор КАК Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.МКД КАК МКД,
	|	бестПредоставленныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестПредоставленныеПоказанияНП.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоДоговору
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	|ГДЕ
	|	бестПредоставленныеПоказанияНП.Организация = &Организация
	|	И бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления
	|	И бестПредоставленныеПоказанияНП.Район = &Район" + ОтборДоговора_бестПредоставленныеПоказанияНП + "
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПредоставленныеПоказанияНП.Организация,
	|	бестПредоставленныеПоказанияНП.ПериодНачисления,
	|	бестПредоставленныеПоказанияНП.Район,
	|	бестПредоставленныеПоказанияНП.МКД,
	|	бестПредоставленныеПоказанияНП.Договор,
	|	бестПредоставленныеПоказанияНП.ОбъектРасчета,
	|	бестПредоставленныеПоказанияНП.ПриборУчета,
	|	бестПредоставленныеПоказанияНП.Шкала,
	|	бестПредоставленныеПоказанияНП.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация КАК Организация,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район КАК Район,
	|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература КАК ПроектнаяТемпература
	|ПОМЕСТИТЬ ТемператураНаружногоВоздуха
	|ИЗ
	|	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестИзмененияОкружающейСредыСрезПоследних.Организация КАК Организация,
	|	бестИзмененияОкружающейСредыСрезПоследних.Район КАК Район,
	|	бестИзмененияОкружающейСредыСрезПоследних.ПроектнаяТемператураХВС КАК ПроектнаяТемператураХВС,
	|	бестИзмененияОкружающейСредыСрезПоследних.ПроектнаяТемператураГВС КАК ПроектнаяТемператураГВС,
	|	бестИзмененияОкружающейСредыСрезПоследних.ТемператураХВСВОтопительныйПериод КАК ТемператураХВСВОтопительныйПериод,
	|	бестИзмененияОкружающейСредыСрезПоследних.ТемператураХВСВНеотопительныйПериод КАК ТемператураХВСВНеотопительныйПериод
	|ПОМЕСТИТЬ ТемпературыПоВоде
	|ИЗ
	|	РегистрСведений.бестИзмененияОкружающейСреды.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестИзмененияОкружающейСредыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация КАК Организация,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район КАК Район,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.РасчетныйМесяц = НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ)
	|				ТОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК СреднемесячнаяТемпература,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.РасчетныйМесяц = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -1), МЕСЯЦ)
	|				ТОГДА бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК СреднемесячнаяТемператураПред
	|ПОМЕСТИТЬ ФактическаяСреднемесячнаяТемпература
	|ИЗ
	|	РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НАЧАЛОПЕРИОДА(РасчетныйМесяц, МЕСЯЦ) В (НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ), НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -1), МЕСЯЦ))) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация,
	|	бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация КАК Организация,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.Район КАК Район,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения КАК КатегорияПомещения,
	|	бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная КАК ТемператураОптимальная
	|ПОМЕСТИТЬ ТемператураКатегорииПомещения
	|ИЗ
	|	РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Организация КАК Организация,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Район КАК Район,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Договор КАК Договор,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.УзелУчета КАК УзелУчета,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВидПараметра КАК ВидПараметра,
	|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ЗначениеПараметра КАК ЗначениеПараметра
	|ПОМЕСТИТЬ ТемпературыПодачиИзСуточнойВедомости
	|ИЗ
	|	РегистрСведений.бестИтоговыеЗначенияПараметровСуточнойВедомости.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район" + ОтборДоговора + " И ПериодНачисления = &ПериодНачисления) КАК бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестТипРегистрируемойТемпературыПриборовУчетаНП.СрезПоследних(
	|				&КонецПериодаРасчета,
	|				Организация = &Организация
	|					И Район = &Район" + ОтборДоговора + ") КАК бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних
	|		ПО бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Организация = бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних.Организация
	|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Район = бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних.Район
	|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Договор = бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних.Договор
	|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ОбъектРасчета = бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних.ОбъектРасчета
	|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПриборУчета = бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВидПараметра = бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних.ВидПараметра
	|ГДЕ
	|	бестТипРегистрируемойТемпературыПриборовУчетаНПСрезПоследних.ТипТемпературы = ЗНАЧЕНИЕ(Перечисление.бестТипыТемператур.ТемператураПодачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	энргВидыУслуг.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемМГВ) КАК ОбъемМГВОборот,
	|	СУММА(бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ) КАК КоличествоЧасовШтатнойРаботыПУОборот,
	|	СУММА(бестОбъемНачисленийНП.КоличествоЧасовРаботыТУ) КАК КоличествоЧасовРаботыТУОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемПоПрибору) КАК Объем_ПоПриборуПред
	|ПОМЕСТИТЬ РасходЗаПредПериод
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестОбъемНачисленийНП.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестОбъемНачисленийНП.Организация = &Организация
	|			И бестОбъемНачисленийНП.Район = &Район
	|			И бестОбъемНачисленийНП.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			И НЕ бестОбъемНачисленийНП.ДолевоеРаспределение
	|			И НЕ бестОбъемНачисленийНП.Распределение" + ОтборДоговора_бестОбъемНачисленийНП + "
	|	И бестОбъемНачисленийНП.Период МЕЖДУ &НачалоПредПериодаРасчета И &НачалоПериодаРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	бестОбъемНачисленийНП.Организация,
	|	бестОбъемНачисленийНП.Район,
	|	бестОбъемНачисленийНП.Договор,
	|	бестОбъемНачисленийНП.ОбъектРасчета,
	|	бестОбъемНачисленийНП.ТочкаУчета,
	|	бестОбъемНачисленийНП.Услуга,
	|	энргВидыУслуг.СпособДосчётаРесурса	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Организация КАК Организация,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Район КАК Район,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Договор КАК Договор,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|			ТОГДА ИСТИНА
	|		КОГДА бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	|			ТОГДА ЛОЖЬ
	|	КОНЕЦ КАК Состояние,
	|	&НачалоПериодаРасчетаМинусСекунда КАК Период
	|ПОМЕСТИТЬ ИзменениеИндивидуальнойСезонности
	|ИЗ
	|	РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг.СрезПоследних(
	|			&НачалоПериодаРасчетаМинусСекунда,
	|			Организация = &Организация
	|				И Район = &Район" + ОтборДоговора + ") КАК бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Организация,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Район,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Договор,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.ОбъектРасчета,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.ТочкаУчета,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Услуга,
	|	ВЫБОР
	|		КОГДА бестИндивидуальныеНастройкиСезонностиУслуг.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|			ТОГДА ИСТИНА
	|		КОГДА бестИндивидуальныеНастройкиСезонностиУслуг.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	|			ТОГДА ЛОЖЬ
	|	КОНЕЦ,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Период
	|ИЗ
	|	РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг КАК бестИндивидуальныеНастройкиСезонностиУслуг
	|ГДЕ
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	|	И бестИндивидуальныеНастройкиСезонностиУслуг.Организация = &Организация
	|	И бестИндивидуальныеНастройкиСезонностиУслуг.Район = &Район" + ОтборДоговора_бестИндивидуальныеНастройкиСезонностиУслуг + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Организация,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Район,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Договор,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.ОбъектРасчета,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.ТочкаУчета,
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Услуга,
	|	ВЫБОР КОГДА ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL ТОГДА Истина ИНАЧЕ &НачалоПериодаРасчета МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода КОНЕЦ,
	|	&НачалоПериодаРасчетаМинусСекунда
	|ИЗ
	|	РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг КАК бестИндивидуальныеНастройкиСезонностиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг.СрезПоследних(
	|				&НачалоПериодаРасчетаМинусСекунда,
	|				Организация = &Организация
	|					И Район = &Район" + ОтборДоговора + ") КАК бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних
	|		ПО бестИндивидуальныеНастройкиСезонностиУслуг.Организация = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Организация
	|			И бестИндивидуальныеНастройкиСезонностиУслуг.Район = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Район
	|			И бестИндивидуальныеНастройкиСезонностиУслуг.Договор = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Договор
	|			И бестИндивидуальныеНастройкиСезонностиУслуг.ОбъектРасчета = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ОбъектРасчета
	|			И бестИндивидуальныеНастройкиСезонностиУслуг.ТочкаУчета = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ТочкаУчета
	|			И бестИндивидуальныеНастройкиСезонностиУслуг.Услуга = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Услуга
	|			И (бестИндивидуальныеНастройкиСезонностиУслуг.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО бестИндивидуальныеНастройкиСезонностиУслуг.Услуга = ДлительностьПериодов.Услуга
	|			И бестИндивидуальныеНастройкиСезонностиУслуг.Организация = ДлительностьПериодов.Организация
	|ГДЕ
	|	бестИндивидуальныеНастройкиСезонностиУслуг.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	|	И бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Период ЕСТЬ NULL
	|	И бестИндивидуальныеНастройкиСезонностиУслуг.Организация = &Организация
	|	И бестИндивидуальныеНастройкиСезонностиУслуг.Район = &Район" + ОтборДоговора_бестИндивидуальныеНастройкиСезонностиУслуг + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзменениеИндивидуальнойСезонности.Организация КАК Организация,
	|	ИзменениеИндивидуальнойСезонности.Район КАК Район,
	|	ИзменениеИндивидуальнойСезонности.Договор КАК Договор,
	|	ИзменениеИндивидуальнойСезонности.ТочкаУчета КАК ТочкаУчета,
	|	ИзменениеИндивидуальнойСезонности.Услуга КАК Услуга,
	|	ИзменениеИндивидуальнойСезонности.Период КАК Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИзменениеИндивидуальнойСезонности1.Период) КАК НомерСтроки,
	|	ИзменениеИндивидуальнойСезонности.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ИндивидуальнаяСезонностьНомерСтроки
	|ИЗ
	|	ИзменениеИндивидуальнойСезонности КАК ИзменениеИндивидуальнойСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменениеИндивидуальнойСезонности КАК ИзменениеИндивидуальнойСезонности1
	|		ПО ИзменениеИндивидуальнойСезонности.Договор = ИзменениеИндивидуальнойСезонности1.Договор
	|			И ИзменениеИндивидуальнойСезонности.ОбъектРасчета = ИзменениеИндивидуальнойСезонности1.ОбъектРасчета
	|			И ИзменениеИндивидуальнойСезонности.ТочкаУчета = ИзменениеИндивидуальнойСезонности1.ТочкаУчета
	|			И ИзменениеИндивидуальнойСезонности.Услуга = ИзменениеИндивидуальнойСезонности1.Услуга
	|			И ИзменениеИндивидуальнойСезонности.Период >= ИзменениеИндивидуальнойСезонности1.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзменениеИндивидуальнойСезонности.Организация,
	|	ИзменениеИндивидуальнойСезонности.Район,
	|	ИзменениеИндивидуальнойСезонности.Договор,
	|	ИзменениеИндивидуальнойСезонности.ТочкаУчета,
	|	ИзменениеИндивидуальнойСезонности.Услуга,
	|	ИзменениеИндивидуальнойСезонности.Период,
	|	ИзменениеИндивидуальнойСезонности.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзменениеИндивидуальнойСезонности.Организация КАК Организация,
	|	ИзменениеИндивидуальнойСезонности.Район КАК Район,
	|	ИзменениеИндивидуальнойСезонности.Договор КАК Договор,
	|	ИзменениеИндивидуальнойСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	ИзменениеИндивидуальнойСезонности.ТочкаУчета КАК ТочкаУчета,
	|	ИзменениеИндивидуальнойСезонности.Услуга КАК Услуга,
	|	ИзменениеИндивидуальнойСезонности.Состояние КАК Состояние,
	|	ИзменениеИндивидуальнойСезонности.Период КАК Период,
	|	ИндивидуальнаяСезонностьНомерСтроки.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ИндивидуальнаяСезонностьПорядок
	|ИЗ
	|	ИзменениеИндивидуальнойСезонности КАК ИзменениеИндивидуальнойСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИндивидуальнаяСезонностьНомерСтроки КАК ИндивидуальнаяСезонностьНомерСтроки
	|		ПО ИзменениеИндивидуальнойСезонности.Организация = ИндивидуальнаяСезонностьНомерСтроки.Организация
	|			И ИзменениеИндивидуальнойСезонности.Район = ИндивидуальнаяСезонностьНомерСтроки.Район
	|			И ИзменениеИндивидуальнойСезонности.Договор = ИндивидуальнаяСезонностьНомерСтроки.Договор
	|			И ИзменениеИндивидуальнойСезонности.ОбъектРасчета = ИндивидуальнаяСезонностьНомерСтроки.ОбъектРасчета
	|			И ИзменениеИндивидуальнойСезонности.ТочкаУчета = ИндивидуальнаяСезонностьНомерСтроки.ТочкаУчета
	|			И ИзменениеИндивидуальнойСезонности.Услуга = ИндивидуальнаяСезонностьНомерСтроки.Услуга
	|			И ИзменениеИндивидуальнойСезонности.Период = ИндивидуальнаяСезонностьНомерСтроки.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИндивидуальнаяСезонностьНачало.Организация КАК Организация,
	|	ИндивидуальнаяСезонностьНачало.Район КАК Район,
	|	ИндивидуальнаяСезонностьНачало.Договор КАК Договор,
	|	ИндивидуальнаяСезонностьНачало.ОбъектРасчета КАК ОбъектРасчета,
	|	ИндивидуальнаяСезонностьНачало.ТочкаУчета КАК ТочкаУчета,
	|	ИндивидуальнаяСезонностьНачало.Услуга КАК Услуга,
	|	ИндивидуальнаяСезонностьНачало.Состояние КАК Состояние,
	|	ВЫБОР
	|		КОГДА ИндивидуальнаяСезонностьКонец.Период ЕСТЬ NULL
	|			ТОГДА &КонецПериодаРасчета
	|		ИНАЧЕ ИндивидуальнаяСезонностьКонец.Период
	|	КОНЕЦ КАК КонецПериода,
	|	ИндивидуальнаяСезонностьНачало.Период КАК НачалоПериода
	|ПОМЕСТИТЬ ИндивидуальнаяСезонностьСтабильныеПериоды
	|ИЗ
	|	ИндивидуальнаяСезонностьПорядок КАК ИндивидуальнаяСезонностьНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИндивидуальнаяСезонностьПорядок КАК ИндивидуальнаяСезонностьКонец
	|		ПО ИндивидуальнаяСезонностьНачало.Организация = ИндивидуальнаяСезонностьКонец.Организация
	|			И ИндивидуальнаяСезонностьНачало.Район = ИндивидуальнаяСезонностьКонец.Район
	|			И ИндивидуальнаяСезонностьНачало.Договор = ИндивидуальнаяСезонностьКонец.Договор
	|			И ИндивидуальнаяСезонностьНачало.ОбъектРасчета = ИндивидуальнаяСезонностьКонец.ОбъектРасчета
	|			И ИндивидуальнаяСезонностьНачало.ТочкаУчета = ИндивидуальнаяСезонностьКонец.ТочкаУчета
	|			И ИндивидуальнаяСезонностьНачало.Услуга = ИндивидуальнаяСезонностьКонец.Услуга
	|			И (ИндивидуальнаяСезонностьНачало.НомерСтроки = ИндивидуальнаяСезонностьКонец.НомерСтроки - 1)
	|ГДЕ
	|	ИндивидуальнаяСезонностьНачало.Состояние
	|	и НачалоПериода(ИндивидуальнаяСезонностьНачало.Период, ДЕНЬ) <> НачалоПериода(ЕСТЬNULL(ИндивидуальнаяСезонностьКонец.Период, ДАТАВРЕМЯ(1,1,1)), ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности,
	|	ЛОЖЬ КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)" + ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП + "
	|ГДЕ
	|	НЕ (бестНомераСтрокСтабильногоПериодаНП.Договор, бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета, бестНомераСтрокСтабильногоПериодаНП.Услуга, бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ИзменениеИндивидуальнойСезонности.Договор КАК Договор,
	|					ИзменениеИндивидуальнойСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|					ИзменениеИндивидуальнойСезонности.Услуга КАК Услуга,
	|					ИзменениеИндивидуальнойСезонности.ТочкаУчета КАК ТочкаУчета
	|				ИЗ
	|					ИзменениеИндивидуальнойСезонности КАК ИзменениеИндивидуальнойСезонности)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ДлительностьПериодов.НачалоФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции),
	|	ИндивидуальнаяСезонностьСтабильныеПериоды.НачалоПериода,
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИндивидуальнаяСезонностьСтабильныеПериоды КАК ИндивидуальнаяСезонностьСтабильныеПериоды
	|		ПО бестНомераСтрокСтабильногоПериодаНП.Услуга = ИндивидуальнаяСезонностьСтабильныеПериоды.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.Организация = ИндивидуальнаяСезонностьСтабильныеПериоды.Организация
	|			И бестНомераСтрокСтабильногоПериодаНП.Район = ИндивидуальнаяСезонностьСтабильныеПериоды.Район
	|			И бестНомераСтрокСтабильногоПериодаНП.Договор = ИндивидуальнаяСезонностьСтабильныеПериоды.Договор
	|			И бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета = ИндивидуальнаяСезонностьСтабильныеПериоды.ОбъектРасчета
	|			И бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета = ИндивидуальнаяСезонностьСтабильныеПериоды.ТочкаУчета
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора <= ИндивидуальнаяСезонностьСтабильныеПериоды.НачалоПериода
	|			И (ИндивидуальнаяСезонностьСтабильныеПериоды.НачалоПериода <> &НачалоПериодаРасчета)
	|			И (ИндивидуальнаяСезонностьСтабильныеПериоды.НачалоПериода <> &КонецПериодаРасчета)" + ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП + "
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	|	ИндивидуальнаяСезонностьСтабильныеПериоды.НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности,
	|	ЛОЖЬ КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета.МКД <> Значение(Справочник.энргСтроения.ПустаяСсылка))
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)" + ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП + "
	|ГДЕ
	|	НЕ (бестНомераСтрокСтабильногоПериодаНП.Договор, бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета, бестНомераСтрокСтабильногоПериодаНП.Услуга, бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ИзменениеИндивидуальнойСезонности.Договор КАК Договор,
	|					ИзменениеИндивидуальнойСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|					ИзменениеИндивидуальнойСезонности.Услуга КАК Услуга,
	|					ИзменениеИндивидуальнойСезонности.ТочкаУчета КАК ТочкаУчета
	|				ИЗ
	|					ИзменениеИндивидуальнойСезонности КАК ИзменениеИндивидуальнойСезонности)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ДлительностьПериодов.КонецФактическогоПериода,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции),
	|	ИндивидуальнаяСезонностьСтабильныеПериоды.КонецПериода,
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИндивидуальнаяСезонностьСтабильныеПериоды КАК ИндивидуальнаяСезонностьСтабильныеПериоды
	|		ПО бестНомераСтрокСтабильногоПериодаНП.Услуга = ИндивидуальнаяСезонностьСтабильныеПериоды.Услуга
	|			И бестНомераСтрокСтабильногоПериодаНП.Организация = ИндивидуальнаяСезонностьСтабильныеПериоды.Организация
	|			И бестНомераСтрокСтабильногоПериодаНП.Район = ИндивидуальнаяСезонностьСтабильныеПериоды.Район
	|			И бестНомераСтрокСтабильногоПериодаНП.Договор = ИндивидуальнаяСезонностьСтабильныеПериоды.Договор
	|			И бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета = ИндивидуальнаяСезонностьСтабильныеПериоды.ОбъектРасчета
	|			И бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета = ИндивидуальнаяСезонностьСтабильныеПериоды.ТочкаУчета
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора <= ИндивидуальнаяСезонностьСтабильныеПериоды.КонецПериода
	//|			И (ИндивидуальнаяСезонностьСтабильныеПериоды.КонецПериода <> &НачалоПериодаРасчета)
	|			И (ИндивидуальнаяСезонностьСтабильныеПериоды.КонецПериода <> &КонецПериодаРасчета)" + ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП + "
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	|	ИндивидуальнаяСезонностьСтабильныеПериоды.КонецПериода
	//ИНДИВИДУАЛЬНАЯ СЕЗОННОСТЬ как было
	//|ВЫБРАТЬ
	//|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	//|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	//|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	//|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	//|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	//|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	//|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	//|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	//|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	//|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	//|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	//|ИЗ
	//|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	//|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	//|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	//|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	//|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	//|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	//|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	//|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)" + ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП + "
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	//|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	//|	бестНомераСтрокСтабильногоПериодаНП.Район,
	//|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	//|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	//|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	//|	ДлительностьПериодов.НачалоФактическогоПериода,
	//|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	//|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	//|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	//|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	//|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	//|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	//|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	//|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	//|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	//|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	//|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	//|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	//|ИЗ
	//|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	//|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	//|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	//|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	//|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ДлительностьПериодов.Услуга
	//|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	//|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	//|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)" + ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП + "
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	//|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	//|	бестНомераСтрокСтабильногоПериодаНП.Район,
	//|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	//|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	//|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	//|	ДлительностьПериодов.КонецФактическогоПериода,
	//|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	//|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	//ИНДИВИДУАЛЬНАЯ СЕЗОННОСТЬ как было	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД КАК МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета, 	
	|	ЗначенияТарифов.ДатаСменыТарифа КАК ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор КАК Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа КАК ЗначениеТарифа,
	|	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомераСтрокЗначениеТарифа
	|ИЗ
	|	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
	|		ПО (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	|			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	|			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	|			И бестНомераСтрокСтабильногоПериодаНП.ДатаРегистратора < ЗначенияТарифов.ДатаСменыТарифа
	|			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ЗначенияТарифов.Услуга" + ОтборДоговора_бестНомераСтрокСтабильногоПериодаНП + "
	|
	|СГРУППИРОВАТЬ ПО
	|	бестНомераСтрокСтабильногоПериодаНП.Организация,
	|	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	|	бестНомераСтрокСтабильногоПериодаНП.Район,
	|	бестНомераСтрокСтабильногоПериодаНП.МКД,
	|	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	|	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа,
	|	бестНомераСтрокСтабильногоПериодаНП.Договор,
	|	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Организация КАК Организация,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Район КАК Район,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ГБП КАК ГБП
	|ПОМЕСТИТЬ РасположениеТУОтносительноГБП
	|ИЗ
	|	РегистрСведений.бестРасположениеТочекУчетаОтносительноГБП.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРасположениеТочекУчетаОтносительноГБПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.Договор КАК Договор,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	ТемпературыИсточника.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ТемпературыИсточника.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ЕСТЬNULL(бестПлотностиВоды.Плотность, 1) КАК Плотность
	|ПОМЕСТИТЬ ТемпературыИсточникаТочекУчета
	|ИЗ
	|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район" + ОтборДоговора + ") КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТемпературыИсточника КАК ТемпературыИсточника
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
	|			ПО ТемпературыИсточника.ТемператураПодачиИсточника = бестПлотностиВоды.Температура
	|		ПО бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация = ТемпературыИсточника.Организация
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.Район = ТемпературыИсточника.Район
	|			И бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = ТемпературыИсточника.Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","бестСтабильныеПериодыНП","ПериодРегистрации",Истина,Ложь) + "
	|	ВЫБОР
	|		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&КонецПериодаРасчета КАК ЗавершениеОП,
	|	&ДнейВПериоде КАК ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|ГДЕ
	|	бестСтабильныеПериодыНП.Организация = &Организация
	|	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|	И бестСтабильныеПериодыНП.Район = &Район" + ОтборДоговора_бестСтабильныеПериодыНП + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачало",,Истина,Ложь) + "
	|	ЕСТЬNULL(СтабильныеПериодыПриборыУзловУчета.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ЧастьУзлаПриборУчета,
	|	ЕСТЬNULL(СтабильныеПериодыПриборыУзловУчета.ПриборВведен, ЛОЖЬ) КАК ЧастьУзлаПриборВведен,
	|	ЕСТЬNULL(СтабильныеПериодыПриборыУзловУчета.КоэффициентПУ, 1) КАК КоэффициентПУ,
	|	СтабильныеПериодыНачало.НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСоставУзла
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПриборыУзловУчета КАК СтабильныеПериодыПриборыУзловУчета
	|		ПО СтабильныеПериодыНачало.Организация = СтабильныеПериодыПриборыУзловУчета.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СтабильныеПериодыПриборыУзловУчета.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СтабильныеПериодыПриборыУзловУчета.Район
	|			И СтабильныеПериодыНачало.Договор = СтабильныеПериодыПриборыУзловУчета.Договор
	|			И СтабильныеПериодыНачало.ОбъектРасчета = СтабильныеПериодыПриборыУзловУчета.ОбъектРасчета
	|			И СтабильныеПериодыНачало.ТочкаУчета = СтабильныеПериодыПриборыУзловУчета.ТочкаУчета
	|			И СтабильныеПериодыНачало.ПриборУчета = СтабильныеПериодыПриборыУзловУчета.УзелУчета
	|			И СтабильныеПериодыНачало.НомерПозиции = СтабильныеПериодыПриборыУзловУчета.НомерПозиции
	|;
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСоставУзла","УзелУчета,ПриборУчета,ЧастьУзлаУчета,Шкала",Истина,Ложь) + "	
	|	СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаПриборВведен КАК ПриборУчетаВведен,
	|	СтабильныеПериодыНачалоСоставУзла.КоэффициентПУ,
	|	СтабильныеПериодыНачалоСоставУзла.ПриборУчета КАК УзелУчета,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная)) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачалоСоставУзла.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПривязанаКШкале,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ЧастьУзлаУчета,
	|	СтабильныеПериодыНачалоСоставУзла.НачалоОП,
	|	СтабильныеПериодыНачалоСоставУзла.ЗавершениеОП,
	|	СтабильныеПериодыНачалоСоставУзла.ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоШкалы
	|ИЗ
	|	СтабильныеПериодыНачалоСоставУзла КАК СтабильныеПериодыНачалоСоставУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО СтабильныеПериодыНачалоСоставУзла.Организация = СтабильныеПериодыШкалы.Организация
	|			И СтабильныеПериодыНачалоСоставУзла.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСоставУзла.Район = СтабильныеПериодыШкалы.Район
	|			И СтабильныеПериодыНачалоСоставУзла.Договор = СтабильныеПериодыШкалы.Договор
	|			И СтабильныеПериодыНачалоСоставУзла.ОбъектРасчета = СтабильныеПериодыШкалы.ОбъектРасчета
	|			И СтабильныеПериодыНачалоСоставУзла.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСоставУзла.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыНачалоСоставУзла.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|						И СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаПриборУчета = СтабильныеПериодыШкалы.ПриборУчета
	|			КОНЕЦ)
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыНачалоШкалы.Организация КАК Организация,
	|	СтабильныеПериодыНачалоШкалы.Район КАК Район,
	|	СтабильныеПериодыНачалоШкалы.ОбъектРасчета КАК ОбъектРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию) = ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию)
	|			ТОГДА 0
	|		ИНАЧЕ (ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) - ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемператураПред) / (ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) - ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию))
	|	КОНЕЦ КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемператураПред КАК СреднемесячнаяТемператураПред,
	|	ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию) КАК ПроектнаяТемпература,
	|	ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) КАК ТемператураОптимальная
	|ПОМЕСТИТЬ ТемперКоэффициентПоВоздухуПред
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО СтабильныеПериодыНачалоШкалы.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическаяСреднемесячнаяТемпература КАК ФактическаяСреднемесячнаяТемпература
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = ФактическаяСреднемесячнаяТемпература.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = ФактическаяСреднемесячнаяТемпература.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	|				ДОБАВИТЬКДАТЕ(&НачалоПериодаРасчета, СЕКУНДА, -1),
	|				Организация = &Организация
	|					И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	|				ДОБАВИТЬКДАТЕ(&НачалоПериодаРасчета, СЕКУНДА, -1),
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = бестТемпературыВКатегорияхОбъектовСрезПоследних.Район
	|			И (бестОбъектыРасчета.КатегорияПомещения = бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Организация КАК Организация,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Район КАК Район,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Договор КАК Договор,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВышедшийДопускПриборовККомУчету
	|ИЗ
	|	РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район" + ОтборДоговора + ") КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних
	|ГДЕ
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета < &КонецПериодаРасчета
	|	или бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.НачалоДействияКоммерскогоУчета > &НачалоПериодаРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
	|	энргЗначенияТарифовСрезПоследних.Район КАК Район,
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеРЭК КАК ЗначениеТарифаРЭК,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	бестТарифныеКатегорииНПСрезПоследних.Организация КАК Организация,
	|	бестТарифныеКатегорииНПСрезПоследних.Район КАК Район,
	|	бестТарифныеКатегорииНПСрезПоследних.Договор КАК Договор,
	|	бестТарифныеКатегорииНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестТарифныеКатегорииНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ТарифныеКатегориии
	|ИЗ
	|	РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район" + ОтборДоговора + ") КАК бестТарифныеКатегорииНПСрезПоследних";
	
	Если Отдельностоящие = Ложь И МКД = Неопределено Тогда
		
		Текст 		= СтрЗаменить(Текст,"И бестАктивностьОбъектовРасчета.ОбъектРасчета.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"ОбъектРасчета.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"МКД = &МКД","ИСТИНА");
		
	КонецЕсли;
	
	Если Договор = Неопределено  тогда
		Текст 		= СтрЗаменить(Текст,"И Договор = &Договор","");
		Текст 		= СтрЗаменить(Текст,"И бестАктивностьОбъектовРасчета.Договор = &Договор","");
	КонецЕсли;
	
	Возврат Текст;	
	
КонецФункции

Функция ТекстПолучитьСтабильныеПериоды(Договор)  
	
	Текст 	=
	"ВЫБРАТЬ
	|	НомераСтрокНачалоСезонности.Организация КАК Организация,
	|	НомераСтрокНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокНачалоСезонности.Район КАК Район,
	|	НомераСтрокНачалоСезонности.Договор КАК Договор,
	|	НомераСтрокНачалоСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокНачалоСезонности.МКД КАК МКД,
	|	НомераСтрокНачалоСезонности.Услуга КАК Услуга,
	|	НомераСтрокНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокНачалоСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокНачалоСезонности.ПериодСезонности КАК ПериодСезонности,
	|	НомераСтрокНачалоСезонности.ЭтоИндивидуальныеНастройки КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокНачалоСезонности КАК НомераСтрокНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокНачалоСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокНачалоСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокНачалоСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокНачалоСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокНачалоСезонности.Договор = СтабильныеПериодыНачало.Договор
	|			И НомераСтрокНачалоСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокНачалоСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокНачалоСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокНачалоСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокКонецСезонности.Организация КАК Организация,
	|	НомераСтрокКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокКонецСезонности.Район КАК Район,
	|	НомераСтрокКонецСезонности.МКД КАК МКД,
	|	НомераСтрокКонецСезонности.Договор КАК Договор,
	|	НомераСтрокКонецСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|	НомераСтрокКонецСезонности.Услуга КАК Услуга,
	|	НомераСтрокКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокКонецСезонности.ПериодСезонности КАК ПериодСезонности,
	|	НомераСтрокКонецСезонности.ЭтоИндивидуальныеНастройки КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ НомераСтрокКонецСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокКонецСезонности КАК НомераСтрокКонецСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокКонецСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокКонецСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокКонецСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокКонецСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокКонецСезонности.Договор = СтабильныеПериодыНачало.Договор
	|			И НомераСтрокКонецСезонности.ОбъектРасчета = СтабильныеПериодыНачало.ОбъектРасчета
	|			И НомераСтрокКонецСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокКонецСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокКонецСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоШкалы","",Истина,Ложь) + "	
	|	ВЫБОР
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СезонностьНачало,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ)) КАК НеПрименятьСезонность,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.ОбъемЗаПрошлыйГод, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.ОбъемЗаПрошлыйГод, ЛОЖЬ)) КАК ОбъемЗаПрошлыйГод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ))
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНеПрименятьСезонность, 1))
	|		ИНАЧЕ ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|	КОНЕЦ КАК КоэффициентНорматива,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1)) КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыНачалоШкалы.УзелУчета КАК УзелУчета,
	|	ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0) КАК ГарантированныйОбъем,
	|   ЕСТЬNULL(ТемператураКатегорииПомещения.ТемператураОптимальная, &ТемператураВнутриПомещенияПоУмолчанию) КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоШкалы.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоШкалы.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоШкалы.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоШкалы.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоШкалы.ПриборУчетаВведен КАК ПриборУчетаВведен
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачалоШкалы.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьМКД
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьМКД.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьМКД.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьМКД.Район
	|			И СтабильныеПериодыНачалоШкалы.МКД = УслугиНеПрименятьСезонностьМКД.Строение
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьМКД.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьРайон
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьРайон.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьРайон.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьРайон.Район
	|			И (УслугиНеПрименятьСезонностьРайон.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьРайон.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = ГарантированныеОбъемы.Организация
	|			И СтабильныеПериодыНачалоШкалы.Район = ГарантированныеОбъемы.Район
	|			И СтабильныеПериодыНачалоШкалы.Договор = ГарантированныеОбъемы.Договор
	|			И СтабильныеПериодыНачалоШкалы.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	|			И СтабильныеПериодыНачалоШкалы.Услуга = ГарантированныеОбъемы.Услуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТемператураКатегорииПомещения КАК ТемператураКатегорииПомещения
	|			ПО бестОбъектыРасчета.КатегорияПомещения = ТемператураКатегорииПомещения.КатегорияПомещения
	|		ПО СтабильныеПериодыНачалоШкалы.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" +	бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "	
	|	СтабильныеПериодыНачалоСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыНачалоСезонности.ПриборУчетаВведен КАК ПриборУчетаВведен,
	|   СтабильныеПериодыНачалоСезонности.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + ВЫБОР
	|	КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачалоСезонности.СезонностьНачало
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УвеличениеПозиции,
	|   ЕСТЬNULL(НомераСтрокНачалоСезонностиБезФормулы.ЭтоИндивидуальныеНастройки, ЛОЖЬ) КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Договор = НомераСтрокНачалоСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.ПериодРегистрации >= НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыНачалоСезонности","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "
	|	НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыНачалоСезонности.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыНачалоСезонности.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыНачалоСезонности.ПриборУчетаВведен КАК ПриборУчетаВведен,
	|   СтабильныеПериодыНачалоСезонности.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + 1 КАК НомерПозиции,
	|	1 КАК КоэффициентСезоности,
	|	1,
	|   ЕСТЬNULL(НомераСтрокНачалоСезонностиБезФормулы.ЭтоИндивидуальныеНастройки, ЛОЖЬ) КАК ЭтоИндивидуальныеНастройки
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериодыНачалоСезонности.НомерПозиции = НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|			И СтабильныеПериодыНачалоСезонности.Договор = НомераСтрокНачалоСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыНачалоСезонности.ОбъектРасчета = НомераСтрокНачалоСезонностиБезФормулы.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "	
	|	СтабильныеПериодыСезонность.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + СтабильныеПериодыСезонность.УвеличениеПозиции > СтабильныеПериодыСезонность.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыСезонность.ПериодРегистрации КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыСезонность.КоэффициентСезоности
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыСезонность.ПриборУчетаВведен КАК ПриборУчетаВведен,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|   СтабильныеПериодыСезонность.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|   СтабильныеПериодыСезонность.ЭтоИндивидуальныеНастройки ИЛИ ЕСТЬNULL(НомераСтрокКонецСезонностиБезФормулы.ЭтоИндивидуальныеНастройки, Ложь) КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ СтабильныеКонецСезонности
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Договор = НомераСтрокКонецСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыСезонность.ОбъектРасчета = НомераСтрокКонецСезонностиБезФормулы.ОбъектРасчета
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.ПериодРегистрации >= НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыСезонность","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "		
	|	НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + 1,
	|	НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности,
	|	0 КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.УзелУчета,
	|	СтабильныеПериодыСезонность.ПриборУчетаВведен,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыСезонность.ГарантированныйОбъем,
	|   СтабильныеПериодыСезонность.ТемператураВнутриПомещения,
	|   СтабильныеПериодыСезонность.ЭтоИндивидуальныеНастройки ИЛИ ЕСТЬNULL(НомераСтрокКонецСезонностиБезФормулы.ЭтоИндивидуальныеНастройки, Ложь) КАК ЭтоИндивидуальныеНастройки
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Договор = НомераСтрокКонецСезонностиБезФормулы.Договор
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериодыСезонность.НомерПозиции - СтабильныеПериодыСезонность.УвеличениеПозиции = НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность или СтабильныеПериодыСезонность.РасчетПоФактическомуПотреблению)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонности","",Истина,Ложь) + "	
	|	СтабильныеКонецСезонности.КоэффициентСезоности,
	|	СтабильныеКонецСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонности.НачалоОП,
	|	СтабильныеКонецСезонности.ЗавершениеОП,
	|	СтабильныеКонецСезонности.ДнейВПериоде,
	|	СтабильныеКонецСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеКонецСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеКонецСезонности.КоэффициентНорматива,
	|	СтабильныеКонецСезонности.КоэффициентНормативаДляФакта,
	|	СтабильныеКонецСезонности.УзелУчета КАК УзелУчета,
	|	СтабильныеКонецСезонности.ПриборУчетаВведен КАК ПриборУчетаВведен,
	|	СтабильныеКонецСезонности.ГарантированныйОбъем,
	|   СтабильныеКонецСезонности.ТемператураВнутриПомещения,
	|	СтабильныеКонецСезонности.ВидДифференцированности,
	|	СтабильныеКонецСезонности.ПривязанаКШкале,
	|	ВЫБОР
	|		КОГДА энргВидыДифференцированностиТарифныеЗоны.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона,
	|	СтабильныеКонецСезонности.ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТарифнаяЗона
	|ИЗ
	|	СтабильныеКонецСезонности КАК СтабильныеКонецСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеКонецСезонности.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеКонецСезонностиТарифнаяЗона","",Истина,Ложь) + "
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидДифференцированности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПривязанаКШкале,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ПериодыПоказаний.Показания, 0) КАК Показания,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеКонецСезонностиТарифнаяЗона.УзелУчета КАК УзелУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПриборУчетаВведен КАК ПриборУчетаВведен,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|   СтабильныеКонецСезонностиТарифнаяЗона.ТемператураВнутриПомещения  КАК ТемператураВнутриПомещения,
	|   СтабильныеКонецСезонностиТарифнаяЗона.ЭтоИндивидуальныеНастройки  КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	СтабильныеКонецСезонностиТарифнаяЗона КАК СтабильныеКонецСезонностиТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестНачислениеНП
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестЗаключениеДоговоровСЮридическимиЛицами
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСПриборомУчетаНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.бестОперацияСУслугамиНП
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				ИНАЧЕ СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации МЕЖДУ ПериодыПоказаний.НачалоПериодДействия И ПериодыПоказаний.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Организация = ПериодыПоказаний.Организация
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Район = ПериодыПоказаний.Район
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Договор = ПериодыПоказаний.Договор
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ОбъектРасчета = ПериодыПоказаний.ОбъектРасчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПриборУчета = ПериодыПоказаний.ПриборУчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Шкала = ПериодыПоказаний.Шкала
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона = ПериодыПоказаний.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериодыПоказанияНачало","НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	СтабильныеПериодыПоказанияНачало.ВидДифференцированности,
	|	СтабильныеПериодыПоказанияНачало.ПривязанаКШкале,
	|	СтабильныеПериодыПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,
	|	СтабильныеПериодыПоказанияНачало.Показания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПриборУчета ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.Показания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|					ТОГДА СтабильныеПериодыПоказанияКонец.Показания
	|				ИНАЧЕ СтабильныеПериодыПоказанияНачало.Показания
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеПериодыПоказанияНачало.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыПоказанияНачало.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыПоказанияНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПоказанияНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПоказанияНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыПоказанияКонец.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	СтабильныеПериодыПоказанияНачало.УзелУчета КАК УзелУчета,
	|	СтабильныеПериодыПоказанияНачало.ПриборУчетаВведен КАК ПриборУчетаВведен,
	|	СтабильныеПериодыПоказанияНачало.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	СтабильныеПериодыПоказанияНачало.ТемператураВнутриПомещения  КАК ТемператураВнутриПомещения,
	|	СтабильныеПериодыПоказанияНачало.ЭтоИндивидуальныеНастройки  КАК ЭтоИндивидуальныеНастройки
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияКонец
	|		ПО (СтабильныеПериодыПоказанияНачало.НомерПозиции = СтабильныеПериодыПоказанияКонец.НомерПозиции - 1)
	|			И СтабильныеПериодыПоказанияНачало.Организация = СтабильныеПериодыПоказанияКонец.Организация
	|			И СтабильныеПериодыПоказанияНачало.ПериодНачисления = СтабильныеПериодыПоказанияКонец.ПериодНачисления
	|			И СтабильныеПериодыПоказанияНачало.Район = СтабильныеПериодыПоказанияКонец.Район
	|			И СтабильныеПериодыПоказанияНачало.Договор = СтабильныеПериодыПоказанияКонец.Договор
	|			И СтабильныеПериодыПоказанияНачало.ОбъектРасчета = СтабильныеПериодыПоказанияКонец.ОбъектРасчета
	|			И СтабильныеПериодыПоказанияНачало.ТочкаУчета = СтабильныеПериодыПоказанияКонец.ТочкаУчета
	|			И СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|			И СтабильныеПериодыПоказанияНачало.Услуга = СтабильныеПериодыПоказанияКонец.Услуга
	|			И СтабильныеПериодыПоказанияНачало.ТарифнаяЗона = СтабильныеПериодыПоказанияКонец.ТарифнаяЗона
	|			И СтабильныеПериодыПоказанияНачало.Шкала = СтабильныеПериодыПоказанияКонец.Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.Договор КАК Договор,
	|	Периоды.ОбъектРасчета КАК ОбъектРасчета,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.УзелУчета КАК УзелУчета,
	|	МАКСИМУМ(Периоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ МаксНомерПозицииПериоды
	|ИЗ
	|	Периоды КАК Периоды
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.ТочкаУчета,
	|	Периоды.УзелУчета,
	|	Периоды.Организация,
	|	Периоды.Договор,
	|	Периоды.ПериодНачисления,
	|	Периоды.ОбъектРасчета,
	|	Периоды.Услуга,
	|	Периоды.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЗарегистрированныеОбъемыПотребленияНП.Организация КАК Организация,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Район КАК Район,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Договор КАК Договор,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Услуга КАК Услуга,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ПриборУчета КАК ПриборУчета,
	|	бестЗарегистрированныеОбъемыПотребленияНП.Период КАК Период,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъемПоПрибору КАК ЗарегистрированныйОбъемПоПрибору,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъемИтоговый КАК ЗарегистрированныйОбъем,
	|	бестЗарегистрированныеОбъемыПотребленияНП.ОбъемМГВ КАК ОбъемМГВ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестЗарегистрированныеОбъемыПотребленияНП.СпособНачисления КАК СпособНачисления,
	|	МаксНомерПозицииПериоды.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ЗарегистрированныеОбъемы
	|ИЗ
	|	РегистрНакопления.бестЗарегистрированныеОбъемыПотребленияНП КАК бестЗарегистрированныеОбъемыПотребленияНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомерПозицииПериоды КАК МаксНомерПозицииПериоды
	|		ПО бестЗарегистрированныеОбъемыПотребленияНП.Организация = МаксНомерПозицииПериоды.Организация
	|			И бестЗарегистрированныеОбъемыПотребленияНП.Район = МаксНомерПозицииПериоды.Район
	|			И бестЗарегистрированныеОбъемыПотребленияНП.Договор = МаксНомерПозицииПериоды.Договор
	|			И бестЗарегистрированныеОбъемыПотребленияНП.ОбъектРасчета = МаксНомерПозицииПериоды.ОбъектРасчета
	|			И бестЗарегистрированныеОбъемыПотребленияНП.Услуга = МаксНомерПозицииПериоды.Услуга
	|			И бестЗарегистрированныеОбъемыПотребленияНП.ТочкаУчета = МаксНомерПозицииПериоды.ТочкаУчета
	|			И бестЗарегистрированныеОбъемыПотребленияНП.ПериодНачисления = МаксНомерПозицииПериоды.ПериодНачисления
	|ГДЕ
	|	бестЗарегистрированныеОбъемыПотребленияНП.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета
	|	И бестЗарегистрированныеОбъемыПотребленияНП.Организация = &Организация
	|	И бестЗарегистрированныеОбъемыПотребленияНП.Район = &Район
	|	И бестЗарегистрированныеОбъемыПотребленияНП.Договор = &Договор
	|	И бестЗарегистрированныеОбъемыПотребленияНП.ПериодНачисления = &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксНомерПозицииПериоды.Организация КАК Организация,
	|	МаксНомерПозицииПериоды.Район КАК Район,
	|	МаксНомерПозицииПериоды.Договор КАК Договор,
	|	МаксНомерПозицииПериоды.ОбъектРасчета КАК ОбъектРасчета,
	|	МаксНомерПозицииПериоды.ТочкаУчета КАК ТочкаУчета,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бестПриборыУзловУчетаНП.ПриборУчета) КАК КоличествоПУ,
	|	МаксНомерПозицииПериоды.Услуга КАК Услуга
	|ПОМЕСТИТЬ КоличествоПУВУзлеУчета
	|ИЗ
	|	МаксНомерПозицииПериоды КАК МаксНомерПозицииПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП КАК бестПриборыУзловУчетаНП
	|		ПО бестПриборыУзловУчетаНП.Организация = МаксНомерПозицииПериоды.Организация
	|			И бестПриборыУзловУчетаНП.Район = МаксНомерПозицииПериоды.Район
	|			И бестПриборыУзловУчетаНП.Договор = МаксНомерПозицииПериоды.Договор
	|			И бестПриборыУзловУчетаНП.ОбъектРасчета = МаксНомерПозицииПериоды.ОбъектРасчета
	|			И бестПриборыУзловУчетаНП.ТочкаУчета = МаксНомерПозицииПериоды.ТочкаУчета
	|			И бестПриборыУзловУчетаНП.УзелУчета = МаксНомерПозицииПериоды.УзелУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксНомерПозицииПериоды.Организация,
	|	МаксНомерПозицииПериоды.Район,
	|	МаксНомерПозицииПериоды.Договор,
	|	МаксНомерПозицииПериоды.ОбъектРасчета,
	|	МаксНомерПозицииПериоды.Услуга,
	|	МаксНомерПозицииПериоды.ТочкаУчета";
	
	Если Договор = Неопределено  тогда
		Текст 		= СтрЗаменить(Текст,"И бестЗарегистрированныеОбъемыПотребленияНП.Договор = &Договор","");
	КонецЕсли;

	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьДанныеДляРасчетаНП(РасчетПоФормуле)
	
	Текст   = 
	"ВЫБРАТЬ
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.Договор КАК Договор,
	|	Периоды.МКД КАК МКД,
	|	Периоды.ОбъектРасчета КАК ОбъектРасчета,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.НомерПозиции КАК НомерПозиции,
	|	Периоды.ДоговорЗаключен КАК ДоговорЗаключен,
	|	Периоды.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	|	Периоды.УслугаПодключена КАК УслугаПодключена,
	|	Периоды.ПриборВведен КАК ПриборВведен,
	|	Периоды.ПриборУчетаВведен КАК УзелУчетаВведен,
	|	Периоды.УзелУчета КАК УзелУчета,
	|	Периоды.ПриборУчета КАК ПриборУчета,
	|	Периоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	Периоды.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	|	Периоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	Периоды.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Периоды.ДатаПоверки КАК ДатаПоверки,
	|	Периоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	Периоды.КоэффициентРасчета КАК КоэффициентРасчета,
	|	Периоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	Периоды.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	Периоды.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	|	Периоды.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	Периоды.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	Периоды.РасчетПоФормуле КАК РасчетПоФормуле,
	|	Периоды.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	|	Периоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Периоды.КлючНорматива КАК КлючНорматива,
	|	Периоды.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	Периоды.Поставщик КАК Поставщик,
	|	Периоды.Шкала КАК Шкала,
	|	Периоды.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	Периоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)) КАК ФормулаРасчета,
	|	Периоды.НачалоПериода КАК НачалоПериода,
	|	Периоды.КонецПериода КАК КонецПериода,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.НачальныеПоказания КАК НачПок,
	|	Периоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, 0) КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ КАК КонПок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ОбъектРасчета ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПредоставленныеПоказания.ВСрок
	|		КОНЕЦ) КАК ПоказанияВСрок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеВыводаПрибораУчета.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВыводПрибораУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ПоказанияПредоставлены,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаДокумента.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеНП.ПустаяСсылка))) КАК ДокументНачисления,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА (энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка) ИЛИ Периоды.НеПрименятьСезонность) И НЕ Периоды.ЭтоИндивидуальныеНастройки
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка) И НЕ Периоды.ЭтоИндивидуальныеНастройки
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоностиОбъемПотребленный,
	|	Периоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ЗарегистрированныеОбъемы.ТочкаУчета ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(ПредоставленныеПоказанияПоДоговору.ПоказанияТекущегоПериода, ЛОЖЬ)
	|		КОНЕЦ) КАК ЕстьПоказанияАбонента,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.СледующийРегистратор КАК СледующийРегистратор,
	|	Периоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	Периоды.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	|	Периоды.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ЕСТЬNULL(ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	|	ЕСТЬNULL(ТемператураНаружногоВоздуха.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию) КАК ПроектнаяТемператураНаружногоВоздуха,
	|	Периоды.ТипСхемыГВС КАК ТипСхемыГВС,
	|	Периоды.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	|	Периоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	Периоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	Периоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	Периоды.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	Периоды.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	Периоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗакрытаяСхемаГВС,
	|	ВЫБОР
	|		КОГДА Периоды.КоличествоЧасовРаботы = 0
	|			ТОГДА 24
	|		ИНАЧЕ Периоды.КоличествоЧасовРаботы
	|	КОНЕЦ КАК КоличествоЧасовРаботы,
	|	ВЫБОР
	|		КОГДА ТемпературыПоВоде.ПроектнаяТемператураГВС <> 0
	|				И ТемпературыПоВоде.ПроектнаяТемператураГВС <> ТемпературыПоВоде.ПроектнаяТемператураХВС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтопительныйПериод.Сезонность ЕСТЬ NULL
	|						ТОГДА (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВНеотопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|					ИНАЧЕ (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВОтопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТемпературныйКоэффициентПоВоде,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоде КАК бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	энргВидыУслуг.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	ОтопительныйПериод.Сезонность КАК ОтопительныйПериод,
	|	ВЫБОР 
	|		КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = Значение(Перечисление.бестСпособыДосчётаРесурса.ПоСреднесуточномуКоличествуТепловойЭнергии) 
	|					И РасходЗаПредПериод.КоличествоЧасовРаботыТУОборот = РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот 
	|			ТОГДА ЕСТЬNULL(РасходЗаПредПериод.Объем_ПоПриборуПред, 0)
	|		КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = Значение(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) 
	|					И РасходЗаПредПериод.ОбъемМГВОборот <> 0
	|			ТОГДА ЕСТЬNULL(РасходЗаПредПериод.ОбъемМГВОборот, 0)
	|		КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = Значение(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) 
	|					И РасходЗаПредПериод.ОбъемМГВОборот = 0
	|			ТОГДА ЕСТЬNULL(РасходЗаПредПериод.ОбъемУслугиОборот, 0) 
	|	КОНЕЦ КАК РасходЗаПредыдущийПериод,
	|	ВЫБОР
	|		КОГДА ПредоставленныеПоказанияПредПериод.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеПоказанийЗаПредПериод,
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот, 0) КАК ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовРаботыТУОборот, 0) КАК КоличествоЧасовРаботыТУЗаПредыдущийПериод,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0) КАК ПлощадьМОП,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0) КАК ПлощадьАбонентов,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0) КАК ПлощадьСобственнаяПоставка,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ЗарегистрированныйОбъем, -1) КАК ЗарегистрированныйОбъем,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.КоличествоЧасовРаботыТУ, 0) КАК КолЧасовРаботыТУЗарегОбъем,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.КоличествоЧасовШтатнойРаботыПУ, 0) КАК КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ЗарегистрированныйОбъемПоПрибору, 0) КАК ЗарегистрированныйОбъемПоПрибору,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ОбъемМГВ, 0) КАК ОбъемМГВ,
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.СпособНачисления, Значение(Перечисление.энргСпособНачислений.Пустаяссылка)) КАК СпособНачисления,
	|	Периоды.ИндивидуальнаяСезонность КАК ИндивидуальнаяСезонность,
	|	ВЫБОР
	|		КОГДА ЗарегистрированныеОбъемы.ТочкаУчета ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеЗарегистрированногоОбъема,
	|	Периоды.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	Периоды.ДиаметрСечения КАК ДиаметрСечения,
	|	ЕСТЬNULL(НормаСкоростиДвиженияВоды.СкоростьДвижения, 0) КАК СкоростьДвижения
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормой
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО Периоды.Организация = ПредоставленныеПоказания.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказания.Район
	|			И Периоды.Договор = ПредоставленныеПоказания.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.Договор = МаксимальныеПоказания.Договор
	|			И Периоды.ОбъектРасчета = МаксимальныеПоказания.ОбъектРасчета
	|			И Периоды.ПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеНП КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ))
	|			И Периоды.Организация = ТаблицаДокумента.Организация
	|			И Периоды.Район = ТаблицаДокумента.Район
	|			И Периоды.Договор = ТаблицаДокумента.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеАбонентов КАК СреднееПотреблениеАбонентов
	|		ПО Периоды.Организация = СреднееПотреблениеАбонентов.Организация
	|			И Периоды.ПериодНачисления = СреднееПотреблениеАбонентов.ПериодНачисления
	|			И Периоды.Район = СреднееПотреблениеАбонентов.Район
	|			И Периоды.Договор = СреднееПотреблениеАбонентов.Договор
	|			И Периоды.ОбъектРасчета = СреднееПотреблениеАбонентов.ОбъектРасчета
	|			И Периоды.Услуга = СреднееПотреблениеАбонентов.Услуга
	|			И Периоды.ТочкаУчета = СреднееПотреблениеАбонентов.ТочкаУчета
	|			И Периоды.Шкала = СреднееПотреблениеАбонентов.Шкала
	|			И Периоды.ТарифнаяЗона = СреднееПотреблениеАбонентов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВыводаПрибораУчета КАК ДанныеВыводаПрибораУчета
	|		ПО Периоды.Организация = ДанныеВыводаПрибораУчета.Организация
	|			И Периоды.ПериодНачисления = ДанныеВыводаПрибораУчета.ПериодНачисления
	|			И Периоды.Район = ДанныеВыводаПрибораУчета.Район
	|			И Периоды.Договор = ДанныеВыводаПрибораУчета.Договор
	|			И Периоды.ОбъектРасчета = ДанныеВыводаПрибораУчета.ОбъектРасчета
	|			И Периоды.ТочкаУчета = ДанныеВыводаПрибораУчета.ТочкаУчета
	|			И Периоды.ПриборУчета = ДанныеВыводаПрибораУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Периоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Периоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоДоговору КАК ПредоставленныеПоказанияПоДоговору
	|		ПО Периоды.Организация = ПредоставленныеПоказанияПоДоговору.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияПоДоговору.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияПоДоговору.Район
	|			И Периоды.Договор = ПредоставленныеПоказанияПоДоговору.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказанияПоДоговору.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказанияПоДоговору.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказанияПоДоговору.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказанияПоДоговору.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемператураНаружногоВоздуха КАК ТемператураНаружногоВоздуха
	|		ПО Периоды.Организация = ТемператураНаружногоВоздуха.Организация
	|			И Периоды.Район = ТемператураНаружногоВоздуха.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическаяСреднемесячнаяТемпература КАК ФактическаяСреднемесячнаяТемпература
	|		ПО Периоды.Организация = ФактическаяСреднемесячнаяТемпература.Организация
	|			И Периоды.Район = ФактическаяСреднемесячнаяТемпература.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО Периоды.Организация = МКДНеНачислятьТЭ.Организация
	|			И Периоды.Район = МКДНеНачислятьТЭ.Район
	|			И Периоды.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И (ВЫБОР
	|				КОГДА МКДНеНачислятьТЭ.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА Периоды.МКД = МКДНеНачислятьТЭ.МКД
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И Периоды.ТипСхемыГВС = МКДНеНачислятьТЭ.ТипСхемы
	|			И Периоды.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыПоВоде КАК ТемпературыПоВоде
	|		ПО Периоды.Организация = ТемпературыПоВоде.Организация
	|			И Периоды.Район = ТемпературыПоВоде.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтопительныйПериод КАК ОтопительныйПериод
	|		ПО Периоды.НачалоПериода >= ОтопительныйПериод.НачалоПериодаДействия
	|			И Периоды.КонецПериода <= ОтопительныйПериод.КонецПериодаДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходЗаПредПериод КАК РасходЗаПредПериод
	|		ПО Периоды.Организация = РасходЗаПредПериод.Организация
	|			И Периоды.Район = РасходЗаПредПериод.Район
	|			И Периоды.Договор = РасходЗаПредПериод.Договор
	|			И Периоды.ОбъектРасчета = РасходЗаПредПериод.ОбъектРасчета
	|			И Периоды.ТочкаУчета = РасходЗаПредПериод.ТочкаУчета
	|			И Периоды.Услуга = РасходЗаПредПериод.Услуга
	|		ПОЛНОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПредПериод КАК ПредоставленныеПоказанияПредПериод
	|		ПО Периоды.Район = ПредоставленныеПоказанияПредПериод.Район
	|			И Периоды.Договор = ПредоставленныеПоказанияПредПериод.Договор
	|			И Периоды.ОбъектРасчета = ПредоставленныеПоказанияПредПериод.ОбъектРасчета
	|			И Периоды.ПриборУчета = ПредоставленныеПоказанияПредПериод.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСтроений КАК ЗначенияПлощадейСтроений
	|		ПО Периоды.Организация = ЗначенияПлощадейСтроений.Организация
	|			И Периоды.ПериодНачисления = ЗначенияПлощадейСтроений.ПериодНачисления
	|			И Периоды.Район = ЗначенияПлощадейСтроений.Район
	|			И Периоды.МКД = ЗначенияПлощадейСтроений.МКД
	|			И Периоды.Услуга = ЗначенияПлощадейСтроений.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗарегистрированныеОбъемы КАК ЗарегистрированныеОбъемы
	|		ПО Периоды.Организация = ЗарегистрированныеОбъемы.Организация
	|			И Периоды.Район = ЗарегистрированныеОбъемы.Район
	|			И Периоды.Договор = ЗарегистрированныеОбъемы.Договор
	|			И Периоды.ОбъектРасчета = ЗарегистрированныеОбъемы.ОбъектРасчета
	|			И Периоды.Услуга = ЗарегистрированныеОбъемы.Услуга
	|			И Периоды.ТочкаУчета = ЗарегистрированныеОбъемы.ТочкаУчета
	//|			И (ЗарегистрированныеОбъемы.Период МЕЖДУ Периоды.НачалоПериода И Периоды.КонецПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НормаСкоростиДвиженияВоды КАК НормаСкоростиДвиженияВоды
	|		ПО Периоды.Организация = НормаСкоростиДвиженияВоды.Организация
	|			И Периоды.ПериодНачисления = НормаСкоростиДвиженияВоды.ПериодНачисления
	|ГДЕ
	|	Периоды.ДоговорЗаключен
	|	И Периоды.УслугаПодключена
	|	И Периоды.СпособРасчетаНорматива <> Значение(Перечисление.бестТипыНачисленияПоНормативуНП.БалансовыйМетод)
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Организация,
	|	Периоды.ПериодНачисления,
	|	Периоды.Район,
	|	Периоды.Договор,
	|	Периоды.МКД,
	|	Периоды.ОбъектРасчета,
	|	Периоды.Услуга,
	|	Периоды.ТочкаУчета,
	|	Периоды.УзелУчета,
	|	Периоды.ПриборУчета,
	|	Периоды.НомерПозиции,
	|	Периоды.ДоговорЗаключен,
	|	Периоды.ОбъектРасчетаПодключен,
	|	Периоды.УслугаПодключена,
	|	Периоды.ПриборВведен,
	|	Периоды.ПриборУчетаВведен,
	|	Периоды.ЗначениеНагрузки,
	|	Периоды.ЗначениеМесячнойНагрузки,
	|	Периоды.ЗначениеПлощади,
	|	Периоды.ТарифнаяГруппа,
	|	Периоды.ДатаПоверки,
	|	Периоды.ЗависимаяТочкаУчета,
	|	Периоды.КоэффициентРасчета,
	|	Периоды.ДатаСостоянияПрибора,
	|	Периоды.МенялосьСостояниеПУ,
	|	Периоды.МенялосьСостояниеФормулы,
	|	Периоды.ЗначениеНормативаЗаДень,
	|	Периоды.ОбъектУчаствуетВРаспределенииМКД,
	|	Периоды.РасчетПоФормуле,
	|	Периоды.ТепловаяСоставляющая,
	|	Периоды.СпособРасчетаНорматива,
	|	Периоды.КлючНорматива,
	|	Периоды.ТемператураВнутриПомещения,
	|	Периоды.Поставщик,
	|	Периоды.Шкала,
	|	Периоды.НетВозможностьУстановкиПУ,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)),
	|	Периоды.НачалоПериода,
	|	Периоды.КонецПериода,
	|	Периоды.ВидДифференцированности,
	|	Периоды.ТарифнаяЗона,
	|	Периоды.ПривязанаКШкале,
	|	Периоды.НачальныеПоказания,
	|	СреднееПотреблениеАбонентов.СреднийОбъем,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, 0),
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка) ИЛИ Периоды.НеПрименятьСезонность) И НЕ Периоды.ЭтоИндивидуальныеНастройки
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка) И НЕ Периоды.ЭтоИндивидуальныеНастройки
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)),
	|	Периоды.НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод,
	|	Периоды.ГарантированныйОбъем,
	|	Периоды.ДнейВПериоде,
	|	Периоды.СледующийРегистратор,
	|	Периоды.КоэффициентНорматива,
	|	Периоды.КоэффициентНормативаДляФакта,
	|	Периоды.ТипСхемыГВС,
	|	Периоды.ВидТепловогоПункта,
	|	Периоды.ИндивидуальнаяСезонность,
	|	ЕСТЬNULL(ФактическаяСреднемесячнаяТемпература.СреднемесячнаяТемпература, 0),
	|	ЕСТЬNULL(ТемператураНаружногоВоздуха.ПроектнаяТемпература, &ПроектнаяТемператураПоУмолчанию),
	|	Периоды.УчаствуетВДолевойСхеме,
	|	Периоды.СпособРаспределенияОбъемаДолевойТУ,
	|	Периоды.СпособРаспределенияОстаткаДолевыеСхемы,
	|	Периоды.РасчетИндивидуальногоПотребления,
	|	Периоды.КоэффициентДолевогоРаспределения,
	|	Периоды.СхемаРасчетаПриВыходеПУ,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	энргВидыУслуг.СпособДосчётаРесурса,
	|	ВЫБОР
	|		КОГДА Периоды.КоличествоЧасовРаботы = 0
	|			ТОГДА 24
	|		ИНАЧЕ Периоды.КоличествоЧасовРаботы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТемпературыПоВоде.ПроектнаяТемператураГВС <> 0
	|				И ТемпературыПоВоде.ПроектнаяТемператураГВС <> ТемпературыПоВоде.ПроектнаяТемператураХВС
	|			ТОГДА ВЫБОР
	|					КОГДА ОтопительныйПериод.Сезонность ЕСТЬ NULL
	|						ТОГДА (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВНеотопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|					ИНАЧЕ (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ТемператураХВСВОтопительныйПериод) / (ТемпературыПоВоде.ПроектнаяТемператураГВС - ТемпературыПоВоде.ПроектнаяТемператураХВС)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ОтопительныйПериод.Сезонность,
	|	ВЫБОР 
	|		КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = Значение(Перечисление.бестСпособыДосчётаРесурса.ПоСреднесуточномуКоличествуТепловойЭнергии) 
	|					И РасходЗаПредПериод.КоличествоЧасовРаботыТУОборот = РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот 
	|			ТОГДА ЕСТЬNULL(РасходЗаПредПериод.Объем_ПоПриборуПред, 0)
	|		КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = Значение(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) 
	|					И РасходЗаПредПериод.ОбъемМГВОборот <> 0
	|			ТОГДА ЕСТЬNULL(РасходЗаПредПериод.ОбъемМГВОборот, 0)
	|		КОГДА РасходЗаПредПериод.СпособДосчётаРесурса = Значение(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) 
	|					И РасходЗаПредПериод.ОбъемМГВОборот = 0
	|			ТОГДА ЕСТЬNULL(РасходЗаПредПериод.ОбъемУслугиОборот, 0) КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПредоставленныеПоказанияПредПериод.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовШтатнойРаботыПУОборот, 0),
	|	ЕСТЬNULL(РасходЗаПредПериод.КоличествоЧасовРаботыТУОборот, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0),
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ЗарегистрированныйОбъем, -1),
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.КоличествоЧасовРаботыТУ, 0),
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.КоличествоЧасовШтатнойРаботыПУ, 0),
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ЗарегистрированныйОбъемПоПрибору, 0),
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.ОбъемМГВ, 0),
	|	ЕСТЬNULL(ЗарегистрированныеОбъемы.СпособНачисления, Значение(Перечисление.энргСпособНачислений.Пустаяссылка)),
	|	ВЫБОР
	|		КОГДА ЗарегистрированныеОбъемы.ТочкаУчета ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга,
	|	Периоды.РасчетПоФактическомуПотреблению,
	|	Периоды.ДиаметрСечения,
	|	ЕСТЬNULL(НормаСкоростиДвиженияВоды.СкоростьДвижения, 0)";   	
	
	Если РасчетПоФормуле тогда
		Текст = СтрЗаменить(Текст,
		"И НЕ Периоды.РасчетПоФормуле",
		" И (Периоды.РасчетПоФормуле  ИЛИ НЕ Периоды.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))");
	КонецЕсли; 
		
	Возврат Текст;
	
КонецФункции

Функция ТекстРассчитатьИндивидуальныйОбъемПотребленияНП(); 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 1
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 2
	|			ИНАЧЕ 3
	|		КОНЕЦ) КАК Приоритет
	|ПОМЕСТИТЬ ПриоритетНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0
	|	И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|			ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга
	|ПОМЕСТИТЬ НедопускПУККомУчету
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВышедшийДопускПриборовККомУчету КАК ВышедшийДопускПриборовККомУчету
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ВышедшийДопускПриборовККомУчету.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ВышедшийДопускПриборовККомУчету.Район
	|			И ДанныеДляРасчетаПередНормой.Договор = ВышедшийДопускПриборовККомУчету.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ВышедшийДопускПриборовККомУчету.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ВышедшийДопускПриборовККомУчету.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.ПриборУчета = ВышедшийДопускПриборовККомУчету.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ТочкиНачисленияНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ПриоритетНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Договор = ПриоритетНормы.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ПриоритетНормы.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ПриоритетНормы.ТочкаУчета
	|			И (ДанныеДляРасчетаПередНормой.КоэффициентРасчета <= 0)
	|			И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 1
	|					ТОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|							И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				КОГДА ПриоритетНормы.Приоритет = 2
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.НомерПозиции) КАК НомерПозиции,
	|	ДанныеДляРасчетаПередНормой.ДоговорЗаключен КАК ДоговорЗаключен,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	|	ДанныеДляРасчетаПередНормой.УслугаПодключена КАК УслугаПодключена,
	|	ДанныеДляРасчетаПередНормой.УзелУчетаВведен КАК УзелУчетаВведен,
	|	ДанныеДляРасчетаПередНормой.ПриборВведен КАК ПриборВведен,
	|	ДанныеДляРасчетаПередНормой.УзелУчета КАК УзелУчета,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ЗначениеМесячнойНагрузки) КАК ЗначениеМесячнойНагрузки,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДанныеДляРасчетаПередНормой.ДатаПоверки КАК ДатаПоверки,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета) КАК ЗависимаяТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеДляРасчетаПередНормой.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ДанныеДляРасчетаПередНормой.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	ДанныеДляРасчетаПередНормой.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ЗначениеНормативаЗаДень) КАК ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчетаПередНормой.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчетаПередНормой.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчетаПередНормой.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	|	ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДанныеДляРасчетаПередНормой.КлючНорматива КАК КлючНорматива,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения) КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчетаПередНормой.Поставщик КАК Поставщик,
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная) КАК Шкала,
	|	ДанныеДляРасчетаПередНормой.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ДанныеДляРасчетаПередНормой.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчетаПередНормой.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.НачПок) КАК НачПок,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КонПок) КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания) КАК МаксимальноВозможныеПоказания,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КоэффициентСезоности) КАК КоэффициентСезоности,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КоэффициентСезоностиОбъемПотребленный) КАК КоэффициентСезоностиОбъемПотребленный,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КоэффициентНорматива) КАК КоэффициентНорматива,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КоэффициентНормативаДляФакта) КАК КоэффициентНормативаДляФакта,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ГарантированныйОбъем) КАК ГарантированныйОбъем,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.СреднемесячнаяТемпература) КАК СреднемесячнаяТемпература,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха) КАК ПроектнаяТемператураНаружногоВоздуха,
	|	ДанныеДляРасчетаПередНормой.ТипСхемыГВС КАК ТипСхемыГВС,
	|	ДанныеДляРасчетаПередНормой.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	|	ДанныеДляРасчетаПередНормой.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ДанныеДляРасчетаПередНормой.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ДанныеДляРасчетаПередНормой.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ДанныеДляРасчетаПередНормой.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	ДанныеДляРасчетаПередНормой.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботы) КАК КоличествоЧасовРаботы,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ТемпературныйКоэффициентПоВоде) КАК ТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоде КАК бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчетаПередНормой.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	ДанныеДляРасчетаПередНормой.ОтопительныйПериод КАК ОтопительныйПериод,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.РасходЗаПредыдущийПериод) КАК РасходЗаПредыдущийПериод,
	|	ДанныеДляРасчетаПередНормой.НаличиеПоказанийЗаПредПериод КАК НаличиеПоказанийЗаПредПериод,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ВремяШтатнойРаботыПУЗаПредыдущийПериод) КАК ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботыТУЗаПредыдущийПериод) КАК КоличествоЧасовРаботыТУЗаПредыдущийПериод,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ПлощадьМОП) КАК ПлощадьМОП,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ЗарегистрированныйОбъем) КАК ЗарегистрированныйОбъем,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ЗарегистрированныйОбъемПоПрибору) КАК ЗарегистрированныйОбъемПоПрибору,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема) КАК НаличиеЗарегистрированногоОбъема,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ОбъемМГВ) КАК ОбъемМГВ,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КолЧасовРаботыТУЗарегОбъем) КАК КолЧасовРаботыТУЗарегОбъем, 
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.КоличествоЧасовШтатнойРаботыПУЗарегОбъем) КАК КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.РасчетПоФактическомуПотреблению) КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчетаПередНормой.ИндивидуальнаяСезонность КАК ИндивидуальнаяСезонность,
	|	ДанныеДляРасчетаПередНормой.УзелУчета КАК ПриборУчета,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.СпособНачисления) КАК СпособНачисления,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ДиаметрСечения) КАК ДиаметрСечения,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.СкоростьДвижения) КАК СкоростьДвижения
	|ПОМЕСТИТЬ ДанныеДляРасчетаГруппировкаПоУзлу
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоПУВУзлеУчета КАК КоличествоПУВУзлеУчета
	|		ПО ДанныеДляРасчетаПередНормой.Организация = КоличествоПУВУзлеУчета.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = КоличествоПУВУзлеУчета.Район
	|			И ДанныеДляРасчетаПередНормой.Договор = КоличествоПУВУзлеУчета.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = КоличествоПУВУзлеУчета.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = КоличествоПУВУзлеУчета.ТочкаУчета
	|			И (КоличествоПУВУзлеУчета.КоличествоПУ > 1)
	|ГДЕ
	//|	ДанныеДляРасчетаПередНормой.УзелУчетаВведен
	|	ДанныеДляРасчетаПередНормой.ПриборВведен
	//|	И НЕ ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.Договор,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета,
	//  |	ДанныеДляРасчетаПередНормой.НомерПозиции,
	|	ДанныеДляРасчетаПередНормой.ДоговорЗаключен,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчетаПодключен,
	|	ДанныеДляРасчетаПередНормой.УслугаПодключена,
	|	ДанныеДляРасчетаПередНормой.УзелУчетаВведен,
	|	ДанныеДляРасчетаПередНормой.ПриборВведен,
	|	ДанныеДляРасчетаПередНормой.УзелУчета,
	// |	ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.КоэффициентРасчета,
	|	ДанныеДляРасчетаПередНормой.РасчетПоФормуле,
	|	ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива,
	|	ДанныеДляРасчетаПередНормой.КлючНорматива,
	|	ДанныеДляРасчетаПередНормой.Поставщик,
	|	ДанныеДляРасчетаПередНормой.НетВозможностьУстановкиПУ,
	|	ДанныеДляРасчетаПередНормой.СоставнаяУслуга,
	|	ДанныеДляРасчетаПередНормой.ФормулаРасчета,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ТипСхемыГВС,
	|	ДанныеДляРасчетаПередНормой.УчаствуетВДолевойСхеме,
	|	ДанныеДляРасчетаПередНормой.СпособРаспределенияОбъемаДолевойТУ,
	|	ДанныеДляРасчетаПередНормой.СпособРаспределенияОстаткаДолевыеСхемы,
	|	ДанныеДляРасчетаПередНормой.РасчетИндивидуальногоПотребления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентДолевогоРаспределения,
	|	ДанныеДляРасчетаПередНормой.СхемаРасчетаПриВыходеПУ,
	|	ДанныеДляРасчетаПередНормой.ВидТепловогоПункта,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчетаПередНормой.СпособДосчётаРесурса,
	|	ДанныеДляРасчетаПередНормой.ОтопительныйПериод,
	|	ДанныеДляРасчетаПередНормой.НаличиеПоказанийЗаПредПериод,
	|	ДанныеДляРасчетаПередНормой.ИндивидуальнаяСезонность,
	|	ДанныеДляРасчетаПередНормой.ТепловаяСоставляющая,
	|	ДанныеДляРасчетаПередНормой.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчетаПередНормой.МенялосьСостояниеФормулы,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяГруппа,
	|	ДанныеДляРасчетаПередНормой.ДатаПоверки,
	|	ДанныеДляРасчетаПередНормой.ДатаСостоянияПрибора,
	|	ДанныеДляРасчетаПередНормой.МенялосьСостояниеПУ,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.УзелУчета
	|;  
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","ДанныеДляРасчетаПередНормой","ЧастьУзлаУчета,НомерПозции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор,ФиксированныйОбъем",Истина,Ложь) + "	
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.УзелУчета КАК УзелУчета,
	|	ЛОЖЬ КАК УзелУчетаВведен,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ДанныеДляРасчетаПередНормой.КонПок КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок
	|	КОНЕЦ КАК ПоказанияВСрок,
	|	ВЫБОР
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента
	|	КОНЕЦ КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ДанныеДляРасчетаПЕредНормой,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслугиЗакрытаяСхема,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоностиОбъемПотребленный КАК КоэффициентСезоностиОбъемПотребленный,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.КоэффициентРасчета = 1
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ТочкиНачисленияНормы.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчетаПередНормой.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература,
	|	ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха КАК ПроектнаяТемператураНаружногоВоздуха,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНормативаДляФакта КАК КоэффициентНормативаДляФакта,
	//|	ДанныеДляРасчетаПередНормой.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	ЕСТЬNULL(ЗначенияПовышающихКоэффициентов.Коэффициент, 1) КАК ПовышающийКоэффициент,
	|	ВЫБОР
	|		КОГДА НЕ НастройкиГВСЗависимаяУслуга.Услуга ЕСТЬ NULL
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетГВС,
	|   ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|   ДанныеДляРасчетаПередНормой.СпособДосчётаРесурса,
	|	РасположениеТУОтносительноГБП.ГБП КАК ГБП,
	|	ЕСТЬNULL(ДанныеДляРасчетаПередНормой.Услуга.СодержитПотери, ЛОЖЬ) КАК СодержитПотери,
	|	ДанныеДляРасчетаПередНормой.ТемпературныйКоэффициентПоВоде КАК ТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчетаПередНормой.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ВЫБОР
	|		КОГДА НастройкиГВСЗависимаяУслуга.Услуга ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УслугаСОбратнымРасчетом,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураПодачиИсточника, 0) КАК ТемператураПодачиИсточника,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0) КАК ТемператураХолоднойВодыИсточника,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.Плотность, 1) КАК Плотность,
	|	ЕСТЬNULL(ДанныеДляРасчетаПередНормой.РасходЗаПредыдущийПериод,0) КАК РасходЗаПредыдущийПериод,
	|	ДанныеДляРасчетаПередНормой.НаличиеПоказанийЗаПредПериод КАК НаличиеПоказанийЗаПредПериод,
	|	ДанныеДляРасчетаПередНормой.ВремяШтатнойРаботыПУЗаПредыдущийПериод КАК ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботыТУЗаПредыдущийПериод КАК КоличествоЧасовРаботыТУЗаПредыдущийПериод,
	|	ВЫБОР КОГДА ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботы = 24 ТОГДА РАЗНОСТЬДАТ(ДанныеДляРасчетаПередНормой.НачалоПериода, ДанныеДляРасчетаПередНормой.КонецПериода, ЧАС) ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчетаПередНормой.КоличествоЧасовРаботы КОНЕЦ КАК КоличествоЧасовПредоставленияУслуги,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчетаПередНормой.ЗарегистрированныйОбъем КАК ЗарегистрированныйОбъем,
	|	ДанныеДляРасчетаПередНормой.ЗарегистрированныйОбъемПоПрибору КАК ЗарегистрированныйОбъемПоПрибору,
	|	ДанныеДляРасчетаПередНормой.ОбъемМГВ КАК ОбъемМГВ,
	|	ДанныеДляРасчетаПередНормой.КолЧасовРаботыТУЗарегОбъем КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчетаПередНормой.КоличествоЧасовШтатнойРаботыПУЗарегОбъем КАК КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения <> ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха
	|			ТОГДА (ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения - ДанныеДляРасчетаПередНормой.СреднемесячнаяТемпература) / (ДанныеДляРасчетаПередНормой.ТемператураВнутриПомещения - ДанныеДляРасчетаПередНормой.ПроектнаяТемператураНаружногоВоздуха)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТемпературныйКоэффициентПоВоздуху,
	|	ВЫБОР
	|		КОГДА ТемпературыПодачиИзСуточнойВедомости.ПриборУчета ЕСТЬ NULL
	|			ТОГДА (ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураПодачиИсточника, 0) - ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0)) / 1000
	|		ИНАЧЕ (ЕСТЬNULL(ТемпературыПодачиИзСуточнойВедомости.ЗначениеПараметра, 0) - ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0)) / 1000
	|	КОНЕЦ КАК РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчетаПередНормой.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка) КАК ЯвляетсяОтдельностоящим,
	|	ЕСТЬNULL(ТемперКоэффициентПоВоздухуПред.ТемпературныйКоэффициентПоВоздухуПред,0) КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаПередНормой.НаличиеЗарегистрированногоОбъема КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчетаПередНормой.СпособНачисления КАК СпособНачисления,
	|	ДанныеДляРасчетаПередНормой.СкоростьДвижения КАК СкоростьДвижения,
	|	ЕСТЬNULL(ТарифныеКатегориии.ТарифнаяКатегория, Значение(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ТарифнаяКатегория
	|ПОМЕСТИТЬ ДанныеДляРасчета
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормы КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ТочкиНачисленияНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.Договор = ТочкиНачисленияНормы.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТочкиНачисленияНормы.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.ЗависимыеУслуги КАК энргВидыУслугЗависимыеУслуги
	|		ПО ДанныеДляРасчетаПередНормой.СоставнаяУслуга = энргВидыУслугЗависимыеУслуги.Ссылка
	|			И ДанныеДляРасчетаПередНормой.Услуга = энргВидыУслугЗависимыеУслуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ДанныеДляРасчетаПередНормой.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			И ВЫБОР
	|				КОГДА ДанныеДляРасчетаПередНормой.ОбъектРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА ЗначенияТекущихНормПотребления.ТН_Норматива = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.НежилыеПомещения)
	|				ИНАЧЕ ЗначенияТекущихНормПотребления.ТН_Норматива = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|			  КОНЕЦ 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияПовышающихКоэффициентов.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияПовышающихКоэффициентов.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасположениеТУОтносительноГБП КАК РасположениеТУОтносительноГБП
	|		ПО ДанныеДляРасчетаПередНормой.Организация = РасположениеТУОтносительноГБП.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = РасположениеТУОтносительноГБП.Район
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = РасположениеТУОтносительноГБП.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиГВС КАК НастройкиГВСЗависимаяУслуга
	|		ПО (ДанныеДляРасчетаПередНормой.Организация = НастройкиГВСЗависимаяУслуга.Организация)
	|			И (ДанныеДляРасчетаПередНормой.Район = НастройкиГВСЗависимаяУслуга.Район)
	|			И (ДанныеДляРасчетаПередНормой.Услуга = НастройкиГВСЗависимаяУслуга.ЗависитОтУслуги)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиГВС КАК НастройкиГВС
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НастройкиГВС.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НастройкиГВС.Район
	|			И ДанныеДляРасчетаПередНормой.Услуга = НастройкиГВС.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыИсточникаТочекУчета КАК ТемпературыИсточникаТочекУчета
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТемпературыИсточникаТочекУчета.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ТемпературыИсточникаТочекУчета.Район
	|			И ДанныеДляРасчетаПередНормой.Договор = ТемпературыИсточникаТочекУчета.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТемпературыИсточникаТочекУчета.ОбъектРасчета
	|			 И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТемпературыИсточникаТочекУчета.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыПодачиИзСуточнойВедомости КАК ТемпературыПодачиИзСуточнойВедомости
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТемпературыПодачиИзСуточнойВедомости.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ТемпературыПодачиИзСуточнойВедомости.Район
	|			И ДанныеДляРасчетаПередНормой.Договор = ТемпературыПодачиИзСуточнойВедомости.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТемпературыПодачиИзСуточнойВедомости.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.УзелУчета = ТемпературыПодачиИзСуточнойВедомости.УзелУчета
	|			И ДанныеДляРасчетаПередНормой.ПриборУчета = ТемпературыПодачиИзСуточнойВедомости.ПриборУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоПУВУзлеУчета КАК КоличествоПУВУзлеУчета
	|		ПО ДанныеДляРасчетаПередНормой.Организация = КоличествоПУВУзлеУчета.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = КоличествоПУВУзлеУчета.Район
	|			И ДанныеДляРасчетаПередНормой.Договор = КоличествоПУВУзлеУчета.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = КоличествоПУВУзлеУчета.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = КоличествоПУВУзлеУчета.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.Услуга = КоличествоПУВУзлеУчета.Услуга
	|			И (КоличествоПУВУзлеУчета.КоличествоПУ <= 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемперКоэффициентПоВоздухуПред КАК ТемперКоэффициентПоВоздухуПред
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТемперКоэффициентПоВоздухуПред.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ТемперКоэффициентПоВоздухуПред.Район
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТемперКоэффициентПоВоздухуПред.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НедопускПУККомУчету КАК НедопускПУККомУчету
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НедопускПУККомУчету.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НедопускПУККомУчету.Район
	|			И ДанныеДляРасчетаПередНормой.Договор = НедопускПУККомУчету.Договор
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = НедопускПУККомУчету.ОбъектРасчета
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = НедопускПУККомУчету.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = НедопускПУККомУчету.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифныеКатегориии КАК ТарифныеКатегориии
	|		ПО ДанныеДляРасчетаПередНормой.Услуга = ТарифныеКатегориии.Услуга
	|			И ДанныеДляРасчетаПередНормой.Договор = ТарифныеКатегориии.Договор
	|			И ДанныеДляРасчетаПередНормой.Район = ТарифныеКатегориии.Район
	|			И ДанныеДляРасчетаПередНормой.Организация = ТарифныеКатегориии.Организация
	|			И ДанныеДляРасчетаПередНормой.ОбъектРасчета = ТарифныеКатегориии.ОбъектРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаГруппировкаПоУзлу.Организация,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПериодНачисления,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.Район,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.МКД,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.Договор,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.Услуга,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ТочкаУчета,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.НомерПозиции,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ДоговорЗаключен,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчетаПодключен,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.УслугаПодключена,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПриборВведен,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПриборУчета,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗначениеНагрузки,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗначениеПлощади,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ТарифнаяГруппа,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ДатаПоверки,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоэффициентРасчета,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ДатаСостоянияПрибора,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.МенялосьСостояниеПУ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.МенялосьСостояниеФормулы,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.РасчетПоФормуле,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ТепловаяСоставляющая,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СпособРасчетаНорматива,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КлючНорматива,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.Поставщик,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.Шкала,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.НетВозможностьУстановкиПУ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СоставнаяУслуга,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ФормулаРасчета,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ТипСхемыГВС,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ВидТепловогоПункта,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗначениеМесячнойНагрузки,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.УчаствуетВДолевойСхеме,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СпособРаспределенияОбъемаДолевойТУ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СпособРаспределенияОстаткаДолевыеСхемы,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.РасчетИндивидуальногоПотребления,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоличествоЧасовРаботы,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоэффициентДолевогоРаспределения,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СхемаРасчетаПриВыходеПУ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ИндивидуальнаяСезонность,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ДиаметрСечения,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.НачалоПериода,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КонецПериода,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.УзелУчета,
	|	ИСТИНА,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ВидДифференцированности,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ТарифнаяЗона,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПривязанаКШкале,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.НачПок,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КонПок,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0),
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СреднийОбъем,
	|	ВЫБОР
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаГруппировкаПоУзлу.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчетаГруппировкаПоУзлу.ПоказанияВСрок
	|	КОНЕЦ КАК ПоказанияВСрок,
	|	ВЫБОР
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаГруппировкаПоУзлу.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчетаГруппировкаПоУзлу.ЕстьПоказанияАбонента
	|	КОНЕЦ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ВыводПрибораУчета,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПоказанияПредоставлены,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслугиЗакрытаяСхема,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ДокументНачисления,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоэффициентСезоности,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоэффициентСезоностиОбъемПотребленный,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.НеПрименятьСезонность,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ВидПлощади,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаГруппировкаПоУзлу.КоэффициентРасчета = 1
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ТочкиНачисленияНормы.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаГруппировкаПоУзлу.НаличиеЗарегистрированногоОбъема
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ДнейВПериоде,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СледующийРегистратор,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ГарантированныйОбъем,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ТемператураВнутриПомещения,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СреднемесячнаяТемпература,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПроектнаяТемператураНаружногоВоздуха,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоэффициентНорматива,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоэффициентНормативаДляФакта,
	|	ЕСТЬNULL(ЗначенияПовышающихКоэффициентов.Коэффициент, 1),
	|	ВЫБОР
	|		КОГДА НЕ НастройкиГВСЗависимаяУслуга.Услуга ЕСТЬ NULL
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СпособДосчётаРесурса,
	|	РасположениеТУОтносительноГБП.ГБП,
	|	ЕСТЬNULL(ДанныеДляРасчетаГруппировкаПоУзлу.Услуга.СодержитПотери, ЛОЖЬ),
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.бестИспользоватьТемпературныйКоэффициентПоВоздуху,
	|	ВЫБОР
	|		КОГДА НастройкиГВСЗависимаяУслуга.Услуга ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураПодачиИсточника, 0),
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0),
	|	ЕСТЬNULL(ТемпературыИсточникаТочекУчета.Плотность, 1),
	|	ЕСТЬNULL(ДанныеДляРасчетаГруппировкаПоУзлу.РасходЗаПредыдущийПериод, 0),
	|	ДанныеДляРасчетаГруппировкаПоУзлу.НаличиеПоказанийЗаПредПериод,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ВремяШтатнойРаботыПУЗаПредыдущийПериод,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоличествоЧасовРаботыТУЗаПредыдущийПериод,
	|	ВЫБОР КОГДА ДанныеДляРасчетаГруппировкаПоУзлу.КоличествоЧасовРаботы = 24 ТОГДА РАЗНОСТЬДАТ(ДанныеДляРасчетаГруппировкаПоУзлу.НачалоПериода, ДанныеДляРасчетаГруппировкаПоУзлу.КонецПериода, ЧАС) ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчетаГруппировкаПоУзлу.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчетаГруппировкаПоУзлу.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчетаГруппировкаПоУзлу.КоличествоЧасовРаботы КОНЕЦ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗарегистрированныйОбъем,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ЗарегистрированныйОбъемПоПрибору,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.ОбъемМГВ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.НаличиеЗарегистрированногоОбъема,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаГруппировкаПоУзлу.ТемператураВнутриПомещения <> ДанныеДляРасчетаГруппировкаПоУзлу.ПроектнаяТемператураНаружногоВоздуха
	|			ТОГДА (ДанныеДляРасчетаГруппировкаПоУзлу.ТемператураВнутриПомещения - ДанныеДляРасчетаГруппировкаПоУзлу.СреднемесячнаяТемпература) / (ДанныеДляРасчетаГруппировкаПоУзлу.ТемператураВнутриПомещения - ДанныеДляРасчетаГруппировкаПоУзлу.ПроектнаяТемператураНаружногоВоздуха)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТемпературыПодачиИзСуточнойВедомости.ПриборУчета ЕСТЬ NULL
	|			ТОГДА (ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураПодачиИсточника, 0) - ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0)) / 1000
	|		ИНАЧЕ (ЕСТЬNULL(ТемпературыПодачиИзСуточнойВедомости.ЗначениеПараметра, 0) - ЕСТЬNULL(ТемпературыИсточникаТочекУчета.ТемператураХолоднойВодыИсточника, 0)) / 1000
	|	КОНЕЦ,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка),
	|	ЕСТЬNULL(ТемперКоэффициентПоВоздухуПред.ТемпературныйКоэффициентПоВоздухуПред,0) КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	НЕ НедопускПУККомУчету.Услуга ЕСТЬ NULL И НЕ ДанныеДляРасчетаГруппировкаПоУзлу.НаличиеЗарегистрированногоОбъема КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СпособНачисления,
	|	ДанныеДляРасчетаГруппировкаПоУзлу.СкоростьДвижения КАК СкоростьДвижения,
	|	ЕСТЬNULL(ТарифныеКатегориии.ТарифнаяКатегория, Значение(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ТарифнаяКатегория
	|ИЗ
	|	ДанныеДляРасчетаГруппировкаПоУзлу КАК ДанныеДляРасчетаГруппировкаПоУзлу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормы КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.МКД = ТочкиНачисленияНормы.МКД
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Договор = ТочкиНачисленияНормы.Договор
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета = ТочкиНачисленияНормы.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.ЗависимыеУслуги КАК энргВидыУслугЗависимыеУслуги
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.СоставнаяУслуга = энргВидыУслугЗависимыеУслуги.Ссылка
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = энргВидыУслугЗависимыеУслуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			И ВЫБОР
	|				КОГДА ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА ЗначенияТекущихНормПотребления.ТН_Норматива = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.НежилыеПомещения)
	|				ИНАЧЕ ЗначенияТекущихНормПотребления.ТН_Норматива = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|			  КОНЕЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ПериодНачисления = ЗначенияПовышающихКоэффициентов.ПериодНачисления
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = ЗначенияПовышающихКоэффициентов.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасположениеТУОтносительноГБП КАК РасположениеТУОтносительноГБП
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = РасположениеТУОтносительноГБП.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = РасположениеТУОтносительноГБП.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ТочкаУчета = РасположениеТУОтносительноГБП.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиГВС КАК НастройкиГВСЗависимаяУслуга
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = НастройкиГВСЗависимаяУслуга.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = НастройкиГВСЗависимаяУслуга.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = НастройкиГВСЗависимаяУслуга.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиГВС КАК НастройкиГВС
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = НастройкиГВС.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = НастройкиГВС.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = НастройкиГВС.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыИсточникаТочекУчета КАК ТемпературыИсточникаТочекУчета
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = ТемпературыИсточникаТочекУчета.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = ТемпературыИсточникаТочекУчета.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Договор = ТемпературыИсточникаТочекУчета.Договор
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета = ТемпературыИсточникаТочекУчета.ОбъектРасчета
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ТочкаУчета = ТемпературыИсточникаТочекУчета.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыПодачиИзСуточнойВедомости КАК ТемпературыПодачиИзСуточнойВедомости
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = ТемпературыПодачиИзСуточнойВедомости.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = ТемпературыПодачиИзСуточнойВедомости.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Договор = ТемпературыПодачиИзСуточнойВедомости.Договор
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета = ТемпературыПодачиИзСуточнойВедомости.ОбъектРасчета
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.УзелУчета = ТемпературыПодачиИзСуточнойВедомости.УзелУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемперКоэффициентПоВоздухуПред КАК ТемперКоэффициентПоВоздухуПред
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = ТемперКоэффициентПоВоздухуПред.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = ТемперКоэффициентПоВоздухуПред.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета = ТемперКоэффициентПоВоздухуПред.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НедопускПУККомУчету КАК НедопускПУККомУчету
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Организация = НедопускПУККомУчету.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = НедопускПУККомУчету.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Договор = НедопускПУККомУчету.Договор
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета = НедопускПУККомУчету.ОбъектРасчета
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ПериодНачисления = НедопускПУККомУчету.ПериодНачисления
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = НедопускПУККомУчету.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифныеКатегориии КАК ТарифныеКатегориии
	|		ПО ДанныеДляРасчетаГруппировкаПоУзлу.Услуга = ТарифныеКатегориии.Услуга
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Договор = ТарифныеКатегориии.Договор
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Район = ТарифныеКатегориии.Район
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.Организация = ТарифныеКатегориии.Организация
	|			И ДанныеДляРасчетаГруппировкаПоУзлу.ОбъектРасчета = ТарифныеКатегориии.ОбъектРасчета
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ДанныеДляРасчета.Организация КАК Организация,
	|ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|ДанныеДляРасчета.Район КАК Район,
	|ДанныеДляРасчета.Договор КАК Договор,
	|ДанныеДляРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|ДанныеДляРасчета.ЗначениеНагрузки КАК ЗначениеНагрузки
	|ПОМЕСТИТЬ ВТ_ПропорциональноНагрузке
	|ИЗ
	|ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПропорциональноНагрузке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПропорциональноНагрузке.Организация КАК Организация,
	|ВТ_ПропорциональноНагрузке.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ПропорциональноНагрузке.Район КАК Район,
	|	ВТ_ПропорциональноНагрузке.Договор КАК Договор,
	|	ВТ_ПропорциональноНагрузке.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ПропорциональноНагрузке.ТочкаУчета КАК ТочкаУчета,
	|	СУММА(ВТ_ПропорциональноНагрузке.ЗначениеНагрузки) КАК ЗначениеНагрузки
	|ПОМЕСТИТЬ ВТ_СуммарнаяНагрузка
	|ИЗ
	|	ВТ_ПропорциональноНагрузке КАК ВТ_ПропорциональноНагрузке
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПропорциональноНагрузке.Организация,
	|	ВТ_ПропорциональноНагрузке.ПериодНачисления,
	|	ВТ_ПропорциональноНагрузке.Район,
	|	ВТ_ПропорциональноНагрузке.Договор,
	|	ВТ_ПропорциональноНагрузке.ОбъектРасчета,
	|	ВТ_ПропорциональноНагрузке.ТочкаУчета
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация КАК Организация,
	|	ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчета.Район КАК Район,
	|	ДанныеДляРасчета.Договор КАК Договор,
	|	ДанныеДляРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчета.МКД КАК МКД,
	|	ДанныеДляРасчета.Услуга КАК Услуга,
	|	ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета КАК УзелУчета,
	|	ДанныеДляРасчета.Шкала КАК Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен КАК ПриборВведен,
	|	ДанныеДляРасчета.ЗависитОтУслугиЗакрытаяСхема КАК ЗависитОтУслугиЗакрытаяСхема,
	|	ВЫБОР КОГДА НЕ ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА 
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема И ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|				ТОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем * ВЫБОР
	|					КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем <> 0 ИЛИ ДанныеДляРасчета.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|						ТОГДА 1
	|					ИНАЧЕ
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде)
	| КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|						ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|					ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) конец иначе 0 конец КАК ОбъемУслугиПотребленный,
	//|	ВЫБОР КОГДА  ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА 
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема И ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|				ТОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем * ВЫБОР
	|					КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем <> 0 ИЛИ ДанныеДляРасчета.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|						ТОГДА 1
	|					ИНАЧЕ
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде)
	| КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|						ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|					ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) конец КАК ОбъемУслуги,
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема И ДанныеДляРасчета.ЗарегистрированныйОбъемПоПрибору >= 0
	|				ТОГДА ДанныеДляРасчета.ЗарегистрированныйОбъемПоПрибору 
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|						ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|					ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 6)) конец КАК ОбъемПоПрибору,
	|	ВЫБОР КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема ТОГДА ДанныеДляРасчета.СпособНачисления ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КОНЕЦ КАК СпособНачисления,
	|	ДанныеДляРасчета.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчета.НачПок КАК НачальныеПоказания,
	|	ДанныеДляРасчета.КонПок КАК КонечныеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДляРасчета.РасчетПоФормуле
	|	КОНЕЦ КАК РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления КАК НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ЗарегистрированныйОбъем >= 0
	|			ТОГДА """"
	|		ИНАЧЕ ДанныеДляРасчета.ФормулаРасчета
	|	КОНЕЦ КАК ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	1 КАК ПовыщающийКоэффициент,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПропорциональноНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СуммарнаяНагрузка.ТочкаУчета ЕСТЬ NULL
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ_СуммарнаяНагрузка.ЗначениеНагрузки = 0
	|								ТОГДА 0
	|							ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.ЗначениеНагрузки / ВТ_СуммарнаяНагрузка.ЗначениеНагрузки КАК ЧИСЛО(15, 6))
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентПропорциональности,
	|	0 КАК ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП КАК ГБП,
	|	ДанныеДляРасчета.СодержитПотери КАК СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом КАК УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем КАК КоличествоЧасовШтатнойРаботыПУ,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде КАК бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху КАК ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев КАК РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ КАК ОбъемМГВ,
	|	ВЫБОР КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0 ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем КОНЕЦ КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория КАК ТарифнаяКатегория
	|	ПОМЕСТИТЬ ПредварительныйРасчет
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиШкалПриборовУчетаНП.СрезПоследних КАК бестУслугиШкалПриборовУчетаНПСрезПоследних
	|		ПО ДанныеДляРасчета.Организация = бестУслугиШкалПриборовУчетаНПСрезПоследних.Организация
	|			И ДанныеДляРасчета.ТочкаУчета = бестУслугиШкалПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ДанныеДляРасчета.ПриборУчета = бестУслугиШкалПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И ДанныеДляРасчета.Услуга = бестУслугиШкалПриборовУчетаНПСрезПоследних.Услуга
	|			И ДанныеДляРасчета.Шкала = бестУслугиШкалПриборовУчетаНПСрезПоследних.Шкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммарнаяНагрузка КАК ВТ_СуммарнаяНагрузка
	|		ПО ДанныеДляРасчета.Организация = ВТ_СуммарнаяНагрузка.Организация
	|			И ДанныеДляРасчета.ТочкаУчета = ВТ_СуммарнаяНагрузка.ТочкаУчета
	|			И ДанныеДляРасчета.ОбъектРасчета = ВТ_СуммарнаяНагрузка.ОбъектРасчета
	|ГДЕ
	//|	ДанныеДляРасчета.УзелУчетаВведен
	|	ДанныеДляРасчета.ПриборВведен
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.НедопускПУККоммерческомуУчету
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|				ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,	
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляРасчета.ЗависитОтУслуги	
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,	
	|   ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляРасчета.ЗависитОтУслугиЗакрытаяСхема	
	|	КОНЕЦ КАК ЗависитОтУслугиЗакрытаяСхема,
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоности ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|			ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху  ТОГДА
	| ВЫБОР КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	| ИНАЧЕ 0
	| КОНЕЦ 
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде 
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентНорматива ИНАЧЕ ДанныеДляРасчета.КоэффициентНормативаДляФакта  КОНЕЦ * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ конец,
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе Выбор когда НЕ ДанныеДляРасчета.НеПрименятьСезонность или ДанныеДляРасчета.Договор.ТипДоговора <> Значение(Перечисление.бестТипыДоговоров.УправляющаяКомпания) Тогда ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|			ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху  ТОГДА
	| ВЫБОР КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	| ИНАЧЕ 0
	| КОНЕЦ 
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде 
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ  * ДанныеДляРасчета.НормаПотребления * ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентНормативаДляФакта ИНАЧЕ ДанныеДляРасчета.КоэффициентНорматива КОНЕЦ * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ иначе 0 конец конец,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.ПовышающийКоэффициент = -1
	|				И НЕ ДанныеДляРасчета.НетВозможностьУстановкиПУ
	|			ТОГДА ДанныеДляРасчета.ПовышающийКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ КАК ОбъемМГВ,
	|	ВЫБОР КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0 ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем КОНЕЦ КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|   НЕ ДанныеДляРасчета.ПриборВведен
	//|	И НЕ ДанныеДляРасчета.УзелУчетаВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЗависитОтУслугиЗакрытаяСхема КАК ЗависитОтУслугиЗакрытаяСхема,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоности ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ВЫБОР
	|								КОГДА ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод)
	|									ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|											КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|												ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|											КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|												ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|											ИНАЧЕ 1
	|										КОНЕЦ 
	|											ИНАЧЕ 1
	|										КОНЕЦ * ВЫБОР
	|											КОГДА ДанныеДляРасчета.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) и ДанныеДляРасчета.УзелУчетаВведен
	|													И ДанныеДляРасчета.ОбъемМГВ > 0
	|												ТОГДА 1000 / ДанныеДляРасчета.Плотность
	|											ИНАЧЕ 1
	|										КОНЕЦ * ВЫБОР
	|											КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|												ТОГДА ВЫБОР
	|														КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|															ТОГДА 0
	|														ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|													КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|				КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод = 0
	|								ТОГДА 0
	|							ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод / ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|						КОНЕЦ
	|				ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|						ИЛИ ДанныеДляРасчета.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|					ТОГДА ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ВЫБОР
	|								КОГДА ДанныеДляРасчета.СпособДосчётаРесурса <> ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод)
	|									ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|											КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|												ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|											КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|												ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|											ИНАЧЕ 1
	|										КОНЕЦ 
	|											ИНАЧЕ 1
	|										КОНЕЦ * ВЫБОР
	|											КОГДА ДанныеДляРасчета.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) и ДанныеДляРасчета.УзелУчетаВведен
	|													И ДанныеДляРасчета.ОбъемМГВ > 0
	|												ТОГДА 1000 / ДанныеДляРасчета.Плотность
	|											ИНАЧЕ 1
	|										КОНЕЦ * ВЫБОР
	|											КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|												ТОГДА ВЫБОР
	|														КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|															ТОГДА 0
	|														ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|													КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|							КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|								ТОГДА ВЫБОР
	|										КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|											ТОГДА ВЫБОР
	|													КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод = 0
	|														ТОГДА 0
	|													ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод / ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|												КОНЕЦ
	|										ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	"""",
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ КАК ОбъемМГВ,
	|	ВЫБОР КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0 ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем КОНЕЦ КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ВЫБОР
	|		КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|			ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод > 0
	|		КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|			ТОГДА ДанныеДляРасчета.НаличиеПоказанийЗаПредПериод
	|		ИНАЧЕ ДанныеДляРасчета.СреднийОбъем > 0
	|	КОНЕЦ
	|	И ДанныеДляРасчета.ПриборВведен
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	//|	И ДанныеДляРасчета.УзелУчетаВведен
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЗависитОтУслугиЗакрытаяСхема КАК ЗависитОтУслугиЗакрытаяСхема,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоности ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный КОНЕЦ * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|								КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|								КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|								ИНАЧЕ 1
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) и ДанныеДляРасчета.УзелУчетаВведен и ДанныеДляРасчета.ОбъемМГВ > 0
	|									ТОГДА 1000 / ДанныеДляРасчета.Плотность
	|								ИНАЧЕ 1
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|												ТОГДА 0
	|											ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ ,
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе  ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности КОНЕЦ *
	|		ВЫБОР КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|					ТОГДА ВЫРАЗИТЬ(ДанныеДляРасчета.РасходЗаПредыдущийПериод * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги / ВЫБОР
	|								КОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.ВремяШтатнойРаботыПУЗаПредыдущийПериод
	|								КОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод <> 0
	|									ТОГДА ДанныеДляРасчета.КоличествоЧасовРаботыТУЗаПредыдущийПериод
	|								ИНАЧЕ 1
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод) и ДанныеДляРасчета.УзелУчетаВведен и ДанныеДляРасчета.ОбъемМГВ > 0
	|									ТОГДА 1000 / ДанныеДляРасчета.Плотность
	|								ИНАЧЕ 1
	|							КОНЕЦ * ВЫБОР
	|								КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|									ТОГДА ВЫБОР
	|											КОГДА ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред = 0
	|												ТОГДА 0
	|											ИНАЧЕ ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху / ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздухуПред
	|										КОНЕЦ
	|								ИНАЧЕ 1
	|							КОНЕЦ КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) /  ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)) конец конец,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ КАК ОбъемМГВ,
	|	ВЫБОР КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0 ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем КОНЕЦ КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ВЫБОР 
	|		КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|			ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод > 0
	|		ИНАЧЕ ДанныеДляРасчета.СреднийОбъем > 0
	|	КОНЕЦ
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НеПрименятьСезонность
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляРасчета.ЗависитОтУслуги	
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЗависитОтУслугиЗакрытаяСхема КАК ЗависитОтУслугиЗакрытаяСхема,
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоности ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|			ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|									ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|								ИНАЧЕ 0
	|							КОНЕЦ
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ конец,
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе Выбор когда НЕ ДанныеДляРасчета.НеПрименятьСезонность или ДанныеДляРасчета.Договор.ТипДоговора <> Значение(Перечисление.бестТипыДоговоров.УправляющаяКомпания) Тогда ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|			ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|									ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|								ИНАЧЕ 0
	|							КОНЕЦ
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ иначе 0 конец конец,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ КАК ОбъемМГВ,
	|	ВЫБОР КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0 ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем КОНЕЦ КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	//|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|	И ВЫБОР
	|		КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	|			ТОГДА НЕ ДанныеДляРасчета.НаличиеПоказанийЗаПредПериод
	|		КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|			ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод = 0
	|		ИНАЧЕ ДанныеДляРасчета.СреднийОбъем = 0
	|	КОНЕЦ
	//|	И ДанныеДляРасчета.УзелУчетаВведен
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И НЕ ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|	И ВЫБОР
	|			КОГДА &РасчетПоФормуле
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.Договор,
	|	ДанныеДляРасчета.ОбъектРасчета,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляРасчета.ЗависитОтУслуги	
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.УзелУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЗависитОтУслугиЗакрытаяСхема КАК ЗависитОтУслугиЗакрытаяСхема,
	|	ВЫБОР КОГДА НЕ ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА 0 иначе выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе ДанныеДляРасчета.ЗначениеНагрузки * ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоности ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|			ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|									ТОГДА  (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|								ИНАЧЕ 0
	|							КОНЕЦ
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ КОНЕЦ КОНЕЦ,
	|	ВЫБОР КОГДА НЕ ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА 
	|	выбор когда ДанныеДляРасчета.Поставщик = ДанныеДляРасчета.Договор.Контрагент тогда 0 иначе ВЫБОР КОГДА ДанныеДляРасчета.РасчетПоФактическомуПотреблению ТОГДА ДанныеДляРасчета.КоэффициентСезоностиОбъемПотребленный ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоДиаметруСечения)
	|			ТОГДА ВЫРАЗИТЬ(0.785 * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.ДиаметрСечения * ДанныеДляРасчета.СкоростьДвижения * 0.000036 * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.НормативСНиП)
	|			ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) * ДанныеДляРасчета.ЗначениеНормативаЗаДень / 1000 КАК ЧИСЛО(15, 6))
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	|			ТОГДА ДанныеДляРасчета.ГарантированныйОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24)
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ТемператураВнутриПомещения <> ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха
	|									ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.СреднемесячнаяТемпература) / (ДанныеДляРасчета.ТемператураВнутриПомещения - ДанныеДляРасчета.ПроектнаяТемператураНаружногоВоздуха) * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|								ИНАЧЕ 0
	|							КОНЕЦ
	//|					КОГДА ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде
	//|						ТОГДА ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги * ДанныеДляРасчета.ТемпературныйКоэффициентПоВоде
	|					ИНАЧЕ ДанныеДляРасчета.ЗначениеНагрузки * ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги
	|				КОНЕЦ
	|		КОГДА ДанныеДляРасчета.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						ИНАЧЕ 1
	|					КОНЕЦ * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ЧАС), ЧАС) / ДанныеДляРасчета.ДнейВПериоде / 24) КАК ЧИСЛО(15, 6))
	|		ИНАЧЕ 0
	|	КОНЕЦ КОНЕЦ ИНАЧЕ 0 КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентРасчета,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления,
	|	ДанныеДляРасчета.ЗначениеНагрузки,
	|	ДанныеДляРасчета.ЗначениеНормативаЗаДень,
	|	ДанныеДляРасчета.ОбъектУчаствуетВРаспределенииМКД,
	|	ДанныеДляРасчета.СпособРасчетаНорматива,
	|	ДанныеДляРасчета.ТемператураВнутриПомещения,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	"""",
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	1,
	|	1,
	|	ДанныеДляРасчета.ПриоритетГВС,
	|	ДанныеДляРасчета.ГБП,
	|	ДанныеДляРасчета.СодержитПотери,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.УслугаСОбратнымРасчетом,
	|	ДанныеДляРасчета.ТемператураПодачиИсточника,
	|	ДанныеДляРасчета.ТемператураХолоднойВодыИсточника,
	|	ДанныеДляРасчета.КоличествоЧасовШтатнойРаботыПУЗарегОбъем,
	|	ДанныеДляРасчета.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ДанныеДляРасчета.бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	ДанныеДляРасчета.ТемпературныйКоэффициентПоВоздуху,
	|	ДанныеДляРасчета.РасчетныйНормативНаПодогрев,
	|	ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДанныеДляРасчета.ОбъемМГВ КАК ОбъемМГВ,
	|	ВЫБОР КОГДА ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем = 0 ТОГДА ДанныеДляРасчета.КоличествоЧасовПредоставленияУслуги ИНАЧЕ ДанныеДляРасчета.КолЧасовРаботыТУЗарегОбъем КОНЕЦ КАК КолЧасовРаботыТУЗарегОбъем,
	|	ДанныеДляРасчета.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ДанныеДляРасчета.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ДанныеДляРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеДляРасчета.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	 ДанныеДляРасчета.ПриборВведен
	|	И ВЫБОР 
	|		КОГДА ДанныеДляРасчета.ЯвляетсяОтдельностоящим
	|			ТОГДА ДанныеДляРасчета.РасходЗаПредыдущийПериод <= 0
	|		ИНАЧЕ ДанныеДляРасчета.СреднийОбъем <= 0 
	|	КОНЕЦ
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И НЕ ДанныеДляРасчета.НаличиеЗарегистрированногоОбъема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.Договор КАК Договор,
	|	ДанныеДляРасчетаПередНормой.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ТемпературныйКоэффициент)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриоритетСпособаРасчета,
	|	ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива КАК СпособРасчетаНорматива
	|ПОМЕСТИТЬ ПриоритетСпособаРасчетаНорматива
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредварительныйРасчет.Организация КАК Организация,
	|	ПредварительныйРасчет.ПериодНачисления КАК ПериодНачисления,
	|	ПредварительныйРасчет.Район КАК Район,
	|	ПредварительныйРасчет.МКД КАК МКД,
	|	ПредварительныйРасчет.Договор КАК Договор,
	|	ПредварительныйРасчет.ОбъектРасчета КАК ОбъектРасчета,
	|	ПредварительныйРасчет.Услуга КАК Услуга,
	|	ПредварительныйРасчет.ТочкаУчета КАК ТочкаУчета,
	|	ПредварительныйРасчет.ЗависитОтУслугиЗакрытаяСхема КАК ЗависитОтУслуги,
	|	ПредварительныйРасчет.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПредварительныйРасчет.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПредварительныйРасчет.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ПредварительныйРасчет.НормаПотребления КАК НормаПотребления,
	|	ПредварительныйРасчет.СпособНачисления КАК СпособНачисления,
	|	ПредварительныйРасчет.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ПредварительныйРасчет.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	ПредварительныйРасчет КАК ПредварительныйРасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.Организация КАК Организация,
	|	Услуги.ПериодНачисления КАК ПериодНачисления,
	|	Услуги.Район КАК Район,
	|	Услуги.МКД КАК МКД,
	|	Услуги.Договор КАК Договор,
	|	Услуги.ОбъектРасчета КАК ОбъектРасчета,
	|	Услуги.Услуга КАК Услуга,
	|	Услуги.ТочкаУчета КАК ТочкаУчета,
	|	Услуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	Услуги.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Услуги.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	Услуги.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	Услуги.НормаПотребления КАК НормаПотребления,
	|	Услуги.СпособНачисления КАК СпособНачисления,
	|	Услуги.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	Услуги.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ ЗависимыеУслуги
	|ИЗ
	|	Услуги КАК Услуги
	|ГДЕ
	|	Услуги.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ЗависимыеУслуги.Организация КАК Организация,
	|	ЗависимыеУслуги.ПериодНачисления КАК ПериодНачисления,
	|	ЗависимыеУслуги.Район КАК Район,
	|	ЗависимыеУслуги.МКД КАК МКД,
	|	ЗависимыеУслуги.Договор КАК Договор,
	|	ЗависимыеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	|	ЗависимыеУслуги.Услуга КАК Услуга,
	|	ЗависимыеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ЗависимыеУслуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ЗависимыеУслуги.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ЗависимыеУслуги.СпособНачисления КАК СпособНачисления,
	|	ЛОЖЬ КАК ОбратныйРасчет,
	|	ЗависимыеУслуги.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ ВзимозависимостьУслуг
	|ИЗ
	|	ЗависимыеУслуги КАК ЗависимыеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО ЗависимыеУслуги.Организация = Услуги.Организация
	|			И ЗависимыеУслуги.Район = Услуги.Район
	|			И ЗависимыеУслуги.Договор = Услуги.Договор
	|			И ЗависимыеУслуги.ОбъектРасчета = Услуги.ОбъектРасчета
	|			И ЗависимыеУслуги.ТочкаУчета = Услуги.ТочкаУчета
	|			И ЗависимыеУслуги.ЗависитОтУслуги = Услуги.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗависимыеУслуги.Организация,
	|	ЗависимыеУслуги.ПериодНачисления,
	|	ЗависимыеУслуги.Район,
	|	ЗависимыеУслуги.МКД,
	|	ЗависимыеУслуги.Договор,
	|	ЗависимыеУслуги.ОбъектРасчета,
	|	ЗависимыеУслуги.ЗависитОтУслуги,
	|	ЗависимыеУслуги.ТочкаУчета,
	|	ЗависимыеУслуги.Услуга,
	|	ЗависимыеУслуги.СпособРасчетаНорматива,
	|	Услуги.СпособНачисления,
	|	ИСТИНА,
	|	ЛОЖЬ
	|ИЗ
	|	ЗависимыеУслуги КАК ЗависимыеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|		ПО ЗависимыеУслуги.Организация = Услуги.Организация
	|			И ЗависимыеУслуги.Район = Услуги.Район
	|			И ЗависимыеУслуги.Договор = Услуги.Договор
	|			И ЗависимыеУслуги.ОбъектРасчета = Услуги.ОбъектРасчета
	|			И ЗависимыеУслуги.ТочкаУчета = Услуги.ТочкаУчета
	|			И ЗависимыеУслуги.ЗависитОтУслуги = Услуги.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзимозависимостьУслуг.Организация КАК Организация,
	|	ВзимозависимостьУслуг.Район КАК Район,
	|	ВзимозависимостьУслуг.Договор КАК Договор,
	|	ВзимозависимостьУслуг.ОбъектРасчета КАК ОбъектРасчета,
	|	ВзимозависимостьУслуг.Услуга КАК Услуга,
	|	ВзимозависимостьУслуг.ТочкаУчета КАК ТочкаУчета,
	|	ПриоритетСпособаРасчетаНорматива.ПриоритетСпособаРасчета КАК ПриоритетСпособаРасчета,
	|	ПриоритетСпособаРасчетаНорматива.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ВзимозависимостьУслуг.ЗависитОтУслуги КАК ЗависимаяУслуга
	|ПОМЕСТИТЬ ПриоритетРасчетаЗависимыхУслуг
	|ИЗ
	|	ВзимозависимостьУслуг КАК ВзимозависимостьУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетСпособаРасчетаНорматива КАК ПриоритетСпособаРасчетаНорматива
	|		ПО ВзимозависимостьУслуг.Организация = ПриоритетСпособаРасчетаНорматива.Организация
	|			И ВзимозависимостьУслуг.ПериодНачисления = ПриоритетСпособаРасчетаНорматива.ПериодНачисления
	|			И ВзимозависимостьУслуг.Район = ПриоритетСпособаРасчетаНорматива.Район
	|			И ВзимозависимостьУслуг.Договор = ПриоритетСпособаРасчетаНорматива.Договор
	|			И ВзимозависимостьУслуг.ОбъектРасчета = ПриоритетСпособаРасчетаНорматива.ОбъектРасчета
	|			И ВзимозависимостьУслуг.Услуга = ПриоритетСпособаРасчетаНорматива.Услуга
	|			И ВзимозависимостьУслуг.ТочкаУчета = ПриоритетСпособаРасчетаНорматива.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредварительныйРасчет.ПлощадьМОП КАК ПлощадьМОП,
	|	ПредварительныйРасчет.Организация КАК Организация,
	|	ПредварительныйРасчет.ПериодНачисления КАК ПериодНачисления,
	|	ПредварительныйРасчет.НачалоПериода КАК НачалоПериода,
	|	ПредварительныйРасчет.КонецПериода КАК КонецПериода,
	|	ПредварительныйРасчет.Район КАК Район,
	|	ПредварительныйРасчет.Договор КАК Договор,
	|	ПредварительныйРасчет.ОбъектРасчета КАК ОбъектРасчета,
	|	ПредварительныйРасчет.МКД КАК МКД,
	|	ПредварительныйРасчет.Услуга КАК Услуга,
	|	ПредварительныйРасчет.ТочкаУчета КАК ТочкаУчета,
	|	ПредварительныйРасчет.УзелУчета КАК УзелПриборУчета,
	|	ПредварительныйРасчет.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ПредварительныйРасчет.ПриборУчета КАК ПриборУчета,
	|	ПредварительныйРасчет.Шкала КАК Шкала,
	|	ПредварительныйРасчет.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредварительныйРасчет.ПриборВведен КАК ПриборВведен,
	|	ПредварительныйРасчет.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ПредварительныйРасчет.ОбъемУслуги КАК ОбъемУслуги,
	|	ПредварительныйРасчет.ОбъемПоПрибору КАК ОбъемПоПрибору,
	|	ПредварительныйРасчет.СпособНачисления КАК СпособНачисления,
	|	ПредварительныйРасчет.ДокументНачисления КАК ДокументНачисления,
	|	ПредварительныйРасчет.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ПредварительныйРасчет.НачальныеПоказания КАК НачальныеПоказания,
	|	ПредварительныйРасчет.КонечныеПоказания КАК КонечныеПоказания,
	|	ПредварительныйРасчет.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ПредварительныйРасчет.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ПредварительныйРасчет.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ПредварительныйРасчет.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ПредварительныйРасчет.НормаПотребления КАК НормаПотребления,
	|	ПредварительныйРасчет.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ПредварительныйРасчет.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ПредварительныйРасчет.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ПредварительныйРасчет.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ПредварительныйРасчет.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ПредварительныйРасчет.ВидПлощади КАК ВидПлощади,
	|	ПредварительныйРасчет.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ПредварительныйРасчет.ФормулаРасчета КАК ФормулаРасчета,
	|	ПредварительныйРасчет.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ПредварительныйРасчет.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ПредварительныйРасчет.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ПредварительныйРасчет.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ПредварительныйРасчет.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ПредварительныйРасчет.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	ПредварительныйРасчет.КоэффициентПропорциональности КАК КоэффициентПропорциональности,
	|	ПредварительныйРасчет.ГБП КАК ГБП,
	|	ПредварительныйРасчет.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ПредварительныйРасчет.СодержитПотери КАК СодержитПотери,
	|	ПредварительныйРасчет.УслугаСОбратнымРасчетом КАК УслугаСОбратнымРасчетом,
	|	ПредварительныйРасчет.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	ПредварительныйРасчет.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	ПредварительныйРасчет.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	ПредварительныйРасчет.ОбъемМГВ КАК ОбъемМГВ,
	|	ПредварительныйРасчет.КолЧасовРаботыТУЗарегОбъем КАК КоличествоЧасовРаботыТУ,
	|	ПредварительныйРасчет.ГарантированныйОбъем КАК ГарантированныйОбъем,
	|	ПредварительныйРасчет.бестИспользоватьТемпературныйКоэффициентПоВоде КАК бестИспользоватьТемпературныйКоэффициентПоВоде,
	|	1 КАК ТемпературныйКоэффициентПоВоде,
	|	ПредварительныйРасчет.ТемпературныйКоэффициентПоВоздуху КАК ТемпературныйКоэффициентПоВоздуху,
	|	ПредварительныйРасчет.РасчетныйНормативНаПодогрев КАК РасчетныйНормативНаПодогрев,
	|	ПредварительныйРасчет.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	|	выбор когда НЕ ПриоритетРасчетаЗависимыхУслуг.ЗависимаяУслуга ЕСТЬ NULL и ПриоритетРасчетаЗависимыхУслуг.ЗависимаяУслуга <> Значение(Справочник.энргВидыУслуг.ПустаяСсылка) Тогда Истина Иначе Ложь Конец КАК ЗависитОтУслугиШапка,
	|	ВЫБОР
	|		КОГДА ПредварительныйРасчет.ПривязанаКШкале
	|				И ПредварительныйРасчет.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			ТОГДА ПредварительныйРасчет.ЗависитОтУслуги
	|		ИНАЧЕ ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ЗависимаяУслуга, ПредварительныйРасчет.ЗависитОтУслуги)
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ПриоритетРасчетаЗависимыхУслуг1.СпособРасчетаНорматива КАК СпособРасчетаНормативаЗависимойУслуги,
	|	ВЫБОР
	|		КОГДА ПредварительныйРасчет.ПривязанаКШкале
	|				И ПредварительныйРасчет.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ПриоритетСпособаРасчета, 0)
	|	КОНЕЦ КАК ПриоритетСпособаРасчета,
	|	ПриоритетРасчетаЗависимыхУслуг1.ПриоритетСпособаРасчета КАК ПриоритетСпособаРасчетаЗАвисимойУслуги,
	|	ПредварительныйРасчет.ЯвляетсяОтдельностоящим КАК ЯвляетсяОтдельностоящим,
	|	ТемперКоэффициентПоВоздухуПред.ТемпературныйКоэффициентПоВоздухуПред КАК ТемпературныйКоэффициентПоВоздухуПред,
	|	РасходЗаПредПериод.Объем_ПоПриборуПред КАК Объем_ПоПриборуПред,
	|	РасходЗаПредПериод.СпособДосчётаРесурса КАК СпособДосчётаРесурса,
	|	ПредварительныйРасчет.Поставщик КАК Поставщик,
	|	ПредварительныйРасчет.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ПредварительныйРасчет.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ПредварительныйРасчет.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	|	ПредварительныйРасчет.ДиаметрСечения КАК ДиаметрСечения,
	|	ПредварительныйРасчет.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.Значение, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.СтавкаНДС, 0) КАК СтавкаНДС,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.НДСВнутри, 0) КАК НДСВнутри,
	|	ВЫБОР
	|		КОГДА ЗначенияТекущихТарифов.Значение ЕСТЬ NULL 
	|			ТОГДА 0 
	|		КОГДА ЗначенияТекущихТарифов.НДСВнутри
	|			ТОГДА ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение 
	//- ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение * ЗначенияТекущихТарифов.СтавкаНДС / (100 + ЗначенияТекущихТарифов.СтавкаНДС)
	|		ИНАЧЕ ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение + ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение * ЗначенияТекущихТарифов.СтавкаНДС / 100
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЗначенияТекущихТарифов.Значение ЕСТЬ NULL 
	|			ТОГДА 0 
	|		КОГДА ЗначенияТекущихТарифов.НДСВнутри
	|			ТОГДА ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение * ЗначенияТекущихТарифов.СтавкаНДС / (100 + ЗначенияТекущихТарифов.СтавкаНДС)
	|		ИНАЧЕ ПредварительныйРасчет.ОбъемУслуги * ЗначенияТекущихТарифов.Значение * ЗначенияТекущихТарифов.СтавкаНДС / 100
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	ПредварительныйРасчет КАК ПредварительныйРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетРасчетаЗависимыхУслуг КАК ПриоритетРасчетаЗависимыхУслуг
	|		ПО ПредварительныйРасчет.Организация = ПриоритетРасчетаЗависимыхУслуг.Организация
	|			И ПредварительныйРасчет.Район = ПриоритетРасчетаЗависимыхУслуг.Район
	|			И ПредварительныйРасчет.Договор = ПриоритетРасчетаЗависимыхУслуг.Договор
	|			И ПредварительныйРасчет.ОбъектРасчета = ПриоритетРасчетаЗависимыхУслуг.ОбъектРасчета
	|			И ПредварительныйРасчет.Услуга = ПриоритетРасчетаЗависимыхУслуг.Услуга
	|			И ПредварительныйРасчет.ТочкаУчета = ПриоритетРасчетаЗависимыхУслуг.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетРасчетаЗависимыхУслуг КАК ПриоритетРасчетаЗависимыхУслуг1
	|		ПО ПредварительныйРасчет.Организация = ПриоритетРасчетаЗависимыхУслуг1.Организация
	|			И ПредварительныйРасчет.Район = ПриоритетРасчетаЗависимыхУслуг1.Район
	|			И ПредварительныйРасчет.Договор = ПриоритетРасчетаЗависимыхУслуг1.Договор
	|			И ПредварительныйРасчет.ОбъектРасчета = ПриоритетРасчетаЗависимыхУслуг1.ОбъектРасчета
	|			И ПредварительныйРасчет.ТочкаУчета = ПриоритетРасчетаЗависимыхУслуг1.ТочкаУчета
	|			И ВЫБОР
	|				КОГДА ПредварительныйРасчет.ПривязанаКШкале
	|					И ПредварительныйРасчет.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|				ТОГДА ПредварительныйРасчет.ЗависитОтУслуги
	|				ИНАЧЕ ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ЗависимаяУслуга, ПредварительныйРасчет.ЗависитОтУслуги)
	|		  	  КОНЕЦ = ПриоритетРасчетаЗависимыхУслуг1.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТемперКоэффициентПоВоздухуПред КАК ТемперКоэффициентПоВоздухуПред
	|		ПО ПредварительныйРасчет.Организация = ТемперКоэффициентПоВоздухуПред.Организация
	|			И ПредварительныйРасчет.Район = ТемперКоэффициентПоВоздухуПред.Район
	|			И ПредварительныйРасчет.ОбъектРасчета = ТемперКоэффициентПоВоздухуПред.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходЗаПредПериод КАК РасходЗаПредПериод
	|		ПО ПредварительныйРасчет.Организация = РасходЗаПредПериод.Организация
	|			И ПредварительныйРасчет.Район = РасходЗаПредПериод.Район
	|			И ПредварительныйРасчет.Договор = РасходЗаПредПериод.Договор
	|			И ПредварительныйРасчет.ОбъектРасчета = РасходЗаПредПериод.ОбъектРасчета
	|			И ПредварительныйРасчет.ТочкаУчета = РасходЗаПредПериод.ТочкаУчета
	|			И ПредварительныйРасчет.Услуга = РасходЗаПредПериод.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|		ПО ПредварительныйРасчет.Организация = ЗначенияТекущихТарифов.Организация
	|			И ПредварительныйРасчет.Район = ЗначенияТекущихТарифов.Район
	|			И ПредварительныйРасчет.ПериодНачисления = ЗначенияТекущихТарифов.ПериодНачисления
	|			И ПредварительныйРасчет.ТарифнаяКатегория = ЗначенияТекущихТарифов.ГруппаПотребителей
	|			И ПредварительныйРасчет.Услуга = ЗначенияТекущихТарифов.Услуга
	|			И ПредварительныйРасчет.Поставщик = ЗначенияТекущихТарифов.Поставщик
	|			И ПредварительныйРасчет.ТарифнаяЗона = ЗначенияТекущихТарифов.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	Договор,
	|	ОбъектРасчета,
	|	СодержитПотери,
	|	РасчетПоФормуле,		
	|	ТочкаУчета,
	|	НачалоПериода,
	|	КонецПериода,
	|	ПриоритетСпособаРасчета,
	|	ЗависитОтУслуги
	|	ИТОГИ ПО
	|    Договор,
	|    ДокументНачисления";
	
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти 

#Область Начислить_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаИндивидуальныеНачисленияНП(ПериодНачисления,Организация,Район,Отдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде)
	
	МВТ  = Новый МенеджерВременныхТаблиц;
	ВспомогательныеДанныеНачисленияНП(МВТ,Организация, ПериодНачисления,Район,Отдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде);
	ПолучитьСтабильныеПериодыНП(МВТ,Организация, ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета);
	ПолучитьДанныеДляРасчетаНП(МВТ,ЛОЖЬ,Ложь,КонецПериодаРасчета);
	Возврат РассчитатьИндивидуальныйОбъемПотребленияНП(МВТ,Ложь);
	
	
КонецФункции

#КонецОбласти


#Область ЗакрытьПериодДляРедактирования_ВспомогательныеФункции

Функция ДокуметЗакрытияПериода(ПериодНачисления,Район)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	НЕ энргЗакрытиеПериода.ПометкаУдаления
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат  Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.энргЗакрытиеПериода.ПустаяСсылка();	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляОтладкиИТестирования

Функция ПрочитатьДанныеВременнойТаблицы(МВТ,ТекстЗапроса) 
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область НачислениеПоДолевымСхемам

Процедура НачислитьОбъемПоСубабонентам(ПериодНачисления, Организация, Район, Договор, ТочкаУчета, Услуга, ГраницыПериода, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НачисленияПоТочке, РассчитанныеОбъемыПоТочке)
	
	ПустаяТочкаУчета 					= Справочники.энргТочкиУчета.ПустаяСсылка();
	ВидНачисления 						= Перечисления.энргВидыНачислений.Начисление;
	
	кРаспределения                      = 0;
	
	Для Каждого СтрокаНачисленийСуб Из ДанныеПоУслуге.ДанныеНачисленийСубабонентов Цикл
		СтрокаНабора  					= НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийСуб);
		СтрокаНабора.ОбъемУслуги 		= -СтрокаНабора.ОбъемУслуги;
		СтрокаНабора.Распределение 		= Истина;
		СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
	КонецЦикла;
	
	Если ДанныеПоУслуге.СхемаРасчетаПриВыходеПУ  Тогда
		ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги;
	Иначе
		ОсталосьРаспределить = ДанныеПоУслуге.ОбъемУслуги + ДанныеПоУслуге.ОбъемСубКРаспределению;
	КонецЕсли;
	
	Если ОсталосьРаспределить <= 0 Тогда						
		Возврат;
	КонецЕсли;	
	
	Субабоненты   = ДанныеПоУслуге.Субабоненты;
	Распределили  = 0;
	
	СубабонентыОстаток = Новый Массив;

	
	Для Сч = 0 По Субабоненты.ВГраница() Цикл
		
		ДанныеСубабонента 					= Субабоненты[Сч];
		ТекОбъемУслуги						= НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга];
		
		Если Не ЗначениеЗаполнено(ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ)  Тогда
			
			ТекОбъемУслуги.ОбъемУслугиГоловнойТУ = ТекОбъемУслуги.ОбъемУслугиГоловнойТУ + ДанныеПоУслуге.ОбъемУслуги;
			Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета] <> Неопределено Тогда	
				Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] <> Неопределено Тогда
					РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] = РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] + ДанныеСубабонента.ОбъемУслуги;
				Иначе
					РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета].Вставить(Услуга, ДанныеСубабонента.ОбъемУслуги);
				КонецЕсли;
			Иначе
				РассчитанныеОбъемыПоУслуге = Новый Соответствие;
				РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ДанныеСубабонента.ОбъемУслуги); 
				РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ОбъектРасчета, РассчитанныеОбъемыПоУслуге);
			КонецЕсли;
			

			Продолжить;
		КонецЕсли;
		
		Если Сч = Субабоненты.ВГраница() Тогда
			ОбъемУслуги 				= ОсталосьРаспределить - Распределили;
		Иначе
			Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение Тогда
				ОбъемУслуги 				= ОсталосьРаспределить * ДанныеСубабонента.КоэффициентДолевогоРаспределения;	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноПлощади Тогда
				ОбъемУслуги 				= ?( ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ЗначениеПлощади / ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ЗначениеНагрузки / ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноДоговорномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ДоговорнойОбъем / ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.ВсегоТочекУчетаСубабонентов = ДанныеПоУслуге.ВсегоПриборовУчетаСубабонентов Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему Тогда
				
				 Если ДанныеСубабонента.ТочкаУчета = ДанныеСубабонента.ЗависимаяТочкаУчета   Тогда
					ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеПоУслуге.ОбъемУслуги /  ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				Иначе
					ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарныйОбъемСубабонентов = 0, 0, ОсталосьРаспределить * ДанныеСубабонента.ОбъемУслуги /  ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				КонецЕсли;
				
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги  Тогда
				
				Если  НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга.ЗависитОтУслуги] <> Неопределено Тогда
					ОбъемУслугиОсновной 			= НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга.ЗависитОтУслуги];
					ОбъемУслуги 				    = ?(ОбъемУслугиОсновной.ОбъемУслугиГоловнойТУ = 0, 0, ОсталосьРаспределить * ОбъемУслугиОсновной.ОбъемУслуги / ОбъемУслугиОсновной.ОбъемУслугиГоловнойТУ);	
				Иначе
					ОбъемУслуги 					= 0;
				КонецЕсли;
				
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ФиксированныйОбъем Тогда
				ОбъемУслуги 				= ?(ОсталосьРаспределить < ДанныеСубабонента.ФиксированныйОбъем, ОсталосьРаспределить, ДанныеСубабонента.ФиксированныйОбъем);
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета] <> Неопределено Тогда	
			Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] <> Неопределено Тогда
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] = РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] + ОбъемУслуги;
			Иначе
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета].Вставить(Услуга, ОбъемУслуги);
			КонецЕсли;
		Иначе
			РассчитанныеОбъемыПоУслуге = Новый Соответствие;
			РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
			РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ОбъектРасчета, РассчитанныеОбъемыПоУслуге);
		КонецЕсли;
		
		//РассчитанныеОбъемыПоУслуге = Новый Соответствие;
		//РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
		//РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, РассчитанныеОбъемыПоУслуге);
		
		Если ЗначениеЗаполнено(ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы) Тогда
			СубабонентыОстаток.Добавить(ДанныеСубабонента);
			
			Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.Остаток Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		Если НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета] = Неопределено Тогда
			НачисленияПоУслуге = Новый Соответствие;
		Иначе
			НачисленияПоУслуге = НачисленияПоТочке[ДанныеСубабонента.ОбъектРасчета];
		КонецЕсли;
		
		ТекОбъемУслуги.ОбъемУслуги = ТекОбъемУслуги.ОбъемУслуги + ОбъемУслуги;
		ТекОбъемУслуги.ОбъемУслугиГоловнойТУ = ТекОбъемУслуги.ОбъемУслугиГоловнойТУ + ДанныеПоУслуге.ОбъемУслуги;
		
		//НачисленияПоУслуге.Вставить(Услуга, Новый Структура("ОбъемУслуги, ОбъемУслугиГоловнойТУ", ОбъемУслуги, ДанныеПоУслуге.ОбъемУслуги));
		//
		//НачисленияПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, НачисленияПоУслуге);
			
		СтрокаНабора  							= НаборЗаписей.Добавить();
		СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 						= Район;
		СтрокаНабора.Организация				= Организация;
		СтрокаНабора.Договор 					= ДанныеСубабонента.Договор;
		СтрокаНабора.ОбъектРасчета              = ДанныеСубабонента.ОбъектРасчета;
		СтрокаНабора.МКД              			= ДанныеСубабонента.ОбъектРасчета.МКД;
		СтрокаНабора.Услуга						= Услуга;
		СтрокаНабора.ТочкаУчета					= ДанныеСубабонента.ТочкаУчета;
		СтрокаНабора.ВидНачисления 				= ВидНачисления;
		СтрокаНабора.СпособНачисления 			= ДанныеПоУслуге.СпособНачисления;
		СтрокаНабора.ДолевоеРаспределение 		= Истина;
		СтрокаНабора.ПериодРасчета				= ПериодНачисления;
		СтрокаНабора.ПериодНачисления			= ПериодНачисления;
		СтрокаНабора.ТарифнаяЗона 				= ДанныеСубабонента.ТарифнаяЗона;
		СтрокаНабора.Поставщик 					= ДанныеСубабонента.Поставщик;
		
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 			= ДанныеСубабонента.ЗначениеПлощади;
		Если ДанныеСубабонента.СпособРаспределенияОбъемаДолевойТУ = Перечисления.бестСпособыРаспределенияДолевыхСхем.ФиксированныйОбъем Тогда
			ОсталосьРаспределить = ОсталосьРаспределить - ОбъемУслуги;
		Иначе
			Распределили 							= Распределили + СтрокаНабора.ОбъемУслуги;	
		КонецЕсли;
		
		
	КонецЦикла;	
	
	//распределить остаток
	
	ОсталосьРаспределитьОстаток = ОсталосьРаспределить - Распределили;
	
	РаспределилиОстаток 		= 0;

	Для Сч = 0 По СубабонентыОстаток.ВГраница() Цикл
		
		ДанныеСубабонента 					= СубабонентыОстаток[Сч];
				
		Если Сч = СубабонентыОстаток.ВГраница() Тогда
			ОбъемУслуги 				= ОсталосьРаспределитьОстаток - РаспределилиОстаток;
		Иначе
			Если ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ДолевоеРаспределение Тогда
				ОбъемУслуги 				= ОсталосьРаспределить * ДанныеСубабонента.КоэффициентРасчета;	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноПлощади Тогда
				ОбъемУслуги 				= ?( ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ЗначениеПлощади / ДанныеПоУслуге.СуммарноеЗначениеПлощадиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ЗначениеНагрузки / ДанныеПоУслуге.СуммарноеЗначениеНагрузкиСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноДоговорномуОбъему Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ДоговорнойОбъем / ДанныеПоУслуге.СуммарноеЗначениеДоговорногоОбъемаСуб);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему И ДанныеПоУслуге.ВсегоТочекУчетаСубабонентов = ДанныеПоУслуге.ВсегоПриборовУчетаСубабонентов Тогда
				ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
			ИначеЕсли ДанныеСубабонента.СпособРаспределенияОстаткаДолевыеСхемы = Перечисления.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНачисленномуОбъему Тогда
				Если ДанныеСубабонента.ТочкаУчета = ДанныеСубабонента.ЗависимаяТочкаУчета   Тогда
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеПоУслуге.ОбъемУслуги / ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				Иначе
					ОбъемУслуги 				= ?(ДанныеПоУслуге.ОбъемУслуги = 0, 0, ОсталосьРаспределитьОстаток * ДанныеСубабонента.ОбъемУслуги /  ДанныеПоУслуге.СуммарныйОбъемСубабонентов);	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета] <> Неопределено Тогда	
			Если РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] <> Неопределено Тогда
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] = РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета][Услуга] + ОбъемУслуги;
			Иначе
				РассчитанныеОбъемыПоТочке[ДанныеСубабонента.ОбъектРасчета].Вставить(Услуга, ОбъемУслуги);
			КонецЕсли;
		Иначе
			РассчитанныеОбъемыПоУслуге = Новый Соответствие;
			РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
			РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ОбъектРасчета, РассчитанныеОбъемыПоУслуге);
		КонецЕсли;

		
		//РассчитанныеОбъемыПоУслуге = Новый Соответствие;
		//РассчитанныеОбъемыПоУслуге.Вставить(Услуга, ОбъемУслуги); 
		//РассчитанныеОбъемыПоТочке.Вставить(ДанныеСубабонента.ТочкаУчета, РассчитанныеОбъемыПоУслуге);
		             
			
		СтрокаНабора  							= НаборЗаписей.Добавить();
		СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 						= Район;
		СтрокаНабора.Организация				= Организация;
		СтрокаНабора.Договор 					= ДанныеСубабонента.Договор;
		СтрокаНабора.ОбъектРасчета              = ДанныеСубабонента.ОбъектРасчета;
		СтрокаНабора.Услуга						= Услуга;
		СтрокаНабора.ТочкаУчета					= ДанныеСубабонента.ТочкаУчета;
		СтрокаНабора.ВидНачисления 				= ВидНачисления;
		СтрокаНабора.СпособНачисления 			= ДанныеПоУслуге.СпособНачисления;
		СтрокаНабора.ДолевоеРаспределение 		= Истина;
		СтрокаНабора.ПериодРасчета				= ПериодНачисления;
		СтрокаНабора.ПериодНачисления			= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 			= ДанныеСубабонента.ЗначениеПлощади;
		СтрокаНабора.ТарифнаяЗона 				= ДанныеСубабонента.ТарифнаяЗона;
		СтрокаНабора.Поставщик 					= ДанныеСубабонента.Поставщик;
		РаспределилиОстаток 					= РаспределилиОстаток + СтрокаНабора.ОбъемУслуги;								
		
	КонецЦикла;	 
	
	
КонецПроцедуры

Функция ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(Отдельностоящие,МКД,Договор = Неопределено)
	
	Текст = "ВЫБРАТЬ
	        |	бестОтложенныеДвиженияДокументовНП.Организация КАК Организация,
	        |	бестОтложенныеДвиженияДокументовНП.Район КАК Район,
	        |	бестОтложенныеДвиженияДокументовНП.Договор КАК Договор,
	        |	бестОтложенныеДвиженияДокументовНП.ПериодНачисления КАК ПериодНачисления
	        |ПОМЕСТИТЬ ДокументыДляРаспределения
	        |ИЗ
	        |	РегистрСведений.бестОтложенныеДвиженияДокументовНП КАК бестОтложенныеДвиженияДокументовНП
	        |ГДЕ
	        |	бестОтложенныеДвиженияДокументовНП.Организация = &Организация
	        |	И бестОтложенныеДвиженияДокументовНП.ПериодНачисления = &ПериодНачисления
	        |	И бестОтложенныеДвиженияДокументовНП.Район = &Район
	        |	И бестОтложенныеДвиженияДокументовНП.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам)
	        |	И бестОтложенныеДвиженияДокументовНП.Договор = &Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	        |	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	        |ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	        |ИЗ
	        |	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	        |			&КонецПериода,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.НежилыеПомещения)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСтабильныеПериодыНП.Организация КАК Организация,
	        |	бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	        |	бестСтабильныеПериодыНП.Район КАК Район,
	        |	бестСтабильныеПериодыНП.МКД КАК МКД,
	        |	бестСтабильныеПериодыНП.Договор КАК Договор,
	        |	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	        |	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестСтабильныеПериодыНП.НомерПозиции КАК НомерПозиции,
	        |	бестСтабильныеПериодыНП.ПериодРегистрации КАК ПериодРегистрации,
	        |	бестСтабильныеПериодыНП.ДатаРегистратора КАК ДатаРегистратора,
	        |	бестСтабильныеПериодыНП.ДокРегистратор КАК ДокРегистратор,
	        |	бестСтабильныеПериодыНП.ДоговорЗаключен КАК ДоговорЗаключен,
	        |	бестСтабильныеПериодыНП.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	        |	бестСтабильныеПериодыНП.УслугаПодключена КАК УслугаПодключена,
	        |	бестСтабильныеПериодыНП.ПриборВведен КАК ПриборВведен,
	        |	бестСтабильныеПериодыНП.ПриборУчета КАК ПриборУчета,
	        |	бестСтабильныеПериодыНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	бестСтабильныеПериодыНП.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	бестСтабильныеПериодыНП.ТарифнаяГруппа КАК ТарифнаяГруппа,
	        |	бестСтабильныеПериодыНП.ДатаПоверки КАК ДатаПоверки,
	        |	бестСтабильныеПериодыНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	бестСтабильныеПериодыНП.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	бестСтабильныеПериодыНП.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	        |	бестСтабильныеПериодыНП.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	        |	бестСтабильныеПериодыНП.МенялосьСостояниеФормулы КАК МенялосьСостояниеФормулы,
	        |	бестСтабильныеПериодыНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	        |	бестСтабильныеПериодыНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	        |	бестСтабильныеПериодыНП.РасчетПоФормуле КАК РасчетПоФормуле,
	        |	бестСтабильныеПериодыНП.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	        |	бестСтабильныеПериодыНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	бестСтабильныеПериодыНП.КлючНорматива КАК КлючНорматива,
	        |	бестСтабильныеПериодыНП.Поставщик КАК Поставщик,
	        |	бестСтабильныеПериодыНП.Шкала КАК Шкала,
	        |	бестСтабильныеПериодыНП.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	        |	бестСтабильныеПериодыНП.СоставнаяУслуга КАК СоставнаяУслуга,
	        |	бестСтабильныеПериодыНП.ФормулаРасчета КАК ФормулаРасчета,
	        |	бестСтабильныеПериодыНП.ТипСхемыГВС КАК ТипСхемыГВС,
	        |	бестСтабильныеПериодыНП.ВидТепловогоПункта КАК ВидТепловогоПункта,
	        |	бестСтабильныеПериодыНП.ЗначениеМесячнойНагрузки КАК ЗначениеМесячнойНагрузки,
	        |	бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	бестСтабильныеПериодыНП.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	бестСтабильныеПериодыНП.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	бестСтабильныеПериодыНП.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	бестСтабильныеПериодыНП.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	        |	бестСтабильныеПериодыНП.ФиксированныйОбъем КАК ФиксированныйОбъем
	        |ПОМЕСТИТЬ СтабПериоды
	        |ИЗ
	        |	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	        |		ПО бестСтабильныеПериодыНП.Организация = ДокументыДляРаспределения.Организация
	        |			И бестСтабильныеПериодыНП.Район = ДокументыДляРаспределения.Район
	        |			И бестСтабильныеПериодыНП.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	        |			И бестСтабильныеПериодыНП.Договор = ДокументыДляРаспределения.Договор
	        |			И (бестСтабильныеПериодыНП.Организация = &Организация)
	        |			И (бестСтабильныеПериодыНП.Район = &Район)
	        |			И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	        |			И (бестСтабильныеПериодыНП.Договор = &Договор)
	        |			И (бестСтабильныеПериодыНП.МКД = &МКД)
	        |			И (бестСтабильныеПериодыНП.УчаствуетВДолевойСхеме)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	МИНИМУМ(СтабПериоды.НомерПозиции) КАК НомерПозиции,
	        |	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета
	        |ПОМЕСТИТЬ СтабПериодыМинНомерПозиции
	        |ИЗ
	        |	СтабПериоды КАК СтабПериоды
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	        |		ПО СтабПериоды.Организация = ДокументыДляРаспределения.Организация
	        |			И СтабПериоды.Район = ДокументыДляРаспределения.Район
	        |			И СтабПериоды.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	        |			И СтабПериоды.Договор = ДокументыДляРаспределения.Договор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтабПериоды.Организация,
	        |	СтабПериоды.Район,
	        |	СтабПериоды.Договор,
	        |	СтабПериоды.ОбъектРасчета,
	        |	СтабПериоды.Услуга,
	        |	СтабПериоды.ТочкаУчета,
	        |	СтабПериоды.ЗависимаяТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.МКД КАК МКД,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	СтабПериоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	СтабПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	СтабПериоды.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	СтабПериоды.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	СтабПериоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	СтабПериоды.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	СтабПериоды.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	        |	СтабПериоды.ФиксированныйОбъем КАК ФиксированныйОбъем
	        |ПОМЕСТИТЬ УслугиДолевойТУ
	        |ИЗ
	        |	СтабПериоды КАК СтабПериоды
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериодыМинНомерПозиции КАК СтабПериодыМинНомерПозиции
	        |		ПО СтабПериоды.Организация = СтабПериодыМинНомерПозиции.Организация
	        |			И СтабПериоды.Район = СтабПериодыМинНомерПозиции.Район
	        |			И СтабПериоды.Договор = СтабПериодыМинНомерПозиции.Договор
	        |			И СтабПериоды.ОбъектРасчета = СтабПериодыМинНомерПозиции.ОбъектРасчета
	        |			И СтабПериоды.Услуга = СтабПериодыМинНомерПозиции.Услуга
	        |			И СтабПериоды.ТочкаУчета = СтабПериодыМинНомерПозиции.ТочкаУчета
	        |			И СтабПериоды.НомерПозиции = СтабПериодыМинНомерПозиции.НомерПозиции
	        |			И (СтабПериоды.ТочкаУчета = СтабПериоды.ЗависимаяТочкаУчета)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УслугиДолевойТУ.Организация КАК Организация,
	        |	УслугиДолевойТУ.Район КАК Район,
	        |	УслугиДолевойТУ.Договор КАК Договор,
	        |	УслугиДолевойТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	УслугиДолевойТУ.Услуга КАК Услуга,
	        |	УслугиДолевойТУ.МКД КАК МКД,
	        |	УслугиДолевойТУ.ТочкаУчета КАК ТочкаУчета,
	        |	УслугиДолевойТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	УслугиДолевойТУ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	УслугиДолевойТУ.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	УслугиДолевойТУ.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	УслугиДолевойТУ.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	УслугиДолевойТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	УслугиДолевойТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	УслугиДолевойТУ.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	УслугиДолевойТУ.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	        |	ЕСТЬNULL(бестУровниВложенностиРасчетныхСхемСрезПоследних.Уровень, 0) КАК Уровень,
	        |	УслугиДолевойТУ.ФиксированныйОбъем КАК ФиксированныйОбъем
	        |ПОМЕСТИТЬ УровеньДолевыхТУ
	        |ИЗ
	        |	УслугиДолевойТУ КАК УслугиДолевойТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУровниВложенностиРасчетныхСхем.СрезПоследних(&КонецПериода, ) КАК бестУровниВложенностиРасчетныхСхемСрезПоследних
	        |		ПО УслугиДолевойТУ.Организация = бестУровниВложенностиРасчетныхСхемСрезПоследних.Организация
	        |			И УслугиДолевойТУ.Район = бестУровниВложенностиРасчетныхСхемСрезПоследних.Район
	        |			И УслугиДолевойТУ.Договор = бестУровниВложенностиРасчетныхСхемСрезПоследних.Договор
	        |			И УслугиДолевойТУ.ОбъектРасчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ОбъектРасчета
	        |			И УслугиДолевойТУ.Услуга = бестУровниВложенностиРасчетныхСхемСрезПоследних.Услуга
	        |			И УслугиДолевойТУ.ТочкаУчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Организация КАК Организация,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Район КАК Район,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Договор КАК Договор,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента КАК УслугаСубабонента,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределения КАК СпособРаспределения,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СхемаПриВыводеПодчиненногоПУ КАК СхемаПриВыводеПодчиненногоПУ,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Коэффициент КАК Коэффициент,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределенияОстатка КАК СпособРаспределенияОстатка,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УчитыватьИндивидуальноеПотребление КАК УчитыватьИндивидуальноеПотребление,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ФиксированныйОбъем КАК ФиксированныйОбъем
	        |ПОМЕСТИТЬ ТочкиСубабонентов
	        |ИЗ
	        |	УслугиДолевойТУ КАК СтабПериодыПоМинПозиции
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	        |		ПО СтабПериодыПоМинПозиции.Организация = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Организация
	        |			И СтабПериодыПоМинПозиции.Район = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Район
	        |			И СтабПериодыПоМинПозиции.Договор = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Договор
	        |			И СтабПериодыПоМинПозиции.ОбъектРасчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	        |			И СтабПериодыПоМинПозиции.ТочкаУчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	        |	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	        |	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	        |	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	        |	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	        |	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	        |	ТочкиСубабонентов.Договор КАК ДоговорДолевойТУ,
	        |	ТочкиСубабонентов.ОбъектРасчета КАК ОбъектРасчетаДолевойТУ,
	        |	ТочкиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.Услуга КАК УслугаДолевойТУ,
	        |	ТочкиСубабонентов.СпособРаспределения КАК СпособРаспределения,
	        |	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ ПоследниеНомераСтрок
	        |ИЗ
	        |	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	        |		ПО бестНомераСтрокСтабильногоПериодаНП.Организация = ТочкиСубабонентов.Организация
	        |			И бестНомераСтрокСтабильногоПериодаНП.Район = ТочкиСубабонентов.Район
	        |			И бестНомераСтрокСтабильногоПериодаНП.Договор = ТочкиСубабонентов.ДоговорСубабонента
	        |			И бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |			И бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |			И (бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления)
	        |			И (бестНомераСтрокСтабильногоПериодаНП.Организация = &Организация)
	        |			И (бестНомераСтрокСтабильногоПериодаНП.Район = &Район)
	        |			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ТочкиСубабонентов.УслугаСубабонента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестНомераСтрокСтабильногоПериодаНП.Организация,
	        |	бестНомераСтрокСтабильногоПериодаНП.Район,
	        |	бестНомераСтрокСтабильногоПериодаНП.Договор,
	        |	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	        |	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	        |	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	        |	ТочкиСубабонентов.Договор,
	        |	ТочкиСубабонентов.ОбъектРасчета,
	        |	ТочкиСубабонентов.ГоловнаяТочкаУчета,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.Услуга,
	        |	ТочкиСубабонентов.СпособРаспределения,
	        |	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	бестНомераСтрокСтабильногоПериодаНП.Организация КАК Организация,
	        |	бестНомераСтрокСтабильногоПериодаНП.Район КАК Район,
	        |	бестНомераСтрокСтабильногоПериодаНП.Договор КАК Договор,
	        |	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестНомераСтрокСтабильногоПериодаНП.Услуга КАК Услуга,
	        |	МАКСИМУМ(бестНомераСтрокСтабильногоПериодаНП.НомерПозиции) КАК НомерПозиции,
	        |	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления КАК ПериодНачисления,
	        |	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета КАК ТочкаУчета,
	        |	ТочкиСубабонентов.Договор КАК ДоговорДолевойТУ,
	        |	ТочкиСубабонентов.ОбъектРасчета КАК ОбъектРасчетаДолевойТУ,
	        |	ТочкиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ТочкиСубабонентов.Услуга КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ ПоследниеНомераСтрокСуб
	        |ИЗ
	        |	РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК бестНомераСтрокСтабильногоПериодаНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	        |		ПО бестНомераСтрокСтабильногоПериодаНП.Организация = ТочкиСубабонентов.Организация
	        |			И бестНомераСтрокСтабильногоПериодаНП.Район = ТочкиСубабонентов.Район
	        |			И бестНомераСтрокСтабильногоПериодаНП.Договор = ТочкиСубабонентов.ДоговорСубабонента
	        |			И бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |			И бестНомераСтрокСтабильногоПериодаНП.Услуга = ТочкиСубабонентов.УслугаСубабонента
	        |			И бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |ГДЕ
	        |	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления = &ПериодНачисления
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестНомераСтрокСтабильногоПериодаНП.Организация,
	        |	бестНомераСтрокСтабильногоПериодаНП.Район,
	        |	бестНомераСтрокСтабильногоПериодаНП.Договор,
	        |	бестНомераСтрокСтабильногоПериодаНП.ОбъектРасчета,
	        |	бестНомераСтрокСтабильногоПериодаНП.Услуга,
	        |	бестНомераСтрокСтабильногоПериодаНП.ПериодНачисления,
	        |	бестНомераСтрокСтабильногоПериодаНП.ТочкаУчета,
	        |	ТочкиСубабонентов.Договор,
	        |	ТочкиСубабонентов.ОбъектРасчета,
	        |	ТочкиСубабонентов.ГоловнаяТочкаУчета,
	        |	ТочкиСубабонентов.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестГарантированныеОбъемыСрезПоследних.Организация КАК Организация,
	        |	бестГарантированныеОбъемыСрезПоследних.Район КАК Район,
	        |	бестГарантированныеОбъемыСрезПоследних.Договор КАК Договор,
	        |	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	        |	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги
	        |ПОМЕСТИТЬ ГарантированныеОбъемы
	        |ИЗ
	        |	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	        |			&КонецПериода,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И (Договор, ОбъектРасчета) В
	        |					(ВЫБРАТЬ
	        |						ТочкиСубабонентов.ДоговорСубабонента,
	        |						ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |					ИЗ
	        |						ТочкиСубабонентов КАК ТочкиСубабонентов)
	        |				И МЕСЯЦ(Месяц) = МЕСЯЦ(&ПериодНачисления)) КАК бестГарантированныеОбъемыСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	ТочкиСубабонентов.Коэффициент КАК КоэффициентРасчета,
	        |	ТочкиСубабонентов.СпособРаспределения КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	ТочкиСубабонентов.СпособРаспределенияОстатка КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	МАКСИМУМ(СтабПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	        |	МАКСИМУМ(СтабПериоды.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	        |	ПоследниеНомераСтрок.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрок.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрок.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ВЫБОР
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	        |			ТОГДА 2
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК Приоритет,
	        |	МАКСИМУМ(ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0)) КАК ЗначениеНорматива,
	        |	СтабПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	МАКСИМУМ(ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0)) КАК ДоговорнойОбъем,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтабПериоды.ПриборВведен
	        |				ТОГДА 1
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК КоличествоПриборов,
	        |	ТочкиСубабонентов.УчитыватьИндивидуальноеПотребление КАК РасчетИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ КАК СхемаРасчетаПриВыходеПУ,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	ПоследниеНомераСтрок.УслугаДолевойТУ КАК УслугаДолевойТУ,
	        |	ТочкиСубабонентов.ФиксированныйОбъем КАК ФиксированныйОбъем
	        |ПОМЕСТИТЬ ПараметрыСубабонентов
	        |ИЗ
	        |	ПоследниеНомераСтрок КАК ПоследниеНомераСтрок
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериоды КАК СтабПериоды
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	        |			ПО СтабПериоды.Организация = ЗначенияТекущихНормПотребления.Организация
	        |				И СтабПериоды.Район = ЗначенияТекущихНормПотребления.Район
	        |				И СтабПериоды.Услуга = ЗначенияТекущихНормПотребления.Район
	        |				И СтабПериоды.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	        |			ПО СтабПериоды.Организация = ГарантированныеОбъемы.Организация
	        |				И СтабПериоды.Район = ГарантированныеОбъемы.Район
	        |				И СтабПериоды.Договор = ГарантированныеОбъемы.Договор
	        |				И СтабПериоды.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	        |				И СтабПериоды.Услуга = ГарантированныеОбъемы.Услуга
	        |		ПО ПоследниеНомераСтрок.Организация = СтабПериоды.Организация
	        |			И ПоследниеНомераСтрок.Район = СтабПериоды.Район
	        |			И ПоследниеНомераСтрок.Договор = СтабПериоды.Договор
	        |			И ПоследниеНомераСтрок.ОбъектРасчета = СтабПериоды.ОбъектРасчета
	        |			И ПоследниеНомераСтрок.Услуга = СтабПериоды.Услуга
	        |			И ПоследниеНомераСтрок.НомерПозиции = СтабПериоды.НомерПозиции
	        |			И ПоследниеНомераСтрок.ТочкаУчета = СтабПериоды.ТочкаУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО ПоследниеНомераСтрок.Услуга = энргВидыУслуг.Ссылка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	        |		ПО ПоследниеНомераСтрок.Организация = ТочкиСубабонентов.Организация
	        |			И ПоследниеНомераСтрок.Район = ТочкиСубабонентов.Район
	        |			И ПоследниеНомераСтрок.Договор = ТочкиСубабонентов.ДоговорСубабонента
	        |			И ПоследниеНомераСтрок.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |			И ПоследниеНомераСтрок.Услуга = ТочкиСубабонентов.УслугаСубабонента
	        |			И ПоследниеНомераСтрок.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтабПериоды.Организация,
	        |	СтабПериоды.Район,
	        |	СтабПериоды.Договор,
	        |	СтабПериоды.ОбъектРасчета,
	        |	СтабПериоды.Услуга,
	        |	СтабПериоды.ТочкаУчета,
	        |	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ,
	        |	СтабПериоды.ЗависимаяТочкаУчета,
	        |	ПоследниеНомераСтрок.ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрок.ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрок.ГоловнаяТочкаУчета,
	        |	СтабПериоды.СпособРасчетаНорматива,
	        |	ВЫБОР
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	        |			ТОГДА 2
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	энргВидыУслуг.ЗависитОтУслуги,
	        |	ПоследниеНомераСтрок.УслугаДолевойТУ,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.СпособРаспределения,
	        |	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ,
	        |	ТочкиСубабонентов.Коэффициент,
	        |	ТочкиСубабонентов.УчитыватьИндивидуальноеПотребление,
	        |	ТочкиСубабонентов.СпособРаспределенияОстатка,
	        |	ТочкиСубабонентов.КоэффициентДолевогоРаспределения,
	        |	ТочкиСубабонентов.ФиксированныйОбъем
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	СтабПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	МАКСИМУМ(СтабПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	        |	МАКСИМУМ(СтабПериоды.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	        |	ВЫБОР
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	        |			ТОГДА 2
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК Приоритет,
	        |	МАКСИМУМ(ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0)) КАК ЗначениеНорматива,
	        |	СтабПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	МАКСИМУМ(ЕСТЬNULL(ГарантированныеОбъемы.ОбъемУслуги, 0)) КАК ДоговорнойОбъем,
	        |	СУММА(ВЫБОР
	        |			КОГДА СтабПериоды.ПриборВведен
	        |				ТОГДА 1
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК КоличествоПриборов,
	        |	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	ПоследниеНомераСтрокСуб.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СтабПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	СтабПериоды.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	ПоследниеНомераСтрокСуб.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ ПараметрыСтабПериодовСуб
	        |ИЗ
	        |	ПоследниеНомераСтрокСуб КАК ПоследниеНомераСтрокСуб
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериоды КАК СтабПериоды
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	        |			ПО СтабПериоды.Организация = ЗначенияТекущихНормПотребления.Организация
	        |				И СтабПериоды.Район = ЗначенияТекущихНормПотребления.Район
	        |				И СтабПериоды.Услуга = ЗначенияТекущихНормПотребления.Район
	        |				И СтабПериоды.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	        |			ПО СтабПериоды.Организация = ГарантированныеОбъемы.Организация
	        |				И СтабПериоды.Район = ГарантированныеОбъемы.Район
	        |				И СтабПериоды.Договор = ГарантированныеОбъемы.Договор
	        |				И СтабПериоды.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	        |				И СтабПериоды.Услуга = ГарантированныеОбъемы.Услуга
	        |		ПО ПоследниеНомераСтрокСуб.Организация = СтабПериоды.Организация
	        |			И ПоследниеНомераСтрокСуб.Район = СтабПериоды.Район
	        |			И ПоследниеНомераСтрокСуб.Договор = СтабПериоды.Договор
	        |			И ПоследниеНомераСтрокСуб.ОбъектРасчета = СтабПериоды.ОбъектРасчета
	        |			И ПоследниеНомераСтрокСуб.Услуга = СтабПериоды.Услуга
	        |			И ПоследниеНомераСтрокСуб.НомерПозиции = СтабПериоды.НомерПозиции
	        |			И ПоследниеНомераСтрокСуб.ТочкаУчета = СтабПериоды.ТочкаУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО ПоследниеНомераСтрокСуб.Услуга = энргВидыУслуг.Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтабПериоды.Организация,
	        |	СтабПериоды.Район,
	        |	СтабПериоды.Договор,
	        |	СтабПериоды.ОбъектРасчета,
	        |	СтабПериоды.Услуга,
	        |	СтабПериоды.ТочкаУчета,
	        |	СтабПериоды.ЗависимаяТочкаУчета,
	        |	СтабПериоды.СпособРасчетаНорматива,
	        |	ВЫБОР
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.Остаток)
	        |			ТОГДА 2
	        |		КОГДА СтабПериоды.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноОбъемуНачисленнойУслуги)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	энргВидыУслуг.ЗависитОтУслуги,
	        |	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета,
	        |	СтабПериоды.КоэффициентРасчета,
	        |	СтабПериоды.РасчетИндивидуальногоПотребления,
	        |	ПоследниеНомераСтрокСуб.УслугаДолевойТУ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.Организация КАК Организация,
	        |	бестОбъемНачисленийНП.Район КАК Район,
	        |	бестОбъемНачисленийНП.Договор КАК Договор,
	        |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	        |	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	        |	ПараметрыСтабПериодовСуб.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	        |	ПараметрыСтабПериодовСуб.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	ПараметрыСтабПериодовСуб.ДоговорнойОбъем КАК ДоговорнойОбъем,
	        |	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	        |	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	        |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот,
	        |	СУММА(бестОбъемНачисленийНП.КоличествоЧасовРаботыТУ) КАК КоличествоЧасовРаботыТУОборот,
	        |	СУММА(бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ) КАК КоличествоЧасовШтатнойРаботыПУ,
	        |	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.ТарифнаяЗона) КАК ТарифнаяЗона,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.Поставщик) КАК Поставщик
	        |ПОМЕСТИТЬ ОбъемНачисленийСубабонентов
	        |ИЗ
	        |	ПараметрыСтабПериодовСуб КАК ПараметрыСтабПериодовСуб
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ПО ПараметрыСтабПериодовСуб.Организация = бестОбъемНачисленийНП.Организация
	        |			И ПараметрыСтабПериодовСуб.Район = бестОбъемНачисленийНП.Район
	        |			И ПараметрыСтабПериодовСуб.Договор = бестОбъемНачисленийНП.Договор
	        |			И ПараметрыСтабПериодовСуб.ОбъектРасчета = бестОбъемНачисленийНП.ОбъектРасчета
	        |			И ПараметрыСтабПериодовСуб.Услуга = бестОбъемНачисленийНП.Услуга
	        |			И ПараметрыСтабПериодовСуб.ТочкаУчета = бестОбъемНачисленийНП.ТочкаУчета
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА ПараметрыСтабПериодовСуб.РасчетИндивидуальногоПотребления
	        |				ТОГДА ПараметрыСтабПериодовСуб.ТочкаУчета <> ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |	И бестОбъемНачисленийНП.Организация = &Организация
	        |	И бестОбъемНачисленийНП.Район = &Район
	        |	И НЕ бестОбъемНачисленийНП.Распределение
	        |	И НЕ бестОбъемНачисленийНП.ДолевоеРаспределение
	        |	И бестОбъемНачисленийНП.Период >= &НачалоПериода
	        |	И бестОбъемНачисленийНП.Период <= &КонецПериода
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийНП.Организация,
	        |	бестОбъемНачисленийНП.Район,
	        |	бестОбъемНачисленийНП.Договор,
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.ВидНачисления,
	        |	бестОбъемНачисленийНП.ПриборУчета,
	        |	ПараметрыСтабПериодовСуб.ДоговорДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.КоэффициентРасчета,
	        |	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ,
	        |	бестОбъемНачисленийНП.СпособНачисления,
	        |	ПараметрыСтабПериодовСуб.ЗначениеНагрузки,
	        |	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива,
	        |	ПараметрыСтабПериодовСуб.ДоговорнойОбъем,
	        |	бестОбъемНачисленийНП.ПериодРасчета,
	        |	бестОбъемНачисленийНП.ПериодНачисления,
	        |	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СтабПериоды.Организация КАК Организация,
	        |	СтабПериоды.Район КАК Район,
	        |	СтабПериоды.Договор КАК Договор,
	        |	СтабПериоды.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтабПериоды.Услуга КАК Услуга,
	        |	СтабПериоды.ТочкаУчета КАК ТочкаУчета,
	        |	ПоследниеНомераСтрокСуб.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПоследниеНомераСтрокСуб.УслугаДолевойТУ КАК УслугаДолевойТУ,
	        |	СтабПериоды.ПриборУчета КАК ПриборУчета
	        |ПОМЕСТИТЬ СубабонентыСПрибором
	        |ИЗ
	        |	ПоследниеНомераСтрокСуб КАК ПоследниеНомераСтрокСуб
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабПериоды КАК СтабПериоды
	        |		ПО ПоследниеНомераСтрокСуб.Организация = СтабПериоды.Организация
	        |			И ПоследниеНомераСтрокСуб.Район = СтабПериоды.Район
	        |			И ПоследниеНомераСтрокСуб.Договор = СтабПериоды.Договор
	        |			И ПоследниеНомераСтрокСуб.ОбъектРасчета = СтабПериоды.ОбъектРасчета
	        |			И ПоследниеНомераСтрокСуб.Услуга = СтабПериоды.Услуга
	        |			И ПоследниеНомераСтрокСуб.НомерПозиции = СтабПериоды.НомерПозиции
	        |			И ПоследниеНомераСтрокСуб.ТочкаУчета = СтабПериоды.ТочкаУчета
	        |ГДЕ
	        |	СтабПериоды.ПриборВведен
	        |	И СтабПериоды.ДоговорЗаключен
	        |	И СтабПериоды.УслугаПодключена
	        |	И СтабПериоды.ОбъектРасчетаПодключен
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СтабПериоды.Организация,
	        |	СтабПериоды.Район,
	        |	СтабПериоды.Договор,
	        |	СтабПериоды.ОбъектРасчета,
	        |	СтабПериоды.Услуга,
	        |	СтабПериоды.ТочкаУчета,
	        |	СтабПериоды.СпособРаспределенияОбъемаДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ДоговорДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ОбъектРасчетаДолевойТУ,
	        |	ПоследниеНомераСтрокСуб.ГоловнаяТочкаУчета,
	        |	ПоследниеНомераСтрокСуб.УслугаДолевойТУ,
	        |	СтабПериоды.ПриборУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СубабонентыСПрибором.Организация КАК Организация,
	        |	СубабонентыСПрибором.Район КАК Район,
	        |	СубабонентыСПрибором.Договор КАК Договор,
	        |	СубабонентыСПрибором.ОбъектРасчета КАК ОбъектРасчета,
	        |	СубабонентыСПрибором.Услуга КАК Услуга,
	        |	СубабонентыСПрибором.ТочкаУчета КАК ТочкаУчета,
	        |	СубабонентыСПрибором.ПриборУчета КАК ПриборУчета,
	        |	СубабонентыСПрибором.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	СубабонентыСПрибором.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СубабонентыСПрибором.УслугаДолевойТУ КАК УслугаДолевойТУ,
	        |	СубабонентыСПрибором.ДоговорДолевойТУ КАК ДоговорДолевойТУ
	        |ПОМЕСТИТЬ СубабонентыСПриборомБезПоказаний
	        |ИЗ
	        |	СубабонентыСПрибором КАК СубабонентыСПрибором
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |		ПО СубабонентыСПрибором.Организация = ОбъемНачисленийСубабонентов.Организация
	        |			И СубабонентыСПрибором.Район = ОбъемНачисленийСубабонентов.Район
	        |			И СубабонентыСПрибором.Договор = ОбъемНачисленийСубабонентов.Договор
	        |			И СубабонентыСПрибором.ОбъектРасчета = ОбъемНачисленийСубабонентов.ОбъектРасчета
	        |			И СубабонентыСПрибором.ТочкаУчета = ОбъемНачисленийСубабонентов.ТочкаУчета
	        |			И (СубабонентыСПрибором.ОбъектРасчета = СубабонентыСПрибором.ОбъектРасчетаДолевойТУ)
	        |			И (СубабонентыСПрибором.ГоловнаяТочкаУчета = СубабонентыСПрибором.ТочкаУчета)
	        |			И СубабонентыСПрибором.Услуга = ОбъемНачисленийСубабонентов.Услуга
	        |ГДЕ
	        |	ОбъемНачисленийСубабонентов.СпособНачисления <> ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	        |	И ОбъемНачисленийСубабонентов.СпособНачисления <> ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.Начислениепосреднему)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестПриборыУзловУчетаНПСрезПоследних.Организация КАК Организация,
	        |	бестПриборыУзловУчетаНПСрезПоследних.Район КАК Район,
	        |	бестПриборыУзловУчетаНПСрезПоследних.Договор КАК Договор,
	        |	бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестПриборыУзловУчетаНПСрезПоследних.УзелУчета КАК УзелУчета,
	        |	бестПриборыУзловУчетаНПСрезПоследних.ТипИзмерителя КАК ТипИзмерителя,
	        |	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	        |	СубабонентыСПрибором.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	СубабонентыСПрибором.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	СубабонентыСПрибором.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СубабонентыСПрибором.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ ПриборыУзловУчетаСубабонентов
	        |ИЗ
	        |	СубабонентыСПрибором КАК СубабонентыСПрибором
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И Договор В
	        |						(ВЫБРАТЬ
	        |							СубабонентыСПрибором.Договор
	        |						ИЗ
	        |							СубабонентыСПрибором)) КАК бестПриборыУзловУчетаНПСрезПоследних
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	        |					&КонецПериода,
	        |					Организация = &Организация
	        |						И Район = &Район
	        |						И Договор В
	        |							(ВЫБРАТЬ
	        |								СубабонентыСПрибором.Договор
	        |							ИЗ
	        |								СубабонентыСПрибором)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	        |			ПО бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета = бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета
	        |				И бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета = бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета
	        |				И бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета = бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета
	        |		ПО СубабонентыСПрибором.Организация = бестПриборыУзловУчетаНПСрезПоследних.Организация
	        |			И СубабонентыСПрибором.Район = бестПриборыУзловУчетаНПСрезПоследних.Район
	        |			И СубабонентыСПрибором.Договор = бестПриборыУзловУчетаНПСрезПоследних.Договор
	        |			И СубабонентыСПрибором.ОбъектРасчета = бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета
	        |			И СубабонентыСПрибором.ТочкаУчета = бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета
	        |			И СубабонентыСПрибором.ПриборУчета = бестПриборыУзловУчетаНПСрезПоследних.УзелУчета
	        |ГДЕ
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СубабонентыСПрибором.Организация КАК Организация,
	        |	СубабонентыСПрибором.Район КАК Район,
	        |	СубабонентыСПрибором.Договор КАК Договор,
	        |	СубабонентыСПрибором.ОбъектРасчета КАК ОбъектРасчета,
	        |	СубабонентыСПрибором.Услуга КАК Услуга,
	        |	СубабонентыСПрибором.ТочкаУчета КАК ТочкаУчета,
	        |	СубабонентыСПрибором.ПриборУчета КАК ПриборУчета,
	        |	энргТипыУзловУчетаСоставУзла.ТипИзмерителя КАК ТипИзмерителя
	        |ПОМЕСТИТЬ СоставИзмерителейПоТипуУзлаУчета
	        |ИЗ
	        |	СубабонентыСПрибором КАК СубабонентыСПрибором
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.СоставУзла КАК энргТипыУзловУчетаСоставУзла
	        |		ПО СубабонентыСПрибором.ПриборУчета.ТипУзлаУчета = энргТипыУзловУчетаСоставУзла.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПриборыУзловУчетаСубабонентов.Организация КАК Организация,
	        |	ПриборыУзловУчетаСубабонентов.Район КАК Район,
	        |	ПриборыУзловУчетаСубабонентов.Договор КАК Договор,
	        |	ПриборыУзловУчетаСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПриборыУзловУчетаСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ПриборыУзловУчетаСубабонентов.УзелУчета КАК УзелУчета,
	        |	ПриборыУзловУчетаСубабонентов.ТипИзмерителя КАК ТипИзмерителя,
	        |	ПриборыУзловУчетаСубабонентов.ПриборУчета КАК ПриборУчета,
	        |	ПриборыУзловУчетаСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ ПриборыУзлаУчетаКомУчет
	        |ИЗ
	        |	ПриборыУзловУчетаСубабонентов КАК ПриборыУзловУчетаСубабонентов
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставИзмерителейПоТипуУзлаУчета КАК СоставИзмерителейПоТипуУзлаУчета
	        |		ПО ПриборыУзловУчетаСубабонентов.Организация = СоставИзмерителейПоТипуУзлаУчета.Организация
	        |			И ПриборыУзловУчетаСубабонентов.Район = СоставИзмерителейПоТипуУзлаУчета.Район
	        |			И ПриборыУзловУчетаСубабонентов.Договор = СоставИзмерителейПоТипуУзлаУчета.Договор
	        |			И ПриборыУзловУчетаСубабонентов.ОбъектРасчета = СоставИзмерителейПоТипуУзлаУчета.ОбъектРасчета
	        |			И ПриборыУзловУчетаСубабонентов.ТочкаУчета = СоставИзмерителейПоТипуУзлаУчета.ТочкаУчета
	        |			И ПриборыУзловУчетаСубабонентов.УзелУчета = СоставИзмерителейПоТипуУзлаУчета.ПриборУчета
	        |			И ПриборыУзловУчетаСубабонентов.ТипИзмерителя = СоставИзмерителейПоТипуУзлаУчета.ТипИзмерителя
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПриборыУзлаУчетаКомУчет.Организация КАК Организация,
	        |	ПриборыУзлаУчетаКомУчет.Район КАК Район,
	        |	ПриборыУзлаУчетаКомУчет.Договор КАК Договор,
	        |	ПриборыУзлаУчетаКомУчет.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПриборыУзлаУчетаКомУчет.ТочкаУчета КАК ТочкаУчета,
	        |	ПриборыУзлаУчетаКомУчет.УзелУчета КАК УзелУчета,
	        |	ПриборыУзлаУчетаКомУчет.ТипИзмерителя КАК ТипИзмерителя,
	        |	ПриборыУзлаУчетаКомУчет.ПриборУчета КАК ПриборУчета,
	        |	ПриборыУзлаУчетаКомУчет.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПриборыУзлаУчетаКомУчет.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПриборыУзлаУчетаКомУчет.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПриборыУзлаУчетаКомУчет.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ ДанныеВыводаЧастиУзлаУчета
	        |ИЗ
	        |	ПриборыУзлаУчетаКомУчет КАК ПриборыУзлаУчетаКомУчет
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестВыводПриборовУчетаНП КАК бестВыводПриборовУчетаНП
	        |		ПО ПриборыУзлаУчетаКомУчет.Организация = бестВыводПриборовУчетаНП.Организация
	        |			И ПриборыУзлаУчетаКомУчет.Район = бестВыводПриборовУчетаНП.Район
	        |			И ПриборыУзлаУчетаКомУчет.Договор = бестВыводПриборовУчетаНП.Договор
	        |			И ПриборыУзлаУчетаКомУчет.ОбъектРасчета = бестВыводПриборовУчетаНП.ОбъектРасчета
	        |			И ПриборыУзлаУчетаКомУчет.ТочкаУчета = бестВыводПриборовУчетаНП.ТочкаУчета
	        |			И ПриборыУзлаУчетаКомУчет.ПриборУчета = бестВыводПриборовУчетаНП.ПриборУчета
	        |			И (ПриборыУзлаУчетаКомУчет.ОбъектРасчета = ПриборыУзлаУчетаКомУчет.ОбъектРасчетаДолевойТУ)
	        |			И (ПриборыУзлаУчетаКомУчет.ГоловнаяТочкаУчета = ПриборыУзлаУчетаКомУчет.ТочкаУчета)
	        |ГДЕ
	        |	бестВыводПриборовУчетаНП.Организация = &Организация
	        |	И бестВыводПриборовУчетаНП.ПериодНачисления = &ПериодНачисления
	        |	И бестВыводПриборовУчетаНП.Район = &Район
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПриборыУзловУчетаСубабонентов.Организация КАК Организация,
	        |	ПриборыУзловУчетаСубабонентов.Район КАК Район,
	        |	ПриборыУзловУчетаСубабонентов.Договор КАК Договор,
	        |	ПриборыУзловУчетаСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПриборыУзловУчетаСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ПриборыУзловУчетаСубабонентов.УзелУчета КАК УзелУчета,
	        |	ПриборыУзловУчетаСубабонентов.ТипИзмерителя КАК ТипИзмерителя,
	        |	ПриборыУзловУчетаСубабонентов.ПриборУчета КАК ПриборУчета,
	        |	ПриборыУзловУчетаСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ ИстекшаяДатаКомУчета
	        |ИЗ
	        |	ПриборыУзловУчетаСубабонентов КАК ПриборыУзловУчетаСубабонентов
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И (Договор, ТочкаУчета, ПриборУчета) В
	        |						(ВЫБРАТЬ
	        |							ПриборыУзловУчетаСубабонентов.Договор,
	        |							ПриборыУзловУчетаСубабонентов.ТочкаУчета,
	        |							ПриборыУзловУчетаСубабонентов.ПриборУчета
	        |						ИЗ
	        |							ПриборыУзловУчетаСубабонентов)) КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних
	        |		ПО ПриборыУзловУчетаСубабонентов.Организация = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Организация
	        |			И ПриборыУзловУчетаСубабонентов.Район = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Район
	        |			И ПриборыУзловУчетаСубабонентов.Договор = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.Договор
	        |			И ПриборыУзловУчетаСубабонентов.ТочкаУчета = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ТочкаУчета
	        |			И ПриборыУзловУчетаСубабонентов.ПриборУчета = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ПриборУчета
	        |			И (ВЫБОР
	        |				КОГДА бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета = ДАТАВРЕМЯ(1, 1, 1)
	        |					ТОГДА ЛОЖЬ
	        |				ИНАЧЕ бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета < &КонецПериода
	        |			КОНЕЦ)
	        |			И (ПриборыУзловУчетаСубабонентов.ОбъектРасчета = ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ)
	        |			И (ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета = ПриборыУзловУчетаСубабонентов.ТочкаУчета)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПриборыУзловУчетаСубабонентов.Организация КАК Организация,
	        |	ПриборыУзловУчетаСубабонентов.Район КАК Район,
	        |	ПриборыУзловУчетаСубабонентов.Договор КАК Договор,
	        |	ПриборыУзловУчетаСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПриборыУзловУчетаСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ПриборыУзловУчетаСубабонентов.УзелУчета КАК УзелУчета,
	        |	ПриборыУзловУчетаСубабонентов.ТипИзмерителя КАК ТипИзмерителя,
	        |	ПриборыУзловУчетаСубабонентов.ПриборУчета КАК ПриборУчета,
	        |	ПриборыУзловУчетаСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ НачисленоНеПоПрибору
	        |ИЗ
	        |	ПриборыУзловУчетаСубабонентов КАК ПриборыУзловУчетаСубабонентов
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |		ПО ПриборыУзловУчетаСубабонентов.ОбъектРасчетаДолевойТУ = ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ
	        |			И ПриборыУзловУчетаСубабонентов.УслугаДолевойТУ = ОбъемНачисленийСубабонентов.Услуга
	        |			И (ВЫБОР
	        |				КОГДА ОбъемНачисленийСубабонентов.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.Среднеепонормативу)
	        |						И ОбъемНачисленийСубабонентов.НаличиеЗарегистрированногоОбъема
	        |					ТОГДА ИСТИНА
	        |				ИНАЧЕ ЛОЖЬ
	        |			КОНЕЦ)
	        |			И (ОбъемНачисленийСубабонентов.ТочкаУчета = ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета)
	        |			И (ОбъемНачисленийСубабонентов.ОбъектРасчета = ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ)
	        |			И ПриборыУзловУчетаСубабонентов.ГоловнаяТочкаУчета = ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеВыводаЧастиУзлаУчета.Организация КАК Организация,
	        |	ДанныеВыводаЧастиУзлаУчета.Район КАК Район,
	        |	ДанныеВыводаЧастиУзлаУчета.Договор КАК Договор,
	        |	ДанныеВыводаЧастиУзлаУчета.ОбъектРасчета КАК ОбъектРасчета,
	        |	ДанныеВыводаЧастиУзлаУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ДанныеВыводаЧастиУзлаУчета.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ДанныеВыводаЧастиУзлаУчета.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ДанныеВыводаЧастиУзлаУчета.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ДанныеВыводаЧастиУзлаУчета.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |ПОМЕСТИТЬ СубабонентыСВышедшимИзСтрояПУОбъединение
	        |ИЗ
	        |	ДанныеВыводаЧастиУзлаУчета КАК ДанныеВыводаЧастиУзлаУчета
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	СубабонентыСПриборомБезПоказаний.Организация,
	        |	СубабонентыСПриборомБезПоказаний.Район,
	        |	СубабонентыСПриборомБезПоказаний.Договор,
	        |	СубабонентыСПриборомБезПоказаний.ОбъектРасчета,
	        |	СубабонентыСПриборомБезПоказаний.ТочкаУчета,
	        |	СубабонентыСПриборомБезПоказаний.ДоговорДолевойТУ,
	        |	СубабонентыСПриборомБезПоказаний.ОбъектРасчетаДолевойТУ,
	        |	СубабонентыСПриборомБезПоказаний.ГоловнаяТочкаУчета,
	        |	СубабонентыСПриборомБезПоказаний.УслугаДолевойТУ
	        |ИЗ
	        |	СубабонентыСПриборомБезПоказаний КАК СубабонентыСПриборомБезПоказаний
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ИстекшаяДатаКомУчета.Организация,
	        |	ИстекшаяДатаКомУчета.Район,
	        |	ИстекшаяДатаКомУчета.Договор,
	        |	ИстекшаяДатаКомУчета.ОбъектРасчета,
	        |	ИстекшаяДатаКомУчета.ТочкаУчета,
	        |	ИстекшаяДатаКомУчета.ДоговорДолевойТУ,
	        |	ИстекшаяДатаКомУчета.ОбъектРасчетаДолевойТУ,
	        |	ИстекшаяДатаКомУчета.ГоловнаяТочкаУчета,
	        |	ИстекшаяДатаКомУчета.УслугаДолевойТУ
	        |ИЗ
	        |	ИстекшаяДатаКомУчета КАК ИстекшаяДатаКомУчета
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	НачисленоНеПоПрибору.Организация,
	        |	НачисленоНеПоПрибору.Район,
	        |	НачисленоНеПоПрибору.Договор,
	        |	НачисленоНеПоПрибору.ОбъектРасчета,
	        |	НачисленоНеПоПрибору.ТочкаУчета,
	        |	НачисленоНеПоПрибору.ДоговорДолевойТУ,
	        |	НачисленоНеПоПрибору.ОбъектРасчетаДолевойТУ,
	        |	НачисленоНеПоПрибору.ГоловнаяТочкаУчета,
	        |	НачисленоНеПоПрибору.УслугаДолевойТУ
	        |ИЗ
	        |	НачисленоНеПоПрибору КАК НачисленоНеПоПрибору
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СубабонентыСВышедшимИзСтрояПУОбъединение.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	СубабонентыСВышедшимИзСтрояПУОбъединение.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	СубабонентыСВышедшимИзСтрояПУОбъединение.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СубабонентыСВышедшимИзСтрояПУОбъединение.УслугаДолевойТУ КАК УслугаДолевойТУ,
	        |	СубабонентыСВышедшимИзСтрояПУОбъединение.Организация КАК Организация,
	        |	СубабонентыСВышедшимИзСтрояПУОбъединение.Район КАК Район
	        |ПОМЕСТИТЬ СхемыСВышедшимИзСтрояПУ
	        |ИЗ
	        |	СубабонентыСВышедшимИзСтрояПУОбъединение КАК СубабонентыСВышедшимИзСтрояПУОбъединение
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТочкаОсновнойУслуги.Организация КАК Организация,
	        |	ТочкаОсновнойУслуги.Район КАК Район,
	        |	ТочкаОсновнойУслуги.Договор КАК Договор,
	        |	ТочкаОсновнойУслуги.ОбъектРасчета КАК ОбъектРасчета,
	        |	ТочкаОсновнойУслуги.Услуга КАК Услуга,
	        |	ТочкаОсновнойУслуги.ТочкаУчета КАК ТочкаУчета,
	        |	ТочкаЗависимойУслуги.ЗначениеНагрузки КАК ЗначениеНагрузки
	        |ПОМЕСТИТЬ ЗначениеНагрузкиЗависимойУслуги
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ТочкаОсновнойУслуги
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыСубабонентов КАК ТочкаЗависимойУслуги
	        |		ПО ТочкаОсновнойУслуги.Организация = ТочкаЗависимойУслуги.Организация
	        |			И ТочкаОсновнойУслуги.Район = ТочкаЗависимойУслуги.Район
	        |			И ТочкаОсновнойУслуги.Договор = ТочкаЗависимойУслуги.Договор
	        |			И ТочкаОсновнойУслуги.ОбъектРасчета = ТочкаЗависимойУслуги.ОбъектРасчета
	        |			И ТочкаОсновнойУслуги.ТочкаУчета = ТочкаЗависимойУслуги.ТочкаУчета
	        |			И ТочкаОсновнойУслуги.Услуга = ТочкаЗависимойУслуги.ЗависитОтУслуги
	        |ГДЕ
	        |	ТочкаОсновнойУслуги.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноНагрузке)
	        |	И ТочкаОсновнойУслуги.ЗначениеНагрузки = 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПараметрыСубабонентов.Договор КАК Договор,
	        |	ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПараметрыСубабонентов.Услуга КАК Услуга,
	        |	ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ПараметрыСубабонентов.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	ГарантированныеОбъемы.ОбъемУслуги КАК ДоговорнойОбъем
	        |ПОМЕСТИТЬ ЗначенияПараметровОсновныхТочек
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ГарантированныеОбъемы КАК ГарантированныеОбъемы
	        |		ПО ПараметрыСубабонентов.Договор = ГарантированныеОбъемы.Договор
	        |			И ПараметрыСубабонентов.ОбъектРасчета = ГарантированныеОбъемы.ОбъектРасчета
	        |			И ПараметрыСубабонентов.Услуга = ГарантированныеОбъемы.Услуга
	        |ГДЕ
	        |	ПараметрыСубабонентов.Услуга.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.Район КАК Район,
	        |	бестОбъемНачисленийНП.Договор КАК Договор,
	        |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	        |	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийНП.Шкала КАК Шкала,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот
	        |ПОМЕСТИТЬ ОбъемыДолевойТУДляРаспределения
	        |ИЗ
	        |	УровеньДолевыхТУ КАК УровеньДолевыхТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ПО УровеньДолевыхТУ.Организация = бестОбъемНачисленийНП.Организация
	        |			И УровеньДолевыхТУ.Район = бестОбъемНачисленийНП.Район
	        |			И УровеньДолевыхТУ.Договор = бестОбъемНачисленийНП.Договор
	        |			И УровеньДолевыхТУ.ОбъектРасчета = бестОбъемНачисленийНП.ОбъектРасчета
	        |			И УровеньДолевыхТУ.Услуга = бестОбъемНачисленийНП.Услуга
	        |			И УровеньДолевыхТУ.ТочкаУчета = бестОбъемНачисленийНП.ТочкаУчета
	        |ГДЕ
	        |	бестОбъемНачисленийНП.Организация = &Организация
	        |	И бестОбъемНачисленийНП.Район = &Район
	        |	И бестОбъемНачисленийНП.ПериодНачисления = &ПериодНачисления
	        |	И НЕ бестОбъемНачисленийНП.Распределение
	        |	И НЕ бестОбъемНачисленийНП.ДолевоеРаспределение
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийНП.Район,
	        |	бестОбъемНачисленийНП.Договор,
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.СпособНачисления,
	        |	бестОбъемНачисленийНП.ПриборУчета,
	        |	бестОбъемНачисленийНП.Шкала,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	        |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	        |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Договор КАК Договор,
	        |	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	        |	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	        |	бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника
	        |ПОМЕСТИТЬ ТемпературыИсточника
	        |ИЗ
	        |	РегистрСведений.бестТемператураИсточника.СрезПоследних(
	        |			&КонецПериода,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестТемператураИсточникаСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И (Договор, ОбъектРасчета, ТочкаУчета) В
	        |						(ВЫБРАТЬ
	        |							ТочкиСубабонентов.ДоговорСубабонента,
	        |							ТочкиСубабонентов.ОбъектРасчетаСубабонента,
	        |							ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |						ИЗ
	        |							ТочкиСубабонентов КАК ТочкиСубабонентов)) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	        |		ПО бестТемператураИсточникаСрезПоследних.Организация = бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация
	        |			И бестТемператураИсточникаСрезПоследних.Район = бестСтруктураСетиТочекУчетаНПСрезПоследних.Район
	        |			И бестТемператураИсточникаСрезПоследних.Источник = бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, 0) КАК ПроектнаяТемпература,
	        |	ЕСТЬNULL(бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	        |	ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, 0) КАК ТемператураОптимальная,
	        |	ТочкиСубабонентов.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	ТочкиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	ТочкиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	ЕСТЬNULL(ТемпературыИсточника.ТемператураПодачиИсточника, 0) КАК ТемператураПодачиИсточника,
	        |	ЕСТЬNULL(ТемпературыИсточника.ТемператураХолоднойВодыИсточника, 0) КАК ТемператураХолоднойВодыИсточника,
	        |	ТочкиСубабонентов.УслугаСубабонента КАК УслугаСубабонента
	        |ПОМЕСТИТЬ ДанныеПоТемпературам
	        |ИЗ
	        |	ТочкиСубабонентов КАК ТочкиСубабонентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И РасчетныйМесяц = &ПериодНачисления) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	        |		ПО ТочкиСубабонентов.Организация = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Организация
	        |			И ТочкиСубабонентов.Район = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.Район
	        |			И ТочкиСубабонентов.Услуга.Сезонность = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.ВидПериода
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	        |		ПО ТочкиСубабонентов.Организация = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация
	        |			И ТочкиСубабонентов.Район = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	        |		ПО ТочкиСубабонентов.Организация = бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация
	        |			И ТочкиСубабонентов.Район = бестТемпературыВКатегорияхОбъектовСрезПоследних.Район
	        |			И ТочкиСубабонентов.ОбъектРасчетаСубабонента.КатегорияПомещения = бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТемпературыИсточника КАК ТемпературыИсточника
	        |		ПО ТочкиСубабонентов.Организация = ТемпературыИсточника.Организация
	        |			И ТочкиСубабонентов.Район = ТемпературыИсточника.Район
	        |			И ТочкиСубабонентов.ДоговорСубабонента = ТемпературыИсточника.Договор
	        |			И ТочкиСубабонентов.ОбъектРасчетаСубабонента = ТемпературыИсточника.ОбъектРасчета
	        |			И ТочкиСубабонентов.ТочкаУчетаСубабонента = ТемпературыИсточника.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТочкиСубабонентов.Организация КАК Организация,
	        |	ТочкиСубабонентов.Район КАК Район,
	        |	ТочкиСубабонентов.Договор КАК Договор,
	        |	ТочкиСубабонентов.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	ТочкиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	ТочкиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	ТочкиСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	        |	ТочкиСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ТочкиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ТочкиСубабонентов.Услуга КАК Услуга
	        |ПОМЕСТИТЬ УслугиСубабонентов
	        |ИЗ
	        |	ТочкиСубабонентов КАК ТочкиСубабонентов
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УслугиСубабонентов.Организация КАК Организация,
	        |	УслугиСубабонентов.Район КАК Район,
	        |	УслугиСубабонентов.Договор КАК Договор,
	        |	УслугиСубабонентов.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	УслугиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	УслугиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	УслугиСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	        |	УслугиСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	УслугиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	УслугиСубабонентов.Услуга КАК Услуга,
	        |	УслугиСубабонентов.УслугаСубабонента.ЗависитОтУслуги КАК ЗависимаяУслуга
	        |ПОМЕСТИТЬ ЗависимыеУслугиСуб
	        |ИЗ
	        |	УслугиСубабонентов КАК УслугиСубабонентов
	        |ГДЕ
	        |	УслугиСубабонентов.УслугаСубабонента.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УслугиСубабонентов.Организация КАК Организация,
	        |	УслугиСубабонентов.Район КАК Район,
	        |	УслугиСубабонентов.Договор КАК Договор,
	        |	УслугиСубабонентов.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	УслугиСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	УслугиСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	УслугиСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	        |	УслугиСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	УслугиСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	УслугиСубабонентов.Услуга КАК Услуга,
	        |	энргВидыУслуг.Ссылка КАК ЗависимаяУслуга
	        |ПОМЕСТИТЬ ОбратноЗависимыеУслугиСуб
	        |ИЗ
	        |	УслугиСубабонентов КАК УслугиСубабонентов
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО УслугиСубабонентов.УслугаСубабонента = энргВидыУслуг.ЗависитОтУслуги
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗависимыеУслугиСуб.Организация КАК Организация,
	        |	ЗависимыеУслугиСуб.Район КАК Район,
	        |	ЗависимыеУслугиСуб.Договор КАК Договор,
	        |	ЗависимыеУслугиСуб.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	ЗависимыеУслугиСуб.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	ЗависимыеУслугиСуб.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	ЗависимыеУслугиСуб.УслугаСубабонента КАК УслугаСубабонента,
	        |	ЗависимыеУслугиСуб.ОбъектРасчета КАК ОбъектРасчета,
	        |	ЗависимыеУслугиСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ЗависимыеУслугиСуб.Услуга КАК Услуга,
	        |	ЗависимыеУслугиСуб.ЗависимаяУслуга КАК ЗависимаяУслуга
	        |ПОМЕСТИТЬ ВзаимозависимыеУслугиСуб
	        |ИЗ
	        |	ЗависимыеУслугиСуб КАК ЗависимыеУслугиСуб
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ОбратноЗависимыеУслугиСуб.Организация,
	        |	ОбратноЗависимыеУслугиСуб.Район,
	        |	ОбратноЗависимыеУслугиСуб.Договор,
	        |	ОбратноЗависимыеУслугиСуб.ДоговорСубабонента,
	        |	ОбратноЗависимыеУслугиСуб.ОбъектРасчетаСубабонента,
	        |	ОбратноЗависимыеУслугиСуб.ТочкаУчетаСубабонента,
	        |	ОбратноЗависимыеУслугиСуб.УслугаСубабонента,
	        |	ОбратноЗависимыеУслугиСуб.ОбъектРасчета,
	        |	ОбратноЗависимыеУслугиСуб.ГоловнаяТочкаУчета,
	        |	ОбратноЗависимыеУслугиСуб.Услуга,
	        |	ОбратноЗависимыеУслугиСуб.ЗависимаяУслуга
	        |ИЗ
	        |	ОбратноЗависимыеУслугиСуб КАК ОбратноЗависимыеУслугиСуб
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВзаимозависимыеУслугиСуб.Организация КАК Организация,
	        |	ВзаимозависимыеУслугиСуб.Район КАК Район,
	        |	ВзаимозависимыеУслугиСуб.Договор КАК Договор,
	        |	ВзаимозависимыеУслугиСуб.ДоговорСубабонента КАК ДоговорСубабонента,
	        |	ВзаимозависимыеУслугиСуб.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	        |	ВзаимозависимыеУслугиСуб.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	        |	ВзаимозависимыеУслугиСуб.УслугаСубабонента КАК УслугаСубабонента,
	        |	ВзаимозависимыеУслугиСуб.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВзаимозависимыеУслугиСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ВзаимозависимыеУслугиСуб.Услуга КАК Услуга,
	        |	ВзаимозависимыеУслугиСуб.ЗависимаяУслуга КАК ЗависимаяУслуга,
	        |	бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка КАК Нагрузка
	        |ПОМЕСТИТЬ НагрузкиЗависимыхУслуг
	        |ИЗ
	        |	ВзаимозависимыеУслугиСуб КАК ВзаимозависимыеУслугиСуб
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНагрузкаПоУслугамНП.СрезПоследних(
	        |				&КонецПериода,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И (Договор, ОбъектРасчета) В
	        |						(ВЫБРАТЬ
	        |							ВзаимозависимыеУслугиСуб.ДоговорСубабонента,
	        |							ВзаимозависимыеУслугиСуб.ОбъектРасчетаСубабонента
	        |						ИЗ
	        |							ВзаимозависимыеУслугиСуб КАК ВзаимозависимыеУслугиСуб)) КАК бестНагрузкаПоУслугамНПСрезПоследних
	        |		ПО ВзаимозависимыеУслугиСуб.Организация = бестНагрузкаПоУслугамНПСрезПоследних.Организация
	        |			И ВзаимозависимыеУслугиСуб.Район = бестНагрузкаПоУслугамНПСрезПоследних.Район
	        |			И ВзаимозависимыеУслугиСуб.ДоговорСубабонента = бестНагрузкаПоУслугамНПСрезПоследних.Договор
	        |			И ВзаимозависимыеУслугиСуб.ОбъектРасчетаСубабонента = бестНагрузкаПоУслугамНПСрезПоследних.ОбъектРасчета
	        |			И ВзаимозависимыеУслугиСуб.ЗависимаяУслуга = бестНагрузкаПоУслугамНПСрезПоследних.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемНачисленийСубабонентов.Организация КАК Организация,
	        |	ОбъемНачисленийСубабонентов.Район КАК Район,
	        |	ОбъемНачисленийСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ОбъемНачисленийСубабонентов.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	        |	ОбъемНачисленийСубабонентов.Услуга КАК Услуга,
	        |	ОбъемНачисленийСубабонентов.Договор КАК Договор,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ОбъемНачисленийСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ОбъемНачисленийСубабонентов.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	ОбъемНачисленийСубабонентов.ПриборУчета КАК ПриборУчета,
	        |	NULL КАК Нагрузка,
	        |	NULL КАК ТемператураПодачиИсточника,
	        |	NULL КАК ТемператураХолоднойВодыИсточника
	        |ПОМЕСТИТЬ ОбъемСубабонентовНачисленныйИРассчитанный
	        |ИЗ
	        |	ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |ГДЕ
	        |	ОбъемНачисленийСубабонентов.СпособРаспределенияОбъемаДолевойТУ <> ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему)
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ОбъемНачисленийСубабонентов.Организация,
	        |	ОбъемНачисленийСубабонентов.Район,
	        |	ОбъемНачисленийСубабонентов.ДоговорДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчетаДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ГоловнаяТочкаУчета,
	        |	ВЫБОР
	        |		КОГДА ОбъемНачисленийСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ПоНагрузке)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ОбъемНачисленийСубабонентов.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху
	        |						ТОГДА ОбъемНачисленийСубабонентов.ЗначениеНагрузки * ОбъемНачисленийСубабонентов.КоличествоЧасовРаботыТУОборот * ((ДанныеПоТемпературам.ТемператураОптимальная - ДанныеПоТемпературам.СреднемесячнаяТемпература) / (ДанныеПоТемпературам.ТемператураОптимальная - ДанныеПоТемпературам.ПроектнаяТемпература))
	        |					ИНАЧЕ ОбъемНачисленийСубабонентов.ЗначениеНагрузки * ОбъемНачисленийСубабонентов.КоличествоЧасовРаботыТУОборот
	        |				КОНЕЦ
	        |		КОГДА ОбъемНачисленийСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ТемпературныйКоэффициент)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ДанныеПоТемпературам.ТемператураПодачиИсточника - ДанныеПоТемпературам.ТемператураХолоднойВодыИсточника = 0
	        |						ТОГДА 0
	        |					ИНАЧЕ ЕСТЬNULL(НагрузкиЗависимыхУслуг.Нагрузка, 0) * ОбъемНачисленийСубабонентов.КоличествоЧасовРаботыТУОборот / (ДанныеПоТемпературам.ТемператураПодачиИсточника - ДанныеПоТемпературам.ТемператураХолоднойВодыИсточника) * 1000
	        |				КОНЕЦ
	        |		КОГДА ОбъемНачисленийСубабонентов.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина)
	        |			ТОГДА ОбъемНачисленийСубабонентов.ДоговорнойОбъем
	        |	КОНЕЦ,
	        |	ОбъемНачисленийСубабонентов.Услуга,
	        |	ОбъемНачисленийСубабонентов.Договор,
	        |	ОбъемНачисленийСубабонентов.ОбъектРасчета,
	        |	ОбъемНачисленийСубабонентов.ТочкаУчета,
	        |	ОбъемНачисленийСубабонентов.КоэффициентРасчета,
	        |	ОбъемНачисленийСубабонентов.ПриборУчета,
	        |	НагрузкиЗависимыхУслуг.Нагрузка,
	        |	ДанныеПоТемпературам.ТемператураПодачиИсточника,
	        |	ДанныеПоТемпературам.ТемператураХолоднойВодыИсточника
	        |ИЗ
	        |	ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НагрузкиЗависимыхУслуг КАК НагрузкиЗависимыхУслуг
	        |		ПО ОбъемНачисленийСубабонентов.Договор = НагрузкиЗависимыхУслуг.ДоговорСубабонента
	        |			И ОбъемНачисленийСубабонентов.ОбъектРасчета = НагрузкиЗависимыхУслуг.ОбъектРасчетаСубабонента
	        |			И ОбъемНачисленийСубабонентов.ТочкаУчета = НагрузкиЗависимыхУслуг.ТочкаУчетаСубабонента
	        |			И ОбъемНачисленийСубабонентов.Услуга = НагрузкиЗависимыхУслуг.УслугаСубабонента
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоТемпературам КАК ДанныеПоТемпературам
	        |		ПО ОбъемНачисленийСубабонентов.Договор = ДанныеПоТемпературам.ДоговорСубабонента
	        |			И ОбъемНачисленийСубабонентов.ОбъектРасчета = ДанныеПоТемпературам.ОбъектРасчетаСубабонента
	        |			И ОбъемНачисленийСубабонентов.ТочкаУчета = ДанныеПоТемпературам.ТочкаУчетаСубабонента
	        |			И ОбъемНачисленийСубабонентов.Услуга = ДанныеПоТемпературам.УслугаСубабонента
	        |ГДЕ
	        |	ОбъемНачисленийСубабонентов.СпособРаспределенияОбъемаДолевойТУ = ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПропорциональноРассчитанномуОбъему)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Организация КАК Организация,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Район КАК Район,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СУММА(ОбъемСубабонентовНачисленныйИРассчитанный.ОбъемУслугиОборот) КАК ОбъемУслугиОборот,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Услуга КАК Услуга
	        |ПОМЕСТИТЬ СуммарныйОбъемСубабонентов
	        |ИЗ
	        |	ОбъемСубабонентовНачисленныйИРассчитанный КАК ОбъемСубабонентовНачисленныйИРассчитанный
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Организация,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Район,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ДоговорДолевойТУ,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчетаДолевойТУ,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ГоловнаяТочкаУчета,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Организация КАК Организация,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Район КАК Район,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъемУслугиОборот * ОбъемСубабонентовНачисленныйИРассчитанный.КоэффициентРасчета КАК ОбъемСуб,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Договор КАК Договор,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчета КАК ОбъектРасчета,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.Услуга КАК Услуга,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ТочкаУчета КАК ТочкаУчета,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.КоэффициентРасчета КАК КоэффициентРасчета
	        |ПОМЕСТИТЬ СубабонентыКРаспределению
	        |ИЗ
	        |	ОбъемСубабонентовНачисленныйИРассчитанный КАК ОбъемСубабонентовНачисленныйИРассчитанный
	        |ГДЕ
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.КоэффициентРасчета <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СубабонентыКРаспределению.Организация КАК Организация,
	        |	СубабонентыКРаспределению.Район КАК Район,
	        |	СубабонентыКРаспределению.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	СубабонентыКРаспределению.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	СубабонентыКРаспределению.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	СУММА(СубабонентыКРаспределению.ОбъемСуб) КАК ОбъемСуб,
	        |	СубабонентыКРаспределению.Услуга КАК Услуга
	        |ПОМЕСТИТЬ ОбъемСубКРаспределению
	        |ИЗ
	        |	СубабонентыКРаспределению КАК СубабонентыКРаспределению
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СубабонентыКРаспределению.Организация,
	        |	СубабонентыКРаспределению.Район,
	        |	СубабонентыКРаспределению.ДоговорДолевойТУ,
	        |	СубабонентыКРаспределению.ОбъектРасчетаДолевойТУ,
	        |	СубабонентыКРаспределению.ГоловнаяТочкаУчета,
	        |	СубабонентыКРаспределению.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПараметрыСубабонентов.Организация КАК Организация,
	        |	ПараметрыСубабонентов.Район КАК Район,
	        |	ПараметрыСубабонентов.Договор КАК Договор,
	        |	ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПараметрыСубабонентов.Услуга КАК Услуга,
	        |	ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета,
	        |	ПараметрыСубабонентов.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	ПараметрыСубабонентов.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	ПараметрыСубабонентов.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	ПараметрыСубабонентов.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	ПараметрыСубабонентов.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	ПараметрыСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПараметрыСубабонентов.Приоритет КАК Приоритет,
	        |	ПараметрыСубабонентов.ЗначениеНорматива КАК ЗначениеНорматива,
	        |	ПараметрыСубабонентов.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	ПараметрыСубабонентов.ДоговорнойОбъем КАК ДоговорнойОбъем,
	        |	ПараметрыСубабонентов.КоличествоПриборов КАК КоличествоПриборов,
	        |	ПараметрыСубабонентов.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	ПараметрыСубабонентов.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	        |	ПараметрыСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	ПараметрыСубабонентов.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	ПараметрыСубабонентов.УслугаДолевойТУ КАК УслугаДолевойТУ,
	        |	ПараметрыСубабонентов.ФиксированныйОбъем КАК ФиксированныйОбъем
	        |ПОМЕСТИТЬ ПараметрыСубабонентовСУчетомВыходаПУ
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	        |		ПО ПараметрыСубабонентов.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	        |			И ПараметрыСубабонентов.Район = СхемыСВышедшимИзСтрояПУ.Район
	        |			И ПараметрыСубабонентов.ДоговорДолевойТУ = СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ
	        |			И ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	        |			И ПараметрыСубабонентов.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	        |			И ПараметрыСубабонентов.УслугаДолевойТУ = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	        |ГДЕ
	        |	ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПараметрыСубабонентов.Организация,
	        |	ПараметрыСубабонентов.Район,
	        |	ПараметрыСубабонентов.Договор,
	        |	ПараметрыСубабонентов.ОбъектРасчета,
	        |	ПараметрыСубабонентов.Услуга,
	        |	ПараметрыСубабонентов.ТочкаУчета,
	        |	ПараметрыСубабонентов.КоэффициентРасчета,
	        |	ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ,
	        |	ПараметрыСубабонентов.СпособРаспределенияОстаткаДолевыеСхемы,
	        |	ПараметрыСубабонентов.ЗависимаяТочкаУчета,
	        |	ПараметрыСубабонентов.ЗначениеПлощади,
	        |	ПараметрыСубабонентов.ЗначениеНагрузки,
	        |	ПараметрыСубабонентов.ДоговорДолевойТУ,
	        |	ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСубабонентов.ГоловнаяТочкаУчета,
	        |	ПараметрыСубабонентов.Приоритет,
	        |	ПараметрыСубабонентов.ЗначениеНорматива,
	        |	ПараметрыСубабонентов.СпособРасчетаНорматива,
	        |	ПараметрыСубабонентов.ДоговорнойОбъем,
	        |	ПараметрыСубабонентов.КоличествоПриборов,
	        |	ПараметрыСубабонентов.РасчетИндивидуальногоПотребления,
	        |	ПараметрыСубабонентов.КоэффициентДолевогоРаспределения,
	        |	ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ,
	        |	ПараметрыСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	        |	ПараметрыСубабонентов.ЗависитОтУслуги,
	        |	ПараметрыСубабонентов.УслугаДолевойТУ,
	        |	ПараметрыСубабонентов.ФиксированныйОбъем
	        |ИЗ
	        |	ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	        |		ПО ПараметрыСубабонентов.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	        |			И ПараметрыСубабонентов.Район = СхемыСВышедшимИзСтрояПУ.Район
	        |			И ПараметрыСубабонентов.ДоговорДолевойТУ = СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ
	        |			И ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	        |			И ПараметрыСубабонентов.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	        |			И ПараметрыСубабонентов.УслугаДолевойТУ = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	        |ГДЕ
	        |	НЕ ПараметрыСубабонентов.СхемаРасчетаПриВыходеПУ
	        |	И СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ ЕСТЬ NULL
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПараметрыСтабПериодовСуб.Организация КАК Организация,
	        |	ПараметрыСтабПериодовСуб.Район КАК Район,
	        |	ПараметрыСтабПериодовСуб.Договор КАК Договор,
	        |	ПараметрыСтабПериодовСуб.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПараметрыСтабПериодовСуб.Услуга КАК Услуга,
	        |	ПараметрыСтабПериодовСуб.ТочкаУчета КАК ТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	ТочкиСубабонентов.СпособРаспределенияОстатка КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	ПараметрыСтабПериодовСуб.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	ПараметрыСтабПериодовСуб.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	ПараметрыСтабПериодовСуб.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.Приоритет КАК Приоритет,
	        |	ПараметрыСтабПериодовСуб.ЗначениеНорматива КАК ЗначениеНорматива,
	        |	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	ПараметрыСтабПериодовСуб.ДоговорнойОбъем КАК ДоговорнойОбъем,
	        |	ПараметрыСтабПериодовСуб.КоличествоПриборов КАК КоличествоПриборов,
	        |	ПараметрыСтабПериодовСуб.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ КАК СхемаРасчетаПриВыходеПУ,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	ПараметрыСтабПериодовСуб.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	ПараметрыСтабПериодовСуб.УслугаДолевойТУ КАК УслугаДолевойТУ,
	        |	ТочкиСубабонентов.ФиксированныйОбъем КАК ФиксированныйОбъем
	        |ПОМЕСТИТЬ ПараметрыСубСУчетомВыходаПУ
	        |ИЗ
	        |	ПараметрыСтабПериодовСуб КАК ПараметрыСтабПериодовСуб
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	        |		ПО ПараметрыСтабПериодовСуб.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	        |			И ПараметрыСтабПериодовСуб.Район = СхемыСВышедшимИзСтрояПУ.Район
	        |			И ПараметрыСтабПериодовСуб.ДоговорДолевойТУ = СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ
	        |			И ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	        |			И ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	        |		ПО ПараметрыСтабПериодовСуб.Организация = ТочкиСубабонентов.Организация
	        |			И ПараметрыСтабПериодовСуб.Район = ТочкиСубабонентов.Район
	        |			И ПараметрыСтабПериодовСуб.Договор = ТочкиСубабонентов.ДоговорСубабонента
	        |			И ПараметрыСтабПериодовСуб.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |			И ПараметрыСтабПериодовСуб.Услуга = ТочкиСубабонентов.УслугаСубабонента
	        |			И ПараметрыСтабПериодовСуб.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |ГДЕ
	        |	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПараметрыСтабПериодовСуб.Организация,
	        |	ПараметрыСтабПериодовСуб.Район,
	        |	ПараметрыСтабПериодовСуб.Договор,
	        |	ПараметрыСтабПериодовСуб.ОбъектРасчета,
	        |	ПараметрыСтабПериодовСуб.Услуга,
	        |	ПараметрыСтабПериодовСуб.ТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.КоэффициентРасчета,
	        |	ПараметрыСтабПериодовСуб.СпособРаспределенияОбъемаДолевойТУ,
	        |	ТочкиСубабонентов.СпособРаспределенияОстатка,
	        |	ПараметрыСтабПериодовСуб.ЗависимаяТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.ЗначениеПлощади,
	        |	ПараметрыСтабПериодовСуб.ЗначениеНагрузки,
	        |	ПараметрыСтабПериодовСуб.ДоговорДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета,
	        |	ПараметрыСтабПериодовСуб.Приоритет,
	        |	ПараметрыСтабПериодовСуб.ЗначениеНорматива,
	        |	ПараметрыСтабПериодовСуб.СпособРасчетаНорматива,
	        |	ПараметрыСтабПериодовСуб.ДоговорнойОбъем,
	        |	ПараметрыСтабПериодовСуб.КоличествоПриборов,
	        |	ПараметрыСтабПериодовСуб.РасчетИндивидуальногоПотребления,
	        |	ТочкиСубабонентов.КоэффициентДолевогоРаспределения,
	        |	ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ,
	        |	ТочкиСубабонентов.СторнироватьОбъемИндивидуальногоПотребления,
	        |	ПараметрыСтабПериодовСуб.ЗависитОтУслуги,
	        |	ПараметрыСтабПериодовСуб.УслугаДолевойТУ,
	        |	ТочкиСубабонентов.ФиксированныйОбъем
	        |ИЗ
	        |	ПараметрыСтабПериодовСуб КАК ПараметрыСтабПериодовСуб
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	        |		ПО ПараметрыСтабПериодовСуб.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	        |			И ПараметрыСтабПериодовСуб.Район = СхемыСВышедшимИзСтрояПУ.Район
	        |			И ПараметрыСтабПериодовСуб.ДоговорДолевойТУ = СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ
	        |			И ПараметрыСтабПериодовСуб.ОбъектРасчетаДолевойТУ = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	        |			И ПараметрыСтабПериодовСуб.ГоловнаяТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета
	        |			И ПараметрыСтабПериодовСуб.УслугаДолевойТУ = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиСубабонентов КАК ТочкиСубабонентов
	        |		ПО ПараметрыСтабПериодовСуб.Организация = ТочкиСубабонентов.Организация
	        |			И ПараметрыСтабПериодовСуб.Район = ТочкиСубабонентов.Район
	        |			И ПараметрыСтабПериодовСуб.Договор = ТочкиСубабонентов.ДоговорСубабонента
	        |			И ПараметрыСтабПериодовСуб.ОбъектРасчета = ТочкиСубабонентов.ОбъектРасчетаСубабонента
	        |			И ПараметрыСтабПериодовСуб.ТочкаУчета = ТочкиСубабонентов.ТочкаУчетаСубабонента
	        |			И ПараметрыСтабПериодовСуб.Услуга = ТочкиСубабонентов.УслугаСубабонента
	        |ГДЕ
	        |	СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ ЕСТЬ NULL
	        |	И НЕ ТочкиСубабонентов.СхемаПриВыводеПодчиненногоПУ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.Организация КАК Организация,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.Район КАК Район,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.Договор КАК Договор,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.Услуга КАК Услуга,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	ВЫБОР
	        |		КОГДА ЗначенияПараметровОсновныхТочек.ТочкаУчета ЕСТЬ NULL
	        |			ТОГДА ВЫБОР
	        |					КОГДА ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНагрузки = 0
	        |						ТОГДА ЗначениеНагрузкиЗависимойУслуги.ЗначениеНагрузки
	        |					ИНАЧЕ ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНагрузки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ПараметрыСубабонентовСУчетомВыходаПУ.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	        |					ТОГДА ЗначенияПараметровОсновныхТочек.ЗначениеНагрузки * ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНорматива
	        |				ИНАЧЕ ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНагрузки
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ЗначениеНагрузки,
	        |	ВЫБОР
	        |		КОГДА ЗначенияПараметровОсновныхТочек.ТочкаУчета ЕСТЬ NULL
	        |			ТОГДА ПараметрыСубабонентовСУчетомВыходаПУ.ДоговорнойОбъем
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ПараметрыСубабонентовСУчетомВыходаПУ.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.Норматив)
	        |					ТОГДА ЗначенияПараметровОсновныхТочек.ДоговорнойОбъем * ПараметрыСубабонентовСУчетомВыходаПУ.ЗначениеНорматива
	        |				ИНАЧЕ ПараметрыСубабонентовСУчетомВыходаПУ.ДоговорнойОбъем
	        |			КОНЕЦ
	        |	КОНЕЦ КАК ДоговорнойОбъем,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.Приоритет КАК Приоритет,
	        |	ОбъемСубабонентовНачисленныйИРассчитанный.ПриборУчета КАК ПриборУчета,
	        |	ЕСТЬNULL(ОбъемСубабонентовНачисленныйИРассчитанный.ОбъемУслугиОборот, 0) КАК ОбъемУслугиОборот,
	        |	ВЫБОР
	        |		КОГДА ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчета ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ЕстьИндивидуальныеНачисления,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.КоличествоПриборов КАК КоличествоПриборов,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	        |	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	ЕСТЬNULL(бестУровниВложенностиРасчетныхСхемСрезПоследних.Уровень, 0) КАК Уровень,
	        |	ЕСТЬNULL(ОбъемНачисленийСубабонентов.ОбъемУслугиОборот, 0) КАК ИндивидуальныйОбъемСуб,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.УслугаДолевойТУ КАК УслугаДолевойТУ,
	        |	ОбъемНачисленийСубабонентов.ВидНачисления КАК ВидНачисления,
	        |	ОбъемНачисленийСубабонентов.СпособНачисления КАК СпособНачисления,
	        |	ОбъемНачисленийСубабонентов.ПериодРасчета КАК ПериодРасчета,
	        |	ОбъемНачисленийСубабонентов.ПериодНачисления КАК ПериодНачисления,
	        |	ПараметрыСубабонентовСУчетомВыходаПУ.ФиксированныйОбъем КАК ФиксированныйОбъем,
	        |	ОбъемНачисленийСубабонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ОбъемНачисленийСубабонентов.Поставщик КАК Поставщик
	        |ПОМЕСТИТЬ ДанныеПоСубабонентам
	        |ИЗ
	        |	ПараметрыСубабонентовСУчетомВыходаПУ КАК ПараметрыСубабонентовСУчетомВыходаПУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемСубабонентовНачисленныйИРассчитанный КАК ОбъемСубабонентовНачисленныйИРассчитанный
	        |		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Организация = ОбъемСубабонентовНачисленныйИРассчитанный.Организация
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Район = ОбъемСубабонентовНачисленныйИРассчитанный.Район
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Договор = ОбъемСубабонентовНачисленныйИРассчитанный.Договор
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ОбъемСубабонентовНачисленныйИРассчитанный.ОбъектРасчета
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = ОбъемСубабонентовНачисленныйИРассчитанный.Услуга
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ОбъемСубабонентовНачисленныйИРассчитанный.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметровОсновныхТочек КАК ЗначенияПараметровОсновныхТочек
	        |		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Договор = ЗначенияПараметровОсновныхТочек.Договор
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ЗначенияПараметровОсновныхТочек.ОбъектРасчета
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ЗначенияПараметровОсновныхТочек.ТочкаУчета
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга.ЗависитОтУслуги = ЗначенияПараметровОсновныхТочек.Услуга
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначениеНагрузкиЗависимойУслуги КАК ЗначениеНагрузкиЗависимойУслуги
	        |		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Договор = ЗначениеНагрузкиЗависимойУслуги.Договор
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ЗначениеНагрузкиЗависимойУслуги.ОбъектРасчета
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = ЗначениеНагрузкиЗависимойУслуги.Услуга
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ЗначениеНагрузкиЗависимойУслуги.ТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = энргВидыУслуг.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУровниВложенностиРасчетныхСхем.СрезПоследних(&КонецПериода, ) КАК бестУровниВложенностиРасчетныхСхемСрезПоследних
	        |		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Организация = бестУровниВложенностиРасчетныхСхемСрезПоследних.Организация
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Район = бестУровниВложенностиРасчетныхСхемСрезПоследних.Район
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ДоговорДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.Договор
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчетаДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.ОбъектРасчета
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ГоловнаяТочкаУчета = бестУровниВложенностиРасчетныхСхемСрезПоследних.ТочкаУчета
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.УслугаДолевойТУ = бестУровниВложенностиРасчетныхСхемСрезПоследних.Услуга
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийСубабонентов КАК ОбъемНачисленийСубабонентов
	        |		ПО ПараметрыСубабонентовСУчетомВыходаПУ.Организация = ОбъемНачисленийСубабонентов.Организация
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Район = ОбъемНачисленийСубабонентов.Район
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Договор = ОбъемНачисленийСубабонентов.Договор
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ОбъектРасчета = ОбъемНачисленийСубабонентов.ОбъектРасчета
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.Услуга = ОбъемНачисленийСубабонентов.Услуга
	        |			И ПараметрыСубабонентовСУчетомВыходаПУ.ТочкаУчета = ОбъемНачисленийСубабонентов.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УровеньДолевыхТУ.Организация КАК Организация,
	        |	УровеньДолевыхТУ.Район КАК Район,
	        |	УровеньДолевыхТУ.Договор КАК Договор,
	        |	УровеньДолевыхТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	УровеньДолевыхТУ.Услуга КАК Услуга,
	        |	УровеньДолевыхТУ.МКД КАК МКД,
	        |	УровеньДолевыхТУ.ТочкаУчета КАК ТочкаУчета,
	        |	УровеньДолевыхТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	УровеньДолевыхТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	ЕСТЬNULL(ПлощадьСубабонентов.ЗначениеПлощади, 0) КАК СуммарноеЗначениеПлощадиСубабонентов,
	        |	ЕСТЬNULL(ДоговорныеОбъемыНагрузка.ЗначениеНагрузки, 0) КАК СуммарноеЗначениеНагрузкиСубабонентов,
	        |	ЕСТЬNULL(ДоговорныеОбъемыНагрузка.ДоговорнойОбъем, 0) КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	        |	КоличествоПриборов.КоличествоТУ КАК ВсегоТочекУчетаСубабонентов,
	        |	КоличествоПриборов.КоличествоПУ КАК ВсегоПриборовУчетаСубабонентов,
	        |	УровеньДолевыхТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	        |	ОбъемСубКРаспределению.ОбъемСуб КАК ОбъемСубКРАспределению,
	        |	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	        |	УровеньДолевыхТУ.Уровень КАК Уровень,
	        |	ВЫБОР
	        |		КОГДА СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК СхемаРасчетаПриВыходеПУ
	        |ПОМЕСТИТЬ ДанныеПоДолевымТУ
	        |ИЗ
	        |	УровеньДолевыхТУ КАК УровеньДолевыхТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |			СУММА(ВложенныйЗапрос.ЗначениеПлощади) КАК ЗначениеПлощади
	        |		ИЗ
	        |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |				ПараметрыСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |				ПараметрыСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |				ПараметрыСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |				ПараметрыСубабонентов.ЗначениеПлощади КАК ЗначениеПлощади,
	        |				ПараметрыСубабонентов.Договор КАК Договор,
	        |				ПараметрыСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	        |				ПараметрыСубабонентов.ТочкаУчета КАК ТочкаУчета
	        |			ИЗ
	        |				ПараметрыСубабонентов КАК ПараметрыСубабонентов
	        |			ГДЕ
	        |				ПараметрыСубабонентов.СпособРаспределенияОбъемаДолевойТУ <> ЗНАЧЕНИЕ(Перечисление.бестСпособыРаспределенияДолевыхСхем.ПустаяСсылка)) КАК ВложенныйЗапрос
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ,
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ) КАК ПлощадьСубабонентов
	        |		ПО УровеньДолевыхТУ.Договор = ПлощадьСубабонентов.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = ПлощадьСубабонентов.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = ПлощадьСубабонентов.ГоловнаяТочкаУчета
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |			ДанныеПоСубабонентам.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |			ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |			СУММА(ДанныеПоСубабонентам.ДоговорнойОбъем) КАК ДоговорнойОбъем,
	        |			ДанныеПоСубабонентам.Услуга КАК Услуга,
	        |			СУММА(ДанныеПоСубабонентам.ЗначениеНагрузки) КАК ЗначениеНагрузки
	        |		ИЗ
	        |			ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ,
	        |			ДанныеПоСубабонентам.ГоловнаяТочкаУчета,
	        |			ДанныеПоСубабонентам.ДоговорДолевойТУ,
	        |			ДанныеПоСубабонентам.Услуга) КАК ДоговорныеОбъемыНагрузка
	        |		ПО УровеньДолевыхТУ.Договор = ДоговорныеОбъемыНагрузка.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = ДоговорныеОбъемыНагрузка.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = ДоговорныеОбъемыНагрузка.ГоловнаяТочкаУчета
	        |			И УровеньДолевыхТУ.Услуга = ДоговорныеОбъемыНагрузка.Услуга
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВложенныйЗапрос.Организация КАК Организация,
	        |			ВложенныйЗапрос.Район КАК Район,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |			СУММА(ВложенныйЗапрос.КоличествоТУ) КАК КоличествоТУ,
	        |			СУММА(ВложенныйЗапрос.КоличествоПУ) КАК КоличествоПУ,
	        |			ВложенныйЗапрос.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |		ИЗ
	        |			(ВЫБРАТЬ
	        |				ДанныеПоСубабонентам.Организация КАК Организация,
	        |				ДанныеПоСубабонентам.Район КАК Район,
	        |				ДанныеПоСубабонентам.Договор КАК Договор,
	        |				ДанныеПоСубабонентам.Услуга КАК Услуга,
	        |				ДанныеПоСубабонентам.ОбъектРасчета КАК ОбъектРасчета,
	        |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПоСубабонентам.ТочкаУчета) КАК КоличествоТУ,
	        |				ДанныеПоСубабонентам.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	        |				ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	        |				ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	        |				СУММА(ДанныеПоСубабонентам.КоличествоПриборов) КАК КоличествоПУ,
	        |				ДанныеПоСубабонентам.УслугаДолевойТУ КАК УслугаДолевойТУ
	        |			ИЗ
	        |				ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	        |			
	        |			СГРУППИРОВАТЬ ПО
	        |				ДанныеПоСубабонентам.Организация,
	        |				ДанныеПоСубабонентам.Район,
	        |				ДанныеПоСубабонентам.Договор,
	        |				ДанныеПоСубабонентам.Услуга,
	        |				ДанныеПоСубабонентам.ОбъектРасчета,
	        |				ДанныеПоСубабонентам.ДоговорДолевойТУ,
	        |				ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ,
	        |				ДанныеПоСубабонентам.ГоловнаяТочкаУчета,
	        |				ДанныеПоСубабонентам.УслугаДолевойТУ) КАК ВложенныйЗапрос
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ВложенныйЗапрос.Организация,
	        |			ВложенныйЗапрос.Район,
	        |			ВложенныйЗапрос.ДоговорДолевойТУ,
	        |			ВложенныйЗапрос.ОбъектРасчетаДолевойТУ,
	        |			ВложенныйЗапрос.ГоловнаяТочкаУчета,
	        |			ВложенныйЗапрос.УслугаДолевойТУ) КАК КоличествоПриборов
	        |		ПО УровеньДолевыхТУ.Организация = КоличествоПриборов.Организация
	        |			И УровеньДолевыхТУ.Район = КоличествоПриборов.Район
	        |			И УровеньДолевыхТУ.Договор = КоличествоПриборов.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = КоличествоПриборов.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = КоличествоПриборов.ГоловнаяТочкаУчета
	        |			И УровеньДолевыхТУ.Услуга = КоличествоПриборов.УслугаДолевойТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемСубКРаспределению КАК ОбъемСубКРаспределению
	        |		ПО УровеньДолевыхТУ.Организация = ОбъемСубКРаспределению.Организация
	        |			И УровеньДолевыхТУ.Район = ОбъемСубКРаспределению.Район
	        |			И УровеньДолевыхТУ.Договор = ОбъемСубКРаспределению.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = ОбъемСубКРаспределению.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = ОбъемСубКРаспределению.ГоловнаяТочкаУчета
	        |			И УровеньДолевыхТУ.Услуга = ОбъемСубКРаспределению.Услуга
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО УровеньДолевыхТУ.Услуга = энргВидыУслуг.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СхемыСВышедшимИзСтрояПУ КАК СхемыСВышедшимИзСтрояПУ
	        |		ПО УровеньДолевыхТУ.Организация = СхемыСВышедшимИзСтрояПУ.Организация
	        |			И УровеньДолевыхТУ.Район = СхемыСВышедшимИзСтрояПУ.Район
	        |			И УровеньДолевыхТУ.Договор = СхемыСВышедшимИзСтрояПУ.ДоговорДолевойТУ
	        |			И УровеньДолевыхТУ.ОбъектРасчета = СхемыСВышедшимИзСтрояПУ.ОбъектРасчетаДолевойТУ
	        |			И УровеньДолевыхТУ.Услуга = СхемыСВышедшимИзСтрояПУ.УслугаДолевойТУ
	        |			И УровеньДолевыхТУ.ТочкаУчета = СхемыСВышедшимИзСтрояПУ.ГоловнаяТочкаУчета";
	       	
	
	Если Договор = Неопределено Тогда		
		Текст 						= СтрЗаменить(Текст,"И бестОтложенныеДвиженияДокументовНП.Договор = &Договор","");
		Текст 						= СтрЗаменить(Текст,"И (бестСтабильныеПериодыНП.Договор = &Договор)","");
		Текст 						= СтрЗаменить(Текст,"И Договор = &Договор","");
	
	КонецЕсли;
	
	Если Отдельностоящие = Ложь И МКД = Неопределено Тогда
		Текст 		= СтрЗаменить(Текст,"И (бестСтабильныеПериодыНП.МКД = &МКД)","");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляНачисленияПоДолевымСхемам()
	Текст 							= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.ОбъемУслугиОборот КАК ОбъемУслуги,
	|	ВложенныйЗапрос.ДокументНачисленияПоДолевымСхемам КАК ДокументНачисленияПоДолевымСхемам,
	|	ВложенныйЗапрос.ОбъемПотребленияСубабонентов КАК ОбъемПотребленияСубабонентов,
	|	ВложенныйЗапрос.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ВложенныйЗапрос.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВложенныйЗапрос.СуммарноеЗначениеПлощадиСубабонентов КАК СуммарноеЗначениеПлощадиСубабонентов,
	|	ВложенныйЗапрос.СуммарноеЗначениеНагрузкиСубабонентов КАК СуммарноеЗначениеНагрузкиСубабонентов,
	|	ВложенныйЗапрос.СуммарноеЗначениеДоговорногоОбъемаСуб КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	|	ВложенныйЗапрос.ВсегоТочекУчетаСубабонентов КАК ВсегоТочекУчетаСубабонентов,
	|	ВложенныйЗапрос.ВсегоПриборовУчетаСубабонентов КАК ВсегоПриборовУчетаСубабонентов,
	|	ВложенныйЗапрос.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ВложенныйЗапрос.ОбъемСубКРАспределению КАК ОбъемСубКРаспределению,
	|	ВложенныйЗапрос.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ВложенныйЗапрос.Уровень КАК Уровень,
	|	ВложенныйЗапрос.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоДолевымТУ.Организация КАК Организация,
	|		ДанныеПоДолевымТУ.Район КАК Район,
	|		ДанныеПоДолевымТУ.Договор КАК Договор,
	|		ДанныеПоДолевымТУ.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеПоДолевымТУ.Услуга КАК Услуга,
	|		ДанныеПоДолевымТУ.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоДолевымТУ.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|		ДанныеПоДолевымТУ.ЗначениеПлощади КАК ЗначениеПлощади,
	|		ОбъемыДолевойТУДляРаспределения.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|		ОбъемыДолевойТУДляРаспределения.ПриборУчета КАК ПриборУчета,
	|		ОбъемыДолевойТУДляРаспределения.СпособНачисления КАК СпособНачисления,
	|		ЕСТЬNULL(ДокументНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.бестНачислениеПоДолевымСхемам.ПустаяСсылка)) КАК ДокументНачисленияПоДолевымСхемам,
	|		СуммарныйОбъемСубабонентов.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	|		СуммарныйОбъемСубабонентов.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|		СуммарныйОбъемСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|		СуммарныйОбъемСубабонентов.ОбъемУслугиОборот КАК ОбъемПотребленияСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеПлощадиСубабонентов КАК СуммарноеЗначениеПлощадиСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеНагрузкиСубабонентов КАК СуммарноеЗначениеНагрузкиСубабонентов,
	|		ДанныеПоДолевымТУ.СуммарноеЗначениеДоговорногоОбъемаСуб КАК СуммарноеЗначениеДоговорногоОбъемаСуб,
	|		ДанныеПоДолевымТУ.ВсегоТочекУчетаСубабонентов КАК ВсегоТочекУчетаСубабонентов,
	|		ДанныеПоДолевымТУ.ВсегоПриборовУчетаСубабонентов КАК ВсегоПриборовУчетаСубабонентов,
	|		ДанныеПоДолевымТУ.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|		ЕСТЬNULL(ДанныеПоДолевымТУ.ОбъемСубКРАспределению, 0) КАК ОбъемСубКРАспределению,
	|		ДанныеПоДолевымТУ.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|		ЕСТЬNULL(ДанныеПоДолевымТУ.Уровень, 0) КАК Уровень,
	|		ДанныеПоДолевымТУ.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ
	|	ИЗ
	|		ДанныеПоДолевымТУ КАК ДанныеПоДолевымТУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыДолевойТУДляРаспределения КАК ОбъемыДолевойТУДляРаспределения
	|			ПО ДанныеПоДолевымТУ.Район = ОбъемыДолевойТУДляРаспределения.Район
	|				И ДанныеПоДолевымТУ.Договор = ОбъемыДолевойТУДляРаспределения.Договор
	|				И ДанныеПоДолевымТУ.ОбъектРасчета = ОбъемыДолевойТУДляРаспределения.ОбъектРасчета
	|				И ДанныеПоДолевымТУ.Услуга = ОбъемыДолевойТУДляРаспределения.Услуга
	|				И ДанныеПоДолевымТУ.ТочкаУчета = ОбъемыДолевойТУДляРаспределения.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеПоДолевымСхемам КАК ДокументНачисления
	|			ПО (ДокументНачисления.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И ДанныеПоДолевымТУ.Организация = ДокументНачисления.Организация
	|				И ДанныеПоДолевымТУ.Район = ДокументНачисления.Район
	|				И ДанныеПоДолевымТУ.Договор = ДокументНачисления.Договор
	|			ЛЕВОЕ СОЕДИНЕНИЕ СуммарныйОбъемСубабонентов КАК СуммарныйОбъемСубабонентов
	|			ПО ДанныеПоДолевымТУ.Договор = СуммарныйОбъемСубабонентов.ДоговорДолевойТУ
	|				И ДанныеПоДолевымТУ.ОбъектРасчета = СуммарныйОбъемСубабонентов.ОбъектРасчетаДолевойТУ
	|				И ДанныеПоДолевымТУ.ТочкаУчета = СуммарныйОбъемСубабонентов.ГоловнаяТочкаУчета
	|				И ДанныеПоДолевымТУ.Услуга = СуммарныйОбъемСубабонентов.Услуга) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	ОбъектРасчета,
	|	Уровень,
	|	ТочкаУчета,
	|	ЗависитОтУслуги,
	|	Услуга
	|ИТОГИ
	|	МАКСИМУМ(ДокументНачисленияПоДолевымСхемам)
	|ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоСубабонентам.Организация КАК Организация,
	|	ДанныеПоСубабонентам.Район КАК Район,
	|	ДанныеПоСубабонентам.Договор КАК Договор,
	|	ДанныеПоСубабонентам.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеПоСубабонентам.Услуга КАК Услуга,
	|	ДанныеПоСубабонентам.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПоСубабонентам.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеПоСубабонентам.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ДанныеПоСубабонентам.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ДанныеПоСубабонентам.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеПоСубабонентам.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеПоСубабонентам.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДанныеПоСубабонентам.ДоговорнойОбъем КАК ДоговорнойОбъем,
	|	ДанныеПоСубабонентам.ДоговорДолевойТУ КАК ДоговорДолевойТУ,
	|	ДанныеПоСубабонентам.ОбъектРасчетаДолевойТУ КАК ОбъектРасчетаДолевойТУ,
	|	ДанныеПоСубабонентам.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДанныеПоСубабонентам.Приоритет КАК Приоритет,
	|	ДанныеПоСубабонентам.ПриборУчета КАК ПриборУчета,
	|	ДанныеПоСубабонентам.ОбъемУслугиОборот КАК ОбъемУслуги,
	|	ДанныеПоСубабонентам.ИндивидуальныйОбъемСуб КАК ИндивидуальныйОбъемСуб,
	|	ДанныеПоСубабонентам.ВидНачисления КАК ВидНачисления,
	|	ДанныеПоСубабонентам.СпособНачисления КАК СпособНачисления,
	|	ДанныеПоСубабонентам.ПериодРасчета КАК ПериодРасчета,
	|	ДанныеПоСубабонентам.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеПоСубабонентам.ЕстьИндивидуальныеНачисления КАК ЕстьИндивидуальныеНачисления,
	|	ДанныеПоСубабонентам.КоличествоПриборов КАК КоличествоПриборов,
	|	ДанныеПоСубабонентам.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ДанныеПоСубабонентам.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ДанныеПоСубабонентам.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	ДанныеПоСубабонентам.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеПоСубабонентам.Уровень КАК Уровень,
	|	ДанныеПоСубабонентам.ФиксированныйОбъем КАК ФиксированныйОбъем,
	|	ДанныеПоСубабонентам.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеПоСубабонентам.Поставщик КАК Поставщик,
	|	бестОбъектыРасчета.МКД КАК МКД
	|ИЗ
	|	ДанныеПоСубабонентам КАК ДанныеПоСубабонентам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО ДанныеПоСубабонентам.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорДолевойТУ,
	|	ОбъектРасчетаДолевойТУ,
	|	Уровень,
	|	ГоловнаяТочкаУчета,
	|	ЗависитОтУслуги,
	|	Услуга,
	|	Приоритет";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область НачислениеПоДолевымСхемам_ВспомогательныеПроцедуры

Процедура ПрочитатьВспомогательныеДанныеНачислениеПоДолевымСхемам(МВТ, Организация,ПериодНачисления,Район,Отдельностоящие,МКД,Договор,ГраницыПериода)	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Договор",			Договор);
	Запрос.УстановитьПараметр("НачалоПериода",		ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",		ГраницыПериода.ЗавершениеОП - 1);
	
	Если Отдельностоящие тогда
		Запрос.УстановитьПараметр("МКД", 		Справочники.энргСтроения.ПустаяСсылка());
	Иначе
		Если Не МКД = Неопределено Тогда 
			Запрос.УстановитьПараметр("МКД",			МКД);
		КонецЕсли;
		
	КонецЕсли;
	Запрос.Текст 					= ТекстЗапросаВспомогательныеДанныеНачислениеПоДолевымСхемам(Отдельностоящие,МКД,Договор);
	Запрос.Выполнить();
КонецПроцедуры


#КонецОбласти

#Область СнятьСредниеНачисления_ВспомогательныеПроцедурыИФункции

Процедура ПрочитатьНеСписанныйСреднийНП(МВТ,ПериодНачисления,Организация,Район,МКД,Договор,НачалоПериодаРасчета,КонецПериодаРасчета,ТаблицаПриемник = Неопределено)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 							=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестАктивностьОбъектовРасчетаСрезПоследних.Договор КАК Ссылка
	|ПОМЕСТИТЬ Договоры
	|ИЗ
	|	РегистрСведений.бестАктивностьОбъектовРасчета.СрезПоследних(
	|			&НачалоПериодаРасчетаГраница,
	|			ОбъектРасчета.МКД = &МКД
	|				И Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестАктивностьОбъектовРасчетаСрезПоследних
	|ГДЕ
	|	бестАктивностьОбъектовРасчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(перечисление.энргСостояниеТочекУчета.включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНачислениеНП.Ссылка КАК ДокументНачисления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	Документ.бестНачислениеНП КАК бестНачислениеНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	|		ПО бестНачислениеНП.Договор = Договоры.Ссылка
	|			И (бестНачислениеНП.Организация = &Организация)
	|			И (бестНачислениеНП.Район = &Район)
	|			И (бестНачислениеНП.Дата = &КонецПериода)
	|			И (НЕ бестНачислениеНП.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПерерасчетНП.Организация КАК Организация,
	|	бестПерерасчетНП.ПериодНачисления КАК ПериодНачисления,
	|	бестПерерасчетНП.Район КАК Район,
	|	бестПерерасчетНП.Ссылка КАК ДокументНачисления,
	|	бестПерерасчетНП.ПометкаУдаления КАК ПометкаУдаления,
	|	бестПерерасчетНП.Договор КАК Договор
	|ПОМЕСТИТЬ ДокументыСвязанныйПерерасчет
	|ИЗ
	|	Документ.бестПерерасчетНП КАК бестПерерасчетНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	|		ПО бестПерерасчетНП.Договор = Договоры.Ссылка
	|ГДЕ
	|	бестПерерасчетНП.Организация = &Организация
	|	И бестПерерасчетНП.ПериодНачисления = &ПериодНачисления
	|	И бестПерерасчетНП.Район = &Район
	|	И бестПерерасчетНП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет)
	|	И бестПерерасчетНП.ПричинаПерерасчета = ЗНАЧЕНИЕ(Справочник.бестПричиныПерерасчета.ПерерасчетСредних)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНачисленныйСреднийОбъемНПОстатки.Организация КАК Организация,
	|	бестНачисленныйСреднийОбъемНПОстатки.Район КАК Район,
	|	бестНачисленныйСреднийОбъемНПОстатки.ОбъектРасчета КАК ОбъектРасчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.Договор КАК Договор,
	|	бестНачисленныйСреднийОбъемНПОстатки.ПериодНачисления КАК ПериодНачисления,
	|	бестНачисленныйСреднийОбъемНПОстатки.ТочкаУчета КАК ТочкаУчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.Услуга КАК Услуга,
	|	бестНачисленныйСреднийОбъемНПОстатки.ЗначениеТарифа КАК ЗначениеТарифа,
	|	бестНачисленныйСреднийОбъемНПОстатки.ПриборУчета КАК ПриборУчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестНачисленныйСреднийОбъемНПОстатки.Поставщик КАК Поставщик,
	|	бестНачисленныйСреднийОбъемНПОстатки.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	бестНачисленныйСреднийОбъемНПОстатки.ПриборЗависимой КАК ПриборЗависимой,
	|	бестНачисленныйСреднийОбъемНПОстатки.СпособНачисления КАК СпособНачисления,
	|	бестНачисленныйСреднийОбъемНПОстатки.СуммаОстаток КАК Сумма,
	|	бестНачисленныйСреднийОбъемНПОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги,
	|	бестНачисленныйСреднийОбъемНПОстатки.ОбъемУслугиПотребленныйОстаток КАК ОбъемУслугиПотребленный,
	|	бестНачисленныйСреднийОбъемНПОстатки.Шкала КАК Шкала
	|ПОМЕСТИТЬ НеСписанныйСредний
	|ИЗ
	|	РегистрНакопления.бестНачисленныйСреднийОбъемНП.Остатки(
	|			&НачалоПериодаРасчетаГраница,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор В
	|					(ВЫБРАТЬ
	|						Договоры.Ссылка КАК Ссылка
	|					ИЗ
	|						Договоры КАК Договоры)) КАК бестНачисленныйСреднийОбъемНПОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СУММА(бестОбъемНачисленийНП.Сумма) КАК СуммаОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслугиОборот,
	|	СУММА(бестОбъемНачисленийНП.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленныйОборот,
	|	МАКСИМУМ(бестОбъемНачисленийНП.ЗначениеТарифа) КАК ЗначениеТарифа
	|ПОМЕСТИТЬ НачисленныйОбъем
	|ИЗ
	|	ДокументыНачислений КАК ДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ПО (бестОбъемНачисленийНП.Период = &КонецПериода)
	|			И ДокументыНачислений.ДокументНачисления = бестОбъемНачисленийНП.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестОбъемНачисленийНП.Организация,
	|	бестОбъемНачисленийНП.ПериодНачисления,
	|	бестОбъемНачисленийНП.Район,
	|	бестОбъемНачисленийНП.ОбъектРасчета,
	|	бестОбъемНачисленийНП.Договор,
	|	бестОбъемНачисленийНП.Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета,
	|	бестОбъемНачисленийНП.СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона,
	|	бестОбъемНачисленийНП.Поставщик";
	
	Если НЕ ЗначениеЗаполнено(Договор) тогда
		Текст 		= СтрЗаменить(Текст,"И Договор = &Договор","");
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаГраница",Новый Граница(НачалоПериодаРасчета,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("КонецПериода",					КонецПериодаРасчета - 1);
	Запрос.УстановитьПараметр("ПериодНачисления",				ПериодНачисления);
	Запрос.УстановитьПараметр("Район",							Район);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("МКД",							МКД);
	Запрос.Текст 			= Текст;
	
	Если ТаблицаПриемник = Неопределено тогда
		Запрос.Выполнить();
	иначе
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"ПОМЕСТИТЬ НеСписанныйСредний","");
		Результат  			= Запрос.Выполнить();
		Выборка 			= Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПриемник.добавить(),Выборка);
		КонецЦикла;  		 
	КонецЕсли; 

КонецПроцедуры

Функция РезультатЗапросаПерерасчетСреднего(МВТ,Организация,ПериодНачисления,КонецПериодаРасчета,Район,Договор,НачисленныйСреднийОбъем=Неопределено)
	
	Текст 			=  
	"ВЫБРАТЬ
	|	НеСписанныйСредний.Организация КАК Организация,
	|	НеСписанныйСредний.Район КАК Район,
	|	НеСписанныйСредний.ОбъектРасчета КАК ОбъектРасчета,
	|	НеСписанныйСредний.Договор КАК Договор,
	|	НеСписанныйСредний.ПериодНачисления КАК ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета КАК ТочкаУчета,
	|	НеСписанныйСредний.Услуга КАК Услуга,
	|	НеСписанныйСредний.ЗначениеТарифа КАК ЗначениеТарифа,
	|	НеСписанныйСредний.ПриборУчета КАК ПриборУчета,
	|	НеСписанныйСредний.Шкала КАК Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НеСписанныйСредний.Сумма КАК Сумма,
	|	НеСписанныйСредний.ОбъемУслуги КАК ОбъемУслуги,
	|	НеСписанныйСредний.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	НеСписанныйСредний.ОбъемУслуги КАК ОбъемНадоСписать,
	|	НеСписанныйСредний.ОбъемУслугиПотребленный КАК ОбъемПотребленныйНадоСписать,
	|	НеСписанныйСредний.Поставщик КАК Поставщик,
	|	НеСписанныйСредний.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДляСписания
	|ИЗ
	|	НеСписанныйСредний КАК НеСписанныйСредний
	|ГДЕ
	|	(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ОбъектРасчета, НеСписанныйСредний.Договор, НеСписанныйСредний.ТочкаУчета, НеСписанныйСредний.Услуга, НеСписанныйСредний.Шкала, НеСписанныйСредний.ТарифнаяЗона) В
	|			(ВЫБРАТЬ
	|				НачисленныйОбъем.Организация,
	|				НачисленныйОбъем.Район,
	|				НачисленныйОбъем.ОбъектРасчета,
	|				НачисленныйОбъем.Договор,
	|				НачисленныйОбъем.ТочкаУчета,
	|				НачисленныйОбъем.Услуга,
	|				НачисленныйОбъем.Шкала,
	|				НачисленныйОбъем.ТарифнаяЗона
	|			ИЗ
	|				НачисленныйОбъем КАК НачисленныйОбъем
	|			ГДЕ
	|				НачисленныйОбъем.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам))
	|	И НЕ НеСписанныйСредний.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленныйОбъем.Организация,
	|	НачисленныйОбъем.Район,
	|	НачисленныйОбъем.ОбъектРасчета,
	|	НачисленныйОбъем.Договор,
	|	НачисленныйОбъем.ПериодНачисления,
	|	НачисленныйОбъем.ТочкаУчета,
	|	НачисленныйОбъем.Услуга,
	|	НачисленныйОбъем.ЗначениеТарифа,
	|	НачисленныйОбъем.ПриборУчета,
	|	НачисленныйОбъем.Шкала,
	|	НачисленныйОбъем.ТарифнаяЗона,
	|	НачисленныйОбъем.СуммаОборот,
	|	НачисленныйОбъем.ОбъемУслугиОборот,
	|	НачисленныйОбъем.ОбъемУслугиПотребленныйОборот,
	|	0,
	|	0,
	|	НачисленныйОбъем.Поставщик,
	|	НачисленныйОбъем.СпособНачисления
	|ИЗ
	|	НачисленныйОбъем КАК НачисленныйОбъем
	|ГДЕ
	|	НачисленныйОбъем.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|	И (НачисленныйОбъем.Организация, НачисленныйОбъем.Район, НачисленныйОбъем.ОбъектРасчета, НачисленныйОбъем.Договор, НачисленныйОбъем.ТочкаУчета, НачисленныйОбъем.Услуга, НачисленныйОбъем.Шкала, НачисленныйОбъем.ТарифнаяЗона) В
	|			(ВЫБРАТЬ
	|				НеСписанныйСредний.Организация,
	|				НеСписанныйСредний.Район,
	|				НеСписанныйСредний.ОбъектРасчета,
	|				НеСписанныйСредний.Договор,
	|				НеСписанныйСредний.ТочкаУчета,
	|				НеСписанныйСредний.Услуга,
	|				НеСписанныйСредний.Шкала,
	|				НеСписанныйСредний.ТарифнаяЗона
	|			ИЗ
	|				НеСписанныйСредний КАК НеСписанныйСредний
	|			ГДЕ
	|				НЕ НеСписанныйСредний.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам))
	|";
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НеСписанныйСредний.Организация,
	//|	НеСписанныйСредний.Район,
	//|	НеСписанныйСредний.ОбъектРасчета,
	//|	НеСписанныйСредний.Договор,
	//|	НеСписанныйСредний.ПериодНачисления,
	//|	НеСписанныйСредний.ТочкаУчета,
	//|	НеСписанныйСредний.Услуга,
	//|	НеСписанныйСредний.ЗначениеТарифа,
	//|	НеСписанныйСредний.ПриборУчета,
	//|	НеСписанныйСредний.Шкала,
	//|	НеСписанныйСредний.ТарифнаяЗона,
	//|	НеСписанныйСредний.Сумма,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.Поставщик,
	//|	НеСписанныйСредний.СпособНачисления
	//|ИЗ
	//|	НеСписанныйСредний КАК НеСписанныйСредний
	//|ГДЕ
	//|	(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ОбъектРасчета, НеСписанныйСредний.Договор, НеСписанныйСредний.ТочкаУчета, НеСписанныйСредний.Услуга) В
	//|			(ВЫБРАТЬ
	//|				НачисленныйОбъем.Организация,
	//|				НачисленныйОбъем.Район,
	//|				НачисленныйОбъем.ОбъектРасчета,
	//|				НачисленныйОбъем.Договор,
	//|				НачисленныйОбъем.ТочкаУчета,
	//|				НачисленныйОбъем.Услуга
	//|			ИЗ
	//|				НачисленныйОбъем КАК НачисленныйОбъем
	//|			ГДЕ
	//|				НачисленныйОбъем.СниматьНачисленныйСреднийЗависимыхТочек)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НеСписанныйСредний.Организация,
	//|	НеСписанныйСредний.Район,
	//|	НеСписанныйСредний.ОбъектРасчета,
	//|	НеСписанныйСредний.Договор,
	//|	НеСписанныйСредний.ПериодНачисления,
	//|	НеСписанныйСредний.ТочкаУчета,
	//|	НеСписанныйСредний.Услуга,
	//|	НеСписанныйСредний.ЗначениеТарифа,
	//|	НеСписанныйСредний.ПриборУчета,
	//|	НеСписанныйСредний.Шкала,
	//|	НеСписанныйСредний.ТарифнаяЗона,
	//|	НеСписанныйСредний.Сумма,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.ОбъемУслуги,
	//|	НеСписанныйСредний.ОбъемУслугиПотребленный,
	//|	НеСписанныйСредний.Поставщик,
	//|	НеСписанныйСредний.СпособНачисления
	//|ИЗ
	//|	НеСписанныйСредний КАК НеСписанныйСредний
	//|ГДЕ
	//|	(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ОбъектРасчета, НеСписанныйСредний.Договор, НеСписанныйСредний.Услуга, НеСписанныйСредний.СпособНачисления) В
	//|			(ВЫБРАТЬ
	//|				НачисленныйОбъем.Организация,
	//|				НачисленныйОбъем.Район,
	//|				НачисленныйОбъем.ОбъектРасчета,
	//|				НачисленныйОбъем.Договор,
	//|				НачисленныйОбъем.Услуга,
	//|				ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	//|			ИЗ
	//|				НачисленныйОбъем КАК НачисленныйОбъем
	//|			ГДЕ
	//|				НачисленныйОбъем.ЕстьСреднийПоВсемТочкамУслуги)
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
		
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ОбъемНадоСписать КАК ОбъемНадоСписать,
	|	ВложенныйЗапрос.ОбъемПотребленныйНадоСписать КАК ОбъемПотребленныйНадоСписать,
	|	ЕСТЬNULL(ДокументыСвязанныйПерерасчет.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргПерерасчет.Пустаяссылка)) КАК ДокументПерерасчета,
	|	ЕСТЬNULL(ДокументыСвязанныйПерерасчет.ПометкаУдаления, ЛОЖЬ) КАК ДокументПерерасчетаПометкаУдаления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДляСписания.Организация КАК Организация,
	|		ДанныеДляСписания.Район КАК Район,
	|		ДанныеДляСписания.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеДляСписания.Договор КАК Договор,
	|		ДанныеДляСписания.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеДляСписания.Услуга КАК Услуга,
	|		ДанныеДляСписания.ПриборУчета КАК ПриборУчета,
	|		ДанныеДляСписания.Шкала КАК Шкала,
	|		ДанныеДляСписания.ТарифнаяЗона КАК ТарифнаяЗона,
	|		СУММА(ДанныеДляСписания.ОбъемНадоСписать) КАК ОбъемНадоСписать,
	|		СУММА(ДанныеДляСписания.ОбъемПотребленныйНадоСписать) КАК ОбъемПотребленныйНадоСписать,
	|		ДанныеДляСписания.Поставщик КАК Поставщик
	|	ИЗ
	|		ДанныеДляСписания КАК ДанныеДляСписания
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДляСписания.Договор,
	|		ДанныеДляСписания.Шкала,
	|		ДанныеДляСписания.ТочкаУчета,
	|		ДанныеДляСписания.Район,
	|		ДанныеДляСписания.ОбъектРасчета,
	|		ДанныеДляСписания.ПриборУчета,
	|		ДанныеДляСписания.Поставщик,
	|		ДанныеДляСписания.Услуга,
	|		ДанныеДляСписания.Организация,
	|		ДанныеДляСписания.ТарифнаяЗона) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыСвязанныйПерерасчет КАК ДокументыСвязанныйПерерасчет
	|		ПО ВложенныйЗапрос.Организация = ДокументыСвязанныйПерерасчет.Организация
	|			И ВложенныйЗапрос.Район = ДокументыСвязанныйПерерасчет.Район
	|			И ВложенныйЗапрос.Договор = ДокументыСвязанныйПерерасчет.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ОбъектРасчета,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписания.Организация КАК Организация,
	|	ДанныеДляСписания.Район КАК Район,
	|	ДанныеДляСписания.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДляСписания.Договор КАК Договор,
	|	ДанныеДляСписания.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписания.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписания.Услуга КАК Услуга,
	|	ДанныеДляСписания.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ДанныеДляСписания.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписания.Шкала КАК Шкала,
	|	ДанныеДляСписания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписания.Сумма КАК Сумма,
	|	ДанныеДляСписания.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписания.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ДанныеДляСписания.ОбъемНадоСписать КАК ОбъемНадоСписать,
	|	ДанныеДляСписания.ОбъемПотребленныйНадоСписать КАК ОбъемПотребленныйНадоСписать,
	|	ДанныеДляСписания.Поставщик КАК Поставщик,
	|	ДанныеДляСписания.СпособНачисления КАК СпособНачисления
	|ИЗ
	|	ДанныеДляСписания КАК ДанныеДляСписания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДляСписания.Район,
	|	ДанныеДляСписания.ОбъектРасчета,
	|	ДанныеДляСписания.Договор,
	|	ДанныеДляСписания.ТочкаУчета,
	|	ДанныеДляСписания.Услуга,
	|	ДанныеДляСписания.ПриборУчета,
	|	ДанныеДляСписания.Шкала,
	|	ДанныеДляСписания.ТарифнаяЗона,
	|	ДанныеДляСписания.Поставщик,
	|	ДанныеДляСписания.ПериодНачисления УБЫВ";
		 
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Результат  						= Запрос.ВыполнитьПакет();  
	Возврат Результат;  	
	
КонецФункции

Функция РезультатОтменитьСнятьСредниеНачисления(ПериодНачисления, Организация, Район, МКД, Договор, КонецПериодаРасчета)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	 ПериодНачисления);
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Организация",		 Организация);
	Запрос.УстановитьПараметр("Район",				 Район);
	Запрос.УстановитьПараметр("МКД",				 МКД);
	Запрос.УстановитьПараметр("Договор",			 Договор);
	Запрос.Текст 	=
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бестАктивностьОбъектовРасчетаСрезПоследних.Договор КАК Ссылка
		|ПОМЕСТИТЬ Договоры
		|ИЗ
		|	РегистрСведений.бестАктивностьОбъектовРасчета.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			ОбъектРасчета.МКД = &МКД
		|				И Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестАктивностьОбъектовРасчетаСрезПоследних
		|ГДЕ
		|	бестАктивностьОбъектовРасчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(перечисление.энргСостояниеТочекУчета.включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестПерерасчетНП.Ссылка КАК ДокументНачисления
		|ИЗ
		|	Документ.бестПерерасчетНП КАК бестПерерасчетНП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
		|		ПО бестПерерасчетНП.Договор = Договоры.Ссылка
		|ГДЕ
		|	НЕ бестПерерасчетНП.ПометкаУдаления
		|	И бестПерерасчетНП.Организация = &Организация
		|	И бестПерерасчетНП.ПериодНачисления = &ПериодНачисления
		|	И бестПерерасчетНП.Район = &Район
		|	И бестПерерасчетНП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет)
		|	И бестПерерасчетНП.ПричинаПерерасчета = ЗНАЧЕНИЕ(Справочник.бестПричиныПерерасчета.ПерерасчетСредних)";
		
	Если НЕ ЗначениеЗаполнено(Договор) тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Договор = &Договор", "");
	КонецЕсли;
	
	
	Результат  = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

#КонецОбласти


#Область НачислениеПоДолевымСхемам

Функция ПолучитьРезультатЗапросаСхемыСтруктурыСети(ПериодНачисления,Организация,Район,Отдельностоящие, МКД, Договор,НачалоПериодаРасчета,КонецПериодаРасчета)
	Запрос = Новый Запрос;
	
	Если (Отдельностоящие = Ложь И МКД = Неопределено) И Договор = Неопределено  тогда
		Текст 									= "";
		ОтборДоговора_бестСтабильныеПериодыНП 	= "";
	Иначе
		Текст = бестНачисленияНП.ПолучитьОтборПоМКД(Новый Структура("Отдельностоящие,МКД,Договор", Отдельностоящие,МКД,Договор),,Истина);  
		ОтборДоговора_бестСтабильныеПериодыНП 	= " И бестСтабильныеПериодыНП.Договор В (ВЫБРАТЬ ОтборДоговор.Договор КАК Договор ИЗ ОтборДоговор КАК ОтборДоговор)" + Символы.ПС;		
	КонецЕсли;
	
	Запрос.Текст = Текст + ТекстЗапросаСхемыСтруктурыСети(ОтборДоговора_бестСтабильныеПериодыНП);
		
	
	Запрос.УстановитьПараметр("КонецПериодаРасчета", 	КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", 	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("МКД", 					?(МКД = Неопределено, Справочники.энргСтроения.ПустаяСсылка(), МКД));
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 		ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 					Район);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ТекстЗапросаСхемыСтруктурыСети(ОтборДоговора_бестСтабильныеПериодыНП)
	    Возврат "ВЫБРАТЬ
	            |	бестСтабильныеПериодыНП.Организация КАК Организация,
	            |	бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	            |	бестСтабильныеПериодыНП.Район КАК Район,
	            |	бестСтабильныеПериодыНП.МКД КАК МКД,
	            |	бестСтабильныеПериодыНП.Договор КАК Договор,
	            |	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	            |	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	            |	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	            |	ВЫБОР
	            |		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	            |			ТОГДА &НачалоПериодаРасчета
	            |		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	            |	КОНЕЦ КАК ПериодРегистрации,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ПриборУчета) КАК ПриборУчета,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеНагрузки) КАК ЗначениеНагрузки,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеПлощади) КАК ЗначениеПлощади,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ДатаПоверки) КАК ДатаПоверки,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ЗависимаяТочкаУчета) КАК ЗависимаяТочкаУчета,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.КоэффициентРасчета) КАК КоэффициентРасчета,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеНормативаЗаДень) КАК ЗначениеНормативаЗаДень,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ОбъектУчаствуетВРаспределенииМКД) КАК ОбъектУчаствуетВРаспределенииМКД,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.СпособРасчетаНорматива) КАК СпособРасчетаНорматива,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.Поставщик) КАК Поставщик,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.Шкала) КАК Шкала,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.СоставнаяУслуга) КАК СоставнаяУслуга,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.КоличествоЧасовРаботы) КАК КоличествоЧасовРаботы,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.РасчетПоФактическомуПотреблению) КАК РасчетПоФактическомуПотреблению,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ФиксированныйОбъем) КАК ФиксированныйОбъем,
	            |	МАКСИМУМ(бестСтабильныеПериодыНП.ДиаметрСечения) КАК ДиаметрСечения
	            |ПОМЕСТИТЬ СтабильныеПериоды
	            |ИЗ
	            |	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	            |ГДЕ
	            |	бестСтабильныеПериодыНП.Организация = &Организация
	            |	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	            |	И бестСтабильныеПериодыНП.Район = &Район
	            |	И бестСтабильныеПериодыНП.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.БалансовыйМетод)" + ОтборДоговора_бестСтабильныеПериодыНП + "
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	бестСтабильныеПериодыНП.Организация,
	            |	бестСтабильныеПериодыНП.ПериодНачисления,
	            |	бестСтабильныеПериодыНП.Район,
	            |	бестСтабильныеПериодыНП.МКД,
	            |	бестСтабильныеПериодыНП.Договор,
	            |	бестСтабильныеПериодыНП.ОбъектРасчета,
	            |	бестСтабильныеПериодыНП.Услуга,
	            |	бестСтабильныеПериодыНП.ТочкаУчета,
	            |	ВЫБОР
	            |		КОГДА бестСтабильныеПериодыНП.ПериодРегистрации < &НачалоПериодаРасчета
	            |			ТОГДА &НачалоПериодаРасчета
	            |		ИНАЧЕ бестСтабильныеПериодыНП.ПериодРегистрации
	            |	КОНЕЦ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ РАЗЛИЧНЫЕ
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Договор КАК Договор,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	            |	ЕСТЬNULL(бестСхемаРасчетаПоСтруктуреСети.Услуга, ЗНАЧЕНИЕ(Справочник.энргвидыуслуг.пустаяссылка)) КАК УслугаПоРассчитываемуЭлементу
	            |ПОМЕСТИТЬ СтруктураСетиРассчитываемыхТочек
	            |ИЗ
	            |	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	            |			&КонецПериодаРасчета,
	            |			(Организация, Район, Услуга, Договор, ОбъектРасчета, ТочкаУчета) В
	            |				(ВЫБРАТЬ
	            |					СтабильныеПериоды.Организация КАК Организация,
	            |					СтабильныеПериоды.Район КАК Район,
	            |					СтабильныеПериоды.Услуга КАК Услуга,
	            |					СтабильныеПериоды.Договор КАК Договор,
	            |					СтабильныеПериоды.ОбъектРасчета КАК ОбъектРасчета,
	            |					СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета
	            |				ИЗ
	            |					СтабильныеПериоды КАК СтабильныеПериоды)) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСхемаРасчетаПоСтруктуреСети КАК бестСхемаРасчетаПоСтруктуреСети
	            |		ПО бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = бестСхемаРасчетаПоСтруктуреСети.РассчитываемыйЭлемент
	            |			И бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация = бестСхемаРасчетаПоСтруктуреСети.Организация
	            |			И бестСтруктураСетиТочекУчетаНПСрезПоследних.Район = бестСхемаРасчетаПоСтруктуреСети.Район
	            |			И бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета = бестСхемаРасчетаПоСтруктуреСети.ТочкаУчета
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	            |	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.ЭлементСтруктурыСети КАК ЭлементСтруктурыСети,
	            |	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.ВычитатьЭлемент КАК ВычитатьЭлемент,
	            |	бестСхемаРасчетаПоСтруктуреСетиСрезПоследних.Услуга КАК Услуга
	            |ПОМЕСТИТЬ Схема
	            |ИЗ
	            |	РегистрСведений.бестСхемаРасчетаПоСтруктуреСети.СрезПоследних(
	            |			&КонецПериодаРасчета,
	            |			РассчитываемыйЭлемент В
	            |				(ВЫБРАТЬ
	            |					СтруктураСетиРассчитываемыхТочек.СтруктураСети КАК СтруктураСети
	            |				ИЗ
	            |					СтруктураСетиРассчитываемыхТочек КАК СтруктураСетиРассчитываемыхТочек)) КАК бестСхемаРасчетаПоСтруктуреСетиСрезПоследних
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	Схема.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Схема1.РассчитываемыйЭлемент) КАК Приоритет,
	            |	Схема.Услуга КАК Услуга
	            |ПОМЕСТИТЬ ПриоритетыРасчета
	            |ИЗ
	            |	Схема КАК Схема
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Схема КАК Схема1
	            |		ПО Схема.РассчитываемыйЭлемент = Схема1.ЭлементСтруктурыСети
	            |			И Схема.Услуга = Схема1.Услуга
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	Схема.РассчитываемыйЭлемент,
	            |	Схема.Услуга
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Договор КАК Договор,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	            |	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети,
	            |	Схема.ВычитатьЭлемент КАК ВычитатьЭлемент,
	            |	Схема.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	            |	Схема.Услуга КАК УслугаПоРассчитываемуЭлементу
	            |ПОМЕСТИТЬ СтруктураСетиТочекДляРасчета
	            |ИЗ
	            |	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Схема КАК Схема
	            |		ПО бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = Схема.ЭлементСтруктурыСети
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ РАЗЛИЧНЫЕ
	            |	СтруктураСетиТочекДляРасчета.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	            |	СтруктураСетиТочекДляРасчета.УслугаПоРассчитываемуЭлементу КАК Услуга,
	            |	СтруктураСетиТочекДляРасчета.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	            |ПОМЕСТИТЬ УслугиВРасчете
	            |ИЗ
	            |	СтруктураСетиТочекДляРасчета КАК СтруктураСетиТочекДляРасчета
	            |ГДЕ
	            |	СтруктураСетиТочекДляРасчета.Услуга.бестОсновнаяУслугаДляРасчетаБалансовымМетодом
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	энргВидыУслугСоставляющиеБалансовыхУслуг.Услуга КАК Услуга,
	            |	УслугиВРасчете.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	            |	УслугиВРасчете.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	            |ПОМЕСТИТЬ УслугиВРасчетеОтбор
	            |ИЗ
	            |	УслугиВРасчете КАК УслугиВРасчете
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеБалансовыхУслуг КАК энргВидыУслугСоставляющиеБалансовыхУслуг
	            |		ПО УслугиВРасчете.Услуга = энргВидыУслугСоставляющиеБалансовыхУслуг.Ссылка
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ РАЗЛИЧНЫЕ
	            |	УслугиВРасчете.Услуга,
	            |	УслугиВРасчете.РассчитываемыйЭлемент,
	            |	УслугиВРасчете.УслугаПоРассчитываемуЭлементу
	            |ИЗ
	            |	УслугиВРасчете КАК УслугиВРасчете
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СтруктураСетиТочекДляРасчета.Организация КАК Организация,
	            |	СтруктураСетиТочекДляРасчета.Район КАК Район,
	            |	СтруктураСетиТочекДляРасчета.Договор КАК Договор,
	            |	СтруктураСетиТочекДляРасчета.ОбъектРасчета КАК ОбъектРасчета,
	            |	СтруктураСетиТочекДляРасчета.Услуга КАК Услуга,
	            |	СтруктураСетиТочекДляРасчета.ТочкаУчета КАК ТочкаУчета,
	            |	СтруктураСетиТочекДляРасчета.СтруктураСети КАК СтруктураСети,
	            |	СтруктураСетиТочекДляРасчета.ВычитатьЭлемент КАК ВычитатьЭлемент,
	            |	СтруктураСетиТочекДляРасчета.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	            |	УслугиВРасчетеОтбор.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	            |ПОМЕСТИТЬ СтруктураСетиТочекДляРасчетаОтбор
	            |ИЗ
	            |	УслугиВРасчетеОтбор КАК УслугиВРасчетеОтбор
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктураСетиТочекДляРасчета КАК СтруктураСетиТочекДляРасчета
	            |		ПО УслугиВРасчетеОтбор.Услуга = СтруктураСетиТочекДляРасчета.Услуга
	            |			И УслугиВРасчетеОтбор.РассчитываемыйЭлемент = СтруктураСетиТочекДляРасчета.РассчитываемыйЭлемент
	            |			И УслугиВРасчетеОтбор.УслугаПоРассчитываемуЭлементу = СтруктураСетиТочекДляРасчета.УслугаПоРассчитываемуЭлементу
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СУММА(ВЫБОР
	            |			КОГДА СтруктураСетиТочекДляРасчетаОтбор.ВычитатьЭлемент
	            |				ТОГДА -ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот, 0)
	            |			ИНАЧЕ ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот, 0)
	            |		КОНЕЦ) КАК ОбъемУслуги,
	            |	СтруктураСетиТочекДляРасчетаОтбор.РассчитываемыйЭлемент КАК РассчитываемыйЭлемент,
	            |	СтруктураСетиТочекДляРасчетаОтбор.СтруктураСети КАК СтруктураСети,
	            |	СтруктураСетиТочекДляРасчетаОтбор.ВычитатьЭлемент КАК ВычитатьЭлемент,
	            |	СтруктураСетиТочекДляРасчетаОтбор.УслугаПоРассчитываемуЭлементу КАК УслугаПоРассчитываемуЭлементу
	            |ПОМЕСТИТЬ ОбъемыНачислений
	            |ИЗ
	            |	СтруктураСетиТочекДляРасчетаОтбор КАК СтруктураСетиТочекДляРасчетаОтбор
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП.Обороты(&НачалоПериодаРасчета, &КонецПериодаРасчета, , ) КАК бестОбъемНачисленийНПОбороты
	            |		ПО (бестОбъемНачисленийНПОбороты.Организация = СтруктураСетиТочекДляРасчетаОтбор.Организация)
	            |			И (бестОбъемНачисленийНПОбороты.Район = СтруктураСетиТочекДляРасчетаОтбор.Район)
	            |			И (бестОбъемНачисленийНПОбороты.Договор = СтруктураСетиТочекДляРасчетаОтбор.Договор)
	            |			И (бестОбъемНачисленийНПОбороты.ОбъектРасчета = СтруктураСетиТочекДляРасчетаОтбор.ОбъектРасчета)
	            |			И (бестОбъемНачисленийНПОбороты.Услуга = СтруктураСетиТочекДляРасчетаОтбор.Услуга)
	            |			И (бестОбъемНачисленийНПОбороты.ТочкаУчета = СтруктураСетиТочекДляРасчетаОтбор.ТочкаУчета)
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	СтруктураСетиТочекДляРасчетаОтбор.РассчитываемыйЭлемент,
	            |	СтруктураСетиТочекДляРасчетаОтбор.СтруктураСети,
	            |	СтруктураСетиТочекДляРасчетаОтбор.ВычитатьЭлемент,
	            |	СтруктураСетиТочекДляРасчетаОтбор.УслугаПоРассчитываемуЭлементу
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СтабильныеПериоды.Организация КАК Организация,
	            |	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	            |	СтабильныеПериоды.Район КАК Район,
	            |	СтабильныеПериоды.МКД КАК МКД,
	            |	СтабильныеПериоды.Договор КАК Договор,
	            |	СтабильныеПериоды.ОбъектРасчета КАК ОбъектРасчета,
	            |	СтабильныеПериоды.Услуга КАК Услуга,
	            |	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	            |	СтабильныеПериоды.ПериодРегистрации КАК ПериодРегистрации,
	            |	СтабильныеПериоды.ПриборУчета КАК ПриборУчета,
	            |	СтабильныеПериоды.ЗначениеНагрузки КАК ЗначениеНагрузки,
	            |	СтабильныеПериоды.ЗначениеПлощади КАК ЗначениеПлощади,
	            |	СтабильныеПериоды.ТарифнаяГруппа КАК ТарифнаяГруппа,
	            |	СтабильныеПериоды.ДатаПоверки КАК ДатаПоверки,
	            |	СтабильныеПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	            |	СтабильныеПериоды.КоэффициентРасчета КАК КоэффициентРасчета,
	            |	СтабильныеПериоды.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	            |	СтабильныеПериоды.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	            |	СтабильныеПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	            |	СтабильныеПериоды.Поставщик КАК Поставщик,
	            |	СтабильныеПериоды.Шкала КАК Шкала,
	            |	СтабильныеПериоды.СоставнаяУслуга КАК СоставнаяУслуга,
	            |	СтабильныеПериоды.КоличествоЧасовРаботы КАК КоличествоЧасовРаботыТУ,
	            |	СтабильныеПериоды.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	            |	СтабильныеПериоды.ФиксированныйОбъем КАК ФиксированныйОбъем,
	            |	СтабильныеПериоды.ДиаметрСечения КАК ДиаметрСечения,
	            |	ЕСТЬNULL(ПриоритетыРасчета.Приоритет, 0) КАК Приоритет,
	            |	ОбъемыНачислений.ОбъемУслуги КАК ОбъемУслуги,
	            |	СтруктураСетиРассчитываемыхТочек.СтруктураСети КАК РассчитываемыйЭлемент,
	            |	ОбъемыНачислений.СтруктураСети КАК СтруктураСетиУчаствующаяВСхеме,
	            |	бестНачислениеПоСхемамСтруктурыСети.Ссылка КАК ДокументНачисления,
	            |	ОбъемыНачислений.ВычитатьЭлемент КАК ВычитатьЭлемент,
	            |	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	            |	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри,
	            |	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	            |	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КАК СпособНачисления,
	            |	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа
	            |ИЗ
	            |	СтабильныеПериоды КАК СтабильныеПериоды
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтруктураСетиРассчитываемыхТочек КАК СтруктураСетиРассчитываемыхТочек
	            |			ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетыРасчета КАК ПриоритетыРасчета
	            |			ПО СтруктураСетиРассчитываемыхТочек.СтруктураСети = ПриоритетыРасчета.РассчитываемыйЭлемент
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыНачислений КАК ОбъемыНачислений
	            |			ПО СтруктураСетиРассчитываемыхТочек.СтруктураСети = ОбъемыНачислений.РассчитываемыйЭлемент
	            |				И СтруктураСетиРассчитываемыхТочек.УслугаПоРассчитываемуЭлементу = ОбъемыНачислений.УслугаПоРассчитываемуЭлементу
	            |		ПО СтабильныеПериоды.Организация = СтруктураСетиРассчитываемыхТочек.Организация
	            |			И СтабильныеПериоды.Район = СтруктураСетиРассчитываемыхТочек.Район
	            |			И СтабильныеПериоды.Договор = СтруктураСетиРассчитываемыхТочек.Договор
	            |			И СтабильныеПериоды.ОбъектРасчета = СтруктураСетиРассчитываемыхТочек.ОбъектРасчета
	            |			И СтабильныеПериоды.Услуга = СтруктураСетиРассчитываемыхТочек.Услуга
	            |			И СтабильныеПериоды.ТочкаУчета = СтруктураСетиРассчитываемыхТочек.ТочкаУчета
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеПоСхемамСтруктурыСети КАК бестНачислениеПоСхемамСтруктурыСети
	            |		ПО СтабильныеПериоды.Организация = бестНачислениеПоСхемамСтруктурыСети.Организация
	            |			И СтабильныеПериоды.Район = бестНачислениеПоСхемамСтруктурыСети.Район
	            |			И СтабильныеПериоды.ПериодНачисления = бестНачислениеПоСхемамСтруктурыСети.ПериодНачисления
	            |			И СтабильныеПериоды.Договор = бестНачислениеПоСхемамСтруктурыСети.Договор
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	            |				&КонецПериодаРасчета,
	            |				Район = &Район
	            |					И Организация = &Организация
	            |					И ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)) КАК энргЗначенияТарифовСрезПоследних
	            |		ПО СтабильныеПериоды.Организация = энргЗначенияТарифовСрезПоследних.Организация
	            |			И СтабильныеПериоды.Район = энргЗначенияТарифовСрезПоследних.Район
	            |			И СтабильныеПериоды.ТарифнаяГруппа = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	            |			И СтабильныеПериоды.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	            |			И СтабильныеПериоды.Поставщик = энргЗначенияТарифовСрезПоследних.Поставщик
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Приоритет УБЫВ,
	            |	Договор,
	            |	РассчитываемыйЭлемент,
	            |	Услуга";
	КонецФункции
#КонецОбласти






