
#Область СлужебныйИнтерфейс

// Процедура - Начисление на ОДН
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  ДокументОбъект	 - 	 - 
//
Процедура НачислениеНаОДН(Организация,ПериодНачисления, Район,МКД, Набор)  Экспорт 
	
	ГраницыПериода  												= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета											= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  											= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  													= ГраницыПериода.ДнейВПериоде; 
	результатЗапроса 												= РезультатЗапросаНачисленияНаОДН(Организация, ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде); 	
	
	ОбработатьРезультатЗапросаНачисленийМКД(результатЗапроса, ГраницыПериода, МКД, Набор);
	
КонецПроцедуры

#КонецОбласти

#Область НачисленияМКД

Функция ТекстЗапросаВспомогательныеДанныеНачисленияМКД(ОтборПоМКД)
	Текст  =  
	"ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО энргЗначенияНормативовПотребленияСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|			И (энргВидыУслуг.НормативДляИндивидуальных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.МКД КАК Строение,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|				И (МКД = &МКД
	|					ИЛИ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))) КАК НастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НеНачислять) КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользования,
	|	ЛОЖЬ КАК НормативПоДням
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА &НачалоПериодаРасчета
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ &КонецПериодаРасчета
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета)
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|						&НачалоПериодаРасчета,
	|						Организация = &Организация
	|							И Район = &Район) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияМКД.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияМКД.Район КАК Район,
	|	энргСреднийОбъемПотребленияМКД.МКД КАК МКД,
	|	энргСреднийОбъемПотребленияМКД.Услуга КАК Услуга,
	|	энргСреднийОбъемПотребленияМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияМКД.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияМКД.Объем КАК СреднийОбъем
	|ПОМЕСТИТЬ СреднееПотреблениеМКД
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК энргСреднийОбъемПотребленияМКД
	|ГДЕ
	|	энргСреднийОбъемПотребленияМКД.Организация = &Организация
	|	И энргСреднийОбъемПотребленияМКД.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребленияМКД.Район = &Район
	|	И энргСреднийОбъемПотребленияМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериодыМКД.Организация КАК Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район КАК Район,
	|		энргСтабильныеПериодыМКД.МКД КАК МКД,
	|		энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргСтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|	ГДЕ
	|		энргСтабильныеПериодыМКД.Организация = &Организация
	|		И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|		И энргСтабильныеПериодыМКД.Район = &Район
	|		И энргСтабильныеПериодыМКД.МКД = &МКД
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериодыМКД.Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район,
	|		энргСтабильныеПериодыМКД.МКД,
	|		энргСтабильныеПериодыМКД.Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = энргСтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргСтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = энргСтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргСтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериодыМКД.НомерПозиции
	|			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКД.Район = &Район)
	|			И (энргСтабильныеПериодыМКД.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКД.Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район,
	|	энргСтабильныеПериодыМКД.МКД,
	|	энргСтабильныеПериодыМКД.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонента) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериоды.Организация КАК Организация,
	|		энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериоды.Район КАК Район,
	|		энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение КАК Строение,
	|		энргСтабильныеПериоды.Помещение КАК Помещение,
	|		энргСтабильныеПериоды.Услуга КАК Услуга,
	|		МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади) КАК ПлощадьАбонента,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|					ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация КАК Организация,
	|			энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|			энргСтабильныеПериоды.Район КАК Район,
	|			энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение КАК Строение,
	|			энргСтабильныеПериоды.Помещение КАК Помещение,
	|			энргСтабильныеПериоды.Услуга КАК Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ГДЕ
	|			энргСтабильныеПериоды.Организация = &Организация
	|			И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|			И энргСтабильныеПериоды.Район = &Район
	|			И НЕ энргСтабильныеПериоды.ЧастныйСектор
	|			И энргСтабильныеПериоды.Строение = &МКД
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.ПериодНачисления,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ПО ВложенныйЗапрос.Организация = энргСтабильныеПериоды.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|				И ВложенныйЗапрос.Район = энргСтабильныеПериоды.Район
	|				И ВложенныйЗапрос.ЧастныйСектор = энргСтабильныеПериоды.ЧастныйСектор
	|				И ВложенныйЗапрос.Строение = энргСтабильныеПериоды.Строение
	|				И ВложенныйЗапрос.Помещение = энргСтабильныеПериоды.Помещение
	|				И ВложенныйЗапрос.Услуга = энргСтабильныеПериоды.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				И (энргСтабильныеПериоды.Организация = &Организация)
	|				И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|				И (энргСтабильныеПериоды.Район = &Район)
	|				И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|				И (энргСтабильныеПериоды.Строение = &МКД)
	|				И (энргСтабильныеПериоды.Помещение.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		энргСтабильныеПериоды.Услуга
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		бестСтабильныеПериодыНП.Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район,
	|		ЛОЖЬ,
	|		бестСтабильныеПериодыНП.МКД,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение,
	|		бестСтабильныеПериодыНП.Услуга,
	|		МАКСИМУМ(бестСтабильныеПериодыНП.ЗначениеПлощади),
	|		СУММА(ВЫБОР
	|				КОГДА бестСтабильныеПериодыНП.Поставщик = бестСтабильныеПериодыНП.Договор.Контрагент
	|					ТОГДА бестСтабильныеПериодыНП.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			КОНЕЦ)
	|	ИЗ
	|		(ВЫБРАТЬ
	|			бестСтабильныеПериодыНП.Организация КАК Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район КАК Район,
	|			ЛОЖЬ КАК ЧастныйСектор,
	|			бестСтабильныеПериодыНП.МКД КАК Строение,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|			бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(бестСтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|			бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор КАК Договор
	|		ИЗ
	|			РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|		ГДЕ
	|			бестСтабильныеПериодыНП.Организация = &Организация
	|			И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|			И бестСтабильныеПериодыНП.Район = &Район
	|			И бестСтабильныеПериодыНП.МКД = &МКД
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бестСтабильныеПериодыНП.Организация,
	|			бестСтабильныеПериодыНП.ПериодНачисления,
	|			бестСтабильныеПериодыНП.Район,
	|			бестСтабильныеПериодыНП.Услуга,
	|			бестСтабильныеПериодыНП.ТочкаУчета,
	|			бестСтабильныеПериодыНП.ОбъектРасчета,
	|			бестСтабильныеПериодыНП.Договор,
	|			бестСтабильныеПериодыНП.МКД,
	|			бестСтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|			ПО ВложенныйЗапрос.Организация = бестСтабильныеПериодыНП.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = бестСтабильныеПериодыНП.ПериодНачисления
	|				И ВложенныйЗапрос.Район = бестСтабильныеПериодыНП.Район
	|				И ВложенныйЗапрос.Услуга = бестСтабильныеПериодыНП.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = бестСтабильныеПериодыНП.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = бестСтабильныеПериодыНП.НомерПозиции
	|				И (бестСтабильныеПериодыНП.Организация = &Организация)
	|				И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|				И (бестСтабильныеПериодыНП.Район = &Район)
	|				И (бестСтабильныеПериодыНП.МКД = &МКД)
	|				И ВложенныйЗапрос.ОбъектРасчета = бестСтабильныеПериодыНП.ОбъектРасчета
	|				И ВложенныйЗапрос.Договор = бестСтабильныеПериодыНП.Договор
	|				И (бестСтабильныеПериодыНП.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бестСтабильныеПериодыНП.Организация,
	|		бестСтабильныеПериодыНП.ПериодНачисления,
	|		бестСтабильныеПериодыНП.Район,
	|		бестСтабильныеПериодыНП.Услуга,
	|		бестСтабильныеПериодыНП.МКД,
	|		бестСтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыШкалы.Организация КАК Организация,
	|	энргСтабильныеПериодыШкалы.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыШкалы.Район КАК Район,
	|	энргСтабильныеПериодыШкалы.МКД КАК МКД,
	|	энргСтабильныеПериодыШкалы.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыШкалы.ЧастьУзлаУчета КАК ЧастьУзлаУчета,
	|	энргСтабильныеПериодыШкалы.Шкала КАК Шкала,
	|	энргСтабильныеПериодыШкалы.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериодыШкалы.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКДШкалы КАК энргСтабильныеПериодыШкалы
	|ГДЕ
	|	энргСтабильныеПериодыШкалы.Организация = &Организация
	|	И энргСтабильныеПериодыШкалы.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыШкалы.Район = &Район
	|	И энргСтабильныеПериодыШкалы.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКДСоставУзловУчета.Организация КАК Организация,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.Район КАК Район,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.МКД КАК МКД,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.УзелУчета КАК УзелУчета,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.ЧастьУзлаУчета КАК ЧастьУзлаУчета,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.ПриборВведен КАК ПриборВведен,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	энргСтабильныеПериодыМКДСоставУзловУчета.КоэффициентПУ КАК КоэффициентПУ
	|ПОМЕСТИТЬ СтабильныеПериодыСоставУзла
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКДСоставУзловУчета КАК энргСтабильныеПериодыМКДСоставУзловУчета
	|ГДЕ
	|	энргСтабильныеПериодыМКДСоставУзловУчета.Организация = &Организация
	|	И энргСтабильныеПериодыМКДСоставУзловУчета.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыМКДСоставУзловУчета.Район = &Район
	|	И энргСтабильныеПериодыМКДСоставУзловУчета.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПредоставленныеПоказанияМКД.Организация КАК Организация,
	|	энргПредоставленныеПоказанияМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргПредоставленныеПоказанияМКД.Район КАК Район,
	|	энргПредоставленныеПоказанияМКД.МКД КАК МКД,
	|	энргПредоставленныеПоказанияМКД.ПриборУчета КАК ПриборУчета,
	|	энргПредоставленныеПоказанияМКД.Шкала КАК Шкала,
	|	энргПредоставленныеПоказанияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргПредоставленныеПоказанияМКД.НомерПозиции КАК НомерПозиции,
	|	энргПредоставленныеПоказанияМКД.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПредоставленныеПоказанияМКД.ДокРегистратор КАК ДокРегистратор,
	|	энргПредоставленныеПоказанияМКД.Показания КАК Показания,
	|	энргПредоставленныеПоказанияМКД.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода,
	|	энргПредоставленныеПоказанияМКД.ВСрок КАК ВСрок,
	|	&КонецПериодаРасчета КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказанияМКД
	|ГДЕ
	|	энргПредоставленныеПоказанияМКД.Организация = &Организация
	|	И энргПредоставленныеПоказанияМКД.ПериодНачисления = &ПериодНачисления
	|	И энргПредоставленныеПоказанияМКД.Район = &Район
	|	И энргПредоставленныеПоказанияМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргВыводПриборовУчетаМКД.Организация КАК Организация,
	|	энргВыводПриборовУчетаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргВыводПриборовУчетаМКД.Район КАК Район,
	|	энргВыводПриборовУчетаМКД.МКД КАК МКД,
	|	энргВыводПриборовУчетаМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргВыводПриборовУчетаМКД.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	РегистрСведений.энргВыводПриборовУчетаМКД КАК энргВыводПриборовУчетаМКД
	|ГДЕ
	|	энргВыводПриборовУчетаМКД.Организация = &Организация
	|	И энргВыводПриборовУчетаМКД.ПериодНачисления = &ПериодНачисления
	|	И энргВыводПриборовУчетаМКД.Район = &Район
	|	И энргВыводПриборовУчетаМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.Показания КАК Показания,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.КонецПериодаРасчета КАК КонецПериодаРасчета,
	|	ВложенныйЗапрос.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ МаксимальныеПоказанияСрезНабор
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргМаксимальныеПоказанияСрезМКД.Организация КАК Организация,
	|		&ПериодНачисления КАК ПериодНачисления,
	|		энргМаксимальныеПоказанияСрезМКД.Район КАК Район,
	|		энргМаксимальныеПоказанияСрезМКД.МКД КАК МКД,
	|		энргМаксимальныеПоказанияСрезМКД.ПриборУчета КАК ПриборУчета,
	|		энргМаксимальныеПоказанияСрезМКД.Шкала КАК Шкала,
	|		энргМаксимальныеПоказанияСрезМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|		энргМаксимальныеПоказанияСрезМКД.Показания КАК Показания,
	|		энргМаксимальныеПоказанияСрезМКД.ДокРегистратор КАК ДокРегистратор,
	|		энргМаксимальныеПоказанияСрезМКД.ДатаРегистратора КАК ДатаРегистратора,
	|		&НачалоПериодаРасчета КАК Период,
	|		&КонецПериодаРасчета КАК КонецПериодаРасчета,
	|		0 КАК Приоритет
	|	ИЗ
	|		РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК энргМаксимальныеПоказанияСрезМКД
	|	ГДЕ
	|		энргМаксимальныеПоказанияСрезМКД.Организация = &Организация
	|		И энргМаксимальныеПоказанияСрезМКД.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|		И энргМаксимальныеПоказанияСрезМКД.Район = &Район
	|		И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПредоставленныеПоказанияМКД.Организация,
	|		&ПериодНачисления,
	|		энргПредоставленныеПоказанияМКД.Район,
	|		энргПредоставленныеПоказанияМКД.МКД,
	|		энргПредоставленныеПоказанияМКД.ПриборУчета,
	|		энргПредоставленныеПоказанияМКД.Шкала,
	|		энргПредоставленныеПоказанияМКД.ТарифнаяЗона,
	|		энргПредоставленныеПоказанияМКД.Показания,
	|		энргПредоставленныеПоказанияМКД.ДокРегистратор,
	|		энргПредоставленныеПоказанияМКД.ДатаРегистратора,
	|		&НачалоПериодаРасчета,
	|		&КонецПериодаРасчета,
	|		1
	|	ИЗ
	|		РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказанияМКД
	|	ГДЕ
	|		энргПредоставленныеПоказанияМКД.Организация = &Организация
	|		И энргПредоставленныеПоказанияМКД.ПериодНачисления = &ПериодНачисления
	|		И энргПредоставленныеПоказанияМКД.Район = &Район
	|		И энргПредоставленныеПоказанияМКД.МКД = &МКД
	|		И энргПредоставленныеПоказанияМКД.НомерПозиции = -1) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПоказанияСрезНабор.Организация КАК Организация,
	|	МаксимальныеПоказанияСрезНабор.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныеПоказанияСрезНабор.Район КАК Район,
	|	МаксимальныеПоказанияСрезНабор.МКД КАК МКД,
	|	МаксимальныеПоказанияСрезНабор.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказанияСрезНабор.Шкала КАК Шкала,
	|	МаксимальныеПоказанияСрезНабор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныеПоказанияСрезНабор.Показания КАК Показания,
	|	МаксимальныеПоказанияСрезНабор.ДокРегистратор КАК ДокРегистратор,
	|	МаксимальныеПоказанияСрезНабор.ДатаРегистратора КАК ДатаРегистратора,
	|	МаксимальныеПоказанияСрезНабор.Период КАК Период,
	|	МаксимальныеПоказанияСрезНабор.КонецПериодаРасчета КАК КонецПериодаРасчета,
	|	МаксимальныеПоказанияСрезНабор.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ МаксимальныеПоказанияСрез
	|ИЗ
	|	МаксимальныеПоказанияСрезНабор КАК МаксимальныеПоказанияСрезНабор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МаксимальныеПоказанияСрезНабор.Организация КАК Организация,
	|			МаксимальныеПоказанияСрезНабор.ПериодНачисления КАК ПериодНачисления,
	|			МаксимальныеПоказанияСрезНабор.Район КАК Район,
	|			МаксимальныеПоказанияСрезНабор.МКД КАК МКД,
	|			МаксимальныеПоказанияСрезНабор.ПриборУчета КАК ПриборУчета,
	|			МаксимальныеПоказанияСрезНабор.Шкала КАК Шкала,
	|			МаксимальныеПоказанияСрезНабор.ТарифнаяЗона КАК ТарифнаяЗона,
	|			МАКСИМУМ(МаксимальныеПоказанияСрезНабор.Приоритет) КАК Приоритет
	|		ИЗ
	|			МаксимальныеПоказанияСрезНабор КАК МаксимальныеПоказанияСрезНабор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			МаксимальныеПоказанияСрезНабор.Организация,
	|			МаксимальныеПоказанияСрезНабор.ПериодНачисления,
	|			МаксимальныеПоказанияСрезНабор.Район,
	|			МаксимальныеПоказанияСрезНабор.МКД,
	|			МаксимальныеПоказанияСрезНабор.ПриборУчета,
	|			МаксимальныеПоказанияСрезНабор.Шкала,
	|			МаксимальныеПоказанияСрезНабор.ТарифнаяЗона) КАК МаксимальныйПриоритетПоказаний
	|		ПО МаксимальныеПоказанияСрезНабор.Организация = МаксимальныйПриоритетПоказаний.Организация
	|			И МаксимальныеПоказанияСрезНабор.Организация = МаксимальныйПриоритетПоказаний.Организация
	|			И МаксимальныеПоказанияСрезНабор.ПериодНачисления = МаксимальныйПриоритетПоказаний.ПериодНачисления
	|			И МаксимальныеПоказанияСрезНабор.Район = МаксимальныйПриоритетПоказаний.Район
	|			И МаксимальныеПоказанияСрезНабор.МКД = МаксимальныйПриоритетПоказаний.МКД
	|			И МаксимальныеПоказанияСрезНабор.ПриборУчета = МаксимальныйПриоритетПоказаний.ПриборУчета
	|			И МаксимальныеПоказанияСрезНабор.Шкала = МаксимальныйПриоритетПоказаний.Шкала
	|			И МаксимальныеПоказанияСрезНабор.ТарифнаяЗона = МаксимальныйПриоритетПоказаний.ТарифнаяЗона
	|			И МаксимальныеПоказанияСрезНабор.Приоритет = МаксимальныйПриоритетПоказаний.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрезМКД.Организация КАК Организация,
	|	энргМаксимальныеПоказанияСрезМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргМаксимальныеПоказанияСрезМКД.Район КАК Район,
	|	энргМаксимальныеПоказанияСрезМКД.МКД КАК МКД,
	|	энргМаксимальныеПоказанияСрезМКД.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрезМКД.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрезМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрезМКД.Показания КАК Показания
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК энргМаксимальныеПоказанияСрезМКД
	|ГДЕ
	|	энргМаксимальныеПоказанияСрезМКД.Организация = &Организация
	|	И энргМаксимальныеПоказанияСрезМКД.ПериодНачисления = &ПериодНачисления
	|	И энргМаксимальныеПоказанияСрезМКД.Район = &Район
	|	И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД КАК МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериодаМКД.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериодаМКД КАК энргНомераСтрокСтабильногоПериодаМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (энргНомераСтрокСтабильногоПериодаМКД.Организация = &Организация)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.Район = &Район)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)
	|			И энргНомераСтрокСтабильногоПериодаМКД.Услуга = ДлительностьПериодов.Услуга
	|			И энргНомераСтрокСтабильногоПериодаМКД.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета,
	|	ДлительностьПериодов.НачалоФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД КАК МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериодаМКД.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериодаМКД КАК энргНомераСтрокСтабильногоПериодаМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (энргНомераСтрокСтабильногоПериодаМКД.Организация = &Организация)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.Район = &Район)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)
	|			И энргНомераСтрокСтабильногоПериодаМКД.Услуга = ДлительностьПериодов.Услуга
	|			И энргНомераСтрокСтабильногоПериодаМКД.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета,
	|	ДлительностьПериодов.КонецФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыМКД.НомерПозиции КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА энргСтабильныеПериодыМКД.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ энргСтабильныеПериодыМКД.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	энргСтабильныеПериодыМКД.ДокРегистратор КАК ДокРегистратор,
	|	энргСтабильныеПериодыМКД.МКДОткрыт КАК МКДОткрыт,
	|	энргСтабильныеПериодыМКД.УслугаПодключена КАК УслугаПодключена,
	|	энргСтабильныеПериодыМКД.ПриборВведен КАК ПриборВведен,
	|	энргСтабильныеПериодыМКД.ПриборУчета КАК ПриборУчета,
	|	энргСтабильныеПериодыМКД.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргСтабильныеПериодыМКД.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргСтабильныеПериодыМКД.Поставщик КАК Поставщик,
	|	энргСтабильныеПериодыМКД.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&КонецПериодаРасчета КАК ЗавершениеОП,
	|	&ДнейВПериоде КАК ДнейВПериоде,
	|	энргСтабильныеПериодыМКД.ФормулаРасчета КАК ФормулаРасчета,
	|	энргСтабильныеПериодыМКД.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргСтабильныеПериодыМКД.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргСтабильныеПериодыМКД.КлючНорматива КАК КлючНорматива,
	|	энргСтабильныеПериодыМКД.Шкала КАК Шкала,
	|	энргСтабильныеПериодыМКД.ЧастьУзлаУчета КАК ЧастьУзлаУчета,
	|	энргСтабильныеПериодыМКД.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	энргСтабильныеПериодыМКД.ТипСхемы КАК ТипСхемы,
	|	энргСтабильныеПериодыМКД.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	энргСтабильныеПериодыМКД.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	энргСтабильныеПериодыМКД.НазначениеПрибораУчета КАК НазначениеПрибораУчета,
	|	энргСтабильныеПериодыМКД.КоэффициентПУ КАК КоэффициентПУ
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|ГДЕ
	|	энргСтабильныеПериодыМКД.Организация = &Организация
	|	И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыМКД.Район = &Район
	|	И энргСтабильныеПериодыМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Организация КАК Организация,
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Район КАК Район,
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.МКД КАК МКД,
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Услуга КАК Услуга,
	|	&ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ МКДСАктивнымиФиксОбъемами
	|ИЗ
	|	РегистрСведений.энргСостояниеФиксированныхОбъемовМКД.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргСостояниеФиксированныхОбъемовМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргФиксированныеОбъемыМКДСрезПоследних.Организация КАК Организация,
	|	энргФиксированныеОбъемыМКДСрезПоследних.Район КАК Район,
	|	энргФиксированныеОбъемыМКДСрезПоследних.МКД КАК МКД,
	|	энргФиксированныеОбъемыМКДСрезПоследних.Услуга КАК Услуга,
	|	энргФиксированныеОбъемыМКДСрезПоследних.ОбъемПотребления КАК ОбъемПотребления
	|ПОМЕСТИТЬ АктуальныеФиксированныеОбъемыМКД
	|ИЗ
	|	РегистрСведений.энргФиксированныеОбъемыМКД.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			(Организация, Район, МКД, Услуга) В
	|				(ВЫБРАТЬ
	|					МКДСАктивнымиФиксОбъемами.Организация КАК Организация,
	|					МКДСАктивнымиФиксОбъемами.Район КАК Район,
	|					МКДСАктивнымиФиксОбъемами.МКД КАК МКД,
	|					МКДСАктивнымиФиксОбъемами.Услуга КАК Услуга
	|				ИЗ
	|					МКДСАктивнымиФиксОбъемами КАК МКДСАктивнымиФиксОбъемами)) КАК энргФиксированныеОбъемыМКДСрезПоследних";
	
	
	Если НЕ ОтборПоМКД тогда
		Текст 						= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргПредоставленныеПоказанияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргВыводПриборовУчетаМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.МКД = &МКД",""); 		
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКДСоставУзловУчета.МКД = &МКД","");
		
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.МКД = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И бестСтабильныеПериодыНП.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (бестСтабильныеПериодыНП.МКД = &МКД)","");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьСтабильныеПериодыМКД()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьМОП) КАК ПлощадьМОП,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначенияПлощадейСтроений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначениеПлощадейМКД.Организация КАК Организация,
	|		ЗначениеПлощадейМКД.ПериодНачисления КАК ПериодНачисления,
	|		ЗначениеПлощадейМКД.Район КАК Район,
	|		ЗначениеПлощадейМКД.МКД КАК МКД,
	|		ЗначениеПлощадейМКД.Услуга КАК Услуга,
	|		ЗначениеПлощадейМКД.ПлощадьМОП КАК ПлощадьМОП,
	|		0 КАК ПлощадьАбонентов,
	|		0 КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеПлощадейМКД КАК ЗначениеПлощадейМКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗначениеИндивидуальныхПлощадей.Организация,
	|		ЗначениеИндивидуальныхПлощадей.ПериодНачисления,
	|		ЗначениеИндивидуальныхПлощадей.Район,
	|		ЗначениеИндивидуальныхПлощадей.Строение,
	|		ЗначениеИндивидуальныхПлощадей.Услуга,
	|		0,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьАбонентов,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеИндивидуальныхПлощадей КАК ЗначениеИндивидуальныхПлощадей) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПоказанияСрез.Организация КАК Организация,
	|	МаксимальныеПоказанияСрез.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныеПоказанияСрез.Район КАК Район,
	|	МаксимальныеПоказанияСрез.МКД КАК МКД,
	|	МаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	МаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныеПоказанияСрез.Показания КАК Показания,
	|	МаксимальныеПоказанияСрез.Период КАК Период,
	|	-1 КАК НомерПозиции,
	|	МаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	МаксимальныеПоказанияСрез.КонецПериодаРасчета КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.МКД,
	|	ПредоставленныеПоказания.ПриборУчета,
	|	ПредоставленныеПоказания.Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона,
	|	ПредоставленныеПоказания.Показания,
	|	ПредоставленныеПоказания.ДатаРегистратора,
	|	ПредоставленныеПоказания.НомерПозиции,
	|	ПредоставленныеПоказания.ДокРегистратор,
	|	ПредоставленныеПоказания.КонецПериодаРасчета
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.МКД КАК МКД,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА ПоказанияНачало.КонецПериодаРасчета
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.МКД = ПоказанияКонец.МКД
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.МКД КАК МКД,
	|	МАКСИМУМ(ПредоставленныеПоказания.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоМКД
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачало.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыНачало.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыНачало.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыНачало.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыНачало.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыНачало.ПриборУчета КАК УзелПриборУчета,
	|	СтабильныеПериодыНачало.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыНачало.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыНачало.Поставщик КАК Поставщик,
	|	СтабильныеПериодыНачало.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	СтабильныеПериодыНачало.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыНачало.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыНачало.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыНачало.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыНачало.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачало.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачало.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачало.Шкала КАК Шкала,
	|	СтабильныеПериодыНачало.ЧастьУзлаУчета КАК ЧастьУзлаУчета,
	|	СтабильныеПериодыНачало.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыНачало.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеПериодыНачало.НазначениеПрибораУчета КАК НазначениеПрибораУчета,
	//|	СтабильныеПериодыНачало.ПриборУчета КАК ЧастьУзлаПриборУчета,
	//|	СтабильныеПериодыНачало.ПриборВведен КАК ЧастьУзлаПриборВведен,
	//|	СтабильныеПериодыНачало.КоэффициентПУ КАК КоэффициентПУ
	|	ЕСТЬNULL(СтабильныеПериодыСоставУзла.ЧастьУзлаУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ЧастьУзлаПриборУчета,
	|	ЕСТЬNULL(СтабильныеПериодыСоставУзла.ПриборВведен, ЛОЖЬ) КАК ЧастьУзлаПриборВведен,
	|	ЕСТЬNULL(СтабильныеПериодыСоставУзла.КоэффициентПУ, 1) КАК КоэффициентПУ
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСоставУзла
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыСоставУзла КАК СтабильныеПериодыСоставУзла
	|		ПО СтабильныеПериодыНачало.Организация = СтабильныеПериодыСоставУзла.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СтабильныеПериодыСоставУзла.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СтабильныеПериодыСоставУзла.Район
	|			И СтабильныеПериодыНачало.МКД = СтабильныеПериодыСоставУзла.МКД
	|			И СтабильныеПериодыНачало.ТочкаУчета = СтабильныеПериодыСоставУзла.ТочкаУчета
	|			И СтабильныеПериодыНачало.НомерПозиции = СтабильныеПериодыСоставУзла.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоСоставУзла.Организация КАК Организация,
	|	СтабильныеПериодыНачалоСоставУзла.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачалоСоставУзла.Район КАК Район,
	|	СтабильныеПериодыНачалоСоставУзла.МКД КАК МКД,
	|	СтабильныеПериодыНачалоСоставУзла.Услуга КАК Услуга,
	|	СтабильныеПериодыНачалоСоставУзла.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачалоСоставУзла.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыНачалоСоставУзла.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыНачалоСоставУзла.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыНачалоСоставУзла.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыНачалоСоставУзла.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыНачалоСоставУзла.УзелПриборУчета КАК УзелПриборУчета,
	|	СтабильныеПериодыНачалоСоставУзла.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыНачалоСоставУзла.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыНачалоСоставУзла.Поставщик КАК Поставщик,
	|	СтабильныеПериодыНачалоСоставУзла.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	СтабильныеПериодыНачалоСоставУзла.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыНачалоСоставУзла.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыНачалоСоставУзла.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыНачалоСоставУзла.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыНачалоСоставУзла.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачалоСоставУзла.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСоставУзла.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСоставУзла.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСоставУзла.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачалоСоставУзла.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачалоСоставУзла.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	СтабильныеПериодыНачалоСоставУзла.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыНачалоСоставУзла.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеПериодыНачалоСоставУзла.НазначениеПрибораУчета КАК НазначениеПрибораУчета,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, СтабильныеПериодыНачалоСоставУзла.Шкала) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ЧастьУзлаУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ЧастьУзлаУчета,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачалоСоставУзла.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПривязанаКШкале
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоШкалы
	|ИЗ
	|	СтабильныеПериодыНачалоСоставУзла КАК СтабильныеПериодыНачалоСоставУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО СтабильныеПериодыНачалоСоставУзла.Организация = СтабильныеПериодыШкалы.Организация
	|			И СтабильныеПериодыНачалоСоставУзла.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСоставУзла.Район = СтабильныеПериодыШкалы.Район
	|			И СтабильныеПериодыНачалоСоставУзла.МКД = СтабильныеПериодыШкалы.МКД
	|			И СтабильныеПериодыНачалоСоставУзла.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСоставУзла.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаПриборУчета = СтабильныеПериодыШкалы.ЧастьУзлаУчета
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыНачалоСоставУзла.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|						И СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтабильныеПериодыНачалоСоставУзла.Шкала = СтабильныеПериодыШкалы.Шкала
	|						И СтабильныеПериодыНачалоСоставУзла.ЧастьУзлаУчета = СтабильныеПериодыШкалы.ЧастьУзлаУчета
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокНачалоСезонности.Организация КАК Организация,
	|	НомераСтрокНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокНачалоСезонности.Район КАК Район,
	|	НомераСтрокНачалоСезонности.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	НомераСтрокНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачало.Шкала КАК Шкала,
	|	НомераСтрокНачалоСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокНачалоСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокНачалоСезонности КАК НомераСтрокНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокНачалоСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокНачалоСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокНачалоСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокНачалоСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокНачалоСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокНачалоСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокКонецСезонности.Организация КАК Организация,
	|	НомераСтрокКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокКонецСезонности.Район КАК Район,
	|	НомераСтрокКонецСезонности.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	НомераСтрокКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачало.Шкала КАК Шкала,
	|	НомераСтрокКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокКонецСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокКонецСезонности КАК НомераСтрокКонецСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокКонецСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокКонецСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокКонецСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокКонецСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокКонецСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокКонецСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоШкалы.Организация КАК Организация,
	|	СтабильныеПериодыНачалоШкалы.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачалоШкалы.Район КАК Район,
	|	СтабильныеПериодыНачалоШкалы.МКД КАК МКД,
	|	СтабильныеПериодыНачалоШкалы.Услуга КАК Услуга,
	|	СтабильныеПериодыНачалоШкалы.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачалоШкалы.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыНачалоШкалы.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоШкалы.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыНачалоШкалы.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыНачалоШкалы.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыНачалоШкалы.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыНачалоШкалы.УзелПриборУчета КАК УзелПриборУчета,
	|	СтабильныеПериодыНачалоШкалы.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыНачалоШкалы.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыНачалоШкалы.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыНачалоШкалы.Поставщик КАК Поставщик,
	|	СтабильныеПериодыНачалоШкалы.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	ВЫБОР
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СезонностьНачало,
	|	СтабильныеПериодыНачалоШкалы.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоШкалы.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоШкалы.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ)) КАК НеПрименятьСезонность,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.ОбъемЗаПрошлыйГод, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.ОбъемЗаПрошлыйГод, ЛОЖЬ)) КАК ОбъемЗаПрошлыйГод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ))
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНеПрименятьСезонность, 1))
	|		ИНАЧЕ ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|	КОНЕЦ КАК КоэффициентНорматива,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1)) КАК КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеПериодыНачалоШкалы.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыНачалоШкалы.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыНачалоШкалы.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыНачалоШкалы.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыНачалоШкалы.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачалоШкалы.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачалоШкалы.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыНачалоШкалы.Шкала КАК Шкала,
	|	СтабильныеПериодыНачалоШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоШкалы.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоШкалы.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	СтабильныеПериодыНачалоШкалы.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	СтабильныеПериодыНачалоШкалы.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеПериодыНачалоШкалы.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачалоШкалы.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьМКД
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьМКД.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьМКД.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьМКД.Район
	|			И СтабильныеПериодыНачалоШкалы.МКД = УслугиНеПрименятьСезонностьМКД.Строение
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьМКД.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьРайон
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьРайон.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьРайон.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьРайон.Район
	|			И (УслугиНеПрименятьСезонностьРайон.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьРайон.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоСезонности.Организация КАК Организация,
	|	СтабильныеПериодыНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачалоСезонности.Район КАК Район,
	|	СтабильныеПериодыНачалоСезонности.МКД КАК МКД,
	|	СтабильныеПериодыНачалоСезонности.Услуга КАК Услуга,
	|	СтабильныеПериодыНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции
	|		КОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			ТОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции + 1
	|		ИНАЧЕ СтабильныеПериодыНачалоСезонности.НомерПозиции
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыНачалоСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыНачалоСезонности.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыНачалоСезонности.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыНачалоСезонности.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыНачалоСезонности.УзелПриборУчета КАК УзелПриборУчета,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыНачалоСезонности.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыНачалоСезонности.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыНачалоСезонности.Поставщик КАК Поставщик,
	|	СтабильныеПериодыНачалоСезонности.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачалоСезонности.СезонностьНачало
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УвеличениеПозиции,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНормативаПрименятьСезонность КАК КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыНачалоСезонности.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыНачалоСезонности.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыНачалоСезонности.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыНачалоСезонности.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачалоСезонности.Шкала КАК Шкала,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачалоСезонности.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыНачалоСезонности.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	СтабильныеПериодыНачалоСезонности.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	СтабильныеПериодыНачалоСезонности.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеПериодыНачалоСезонности.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.Шкала = НомераСтрокНачалоСезонностиБезФормулы.Шкала
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоСезонности.Организация,
	|	СтабильныеПериодыНачалоСезонности.ПериодНачисления,
	|	СтабильныеПериодыНачалоСезонности.Район,
	|	СтабильныеПериодыНачалоСезонности.МКД,
	|	СтабильныеПериодыНачалоСезонности.Услуга,
	|	СтабильныеПериодыНачалоСезонности.ТочкаУчета,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + 1,
	|	НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности,
	|	СтабильныеПериодыНачалоСезонности.ДокРегистратор,
	|	СтабильныеПериодыНачалоСезонности.МКДОткрыт,
	|	СтабильныеПериодыНачалоСезонности.УслугаПодключена,
	|	СтабильныеПериодыНачалоСезонности.ПриборВведен,
	|	СтабильныеПериодыНачалоСезонности.УзелПриборУчета,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентПУ,
	|	СтабильныеПериодыНачалоСезонности.ВидБлагоустройства,
	|	СтабильныеПериодыНачалоСезонности.ЗначениеПлощади,
	|	СтабильныеПериодыНачалоСезонности.Поставщик,
	|	СтабильныеПериодыНачалоСезонности.МенялосьСостояниеПУ,
	|	1,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде,
	|	1,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ФормулаРасчета,
	|	СтабильныеПериодыНачалоСезонности.РасчетПоФормуле,
	|	СтабильныеПериодыНачалоСезонности.СоставнаяУслуга,
	|	СтабильныеПериодыНачалоСезонности.КлючНорматива,
	|	СтабильныеПериодыНачалоСезонности.НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачалоСезонности.Шкала,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.ТипСхемы,
	|	СтабильныеПериодыНачалоСезонности.ВидТепловогоПункта,
	|	СтабильныеПериодыНачалоСезонности.ЧастьУзлаПриборУчета,
	|	СтабильныеПериодыНачалоСезонности.ЧастьУзлаПриборВведен,
	|	СтабильныеПериодыНачалоСезонности.РаспределятьНаТочку,
	|	СтабильныеПериодыНачалоСезонности.НазначениеПрибораУчета
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.Шкала = НомераСтрокНачалоСезонностиБезФормулы.Шкала
	|			И СтабильныеПериодыНачалоСезонности.НомерПозиции = НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыСезонность.Организация КАК Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район КАК Район,
	|	СтабильныеПериодыСезонность.МКД КАК МКД,
	|	СтабильныеПериодыСезонность.Услуга КАК Услуга,
	|	СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыСезонность.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + СтабильныеПериодыСезонность.УвеличениеПозиции > СтабильныеПериодыСезонность.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыСезонность.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыСезонность.ДокРегистратор КАК ДокРегистратор,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыСезонность.КоэффициентСезоности
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыСезонность.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыСезонность.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыСезонность.УзелПриборУчета КАК УзелПриборУчета,
	|	СтабильныеПериодыСезонность.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыСезонность.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыСезонность.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыСезонность.Поставщик КАК Поставщик,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаПрименятьСезонность КАК КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыСезонность.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыСезонность.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыСезонность.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыСезонность.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.Шкала КАК Шкала,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыСезонность.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыСезонность.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	СтабильныеПериодыСезонность.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	СтабильныеПериодыСезонность.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеПериодыСезонность.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ СтабильныеКонецСезонности
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.Шкала = НомераСтрокКонецСезонностиБезФормулы.Шкала
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтабильныеПериодыСезонность.Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район,
	|	СтабильныеПериодыСезонность.МКД,
	|	СтабильныеПериодыСезонность.Услуга,
	|	СтабильныеПериодыСезонность.ТочкаУчета,
	|	НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + 1,
	|	НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности,
	|	СтабильныеПериодыСезонность.ДокРегистратор,
	|	0,
	|	СтабильныеПериодыСезонность.НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде,
	|	СтабильныеПериодыСезонность.МКДОткрыт,
	|	СтабильныеПериодыСезонность.УслугаПодключена,
	|	СтабильныеПериодыСезонность.ПриборВведен,
	|	СтабильныеПериодыСезонность.УзелПриборУчета,
	|	СтабильныеПериодыСезонность.КоэффициентПУ,
	|	СтабильныеПериодыСезонность.ВидБлагоустройства,
	|	СтабильныеПериодыСезонность.ЗначениеПлощади,
	|	СтабильныеПериодыСезонность.Поставщик,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ФормулаРасчета,
	|	СтабильныеПериодыСезонность.РасчетПоФормуле,
	|	СтабильныеПериодыСезонность.СоставнаяУслуга,
	|	СтабильныеПериодыСезонность.КлючНорматива,
	|	СтабильныеПериодыСезонность.НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.Шкала,
	|	СтабильныеПериодыСезонность.ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.ТипСхемы,
	|	СтабильныеПериодыСезонность.ВидТепловогоПункта,
	|	СтабильныеПериодыСезонность.ЧастьУзлаПриборУчета,
	|	СтабильныеПериодыСезонность.ЧастьУзлаПриборВведен,
	|	СтабильныеПериодыСезонность.РаспределятьНаТочку,
	|	СтабильныеПериодыСезонность.НазначениеПрибораУчета
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.Шкала = НомераСтрокКонецСезонностиБезФормулы.Шкала
	|			И (СтабильныеПериодыСезонность.НомерПозиции - СтабильныеПериодыСезонность.УвеличениеПозиции = НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеКонецСезонности.Организация КАК Организация,
	|	СтабильныеКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеКонецСезонности.Район КАК Район,
	|	СтабильныеКонецСезонности.МКД КАК МКД,
	|	СтабильныеКонецСезонности.Услуга КАК Услуга,
	|	СтабильныеКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	СтабильныеКонецСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеКонецСезонности.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеКонецСезонности.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонности.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеКонецСезонности.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеКонецСезонности.ПриборВведен КАК ПриборВведен,
	|	СтабильныеКонецСезонности.УзелПриборУчета КАК УзелПриборУчета,
	|	СтабильныеКонецСезонности.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеКонецСезонности.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеКонецСезонности.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеКонецСезонности.Поставщик КАК Поставщик,
	|	СтабильныеКонецСезонности.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеКонецСезонности.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеКонецСезонности.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеКонецСезонности.КлючНорматива КАК КлючНорматива,
	|	СтабильныеКонецСезонности.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеКонецСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонности.Шкала КАК Шкала,
	|	СтабильныеКонецСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеКонецСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ВЫБОР
	|		КОГДА энргВидыДифференцированностиТарифныеЗоны.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона,
	|	СтабильныеКонецСезонности.ТипСхемы КАК ТипСхемы,
	|	СтабильныеКонецСезонности.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеКонецСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеКонецСезонности.КоэффициентНормативаПрименятьСезонность КАК КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеКонецСезонности.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	СтабильныеКонецСезонности.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	СтабильныеКонецСезонности.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеКонецСезонности.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТарифнаяЗона
	|ИЗ
	|	СтабильныеКонецСезонности КАК СтабильныеКонецСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеКонецСезонности.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеКонецСезонностиТарифнаяЗона.Организация КАК Организация,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Район КАК Район,
	|	СтабильныеКонецСезонностиТарифнаяЗона.МКД КАК МКД,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Услуга КАК Услуга,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НомерПозиции КАК НомерПозиции,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Шкала КАК Шкала,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидДифференцированности КАК ВидДифференцированности,
	|	ЕСТЬNULL(ПериодыПоказаний.Показания, 0) КАК Показания,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонностиТарифнаяЗона.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеКонецСезонностиТарифнаяЗона.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПриборВведен КАК ПриборВведен,
	|	СтабильныеКонецСезонностиТарифнаяЗона.УзелПриборУчета КАК УзелПриборУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Поставщик КАК Поставщик,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеКонецСезонностиТарифнаяЗона.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КлючНорматива КАК КлючНорматива,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТипСхемы КАК ТипСхемы,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНормативаПрименятьСезонность КАК КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	СтабильныеКонецСезонностиТарифнаяЗона.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	СтабильныеКонецСезонностиТарифнаяЗона КАК СтабильныеКонецСезонностиТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор) = ТИП(Документ.энргНачислениеМКД)
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА ТИПЗНАЧЕНИЯ(СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор) = ТИП(Документ.энргВводНачальныхОстатковМКД)
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА ТИПЗНАЧЕНИЯ(СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор) = ТИП(Документ.энргОткрытиеМКД)
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА ТИПЗНАЧЕНИЯ(СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор) = ТИП(Документ.энргОперацияСПриборомУчетаМКД)
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА ТИПЗНАЧЕНИЯ(СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор) = ТИП(Документ.энргОперацияСУслугамиМКД)
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				ИНАЧЕ СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации МЕЖДУ ПериодыПоказаний.НачалоПериодДействия И ПериодыПоказаний.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Организация = ПериодыПоказаний.Организация
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Район = ПериодыПоказаний.Район
	|			И СтабильныеКонецСезонностиТарифнаяЗона.МКД = ПериодыПоказаний.МКД
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ЧастьУзлаПриборУчета = ПериодыПоказаний.ПриборУчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Шкала = ПериодыПоказаний.Шкала
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона = ПериодыПоказаний.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыПоказанияНачало.Организация КАК Организация,
	|	СтабильныеПериодыПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыПоказанияНачало.Район КАК Район,
	|	СтабильныеПериодыПоказанияНачало.МКД КАК МКД,
	|	СтабильныеПериодыПоказанияНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыПоказанияНачало.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыПоказанияНачало.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыПоказанияНачало.Шкала КАК Шкала,
	|	СтабильныеПериодыПоказанияНачало.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.НачалоОП
	|			ТОГДА СтабильныеПериодыПоказанияНачало.НачалоОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации > СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации > СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.НачалоОП
	|			ТОГДА СтабильныеПериодыПоказанияКонец.НачалоОП
	|		ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,
	|	СтабильныеПериодыПоказанияНачало.Показания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ЧастьУзлаПриборУчета ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.Показания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтабильныеПериодыПоказанияНачало.ЧастьУзлаПриборУчета = СтабильныеПериодыПоказанияКонец.ЧастьУзлаПриборУчета
	|					ТОГДА СтабильныеПериодыПоказанияКонец.Показания
	|				ИНАЧЕ СтабильныеПериодыПоказанияНачало.Показания
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеПериодыПоказанияНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПоказанияНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПоказанияНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыПоказанияКонец.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	|	СтабильныеПериодыПоказанияНачало.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыПоказанияНачало.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыПоказанияНачало.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыПоказанияНачало.УзелПриборУчета КАК УзелПриборУчета,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыПоказанияНачало.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыПоказанияНачало.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыПоказанияНачало.Поставщик КАК Поставщик,
	|	СтабильныеПериодыПоказанияНачало.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыПоказанияНачало.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыПоказанияНачало.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыПоказанияНачало.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыПоказанияНачало.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыПоказанияНачало.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыПоказанияНачало.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыПоказанияНачало.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыПоказанияНачало.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыПоказанияНачало.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНормативаПрименятьСезонность КАК КоэффициентНормативаПрименятьСезонность,
	|	СтабильныеПериодыПоказанияНачало.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	СтабильныеПериодыПоказанияНачало.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	СтабильныеПериодыПоказанияНачало.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	СтабильныеПериодыПоказанияНачало.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияКонец
	|		ПО СтабильныеПериодыПоказанияНачало.Организация = СтабильныеПериодыПоказанияКонец.Организация
	|			И (СтабильныеПериодыПоказанияНачало.НомерПозиции = СтабильныеПериодыПоказанияКонец.НомерПозиции - 1)
	|			И СтабильныеПериодыПоказанияНачало.ПериодНачисления = СтабильныеПериодыПоказанияКонец.ПериодНачисления
	|			И СтабильныеПериодыПоказанияНачало.Район = СтабильныеПериодыПоказанияКонец.Район
	|			И СтабильныеПериодыПоказанияНачало.МКД = СтабильныеПериодыПоказанияКонец.МКД
	|			И СтабильныеПериодыПоказанияНачало.ТочкаУчета = СтабильныеПериодыПоказанияКонец.ТочкаУчета
	|			И СтабильныеПериодыПоказанияНачало.Услуга = СтабильныеПериодыПоказанияКонец.Услуга";
	//|			И СтабильныеПериодыПоказанияНачало.ЧастьУзлаПриборУчета = СтабильныеПериодыПоказанияКонец.ЧастьУзлаПриборУчета
	//|			И СтабильныеПериодыПоказанияНачало.Шкала = СтабильныеПериодыПоказанияКонец.Шкала
	//|			И СтабильныеПериодыПоказанияНачало.ТарифнаяЗона = СтабильныеПериодыПоказанияКонец.ТарифнаяЗона";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьДанныеДляРасчетаМКД(ИмяДокумента)	
	Текст  = 
	"ВЫБРАТЬ
	|	Периоды.НачалоПериода КАК НачалоПериода,
	|	Периоды.КонецПериода КАК КонецПериода,
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.МКД КАК МКД,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.Шкала КАК Шкала,
	|	Периоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	Периоды.НачальныеПоказания КАК НачПок,
	|	ЕСТЬNULL(СреднееПотребление.СреднийОбъем, -1) КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ КАК КонПок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.МКД ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПредоставленныеПоказания.ВСрок
	|		КОНЕЦ) КАК ПоказанияВСрок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеВыводаПрибораУчета.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВыводПрибораУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ПоказанияПредоставлены,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаДокумента.Ссылка, ЗНАЧЕНИЕ(Документ.энргНачислениеМКД.ПустаяСсылка))) КАК ДокументНачисления,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаДокумента.ПометкаУдаления, ЛОЖЬ)) КАК ДокументНачисленияПометкаУдаления,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	Периоды.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощадиМКД, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|	МАКСИМУМ(ЕСТЬNULL(ПредоставленныеПоказанияПоМКД.ПоказанияТекущегоПериода, ЛОЖЬ)) КАК ЕстьПоказанияМКД,
	|	Периоды.МКДОткрыт КАК МКДОткрыт,
	|	Периоды.УслугаПодключена КАК УслугаПодключена,
	|	Периоды.ПриборВведен КАК ПриборВведен,
	|	Периоды.УзелПриборУчета КАК УзелПриборУчета,
	|	Периоды.КоэффициентПУ КАК КоэффициентПУ,
	|	Периоды.ВидБлагоустройства КАК ВидБлагоустройства,
	|	Периоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	Периоды.Поставщик КАК Поставщик,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)) КАК ФормулаРасчета,
	|	Периоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Периоды.КлючНорматива КАК КлючНорматива,
	|	Периоды.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	Периоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	Периоды.ТипСхемы КАК ТипСхемы,
	|	Периоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК ЗависитОтУслуги,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗакрытаяСхемаГВС,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0) КАК ПлощадьМОП,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0) КАК ПлощадьАбонентов,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0) КАК ПлощадьСобственнаяПоставка,
	|	Периоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	Периоды.КоэффициентНормативаПрименятьСезонность КАК КоэффициентНормативаПрименятьСезонность,
	|	Периоды.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	Периоды.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	Периоды.ЗавершениеОП КАК ЗавершениеОП,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	Периоды.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	Периоды.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормой
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО Периоды.Организация = ПредоставленныеПоказания.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказания.Район
	|			И Периоды.МКД = ПредоставленныеПоказания.МКД
	|			И Периоды.ЧастьУзлаПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.МКД = МаксимальныеПоказания.МКД
	|			И Периоды.ЧастьУзлаПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргНачислениеМКД КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ))
	|			И Периоды.Организация = ТаблицаДокумента.Организация
	|			И Периоды.Район = ТаблицаДокумента.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеМКД КАК СреднееПотребление
	|		ПО Периоды.Организация = СреднееПотребление.Организация
	|			И Периоды.ПериодНачисления = СреднееПотребление.ПериодНачисления
	|			И Периоды.Район = СреднееПотребление.Район
	|			И Периоды.МКД = СреднееПотребление.МКД
	|			И Периоды.Услуга = СреднееПотребление.Услуга
	|			И Периоды.ТочкаУчета = СреднееПотребление.ТочкаУчета
	|			И Периоды.Шкала = СреднееПотребление.Шкала
	|			И Периоды.ТарифнаяЗона = СреднееПотребление.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВыводаПрибораУчета КАК ДанныеВыводаПрибораУчета
	|		ПО Периоды.Организация = ДанныеВыводаПрибораУчета.Организация
	|			И Периоды.ПериодНачисления = ДанныеВыводаПрибораУчета.ПериодНачисления
	|			И Периоды.Район = ДанныеВыводаПрибораУчета.Район
	|			И Периоды.МКД = ДанныеВыводаПрибораУчета.МКД
	|			И Периоды.ТочкаУчета = ДанныеВыводаПрибораУчета.ТочкаУчета
	|			И Периоды.ЧастьУзлаПриборУчета = ДанныеВыводаПрибораУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Периоды.ЧастьУзлаПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Периоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоМКД КАК ПредоставленныеПоказанияПоМКД
	|		ПО Периоды.Организация = ПредоставленныеПоказанияПоМКД.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияПоМКД.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияПоМКД.Район
	|			И Периоды.МКД = ПредоставленныеПоказанияПоМКД.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО Периоды.Организация = МКДНеНачислятьТЭ.Организация
	|			И Периоды.Район = МКДНеНачислятьТЭ.Район
	|			И Периоды.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И Периоды.ТипСхемы = МКДНеНачислятьТЭ.ТипСхемы
	|			И Периоды.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту
	|			И (ВЫБОР
	|				КОГДА МКДНеНачислятьТЭ.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА Периоды.МКД = МКДНеНачислятьТЭ.МКД
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСтроений КАК ЗначенияПлощадейСтроений
	|		ПО Периоды.Организация = ЗначенияПлощадейСтроений.Организация
	|			И Периоды.ПериодНачисления = ЗначенияПлощадейСтроений.ПериодНачисления
	|			И Периоды.Район = ЗначенияПлощадейСтроений.Район
	|			И Периоды.Услуга = ЗначенияПлощадейСтроений.Услуга
	|			И Периоды.МКД = ЗначенияПлощадейСтроений.МКД
	|ГДЕ
	|	Периоды.МКДОткрыт
	|	И Периоды.УслугаПодключена
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Организация,
	|	Периоды.ПериодНачисления,
	|	Периоды.МКД,
	|	Периоды.Шкала,
	|	Периоды.ПривязанаКШкале,
	|	Периоды.ТарифнаяЗона,
	|	Периоды.КонецПериода,
	|	Периоды.НачалоПериода,
	|	Периоды.Район,
	|	Периоды.ТочкаУчета,
	|	Периоды.НачальныеПоказания,
	|	ЕСТЬNULL(СреднееПотребление.СреднийОбъем, -1),
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания,
	|	Периоды.Услуга,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ,
	|	Периоды.КоэффициентСезоности,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощадиМКД, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)),
	|	Периоды.ДнейВПериоде,
	|	Периоды.МКДОткрыт,
	|	Периоды.УслугаПодключена,
	|	Периоды.ПриборВведен,
	|	Периоды.УзелПриборУчета,
	|	Периоды.КоэффициентПУ,
	|	Периоды.ВидБлагоустройства,
	|	Периоды.ЗначениеПлощади,
	|	Периоды.Поставщик,
	|	Периоды.ВидДифференцированности,
	|	Периоды.РасчетПоФормуле,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)),
	|	Периоды.СоставнаяУслуга,
	|	Периоды.КлючНорматива,
	|	Периоды.НеРаспределятьНаАбонентов,
	|	Периоды.НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод,
	|	Периоды.ТипСхемы,
	|	Периоды.ВидТепловогоПункта,
	|	ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0),
	|	Периоды.КоэффициентНорматива,
	|	Периоды.КоэффициентНормативаПрименятьСезонность,
	|	Периоды.ЧастьУзлаПриборУчета,
	|	Периоды.ЧастьУзлаПриборВведен,
	|	Периоды.ЗавершениеОП,
	|	энргПриборыУчетаАбонента.РегистрируетОбъем,
	|	Периоды.РаспределятьНаТочку,
	|	Периоды.НазначениеПрибораУчета";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаРассчитатьОбъемПотребленияМКД()
	Текст  =  
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|					ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ) КАК Приоритет,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ДанныеДляРасчетаПередНормой.СреднийОбъем >= 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) КАК ПриборВведен,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) КАК ПоказанияВСрок,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК КоличествоТочекУчета
	|ПОМЕСТИТЬ ПриоритетНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга
	|
	|ИМЕЮЩИЕ
	|	(МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод) = ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиНачисленияНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ПриоритетНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 1
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|							ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.УслугаПодключена КАК УслугаПодключена,
	|	ДанныеДляРасчетаПередНормой.УзелПриборУчета КАК УзелПриборУчета,
	|	ДанныеДляРасчетаПередНормой.Шкала КАК Шкала,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.МКДОткрыт КАК МКДОткрыт,
	|	ДанныеДляРасчетаПередНормой.ПриборВведен КАК ПриборВведен,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.КонПок КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ДанныеДляРасчетаПЕредНормой,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеДляРасчетаПередНормой.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляРасчетаПередНормой.Поставщик КАК Поставщик,
	|	ДанныеДляРасчетаПередНормой.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияМКД КАК ЕстьПоказанияМКД,
	|	ВЫБОР
	|		КОГДА НЕ ТочкиНачисленияНормы.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеДляРасчетаПередНормой.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчетаПередНормой.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) * ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчетаПередНормой.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчетаПередНормой.ЗначениеПлощади
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчетаПередНормой.ПлощадьАбонентов - ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка + ДанныеДляРасчетаПередНормой.ПлощадьМОП = 0
	|						ТОГДА 0
	|					ИНАЧЕ (ДанныеДляРасчетаПередНормой.ПлощадьАбонентов - ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчетаПередНормой.ПлощадьАбонентов - ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка + ДанныеДляРасчетаПередНормой.ПлощадьМОП)
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчетаПередНормой.ДнейВПериоде) КАК ОбъемПоНорме,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНормативаПрименятьСезонность КАК КоэффициентНормативаПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	ДанныеДляРасчетаПередНормой.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	ДанныеДляРасчетаПередНормой.ЗавершениеОП КАК ЗавершениеОП,
	|	ДанныеДляРасчетаПередНормой.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ДанныеДляРасчетаПередНормой.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	ДанныеДляРасчетаПередНормой.НазначениеПрибораУчета КАК НазначениеПрибораУчета,
	|	ЕСТЬNULL(АктуальныеФиксированныеОбъемыМКД.ОбъемПотребления, 0) КАК ФиксированныйОбъем
	|ПОМЕСТИТЬ ДанныеДляРасчета
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормы КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ТочкиНачисленияНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеФиксированныеОбъемыМКД КАК АктуальныеФиксированныеОбъемыМКД
	|		ПО ДанныеДляРасчетаПередНормой.Организация = АктуальныеФиксированныеОбъемыМКД.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = АктуальныеФиксированныеОбъемыМКД.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = АктуальныеФиксированныеОбъемыМКД.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = АктуальныеФиксированныеОбъемыМКД.Услуга
	|			И ДанныеДляРасчетаПередНормой.МКД = АктуальныеФиксированныеОбъемыМКД.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация КАК Организация,
	|	ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчета.Район КАК Район,
	|	ДанныеДляРасчета.МКД КАК МКД,
	|	ДанныеДляРасчета.Услуга КАК Услуга,
	|	ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчета.УзелПриборУчета КАК УзелПриборУчета,
	|	ДанныеДляРасчета.ЧастьУзлаПриборУчета КАК ЧастьУзлаПриборУчета,
	|	ДанныеДляРасчета.Шкала КАК Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен КАК ПриборВведен,
	|	ДанныеДляРасчета.ЧастьУзлаПриборВведен КАК ЧастьУзлаПриборВведен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.РегистрируетОбъем
	|					И НЕ ДанныеДляРасчета.КонПок = ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.КонПок
	|			КОГДА ДанныеДляРасчета.РегистрируетОбъем
	|				ТОГДА 0
	|			КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|			ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|		КОНЕЦ * ДанныеДляРасчета.КоэффициентПУ КАК ЧИСЛО(15, 6)) КАК ОбъемУслугиПотребленный,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				ТОГДА 0
	|			КОГДА ДанныеДляРасчета.РегистрируетОбъем
	|					И НЕ ДанныеДляРасчета.КонПок = ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.КонПок
	|			КОГДА ДанныеДляРасчета.РегистрируетОбъем
	|				ТОГДА 0
	|			КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|			ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|		КОНЕЦ * ДанныеДляРасчета.КоэффициентПУ КАК ЧИСЛО(15, 6)) КАК ОбъемУслуги,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КАК СпособНачисления,
	|	ДанныеДляРасчета.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.РегистрируетОбъем
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДляРасчета.НачПок
	|	КОНЕЦ КАК НачальныеПоказания,
	|	ДанныеДляРасчета.КонПок КАК КонечныеПоказания,
	|	ДанныеДляРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива КАК НормаПотребления,
	|	ДанныеДляРасчета.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК СниматьНачисленныйСредний,
	|	ДанныеДляРасчета.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме КАК ОбъемУслугиНорматив,
	|	ДанныеДляРасчета.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчета.ЗавершениеОП КАК ЗавершениеОП,
	|	ДанныеДляРасчета.УзелПриборУчета КАК ПриборУчета,
	|	1 КАК ПоказанияПредоставленыПотребленный,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				И ДанныеДляРасчета.СреднийОбъем >= 0
	|			ТОГДА 1
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПоказанияПредоставлены,
	|	ДанныеДляРасчета.РаспределятьНаТочку КАК РаспределятьНаТочку,
	|	ДанныеДляРасчета.НазначениеПрибораУчета КАК НазначениеПрибораУчета,
	|	ДанныеДляРасчета.КоэффициентПУ КАК КоэффициентПУ
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	ДанныеДляРасчета.ЧастьУзлаПриборВведен
	|	И ДанныеДляРасчета.ПоказанияПредоставлены
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная),
	|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки),
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЧастьУзлаПриборВведен,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ФиксированныйОбъем > 0
	|			ТОГДА ДанныеДляРасчета.ФиксированныйОбъем
	|		ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНормативаПрименятьСезонность * ВЫБОР
	|				КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|					ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|				ИНАЧЕ 1
	|			КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|								ТОГДА 0
	|							ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ФиксированныйОбъем > 0
	|			ТОГДА ДанныеДляРасчета.ФиксированныйОбъем
	|		ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|				КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|					ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|				ИНАЧЕ 1
	|			КОНЕЦ * ВЫБОР
	|				КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|					ТОГДА ВЫБОР
	|							КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|								ТОГДА 0
	|							ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ФиксированныйОбъем > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ФиксированныйОбъем)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				И ДанныеДляРасчета.СреднийОбъем >= 0
	|			ТОГДА 1
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.РаспределятьНаТочку,
	|	ДанныеДляРасчета.НазначениеПрибораУчета,
	|	ДанныеДляРасчета.КоэффициентПУ
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ДанныеДляРасчета.ЧастьУзлаПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЧастьУзлаПриборВведен,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентПУ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентПУ * ВЫБОР
	|			КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				ТОГДА 0
	|			ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				И ДанныеДляРасчета.СреднийОбъем >= 0
	|			ТОГДА 1
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.РаспределятьНаТочку,
	|	ДанныеДляРасчета.НазначениеПрибораУчета,
	|	ДанныеДляРасчета.КоэффициентПУ
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем >= 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ДанныеДляРасчета.ЧастьУзлаПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЧастьУзлаПриборВведен,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНормативаПрименятьСезонность * ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|			ИНАЧЕ 1
	|		КОНЕЦ * ВЫБОР
	|			КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				ТОГДА 0
	|			ИНАЧЕ ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|					КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|					ИНАЧЕ 1
	|				КОНЕЦ * ВЫБОР
	|					КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|									ТОГДА 0
	|								ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|							КОНЕЦ
	|					ИНАЧЕ 1
	|				КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде)
	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				И ДанныеДляРасчета.СреднийОбъем >= 0
	|			ТОГДА 1
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.РаспределятьНаТочку,
	|	ДанныеДляРасчета.НазначениеПрибораУчета,
	|	ДанныеДляРасчета.КоэффициентПУ
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем < 0
	|	И ДанныеДляРасчета.ЧастьУзлаПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ДанныеДляРасчета.ЧастьУзлаПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЧастьУзлаПриборВведен,
	|	0,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентПУ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	0,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				И ДанныеДляРасчета.СреднийОбъем >= 0
	|			ТОГДА 1
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.РаспределятьНаТочку,
	|	ДанныеДляРасчета.НазначениеПрибораУчета,
	|	ДанныеДляРасчета.КоэффициентПУ
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем >= 0
	|	И ДанныеДляРасчета.ЧастьУзлаПриборВведен
	|	И ДанныеДляРасчета.НеПрименятьСезонность
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ДанныеДляРасчета.ЧастьУзлаПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.ЧастьУзлаПриборВведен,
	|	0,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|			ИНАЧЕ 1
	|		КОНЕЦ * ВЫБОР
	|			КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	0,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ДанныеДляРасчета.УзелПриборУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				И ДанныеДляРасчета.СреднийОбъем >= 0
	|			ТОГДА 1
	|		КОГДА НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПоказанияПредоставлены
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.РаспределятьНаТочку,
	|	ДанныеДляРасчета.НазначениеПрибораУчета,
	|	ДанныеДляРасчета.КоэффициентПУ
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	ДанныеДляРасчета.СреднийОбъем <= 0
	|	И ДанныеДляРасчета.ЧастьУзлаПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	ЗависитОтУслуги,
	|	ТочкаУчета,
	|	НачалоПериода,
	|	СоставнаяУслуга,
	|	Услуга";
			
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область КорректировкаПотребленияСезонныхУслугМКД

Функция ТекстЗапросаВспомогательныеДанныеДляКорректировкиПотребленияСезонныхУслугМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНастройкаСезонностиУслуг.МКД КАК МКД,
	|	энргНастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	энргНастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргНастройкаСезонностиУслуг.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ УслугиКорректироватьГодовойОбъемНабор
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|				И НЕ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				И МКД = &МКД) КАК энргНастройкаСезонностиУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНастройкаСезонностиУслуг.МКД,
	|	энргНастройкаСезонностиУслуг.Услуга,
	|	энргНастройкаСезонностиУслуг.НеПрименятьСезонность,
	|	энргНастройкаСезонностиУслуг.КорректироватьГодовойОбъем,
	|	1
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|				И МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)) КАК энргНастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиКорректироватьГодовойОбъем
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиКорректироватьГодовойОбъемНабор.МКД КАК МКД,
	|		УслугиКорректироватьГодовойОбъемНабор.Услуга КАК Услуга,
	|		МИНИМУМ(УслугиКорректироватьГодовойОбъемНабор.Приоритет) КАК Приоритет
	|	ИЗ
	|		УслугиКорректироватьГодовойОбъемНабор КАК УслугиКорректироватьГодовойОбъемНабор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УслугиКорректироватьГодовойОбъемНабор.МКД,
	|		УслугиКорректироватьГодовойОбъемНабор.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъемНабор КАК УслугиКорректироватьГодовойОбъемНабор
	|		ПО ВложенныйЗапрос.МКД = УслугиКорректироватьГодовойОбъемНабор.МКД
	|			И ВложенныйЗапрос.Услуга = УслугиКорректироватьГодовойОбъемНабор.Услуга
	|			И ВложенныйЗапрос.Приоритет = УслугиКорректироватьГодовойОбъемНабор.Приоритет
	|ГДЕ
	|	УслугиКорректироватьГодовойОбъемНабор.НеПрименятьСезонность
	|	И УслугиКорректироватьГодовойОбъемНабор.КорректироватьГодовойОбъем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.МКД КАК МКД,
	|	энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	ИСТИНА КАК КорректировкаТекущегоПериода
	|ПОМЕСТИТЬ ТочкиДляКорректировкиТекущийПериод
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъем КАК УслугиКорректироватьГодовойОбъем
	|		ПО энргСтабильныеПериоды.МКД = УслугиКорректироватьГодовойОбъем.МКД
	|			И энргСтабильныеПериоды.Услуга = УслугиКорректироватьГодовойОбъем.Услуга
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (энргСтабильныеПериоды.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.МКД,
	|	энргСтабильныеПериоды.ТочкаУчета,
	|	энргСтабильныеПериоды.Услуга
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргСтабильныеПериоды.УслугаПодключена) > 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Услуга,
	|	ЛОЖЬ
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериоды.МКД КАК МКД,
	|		энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|		энргСтабильныеПериоды.Услуга КАК Услуга
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъемНабор КАК УслугиКорректироватьГодовойОбъемНабор
	|			ПО энргСтабильныеПериоды.Услуга = УслугиКорректироватьГодовойОбъемНабор.Услуга
	|				И энргСтабильныеПериоды.МКД = УслугиКорректироватьГодовойОбъемНабор.МКД
	|	ГДЕ
	|		&ВыполнятьГодовуюКорректировку
	|		И энргСтабильныеПериоды.Организация = &Организация
	|		И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|		И энргСтабильныеПериоды.Район = &Район
	|		И энргСтабильныеПериоды.МКД = &МКД
	|		И энргСтабильныеПериоды.НомерПозиции = 0
	|		И УслугиКорректироватьГодовойОбъемНабор.МКД ЕСТЬ NULL) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъем КАК УслугиКорректироватьГодовойОбъем
	|		ПО ВложенныйЗапрос.Услуга = УслугиКорректироватьГодовойОбъем.Услуга
	|			И (УслугиКорректироватьГодовойОбъем.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.МКД,
	|	энргСтабильныеПериоды.ТочкаУчета,
	|	энргСтабильныеПериоды.Услуга,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъем КАК УслугиКорректироватьГодовойОбъем
	|		ПО (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД))
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (энргСтабильныеПериоды.МКД = &МКД)
	|			И (энргСтабильныеПериоды.НомерПозиции = 0)
	|			И (энргСтабильныеПериоды.УслугаПодключена)
	|			И (энргСтабильныеПериоды.МКДОткрыт)
	|			И энргСтабильныеПериоды.МКД = УслугиКорректироватьГодовойОбъем.МКД
	|			И энргСтабильныеПериоды.Услуга = УслугиКорректироватьГодовойОбъем.Услуга
	|			И (&ВыполнятьГодовуюКорректировку)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ОбъемУслугиПотребленный - ВложенныйЗапрос.ОбъемУслуги КАК ОбъемКорректировки,
	|	ВложенныйЗапрос.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	&ЗавершениеОП КАК ЗавершениеОП
	|ПОМЕСТИТЬ КорректируемыеОбъемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргОбъемНачисленийОбороты.МКД КАК МКД,
	|		энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|		энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|		энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|		СУММА(энргОбъемНачисленийОбороты.ОбъемУслугиОборот) КАК ОбъемУслуги,
	|		СУММА(энргОбъемНачисленийОбороты.ОбъемУслугиПотребленныйОборот) КАК ОбъемУслугиПотребленный
	|	ИЗ
	|		РегистрНакопления.энргОбъемНачисленийМКД.Обороты(
	|				&ПериодНачисления,
	|				КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ),
	|				Месяц,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &МКД) КАК энргОбъемНачисленийОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиДляКорректировкиТекущийПериод КАК ТочкиДляКорректировки
	|			ПО энргОбъемНачисленийОбороты.МКД = ТочкиДляКорректировки.МКД
	|				И энргОбъемНачисленийОбороты.ТочкаУчета = ТочкиДляКорректировки.ТочкаУчета
	|				И энргОбъемНачисленийОбороты.Услуга = ТочкиДляКорректировки.Услуга
	|				И (ТочкиДляКорректировки.КорректировкаТекущегоПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргОбъемНачисленийОбороты.МКД,
	|		энргОбъемНачисленийОбороты.Услуга,
	|		энргОбъемНачисленийОбороты.ТочкаУчета,
	|		энргОбъемНачисленийОбороты.Поставщик
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргОбъемНачисленийОбороты.МКД,
	|		энргОбъемНачисленийОбороты.Услуга,
	|		энргОбъемНачисленийОбороты.ТочкаУчета,
	|		энргОбъемНачисленийОбороты.Поставщик,
	|		СУММА(энргОбъемНачисленийОбороты.ОбъемУслугиОборот),
	|		СУММА(энргОбъемНачисленийОбороты.ОбъемУслугиПотребленныйОборот)
	|	ИЗ
	|		РегистрНакопления.энргОбъемНачисленийМКД.Обороты(
	|				НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД), СЕКУНДА, -1), ГОД),
	|				КОНЕЦПЕРИОДА(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД), СЕКУНДА, -1), ГОД), ГОД),
	|				Год,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &МКД
	|					И &ВыполнятьГодовуюКорректировку) КАК энргОбъемНачисленийОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиДляКорректировкиТекущийПериод КАК ТочкиДляКорректировки
	|			ПО энргОбъемНачисленийОбороты.МКД = ТочкиДляКорректировки.МКД
	|				И энргОбъемНачисленийОбороты.ТочкаУчета = ТочкиДляКорректировки.ТочкаУчета
	|				И энргОбъемНачисленийОбороты.Услуга = ТочкиДляКорректировки.Услуга
	|				И (НЕ ТочкиДляКорректировки.КорректировкаТекущегоПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргОбъемНачисленийОбороты.МКД,
	|		энргОбъемНачисленийОбороты.Услуга,
	|		энргОбъемНачисленийОбороты.ТочкаУчета,
	|		энргОбъемНачисленийОбороты.Поставщик) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргДокументыНачислений.Организация,
	|	энргДокументыНачислений.Район,
	|	энргДокументыНачислений.ПериодНачисления,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	энргДокументыНачислений.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|ГДЕ
	|	энргДокументыНачислений.Организация = &Организация
	|	И энргДокументыНачислений.ПериодНачисления = &ПериодНачисления
	|	И энргДокументыНачислений.Район = &Район
	|	И энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.КорректировкаПотребленияСезонныхУслугМКД)
	|	И энргДокументыНачислений.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляКорректировкаПотребленияСезонныхУслугМКД()
	
	Текст  = 
	"ВЫБРАТЬ
	|	КорректируемыеОбъемы.Организация КАК Организация,
	|	КорректируемыеОбъемы.ПериодНачисления КАК ПериодНачисления,
	|	КорректируемыеОбъемы.Район КАК Район,
	|	КорректируемыеОбъемы.МКД КАК МКД,
	|	КорректируемыеОбъемы.Услуга КАК Услуга,
	|	КорректируемыеОбъемы.ТочкаУчета КАК ТочкаУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет) КАК ВидНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг) КАК СпособНачисления,
	|	КорректируемыеОбъемы.Поставщик КАК Поставщик,
	|	КорректируемыеОбъемы.ОбъемКорректировки КАК ОбъемУслуги,
	|	ЕСТЬNULL(ДокументыНачислений.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргПерерасчет.ПустаяСсылка)) КАК ДокументНачисления,
	|	ЕСТЬNULL(ДокументыНачислений.ПометкаУдаления, ЛОЖЬ) КАК ДокументНачисленияПометкаУдаления,
	|	КорректируемыеОбъемы.ЗавершениеОП КАК ЗавершениеОП
	|ИЗ
	|	КорректируемыеОбъемы КАК КорректируемыеОбъемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО КорректируемыеОбъемы.Организация = ДокументыНачислений.Организация
	|			И КорректируемыеОбъемы.Район = ДокументыНачислений.Район
	|			И КорректируемыеОбъемы.ПериодНачисления = ДокументыНачислений.ПериодНачисления";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область НачислениеНаОДН_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаНачисленияНаОДН(Организация,ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде) 	
	МВТ  = Новый МенеджерВременныхТаблиц;
	ВспомогательныеДанныеНачисленияМКД(МВТ,Организация, ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде);
	ПолучитьСтабильныеПериодыМКД(МВТ);
	ПолучитьДанныеДляРасчетаМКД(МВТ,"энргНачислениеМКД");
	Возврат РассчитатьОбъемПотребленияМКД(МВТ);
КонецФункции

Процедура ВспомогательныеДанныеНачисленияМКД(МВТ,Организация,ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде)
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст  							= ТекстЗапросаВспомогательныеДанныеНачисленияМКД(МКД<>Неопределено);	
	Если МКД = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД","");		
		Текст 						= СтрЗаменить(Текст,"И энргПредоставленныеПоказанияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргВыводПриборовУчетаМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"МКД = &МКД","ИСТИНА");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли; 	
	
	Запрос.УстановитьПараметр("НачалоВеденияУчета",		Константы.энргДатаНачалаВеденияУчета.Получить());	 // Дата
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("Организация",			Организация);	 // Дата
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 // Дата
	Запрос.УстановитьПараметр("Район",					Район);	 // Районы
	Запрос.УстановитьПараметр("ДнейВПериоде",			ДнейВПериоде );
	Запрос.Текст 					= Текст;
	Запрос.Выполнить();
КонецПроцедуры

Процедура ПолучитьСтабильныеПериодыМКД(МВТ)
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст  							= ТекстЗапросаПолучитьСтабильныеПериодыМКД();	
	Запрос.Текст 					= Текст;
	Запрос.Выполнить();
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчетаМКД(МВТ,ИмяДокумента)
	Текст 							= ТекстЗапросаПолучитьДанныеДляРасчетаМКД(ИмяДокумента);
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= Текст;
	Запрос.Выполнить(); 	
КонецПроцедуры

Процедура ДобавитьСтрокиНачисленияМКДПоФормуле(ПериодНачисления, Организация, Район, МКД, ТочкаУчета, КонецПериодаРасчета, ОписаниеУслуг, НормативыПоУслугам, Набор)
	
 	ТипыРасходов 									= энргНачисления.ТипыРасходовВФормулахРасчета();
	ТипРасходаПоШкале  								= ТипыРасходов["РасходИзмерителяПоШкале"];	
	ТипРасходаНорматив 								= ТипыРасходов["ЗначениеНормативаПоУслуге"];
	
	Для Каждого СтрокаФормулы Из ОписаниеУслуг Цикл			
		ТекФормулаОбъемУслуги	 					= СтрокаФормулы.ФормулаРасчета;
		
		Если Не ЗначениеЗаполнено(ТекФормулаОбъемУслуги) Тогда
			Продолжить;
		КонецЕсли;
		ТекФормулаОбъемУслугиПотребленный			= СтрокаФормулы.ФормулаРасчета;
		ПараметрыФормулы 							= СтрокаФормулы.ПараметрыФормулы;
		Для Каждого КлючЗначениеЧастьУзла Из ПараметрыФормулы Цикл
			Шкалы 									= КлючЗначениеЧастьУзла.Значение;
			КлючЧастьУзлаПриборУчета 				= XMLСтрока(КлючЗначениеЧастьУзла.Ключ); 
			Для Каждого КлючЗначениеШкала Из Шкалы Цикл
				КлючШкалы 							= XMLСтрока(КлючЗначениеШкала.Ключ);
				ОписаниеОбъема 						= КлючЗначениеШкала.Значение;
				Ключ 								= Новый Структура("ТипРасхода, ПриборУчета, Шкала", ТипРасходаПоШкале, КлючЧастьУзлаПриборУчета,КлючШкалы); 
				ТекФормулаОбъемУслуги 				= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОписаниеОбъема.ОбъемУслуги);
				ТекФормулаОбъемУслугиПотребленный 	= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ОписаниеОбъема.ОбъемУслугиПотребленный);
			КонецЦикла; 			
		КонецЦикла;
		
		Для Каждого ПараметрФормулы Из НормативыПоУслугам Цикл			
			Ключ 									= Новый Структура("ТипРасхода, Услуга", ТипРасходаНорматив, XMLСтрока(ПараметрФормулы.Ключ));			
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ЗначениеВСтрокуВнутр(Ключ) + "]",ПараметрФормулы.Значение);
		КонецЦикла;
		
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги," ","");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,Символы.НПП,"");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,",",".");
		РезультатПоФормуламОбъемУслуги				= 0;
		ТекФормулаОбъемУслуги 						= СтрЗаменить(ТекФормулаОбъемУслуги,"[Результат]=","РезультатПоФормуламОбъемУслуги=");
		Выполнить ТекФормулаОбъемУслуги;
		
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный," ","");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,Символы.НПП,"");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,",",".");
		РезультатПоФормуламОбъемУслугиПотребленный	= 0;
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[Результат]=","РезультатПоФормуламОбъемУслугиПотребленный=");
		Выполнить ТекФормулаОбъемУслугиПотребленный;
		
		Если РезультатПоФормуламОбъемУслуги = 0 И РезультатПоФормуламОбъемУслугиПотребленный = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНабора 								= Набор.добавить();
		СтрокаНабора.Период 						= КонецПериодаРасчета-1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.Район 							= Район;
		СтрокаНабора.МКД 							= МКД;
		СтрокаНабора.Услуга 						= СтрокаФормулы.Услуга;
		СтрокаНабора.ТочкаУчета 					= ТочкаУчета;
		СтрокаНабора.ВидНачисления 					= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.СпособНачисления 				= СтрокаФормулы.СпособНачисления;
		СтрокаНабора.ПриборУчета 					= СтрокаФормулы.УзелПриборУчета;
		СтрокаНабора.ТарифнаяЗона 					= Справочники.энргТарифныеЗоны.ПустаяСсылка();
		СтрокаНабора.Поставщик 						= СтрокаФормулы.Поставщик;
		СтрокаНабора.ПериодРасчета 					= ПериодНачисления;
		СтрокаНабора.ПериодНачисления 				= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги 					= РезультатПоФормуламОбъемУслуги;		
		СтрокаНабора.ОбъемУслугиПотребленный 		= РезультатПоФормуламОбъемУслугиПотребленный;		
		СтрокаНабора.НачалоПериода 					= СтрокаФормулы.НачалоПериода;
		СтрокаНабора.КонецПериода 					= СтрокаФормулы.КонецПериода;			
		СтрокаНабора.НеПрименятьСезонность			= СтрокаФормулы.НеПрименятьСезонность;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьРезультатЗапросаНачисленийМКД(РезультатЗапроса, ГраницыПериода, МКД, Набор)
	перем ДокументОбъект, НаборВыполненные, ТекМКД, ТекУслуга, ТекШкала;
		
	Выборка  														= РезультатЗапроса.выбрать();
			
	ТекТочкаУчета													= Неопределено;
	ТекПриборУчета													= Неопределено;
	ТекНачалоПериода												= Неопределено;
	ТекКонецПериода 												= Неопределено;
	ТекФормулаРасчета												= Неопределено;
	ТекПоставщик  													= Неопределено;
	СпособРасчетаПоПрибору 											= Перечисления.энргСпособНачислений.ПоПриборам;
	СпособРасчетаПоСреднему											= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	КлючТепловаяСоставляющая 										= энргРаботаСФормуламиРасчетаСервер.ТепловаяСоставляющаяКлюч();
	БезРазбивки														= Справочники.энргТарифныеЗоны.БезРазбивки;
	ФормулыРасчет 													= Неопределено;
	ПараметрыФормулы 												= Неопределено;
	ТекСпособНачисленияПоФормуле 									= Неопределено;
	НачисляемПоФормуле 												= Ложь;	
	СпособРасчетаПоФормуле 											= Неопределено;	
	НормативыПоУслугам 												= Неопределено;
	СтрокаОписанияФормулы 											= Неопределено;
	МассивФормулРасчета												= Неопределено;	
	КлючСтруктурыФормулы 											= "
	|Услуга, ФормулаРасчета, Поставщик,
	|СпособНачисления, УзелПриборУчета, НеПрименятьСезонность,
	|НачалоПериода, КонецПериода, ОбъемЗаПрошлыйГод";
			
	НачисленияПоУслугамТочки 										= Неопределено;
		
	Ошибки 															= "";
	Если Выборка.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	НачатьТранзакцию();

	ЧитатьНаборыЗаписейДокументаНачисленияМКД 						= Набор = Неопределено;
	
	Пока Выборка.следующий() цикл
		
		Если ТекМКД = Неопределено И ЧитатьНаборыЗаписейДокументаНачисленияМКД Тогда
			ПрочитатьНаборыЗаписейДокументаНачисленияМКД(Выборка, МКД, ДокументОбъект, НаборВыполненные, Набор, Перечисления.энргВидыОперацийНачисления.РасчетМКД);
		КонецЕсли;
	
		Если Не ТекМКД = Выборка.МКД Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ Не ТекНачалоПериода = Выборка.НачалоПериода Тогда
			
			Если НЕ ТекМКД = Неопределено Тогда
				СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
				МассивФормулРасчета.Добавить(СтрокаОписанияФормулы); 				
				
				ДобавитьСтрокиНачисленияМКДПоФормуле(Выборка.ПериодНачисления, Выборка.Организация, Выборка.Район, ТекМКД, ТекТочкаУчета, Выборка.ЗавершениеОП-1, МассивФормулРасчета, НормативыПоУслугам, Набор);
			КонецЕсли;
			
			МассивФормулРасчета 									= Новый Массив;
			СтрокаОписанияФормулы 									= Новый Структура(КлючСтруктурыФормулы);
			СтрокаОписанияФормулы.Услуга 							= Выборка.Услуга;
			СтрокаОписанияФормулы.ФормулаРасчета 					= Выборка.ФормулаРасчета;
			СтрокаОписанияФормулы.Поставщик 						= Выборка.Поставщик;
			СтрокаОписанияФормулы.СпособНачисления 					= Выборка.СпособНачисления;
			СтрокаОписанияФормулы.УзелПриборУчета 					= Выборка.УзелПриборУчета;
			СтрокаОписанияФормулы.НеПрименятьСезонность 			= Выборка.НеПрименятьСезонность;
			СтрокаОписанияФормулы.НачалоПериода 					= Выборка.НачалоПериода;
			СтрокаОписанияФормулы.КонецПериода 						= Выборка.КонецПериода;
			СтрокаОписанияФормулы.ОбъемЗаПрошлыйГод 				= Выборка.ОбъемЗаПрошлыйГод;
							
			ПараметрыФормулы 										= Новый Соответствие;
			НачисленияПоУслугамТочки 								= Новый Соответствие;
			НачисленияПоШкале 										= Новый Соответствие;
			
			НормативыПоУслугам  									= Новый Соответствие;
			НормативыПоУслугам.Вставить(Выборка.Услуга, 	Выборка.НормаПотребления);			
			
			УдалитьСтрокиПоСреднемуПоНормативу					= Новый Соответствие;
		ИначеЕсли НЕ ТекУслуга = Выборка.Услуга Тогда
			СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
			МассивФормулРасчета.Добавить(СтрокаОписанияФормулы);
			НачисленияПоУслугамТочки.Вставить(ТекУслуга, НачисленияПоШкале);
			
			ПараметрыФормулы 										= Новый Соответствие;
			НачисленияПоШкале 										= Новый Соответствие;
			
			СтрокаОписанияФормулы 									= Новый Структура(КлючСтруктурыФормулы);
			СтрокаОписанияФормулы.Услуга 							= Выборка.Услуга;
			СтрокаОписанияФормулы.ФормулаРасчета 					= Выборка.ФормулаРасчета;
			СтрокаОписанияФормулы.Поставщик 						= Выборка.Поставщик;
			СтрокаОписанияФормулы.СпособНачисления 					= Выборка.СпособНачисления;
			СтрокаОписанияФормулы.УзелПриборУчета 					= Выборка.УзелПриборУчета;
			СтрокаОписанияФормулы.НеПрименятьСезонность 			= Выборка.НеПрименятьСезонность;
			СтрокаОписанияФормулы.НачалоПериода 					= Выборка.НачалоПериода;
			СтрокаОписанияФормулы.КонецПериода 						= Выборка.КонецПериода;
			СтрокаОписанияФормулы.ОбъемЗаПрошлыйГод 				= Выборка.ОбъемЗаПрошлыйГод;
					
			НормативыПоУслугам.Вставить(Выборка.Услуга, 		Выборка.НормаПотребления);			
		ИначеЕсли НЕ ТекШкала = Выборка.Шкала Тогда
			НачисленияПоШкале 										= Новый Соответствие;
		КонецЕсли; 
		
		//перенос с отэка
		Если НЕ ЗначениеЗаполнено(Выборка.ФормулаРасчета) Тогда
			Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.СреднееПоНормативу Тогда
				Если УдалитьСтрокиПоСреднемуПоНормативу[Выборка.Услуга] = Неопределено или УдалитьСтрокиПоСреднемуПоНормативу[Выборка.Услуга][Выборка.УзелПриборУчета] = Неопределено Тогда
					
					СтрокаНабора 											= Набор.добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
					СтрокаНабора.ПриборУчета								= Выборка.УзелПриборУчета;
					СтрокаНабора.Период 									= Выборка.ЗавершениеОП-1;
					СтрокаНабора.ВидНачисления 								= Перечисления.энргВидыНачислений.Начисление;
					СтрокаНабора.ТарифнаяЗона								= БезРазбивки;
					
					Если ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и НЕ Выборка.ПривязанаКШкале и НЕ Выборка.РасчетПоФормуле Тогда
						ОбъемУслуги 										= 0;
						ОбъемУслугиПотребленный 							= 0;
						Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
							Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
								ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
								ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
								ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
							КонецЕсли;
						КонецЕсли;
						СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги;
						СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный;
					КонецЕсли;
					
					Если УдалитьСтрокиПоСреднемуПоНормативу[Выборка.Услуга] <> Неопределено Тогда
						УдалитьСтрокиПоСреднемуПоНормативу[Выборка.Услуга].Вставить(Выборка.УзелПриборУчета,Истина);
					Иначе
						СоотвествиеПрибора = Новый Соответствие;
						СоотвествиеПрибора.Вставить(Выборка.УзелПриборУчета,Истина);
						УдалитьСтрокиПоСреднемуПоНормативу.Вставить(Выборка.Услуга,СоотвествиеПрибора);
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтрокаНабора 											= Набор.добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
				СтрокаНабора.Период 									= Выборка.ЗавершениеОП-1;
				СтрокаНабора.ВидНачисления 								= Перечисления.энргВидыНачислений.Начисление;
				
				Если ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и НЕ Выборка.ПривязанаКШкале и НЕ Выборка.РасчетПоФормуле Тогда
					ОбъемУслуги 										= 0;
					ОбъемУслугиПотребленный 							= 0;
					Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
						Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
							ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
							ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
							ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
						КонецЕсли;
					КонецЕсли;
					СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги;
					СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//отэк
		 		
		
		КлючЧастиУзла 												= Выборка.ЧастьУзлаПриборУчета.УникальныйИдентификатор();
		КлючШкалы 													= Выборка.Шкала.УникальныйИдентификатор();
		Если ПараметрыФормулы[КлючЧастиУзла] = Неопределено Тогда
			СоотвествиеШкалы 										= Новый Соответствие;
			СоотвествиеШкалы.Вставить(КлючШкалы, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
			ПараметрыФормулы.Вставить(КлючЧастиУзла, СоотвествиеШкалы);
		ИначеЕсли ПараметрыФормулы[КлючЧастиУзла][КлючШкалы] = Неопределено Тогда
			ПараметрыФормулы[КлючЧастиУзла].Вставить(КлючШкалы, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
		Иначе
			ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслуги 				= ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслуги + Выборка.ОбъемУслуги;
			ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслугиПотребленный 	= ПараметрыФормулы[КлючЧастиУзла][КлючШкалы].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
		КонецЕсли; 		
		
		Если НЕ НачисленияПоШкале[Выборка.Шкала] = Неопределено Тогда
			НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги 			 = НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги + Выборка.ОбъемУслуги;
			НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный = НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
		Иначе
			НачисленияПоШкале.Вставить(Выборка.Шкала, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
		КонецЕсли;
		
		//закрытая схема
		Если Выборка.ЗакрытаяСхемаГВС Тогда
			СтрокаНабора.ОбъемУслуги = 0;
		КонецЕсли;		 		
		
		ТекМКД 														= Выборка.МКД;
		ТекУслуга 													= Выборка.Услуга;
		ТекНачалоПериода											= Выборка.НачалоПериода;
		ТекКонецПериода												= Выборка.КонецПериода;
		ТекТочкаУчета 												= Выборка.ТочкаУчета;
		ТекШкала 													= Выборка.Шкала;
	КонецЦикла;	
	
	Если Не МассивФормулРасчета = Неопределено Тогда
		СтрокаОписанияФормулы.Вставить("ПараметрыФормулы", ПараметрыФормулы);
		МассивФормулРасчета.Добавить(СтрокаОписанияФормулы);		
		ДобавитьСтрокиНачисленияМКДПоФормуле(Выборка.ПериодНачисления, Выборка.Организация, Выборка.Район, ТекМКД, ТекТочкаУчета, Выборка.ЗавершениеОП-1, МассивФормулРасчета, НормативыПоУслугам, Набор);
	КонецЕсли;
	
	Если ЧитатьНаборыЗаписейДокументаНачисленияМКД Тогда
		ЗаписатьНаборыЗаписейНачислениеМКД(ДокументОбъект, Набор, НаборВыполненные, Ошибки) ;     
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьНаборыЗаписейДокументаНачисленияМКД(Выборка,МКД,ДокументОбъект,НаборВыполненные,Набор, ВидОперацийНачисления)
	
	ДокументСсылка											= Выборка.ДокументНачисления;
	ПометкаУдаления 										= Выборка.ДокументНачисленияПометкаУдаления;
	
	ДокументОбъект 											= Неопределено;
	НаборВыполненные 										= Неопределено;
	Набор 													= Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда				
		Если ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.РасчетМКД Тогда																							   
			ДокументСсылка 									= Документы.энргНачислениеМКД.ПолучитьСсылку(Новый УникальныйИдентификатор());
			ДокументОбъект  								= Документы.энргНачислениеМКД.СоздатьДокумент();																					 
		ИначеЕсли ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.КорректировкаПотребленияСезонныхУслугМКД Тогда
			ДокументСсылка 									= Документы.энргПерерасчетМКД.ПолучитьСсылку(Новый УникальныйИдентификатор());															  
			ДокументОбъект  								= Документы.энргПерерасчетМКД.СоздатьДокумент();																										  
			ДокументОбъект.ВидОперации 						= Перечисления.энргВидыОпераций.энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг;
		Иначе
			ВызватьИсключение "Не указан вид операций начисления";																						 
		КонецЕсли;
		
		ДокументОбъект.район  								= Выборка.Район;
		ДокументОбъект.Дата									= Выборка.ЗавершениеОП-1;
		ДокументОбъект.Организация 							= Выборка.Организация;
		ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
		
		НаборВыполненные 									= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненныеДопСвойства 						= НаборВыполненные.ДополнительныеСвойства;
		НаборВыполненныеДопСвойства.Вставить("Замещать", Ложь);
		ЗаписьВыполненные									= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 						= Выборка.Организация;
		ЗаписьВыполненные.ПериодНачисления 					= Выборка.ПериодНачисления;
		ЗаписьВыполненные.Район			 					= Выборка.Район;
		ЗаписьВыполненные.ВидОперацийНачисления 			= ВидОперацийНачисления;
		ЗаписьВыполненные.МКД 								= Справочники.энргСтроения.ПустаяСсылка();
		ЗаписьВыполненные.ДокументНачисления 				= ДокументСсылка;							
	ИначеЕсли ПометкаУдаления Тогда
		ДокументОбъект										= ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления 						= Ложь;
		
		НаборВыполненные 									= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненныеДопСвойства 						= НаборВыполненные.ДополнительныеСвойства;
		НаборВыполненныеДопСвойства.Вставить("Замещать", Истина);
		
		НаборВыполненные.Отбор.Организация.Установить(Выборка.Организация);
		НаборВыполненные.Отбор.ПериодНачисления.Установить(Выборка.ПериодНачисления);
		НаборВыполненные.Отбор.Район.Установить(Выборка.Район);
		НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(ВидОперацийНачисления);
		НаборВыполненные.Отбор.МКД.Установить(Справочники.энргСтроения.ПустаяСсылка());  					  
		
		ЗаписьВыполненные									= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 						= Выборка.Организация;
		ЗаписьВыполненные.ПериодНачисления 					= Выборка.ПериодНачисления;
		ЗаписьВыполненные.Район			 					= Выборка.Район;
		ЗаписьВыполненные.ВидОперацийНачисления 			= ВидОперацийНачисления;
		ЗаписьВыполненные.МКД 								= Справочники.энргСтроения.ПустаяСсылка();
		ЗаписьВыполненные.ДокументНачисления 				= ДокументСсылка;
		ЗаписьВыполненные.ПометкаУдаления	 				= Ложь;				
	КонецЕсли;
	
	Набор 													= РегистрыНакопления.энргОбъемНачисленийМКД.СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("Организация",		Выборка.Организация);
	Набор.ДополнительныеСвойства.Вставить("Район",				Выборка.Район);
	Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	Выборка.ПериодНачисления);
	Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	Выборка.ЗавершениеОП-1);
	Набор.Отбор.Регистратор.Установить(ДокументСсылка);
	
	ОчищатьНабор 											= Ложь;
	
	Если НЕ МКД = Неопределено Тогда
		ОчищатьНабор 										= Истина;
		Набор.ДополнительныеСвойства.Вставить("МКД",	МКД);		
		Набор.Прочитать();
		СтрокиУдалить 										= Новый Массив;
		Для Каждого СтрокаНабора ИЗ Набор Цикл
			Если НЕ СтрокаНабора.МКД = МКД Тогда
				Продолжить;
			КонецЕсли;				
			СтрокиУдалить.Добавить(СтрокаНабора);
		КонецЦикла;
		
		Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
			Набор.Удалить(СтрокиУдалить[Сч]);
		КонецЦикла;			
	КонецЕсли;	
	
	Если ДокументОбъект = Неопределено Тогда
		Набор.ДополнительныеСвойства.Вставить("ЭтоОчистка",Истина);
		Набор.Записать();
		Набор.ДополнительныеСвойства.Удалить("ЭтоОчистка");
		Если ОчищатьНабор Тогда
			Набор.Очистить();
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

Функция РассчитатьОбъемПотребленияМКД(МВТ); 
	Текст 							= ТекстЗапросаРассчитатьОбъемПотребленияМКД();
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= Текст;
	Возврат Запрос.Выполнить();	
КонецФункции

#КонецОбласти

#Область ДанныеПерерасчетаМКД_ВпомогательныеФункции

Процедура ПрочитатьСтабильныеПериодыПерерасчетМКД(МВТ,Организация,Район,МКД,ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета)
	
	ТекстГраницОтчетногоПериода = энргНачисления.ТекстГраницОтчетногоПериода(ПериодНачисленияНачало,ПериодНачисленияКонец,Ложь);
	
	Объекты  					= Новый Структура;
	
	Объекты.Вставить("энргАктивностьТочекУчетаМКД",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
	
	Объекты.Вставить("энргВидБлагоустройствМКД",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
	
	Объекты.Вставить("энргВидыДифференцированностиПриборовУчетаМКД", Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
	
	Объекты.Вставить("энргЗначениеПлощадейМКД", 					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
	
	Объекты.Вставить("энргПриборыТочекМКД", 						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
	
	Объекты.Вставить("энргПоставщикиУслугМКД", 						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
		
	Объекты.Вставить("энргПриборыУзловУчетаМКД", 					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
	
	Объекты.Вставить("энргСостояниеМКД",							Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));
	
	//Объекты.Вставить("энргСпособРаспределенияОбъемаМКДНаАбонентов",	Новый Структура("
	//|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО,Новый Структура));  	
	
	//Объекты.Вставить("энргТипПринадлежностиМКД",					Новый Структура("
	//|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО ,Новый Структура));
	
	//Объекты.Вставить("энргТипСхемыГВС",								Новый Структура("
	//|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО ,Новый Структура));
		
	Объекты.Вставить("энргСостояниеПриборовМКД",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО ,Новый Структура));
	
	Объекты.Вставить("энргСостояниеПриборовУзловУчетаМКД",			Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО ,Новый Структура));
	
	Объекты.Вставить("энргУслугиТочекУчетаМКД",						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО ,Новый Структура));
	
	Объекты.Вставить("энргФормулыРасчетаУслугМКД",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки, СинонимыПолей", "МКД = (&МКД)", "ТаблицаРС.МКД = (&МКД)", НЕОПРЕДЕЛЕНО ,Новый Структура));
		
	
	ИтоговыйТекст  				= 
	"ВЫБРАТЬ * 
	|ПОМЕСТИТЬ ГраницыОтчетногоПериода
	|ИЗ 
	|	(" + ТекстГраницОтчетногоПериода + ") КАК ВложенныйЗапрос
	|;
	|///////////
	|";
		
	ШаблонНаборПериодов 		= 
	"ВЫБРАТЬ
	|	вТаблица.Регистратор КАК ДокРегистратор,
	|	вТаблица.Период КАК Период, 	
	|	ВЫБОР 
	|		КОГДА вТаблица.ПериодРегистрации > вТаблица.Период
	|			ТОГДА  вТаблица.Период
	|		ИНАЧЕ вТаблица.ПериодРегистрации
	|	КОНЕЦ  КАК ПериодРегистрации,
	|	вТаблица.МКД КАК МКД,
	|	вТаблица.ТочкаУчета КАК ТочкаУчета
	|ИЗ 
	|	Набор%%ИмяТаблицы%%  КАК вТаблица";
	
			
	ШаблонГраницыРС				= 
	"ВЫБРАТЬ
	|	%%СтрокаресурсыИзмеренияГраницы%%
	|   , ТаблицаРС.Регистратор КАК ДокРегистратор
	|   , ТаблицаРС.Период КАК ПериодС
	|	, МИНИМУМ(ЕСТЬNULL(ТаблицаКонец.Период,ДОБАВИТЬКДАТЕ(&КонецПериода,СЕКУНДА,1))) КАК ПериодПо
	|ПОМЕСТИТЬ Набор%%ИмяТаблицы%%Границы
	|ИЗ
	|	Набор%%ИмяТаблицы%% КАК ТаблицаРС
	|		ЛЕВОЕ СОЕДИНЕНИЕ НАбор%%ИмяТаблицы%% КАК ТаблицаКонец
	|		ПО %%СтрокаСоединенения%%
	|		И (ВЫБОР
	|			КОГДА ТаблицаРС.Период < ТаблицаКонец.Период
	|				ТОГДА ИСТИНА
	|			КОГДА ТаблицаРС.Период = ТаблицаКонец.Период
	|					И ТаблицаРС.ПериодРегистрации < ТаблицаКонец.ПериодРегистрации
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаРС.Период = ТаблицаКонец.Период
	|					И ТаблицаРС.ПериодРегистрации = ТаблицаКонец.ПериодРегистрации
	|					И ТаблицаРС.Регистратор < ТаблицаКонец.Регистратор
	|		КОНЕЦ)	
	|СГРУППИРОВАТЬ ПО
	|   %%СтрокаресурсыИзмеренияГраницы%%
	|	,ТаблицаРС.Регистратор
	|	,ТаблицаРС.Период";
	
	ШаблонЗаписиЗаПериод  		=
	"ВЫБРАТЬ
	|	%%СтрокаресурсыИзмерения%%
	|	,&НачалоПериода КАК Период
	|	,ВЫБОР КОГДА ТаблицаРС.ПериодРегистрации < &НачалоПериода Тогда ЗНАЧЕНИЕ(Документ.энргНачисление.ПустаяСсылка) ИНАЧЕ ТаблицаРС.Регистратор КОНЕЦ КАК Регистратор
	|	,ВЫБОР КОГДА ТаблицаРС.ПериодРегистрации < &НачалоПериода Тогда &НачалоПериода ИНАЧЕ ТаблицаРС.ПериодРегистрации КОНЕЦ КАК ПериодРегистрации
	|ПОМЕСТИТЬ Набор%%ИмяТаблицы%%
	|ИЗ
	|	РегистрСведений.%%ИмяТаблицы%%.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1),
	|			Организация = &Организация
	|				И Район = &Район
	|				И %%ДополнительноеУсловие%%) КАК ТаблицаРС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	%%СтрокаресурсыИзмерения%%
	|	,КОНЕЦПЕРИОДА(ТаблицаРС.Период,ДЕНЬ) КАК Период 
	|	,ТаблицаРС.Регистратор
	|	,ТаблицаРС.ПериодРегистрации
	|ИЗ
	|	РегистрСведений.%%ИмяТаблицы%% КАК ТаблицаРС
	|ГДЕ
	|	ТаблицаРС.Период >= &НачалоПериода
	|	И ТаблицаРС.Период < &КонецПериода
	|	И ТаблицаРС.Организация = &Организация
	|	И ТаблицаРС.Район = &Район
	|	И %%ДополнительноеУсловиеТаблица%%";
	
	ГлавСчетчик									= 0;
	ТекстНаборПериодов 							= "";
	
	для Каждого объект из Объекты цикл
		
		СтрокаСоединения  						= "";
		Метад 									= Метаданные.РегистрыСведений[объект.Ключ]; 
		Измерения  								= Метад.Измерения;
		Ресурсы 								= Метад.Ресурсы; 
		СинонимыПолей 							= объект.Значение.СинонимыПолей;
		ТексПериода 							= "";
		Сч 										= 0;
		ИзмеренияРесурсы  						= "";
		ИзмеренияРесурсыГруппировка				= "";
		ИзмеренияРесурсыГраницы					= "";
		
		СтрокаРесурсов 							= "";
		
		// Измерения		
		для Каждого Измерение из Измерения цикл
			Синоним 					= Измерение.Имя;
			Если СинонимыПолей.Свойство(Измерение.Имя) Тогда
				Синоним 				= СинонимыПолей[Измерение.Имя];
			КонецЕсли;
			
			ИзмеренияРесурсы			= ИзмеренияРесурсы 				+ ?(Сч > 0,Символы.ПС + ",","")  + " ТаблицаРС." +  Измерение.Имя +" КАК " + Синоним + "";
			ИзмеренияРесурсыГраницы		= ИзмеренияРесурсыГраницы 		+ ?(Сч > 0,Символы.ПС + ",","")  + " ТаблицаРС." +  Синоним;			
			ИзмеренияРесурсыГруппировка	= ИзмеренияРесурсыГруппировка 	+ ?(Сч > 0,Символы.ПС + ",","")  + " ТаблицаРС." +  Измерение.Имя;
			СтрокаСоединения 			= СтрокаСоединения 				+ ?(Сч > 0,Символы.ПС + "И ","")  + " %%ТаблицаИсточник%%." +  Синоним +" = %%ТаблицаПриемник%%." + Синоним; 
			Сч 							= Сч + 1;
		КонецЦикла;
		
		//  Ресурсы.
		для Каждого Ресурс из Ресурсы цикл
			Синоним 					= Ресурс.Имя;
			Если СинонимыПолей.Свойство(Ресурс.Имя) Тогда
				Синоним 				= СинонимыПолей[Ресурс.Имя];				
			КонецЕсли;
			ИзмеренияРесурсы			= ИзмеренияРесурсы 				+ Символы.ПС +?(Сч > 0,",","")  + " ТаблицаРС." +  Ресурс.Имя +" КАК " + Синоним + "" ;
			ИзмеренияРесурсыГраницы		= ИзмеренияРесурсыГраницы 		+ Символы.ПС +?(Сч > 0,",","")  + " ТаблицаРС." +  Синоним;
			ИзмеренияРесурсыГруппировка	= ИзмеренияРесурсыГруппировка 	+ Символы.ПС +?(Сч > 0,",","")  + " ТаблицаРС." +  Ресурс.Имя ;
			Сч 							= Сч + 1;
		КонецЦикла; 
		
		Если НЕ объект.Значение.СвойствоТочки = Неопределено Тогда
			ИзмеренияРесурсы			= ИзмеренияРесурсы 	+ Символы.ПС +?(Сч > 0,",","")  + " ТаблицаРС." +  объект.Значение.СвойствоТочки +"";
		КонецЕсли;		
		
		ТексПериода 					= СтрЗаменить(ШаблонЗаписиЗаПериод,	"%%СтрокаресурсыИзмерения%%", 				ИзмеренияРесурсы);
		ТексПериода 					= СтрЗаменить(ТексПериода,			"%%СтрокаресурсыИзмеренияГруппировка%%", 	ИзмеренияРесурсыГруппировка);
		ТексПериода 					= СтрЗаменить(ТексПериода,			"%%ДополнительноеУсловие%%", 				объект.Значение.Условие);
		ТексПериода 					= СтрЗаменить(ТексПериода,			"%%ДополнительноеУсловиеТаблица%%", 		объект.Значение.УсловиеТаблицы);
		ТексПериода 					= СтрЗаменить(ТексПериода,			"%%ИмяТаблицы%%", 							объект.Ключ);
						
		// Сформировать границы регистра.		
		ТексПериода 					= ТексПериода + Символы.ПС + ";" + Символы.ПС + "//////////"+ Символы.ПС;
		
		ГраницыРС 						= ""; 		
		ГраницыРС 						= СтрЗаменить(ШаблонГраницыРС,	"%%СтрокаресурсыИзмеренияГраницы%%",		ИзмеренияРесурсыГраницы);
		ГраницыРС 						= СтрЗаменить(ГраницыРС,		"%%ИмяТаблицы%%",							объект.Ключ);
		ГраницыРС 						= СтрЗаменить(ГраницыРС,		"%%СтрокаСоединенения%%",					СтрокаСоединения);
		ГраницыРС 						= СтрЗаменить(ГраницыРС,		"%%ТаблицаИсточник%%",						"ТаблицаРС");
		ГраницыРС 						= СтрЗаменить(ГраницыРС,		"%%ТаблицаПриемник%%",						"ТаблицаКонец");
		
		ИтоговыйТекст 					= ИтоговыйТекст + ?(ГлавСчетчик>0,Символы.ПС + ";" + Символы.ПС + "//////////"+ Символы.ПС,"")  + ТексПериода;
		
		ИтоговыйТекст 					= ИтоговыйТекст + ГраницыРС;
		
		ВрТекст 						= СтрЗаменить(ШаблонНаборПериодов,"%%ИмяТаблицы%%",объект.Ключ);
		
		Если объект.Значение.СвойствоТочки = Неопределено Тогда
			ВрТекст 					= СтрЗаменить(ВрТекст,"вТаблица.ТочкаУчета КАК ТочкаУчета","НЕОПРЕДЕЛЕНО КАК ТочкаУчета");
		Иначе
			ВрТекст 					= СтрЗаменить(ВрТекст,"вТаблица.ТочкаУчета КАК ТочкаУчета","вТаблица." + объект.Значение.СвойствоТочки + " КАК ТочкаУчета");
		КонецЕсли;
				
		ТекстНаборПериодов  			= ТекстНаборПериодов + ?(ГлавСчетчик>0,Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС ,"")  + ВрТекст;
		
		ГлавСчетчик 					= ГлавСчетчик + 1;				
	КонецЦикла;
	
	ТекстНаборПериодов  				=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.ТочкаУчета
	|ПОМЕСТИТЬ НаборПериодов 
	|ИЗ 
	|	(" + ТекстНаборПериодов + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	| 	Значение(Документ.энргНачисление.ПустаяСсылка), 
	| 	ГраницыОтчетногоПериода.НачалоОП,
	| 	ГраницыОтчетногоПериода.НачалоОП,
	| 	НЕОПРЕДЕЛЕНО,
	| 	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	| 	Значение(Документ.энргНачисление.ПустаяСсылка),
	|	ГраницыОтчетногоПериода.ЗавершениеОП,
	|	ГраницыОтчетногоПериода.ЗавершениеОП,
	| 	НЕОПРЕДЕЛЕНО,
	| 	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода) КАК ВложенныйЗапрос";
	
	
	ИтоговыйТекст 				= ИтоговыйТекст + Символы.ПС + ";" + Символы.ПС + "//////////"+ Символы.ПС +ТекстНаборПериодов;
		
	ИтоговыйТекст 				= ИтоговыйТекст + Символы.ПС + ";" + Символы.ПС + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаборэнргАктивностьТочекУчетаМКД.МКД КАК МКД,
	|	НаборэнргАктивностьТочекУчетаМКД.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВсеТочкиУчета
	|ИЗ
	|	НаборэнргАктивностьТочекУчетаМКД КАК НаборэнргАктивностьТочекУчетаМКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПериодов.ДокРегистратор КАК ДокРегистратор,
	|	НаборПериодов.Период КАК Период,
	|	НаборПериодов.МКД КАК МКД,
	|	НаборПериодов.ТочкаУчета КАК ТочкаУчета,
	|	НаборПериодов.ПериодРегистрации КАК ПериодРегистрации
	|ПОМЕСТИТЬ НаборПериодовТочкиУчета
	|ИЗ
	|	НаборПериодов КАК НаборПериодов
	|ГДЕ
	|	НЕ НаборПериодов.МКД = НЕОПРЕДЕЛЕНО
	|	И НЕ НаборПериодов.ТочкаУчета = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборПериодов.ДокРегистратор,
	|	НаборПериодов.Период,
	|	ВсеТочкиУчета.МКД,
	|	ВсеТочкиУчета.ТочкаУчета,
	|	НаборПериодов.ПериодРегистрации
	|ИЗ
	|	ВсеТочкиУчета КАК ВсеТочкиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПериодов КАК НаборПериодов
	|		ПО ВсеТочкиУчета.МКД = НаборПериодов.МКД
	|			И (НаборПериодов.ТочкаУчета = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборПериодов.ДокРегистратор,
	|	НаборПериодов.Период,
	|	ВсеТочкиУчета.МКД,
	|	ВсеТочкиУчета.ТочкаУчета,
	|	НаборПериодов.ПериодРегистрации
	|ИЗ
	|	ВсеТочкиУчета КАК ВсеТочкиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПериодов КАК НаборПериодов
	|		ПО (НаборПериодов.МКД = НЕОПРЕДЕЛЕНО)
	|			И (НаборПериодов.ТочкаУчета = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючНорматива КАК КлючНорматива,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребления.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргЗначенияНормативовПотребления.Организация КАК Организация,
	|		энргЗначенияНормативовПотребления.Район КАК Район,
	|		энргЗначенияНормативовПотребления.КлючНорматива КАК КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга КАК Услуга,
	|		МАКСИМУМ(энргЗначенияНормативовПотребления.Период) КАК Период,
	|		ЛОЖЬ КАК НормативДляИндивидуальных
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|			ПО ГраницыОтчетногоПериода.Организация = энргЗначенияНормативовПотребления.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначенияНормативовПотребления.Период
	|				И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|				И (энргЗначенияНормативовПотребления.Район = &Район)
	|				И (энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|				И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргЗначенияНормативовПотребления.Организация,
	|		энргЗначенияНормативовПотребления.Район,
	|		энргЗначенияНормативовПотребления.КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргЗначенияНормативовПотребления.Организация,
	|		энргЗначенияНормативовПотребления.Район,
	|		энргЗначенияНормативовПотребления.КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга,
	|		МАКСИМУМ(энргЗначенияНормативовПотребления.Период),
	|		ИСТИНА
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|			ПО ГраницыОтчетногоПериода.Организация = энргЗначенияНормативовПотребления.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначенияНормативовПотребления.Период
	|				И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|				И (энргЗначенияНормативовПотребления.Район = &Район)
	|				И (энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|				И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО (энргЗначенияНормативовПотребления.Услуга = энргВидыУслуг.Ссылка)
	|				И (энргВидыУслуг.НормативДляИндивидуальных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргЗначенияНормативовПотребления.Организация,
	|		энргЗначенияНормативовПотребления.Район,
	|		энргЗначенияНормативовПотребления.КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|		ПО ВложенныйЗапрос.Организация = энргЗначенияНормативовПотребления.Организация
	|			И ВложенныйЗапрос.Период = энргЗначенияНормативовПотребления.Период
	|			И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|			И (энргЗначенияНормативовПотребления.Район = &Район)
	|			И (энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|			И (ВЫБОР
	|				КОГДА ВложенныйЗапрос.НормативДляИндивидуальных
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления)
	|			КОНЕЦ = энргЗначенияНормативовПотребления.ТипНачисления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользования,
	|	ВложенныйЗапрос.МКД КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	(ВЫБРАТЬ
	|		НастройкаСезонностиУслуг.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		НастройкаСезонностиУслуг.Район КАК Район,
	|		НастройкаСезонностиУслуг.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		НастройкаСезонностиУслуг.МКД КАК МКД,
	|		НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|		МАКСИМУМ(НастройкаСезонностиУслуг.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаСезонностиУслуг КАК НастройкаСезонностиУслуг
	|			ПО ГраницыОтчетногоПериода.Организация = НастройкаСезонностиУслуг.Организация
	|				И (НастройкаСезонностиУслуг.Организация = &Организация)
	|				И (НастройкаСезонностиУслуг.Район = &Район)
	|				И (НастройкаСезонностиУслуг.МКД = &МКД
	|					ИЛИ НастройкаСезонностиУслуг.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > НастройкаСезонностиУслуг.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НастройкаСезонностиУслуг.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		НастройкаСезонностиУслуг.Район,
	|		НастройкаСезонностиУслуг.НаправлениеИспользованияТУ,
	|		НастройкаСезонностиУслуг.МКД,
	|		НастройкаСезонностиУслуг.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаСезонностиУслуг КАК НастройкаСезонностиУслуг
	|		ПО ВложенныйЗапрос.Организация = НастройкаСезонностиУслуг.Организация
	|			И ВложенныйЗапрос.Район = НастройкаСезонностиУслуг.Район
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = НастройкаСезонностиУслуг.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.МКД = НастройкаСезонностиУслуг.МКД
	|			И ВложенныйЗапрос.Услуга = НастройкаСезонностиУслуг.Услуга
	|			И ВложенныйЗапрос.Период = НастройкаСезонностиУслуг.Период
	|			И (НастройкаСезонностиУслуг.Организация = &Организация)
	|			И (НастройкаСезонностиУслуг.Район = &Район)
	|			И (НастройкаСезонностиУслуг.МКД = &МКД
	|				ИЛИ НастройкаСезонностиУслуг.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.НачПер КАК НачПер,
	|	ВложенныйЗапрос.КонПер КАК КонПер
	|ПОМЕСТИТЬ ГраницыПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НаборПериодовНачало.ДокРегистратор КАК ДокРегистратор,
	|		НаборПериодовНачало.МКД КАК МКД,
	|		НаборПериодовНачало.ТочкаУчета КАК ТочкаУчета,
	|		НаборПериодовНачало.Период КАК НачПер,
	|		НаборПериодовНачало.ПериодРегистрации КАК ПериодРегистрации,
	|		МИНИМУМ(НаборПериодовКонец.Период) КАК КонПер
	|	ИЗ
	|		НаборПериодовТочкиУчета КАК НаборПериодовНачало
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПериодовТочкиУчета КАК НаборПериодовКонец
	|			ПО НаборПериодовНачало.МКД = НаборПериодовКонец.МКД
	|				И НаборПериодовНачало.ТочкаУчета = НаборПериодовКонец.ТочкаУчета
	|				И (ВЫБОР
	|					КОГДА НаборПериодовНачало.Период < НаборПериодовКонец.Период
	|						ТОГДА ИСТИНА
	|					КОГДА НаборПериодовНачало.Период = НаборПериодовКонец.Период
	|							И НаборПериодовНачало.ПериодРегистрации < НаборПериодовКонец.ПериодРегистрации
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ НаборПериодовНачало.Период = НаборПериодовКонец.Период
	|							И НаборПериодовНачало.ПериодРегистрации = НаборПериодовКонец.ПериодРегистрации
	|							И НаборПериодовНачало.ДокРегистратор < НаборПериодовКонец.ДокРегистратор
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НаборПериодовНачало.ДокРегистратор,
	|		НаборПериодовНачало.МКД,
	|		НаборПериодовНачало.ТочкаУчета,
	|		НаборПериодовНачало.ПериодРегистрации,
	|		НаборПериодовНачало.Период) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.КонПер <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТипСхемы КАК ТипСхемы,
	|	ВложенныйЗапрос.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКД.ПредставлениеУслуги КАК ПредставлениеУслуги,
	|	энргНастройкаНачисленияГВСМКД.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргНастройкаНачисленияГВСМКД.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргНастройкаНачисленияГВСМКД.Район КАК Район,
	|		энргНастройкаНачисленияГВСМКД.МКД КАК МКД,
	|		энргНастройкаНачисленияГВСМКД.Услуга КАК Услуга,
	|		энргНастройкаНачисленияГВСМКД.ТипСхемы КАК ТипСхемы,
	|		энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|		МАКСИМУМ(энргНастройкаНачисленияГВСМКД.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаНачисленияГВСМКД КАК энргНастройкаНачисленияГВСМКД
	|			ПО ГраницыОтчетногоПериода.Организация = энргНастройкаНачисленияГВСМКД.Организация
	|				И (энргНастройкаНачисленияГВСМКД.Организация = &Организация)
	|				И (энргНастройкаНачисленияГВСМКД.Район = &Район)
	|				И (энргНастройкаНачисленияГВСМКД.МКД = &МКД
	|					ИЛИ энргНастройкаНачисленияГВСМКД.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргНастройкаНачисленияГВСМКД.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргНастройкаНачисленияГВСМКД.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргНастройкаНачисленияГВСМКД.Район,
	|		энргНастройкаНачисленияГВСМКД.МКД,
	|		энргНастройкаНачисленияГВСМКД.Услуга,
	|		энргНастройкаНачисленияГВСМКД.ТипСхемы,
	|		энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаНачисленияГВСМКД КАК энргНастройкаНачисленияГВСМКД
	|		ПО ВложенныйЗапрос.Организация = энргНастройкаНачисленияГВСМКД.Организация
	|			И ВложенныйЗапрос.Район = энргНастройкаНачисленияГВСМКД.Район
	|			И ВложенныйЗапрос.МКД = энргНастройкаНачисленияГВСМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргНастройкаНачисленияГВСМКД.Услуга
	|			И ВложенныйЗапрос.ТипСхемы = энргНастройкаНачисленияГВСМКД.ТипСхемы
	|			И ВложенныйЗапрос.ПринадлежностьКТепловомуПункту = энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту
	|			И ВложенныйЗапрос.Период = энргНастройкаНачисленияГВСМКД.Период
	|			И (энргНастройкаНачисленияГВСМКД.Организация = &Организация)
	|			И (энргНастройкаНачисленияГВСМКД.Район = &Район)
	|			И (энргНастройкаНачисленияГВСМКД.МКД = &МКД
	|				ИЛИ энргНастройкаНачисленияГВСМКД.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|	энргПериодыПриемаПоказаний.ДатаС КАК ДатаС,
	|	энргПериодыПриемаПоказаний.ДатаПо КАК ДатаПо
	|ПОМЕСТИТЬ ПериодыПриемаПоказаний
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП,
	|		МАКСИМУМ(энргПериодыПриемаПоказаний.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПериодыПриемаПоказаний КАК энргПериодыПриемаПоказаний
	|			ПО ГраницыОтчетногоПериода.Организация = энргПериодыПриемаПоказаний.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргПериодыПриемаПоказаний.Период
	|				И (энргПериодыПриемаПоказаний.Организация = &Организация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		ГраницыОтчетногоПериода.НачалоОП) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПериодыПриемаПоказаний КАК энргПериодыПриемаПоказаний
	|		ПО ВложенныйЗапрос.Организация = энргПериодыПриемаПоказаний.Организация
	|			И ВложенныйЗапрос.Период = энргПериодыПриемаПоказаний.Период
	|			И (энргПериодыПриемаПоказаний.Организация = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	ГраницыПериодов.МКД КАК МКД,
	|	ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП,
	|	ГраницыОтчетногоПериода.ЗавершениеОП КАК ЗавершениеОП,
	|	ГраницыОтчетногоПериода.ДнейВПериоде КАК ДнейВПериоде,
	|	ГраницыПериодов.ДокРегистратор КАК ДокРегистратор,
	|	ГраницыПериодов.ПериодРегистрации КАК ПериодРегистрации,
	|	ГраницыПериодов.НачПер КАК НачПер,
	|	ГраницыПериодов.КонПер КАК КонПер,
	|	ГраницыПериодов.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(НаборэнргСостояниеМКДГраницы.Состояние, ЛОЖЬ) КАК МКДОткрыт,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыТепловыхПунктов.ПустаяСсылка) КАК ВидТепловогоПункта,
	// ЕСТЬNULL(НаборэнргТипПринадлежностиМКДГраницы.ВидТепловогоПункта, ) КАК ВидТепловогоПункта,
	|	ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка) КАК ТипСхемы,
	// ЕСТЬNULL(НаборэнргТипСхемыГВСГраницы.ТипСхемы, ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка)) КАК ТипСхемы,
	|	ЕСТЬNULL(НаборэнргЗначениеПлощадейМКДГраницы.Площадь, 0) КАК ОбщаяПлощадь,
	|	ЛОЖЬ КАК НеРаспределятьНаАбонентов,
	//ЕСТЬNULL(НЕ НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы.Распределять, ЛОЖЬ) КАК НеРаспределятьНаАбонентов,
	|	энргСтроения.КоличествоЭтажей КАК КоличествоЭтажей,
	|	энргСтроения.ГодПостройки КАК ГодПостройки
	|ПОМЕСТИТЬ ОбщиеДанные
	|ИЗ
	|	ГраницыПериодов КАК ГраницыПериодов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргСостояниеМКДГраницы КАК НаборэнргСостояниеМКДГраницы
	|		ПО ГраницыПериодов.МКД = НаборэнргСостояниеМКДГраницы.МКД
	|			И (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргСостояниеМКДГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргСостояниеМКДГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргСостояниеМКДГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргТипПринадлежностиМКДГраницы КАК НаборэнргТипПринадлежностиМКДГраницы
	//|		ПО ГраницыПериодов.МКД = НаборэнргТипПринадлежностиМКДГраницы.МКД
	//|			И (ВЫБОР
	//|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	//|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргТипПринадлежностиМКДГраницы.ДокРегистратор
	//|				ИНАЧЕ НаборэнргТипПринадлежностиМКДГраницы.ПериодС <= ГраницыПериодов.НачПер
	//|						И НаборэнргТипПринадлежностиМКДГраницы.ПериодПо >= ГраницыПериодов.КонПер
	//|			КОНЕЦ)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргТипСхемыГВСГраницы КАК НаборэнргТипСхемыГВСГраницы
	//|		ПО ГраницыПериодов.МКД = НаборэнргТипСхемыГВСГраницы.МКД
	//|			И (ВЫБОР
	//|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	//|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргТипСхемыГВСГраницы.ДокРегистратор
	//|				ИНАЧЕ НаборэнргТипСхемыГВСГраницы.ПериодС <= ГраницыПериодов.НачПер
	//|						И НаборэнргТипСхемыГВСГраницы.ПериодПо >= ГраницыПериодов.КонПер
	//|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|		ПО ГраницыПериодов.МКД = энргСтроения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргЗначениеПлощадейМКДГраницы КАК НаборэнргЗначениеПлощадейМКДГраницы
	|		ПО ГраницыПериодов.МКД = НаборэнргЗначениеПлощадейМКДГраницы.МКД
	|			И (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргЗначениеПлощадейМКДГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргЗначениеПлощадейМКДГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргЗначениеПлощадейМКДГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	|			И (НаборэнргЗначениеПлощадейМКДГраницы.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД))
	|			И (НаборэнргЗначениеПлощадейМКДГраницы.Услуга = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы КАК НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы
	//|		ПО ГраницыПериодов.МКД = НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы.МКД
	//|			И (ВЫБОР
	//|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	//|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы.ДокРегистратор
	//|				ИНАЧЕ НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы.ПериодС <= ГраницыПериодов.НачПер
	//|						И НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы.ПериодПо >= ГраницыПериодов.КонПер
	//|			КОНЕЦ)
	//|			И ГраницыПериодов.ТочкаУчета = НаборэнргСпособРаспределенияОбъемаМКДНаАбонентовГраницы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ПО ГраницыПериодов.НачПер >= ГраницыОтчетногоПериода.НачалоОП
	|			И ГраницыПериодов.КонПер <= ГраницыОтчетногоПериода.ЗавершениеОП
	|ГДЕ
	|	НЕ ГраницыОтчетногоПериода.ПериодНачисления ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|	ВложенныйЗапрос.ДнейВПериоде КАК ДнейВПериоде,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.НачПер КАК НачПер,
	|	ВложенныйЗапрос.КонПер КАК КонПер,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.МКДОткрыт КАК МКДОткрыт,
	|	ВложенныйЗапрос.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ВложенныйЗапрос.ТипСхемы КАК ТипСхемы,
	|	ВложенныйЗапрос.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ВложенныйЗапрос.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	ВложенныйЗапрос.КоличествоЭтажей КАК КоличествоЭтажей,
	|	ВложенныйЗапрос.ГодПостройки КАК ГодПостройки,
	|	ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргВидыУслуг.ВидПлощадиМКД КАК ВидПлощадиМКД
	|ПОМЕСТИТЬ ДанныеПриборовУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|		ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|		ВложенныйЗапрос.ДнейВПериоде КАК ДнейВПериоде,
	|		ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.НачПер КАК НачПер,
	|		ВложенныйЗапрос.КонПер КАК КонПер,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.МКДОткрыт КАК МКДОткрыт,
	|		ВложенныйЗапрос.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|		ВложенныйЗапрос.ТипСхемы КАК ТипСхемы,
	|		ВложенныйЗапрос.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|		ВложенныйЗапрос.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|		ВложенныйЗапрос.КоличествоЭтажей КАК КоличествоЭтажей,
	|		ВложенныйЗапрос.ГодПостройки КАК ГодПостройки,
	|		ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВЫБОР
	|			КОГДА энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ВложенныйЗапрос.Услуга
	|			ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
	|		КОНЕЦ КАК Услуга,
	|		ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Ссылка, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК СоставнаяУслуга
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ОбщиеДанные.Организация КАК Организация,
	|			ОбщиеДанные.ПериодНачисления КАК ПериодНачисления,
	|			ОбщиеДанные.Район КАК Район,
	|			ОбщиеДанные.МКД КАК МКД,
	|			ОбщиеДанные.НачалоОП КАК НачалоОП,
	|			ОбщиеДанные.ЗавершениеОП КАК ЗавершениеОП,
	|			ОбщиеДанные.ДнейВПериоде КАК ДнейВПериоде,
	|			ОбщиеДанные.ДокРегистратор КАК ДокРегистратор,
	|			ОбщиеДанные.ПериодРегистрации КАК ПериодРегистрации,
	|			ОбщиеДанные.НачПер КАК НачПер,
	|			ОбщиеДанные.КонПер КАК КонПер,
	|			ОбщиеДанные.ТочкаУчета КАК ТочкаУчета,
	|			ОбщиеДанные.МКДОткрыт КАК МКДОткрыт,
	|			ОбщиеДанные.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|			ОбщиеДанные.ТипСхемы КАК ТипСхемы,
	|			ОбщиеДанные.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|			ОбщиеДанные.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|			ОбщиеДанные.КоличествоЭтажей КАК КоличествоЭтажей,
	|			ОбщиеДанные.ГодПостройки КАК ГодПостройки,
	|			ВЫБОР
	|				КОГДА НаборэнргАктивностьТочекУчетаМКДГраницы.Состояние ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				КОГДА НаборэнргАктивностьТочекУчетаМКДГраницы.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ КАК УслугаПодключена,
	|			ЕСТЬNULL(НаборэнргУслугиТочекУчетаМКДГраницы.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|			ЕСТЬNULL(НаборэнргПриборыТочекМКДГраницы.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ПриборУчета
	|		ИЗ
	|			ОбщиеДанные КАК ОбщиеДанные
	|				ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргАктивностьТочекУчетаМКДГраницы КАК НаборэнргАктивностьТочекУчетаМКДГраницы
	|				ПО ОбщиеДанные.МКД = НаборэнргАктивностьТочекУчетаМКДГраницы.МКД
	|					И (ВЫБОР
	|						КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|							ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргАктивностьТочекУчетаМКДГраницы.ДокРегистратор
	|						ИНАЧЕ НаборэнргАктивностьТочекУчетаМКДГраницы.ПериодС <= ОбщиеДанные.НачПер
	|								И НаборэнргАктивностьТочекУчетаМКДГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|					КОНЕЦ)
	|					И ОбщиеДанные.ТочкаУчета = НаборэнргАктивностьТочекУчетаМКДГраницы.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргУслугиТочекУчетаМКДГраницы КАК НаборэнргУслугиТочекУчетаМКДГраницы
	|				ПО ОбщиеДанные.МКД = НаборэнргУслугиТочекУчетаМКДГраницы.МКД
	|					И (ВЫБОР
	|						КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|							ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргУслугиТочекУчетаМКДГраницы.ДокРегистратор
	|						ИНАЧЕ НаборэнргУслугиТочекУчетаМКДГраницы.ПериодС <= ОбщиеДанные.НачПер
	|								И НаборэнргУслугиТочекУчетаМКДГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|					КОНЕЦ)
	|					И ОбщиеДанные.ТочкаУчета = НаборэнргУслугиТочекУчетаМКДГраницы.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргПриборыТочекМКДГраницы КАК НаборэнргПриборыТочекМКДГраницы
	|				ПО ОбщиеДанные.МКД = НаборэнргПриборыТочекМКДГраницы.МКД
	|					И (ВЫБОР
	|						КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|							ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргПриборыТочекМКДГраницы.ДокРегистратор
	|						ИНАЧЕ НаборэнргПриборыТочекМКДГраницы.ПериодС <= ОбщиеДанные.НачПер
	|								И НаборэнргПриборыТочекМКДГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|					КОНЕЦ)
	|					И ОбщиеДанные.ТочкаУчета = НаборэнргПриборыТочекМКДГраницы.ТочкаУчета) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|			ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПриборовУчета.Организация КАК Организация,
	|	ДанныеПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеПриборовУчета.Район КАК Район,
	|	ДанныеПриборовУчета.МКД КАК МКД,
	|	ДанныеПриборовУчета.НачалоОП КАК НачалоОП,
	|	ДанныеПриборовУчета.ЗавершениеОП КАК ЗавершениеОП,
	|	ДанныеПриборовУчета.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеПриборовУчета.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеПриборовУчета.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеПриборовУчета.НачПер КАК НачПер,
	|	ДанныеПриборовУчета.КонПер КАК КонПер,
	|	ДанныеПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПриборовУчета.МКДОткрыт КАК МКДОткрыт,
	|	ДанныеПриборовУчета.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ДанныеПриборовУчета.ТипСхемы КАК ТипСхемы,
	|	ДанныеПриборовУчета.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ДанныеПриборовУчета.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	ДанныеПриборовУчета.КоличествоЭтажей КАК КоличествоЭтажей,
	|	ДанныеПриборовУчета.ГодПостройки КАК ГодПостройки,
	|	ДанныеПриборовУчета.УслугаПодключена КАК УслугаПодключена,
	|	ДанныеПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеПриборовУчета.Услуга КАК Услуга,
	|	ДанныеПриборовУчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеПриборовУчета.ВидПлощадиМКД КАК ВидПлощадиМКД,
	|	ЕСТЬNULL(НаборэнргСостояниеПриборовМКДГраницы.Состояние, ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК ПриборВведен,
	|	ЕСТЬNULL(НаборэнргСостояниеПриборовМКДГраницы.ПериодС, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСостоянияПрибора,
	|	ЕСТЬNULL(НаборэнргЗначениеПлощадейМКДГраницы.Площадь, 0) КАК ЗначениеПлощади,
	|	ЕСТЬNULL(НаборэнргПоставщикиУслугМКДГраницы.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК Поставщик,
	|	ЕСТЬNULL(НаборэнргВидБлагоустройствМКДГраницы.ВидБлагоустройства, ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)) КАК ВидБлагоустройства,
	|	НЕ НаборэнргФормулыРасчетаУслугМКДГраницы.ФормулаРасчета ЕСТЬ NULL КАК РасчетПоФормуле,
	|	ЕСТЬNULL(НаборэнргФормулыРасчетаУслугМКДГраницы.ФормулаРасчета, """") КАК ФормулаРасчета
	|ПОМЕСТИТЬ ВсеПараметрыРасчетаБезНомера
	|ИЗ
	|	ДанныеПриборовУчета КАК ДанныеПриборовУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргСостояниеПриборовМКДГраницы КАК НаборэнргСостояниеПриборовМКДГраницы
	|		ПО ДанныеПриборовУчета.МКД = НаборэнргСостояниеПриборовМКДГраницы.МКД
	|			И (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргСостояниеПриборовМКДГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргСостояниеПриборовМКДГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргСостояниеПриборовМКДГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.ТочкаУчета = НаборэнргСостояниеПриборовМКДГраницы.ТочкаУчета
	|			И ДанныеПриборовУчета.ПриборУчета = НаборэнргСостояниеПриборовМКДГраницы.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргПоставщикиУслугМКДГраницы КАК НаборэнргПоставщикиУслугМКДГраницы
	|		ПО ДанныеПриборовУчета.МКД = НаборэнргПоставщикиУслугМКДГраницы.МКД
	|			И (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргПоставщикиУслугМКДГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргПоставщикиУслугМКДГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргПоставщикиУслугМКДГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.ТочкаУчета = НаборэнргПоставщикиУслугМКДГраницы.ТочкаУчета
	|			И ДанныеПриборовУчета.Услуга = НаборэнргПоставщикиУслугМКДГраницы.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргЗначениеПлощадейМКДГраницы КАК НаборэнргЗначениеПлощадейМКДГраницы
	|		ПО ДанныеПриборовУчета.МКД = НаборэнргЗначениеПлощадейМКДГраницы.МКД
	|			И (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргЗначениеПлощадейМКДГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргЗначениеПлощадейМКДГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргЗначениеПлощадейМКДГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.Услуга = НаборэнргЗначениеПлощадейМКДГраницы.Услуга
	|			И ДанныеПриборовУчета.ВидПлощадиМКД = НаборэнргЗначениеПлощадейМКДГраницы.ВидПлощади
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргВидБлагоустройствМКДГраницы КАК НаборэнргВидБлагоустройствМКДГраницы
	|		ПО ДанныеПриборовУчета.МКД = НаборэнргВидБлагоустройствМКДГраницы.МКД
	|			И (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргВидБлагоустройствМКДГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргВидБлагоустройствМКДГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргВидБлагоустройствМКДГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.Услуга = НаборэнргВидБлагоустройствМКДГраницы.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргФормулыРасчетаУслугМКДГраницы КАК НаборэнргФормулыРасчетаУслугМКДГраницы
	|		ПО ДанныеПриборовУчета.МКД = НаборэнргФормулыРасчетаУслугМКДГраницы.МКД
	|			И (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргФормулыРасчетаУслугМКДГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргФормулыРасчетаУслугМКДГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргФормулыРасчетаУслугМКДГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.ТочкаУчета = НаборэнргФормулыРасчетаУслугМКДГраницы.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыБезНомераНачало.Организация КАК Организация,
	|	СтабильныеПериодыБезНомераНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыБезНомераНачало.Район КАК Район,
	|	СтабильныеПериодыБезНомераНачало.МКД КАК МКД,
	|	СтабильныеПериодыБезНомераНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыБезНомераНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыБезНомераНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыБезНомераНачало.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыБезНомераНачало.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыБезНомераНачало.НачПер КАК НачПер,
	|	СтабильныеПериодыБезНомераНачало.КонПер КАК КонПер,
	|	СтабильныеПериодыБезНомераНачало.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыБезНомераНачало.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыБезНомераНачало.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыБезНомераНачало.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыБезНомераНачало.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	СтабильныеПериодыБезНомераНачало.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыБезНомераНачало.КоличествоЭтажей КАК КоличествоЭтажей,
	|	СтабильныеПериодыБезНомераНачало.ГодПостройки КАК ГодПостройки,
	|	СтабильныеПериодыБезНомераНачало.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыБезНомераНачало.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыБезНомераНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыБезНомераНачало.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыБезНомераНачало.ВидПлощадиМКД КАК ВидПлощадиМКД,
	|	СтабильныеПериодыБезНомераНачало.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыБезНомераНачало.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	СтабильныеПериодыБезНомераНачало.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыБезНомераНачало.Поставщик КАК Поставщик,
	|	СтабильныеПериодыБезНомераНачало.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыБезНомераНачало.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыБезНомераНачало.ФормулаРасчета КАК ФормулаРасчета,
	|	СУММА(ВЫБОР
	|			КОГДА СтабильныеПериодыБезНомераКонец.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК НомерПозиции,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользованияТУ,
	|	ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка) КАК ВидСобственности,
	|	0 КАК КоличествоКомнат,
	|	0 КАК КоличествоПрописанных,
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка) КАК ЧастьУзлаУчета
	|ПОМЕСТИТЬ ВсеПараметрыРасчета
	|ИЗ
	|	ВсеПараметрыРасчетаБезНомера КАК СтабильныеПериодыБезНомераНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПараметрыРасчетаБезНомера КАК СтабильныеПериодыБезНомераКонец
	|		ПО СтабильныеПериодыБезНомераНачало.Организация = СтабильныеПериодыБезНомераКонец.Организация
	|			И СтабильныеПериодыБезНомераНачало.ПериодНачисления = СтабильныеПериодыБезНомераКонец.ПериодНачисления
	|			И СтабильныеПериодыБезНомераНачало.Район = СтабильныеПериодыБезНомераКонец.Район
	|			И СтабильныеПериодыБезНомераНачало.МКД = СтабильныеПериодыБезНомераКонец.МКД
	|			И СтабильныеПериодыБезНомераНачало.Услуга = СтабильныеПериодыБезНомераКонец.Услуга
	|			И СтабильныеПериодыБезНомераНачало.ТочкаУчета = СтабильныеПериодыБезНомераКонец.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыБезНомераНачало.ПериодРегистрации = СтабильныеПериодыБезНомераКонец.ПериодРегистрации
	|					ТОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор > СтабильныеПериодыБезНомераКонец.ДокРегистратор
	|				ИНАЧЕ СтабильныеПериодыБезНомераНачало.ПериодРегистрации > СтабильныеПериодыБезНомераКонец.ПериодРегистрации
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыБезНомераНачало.ФормулаРасчета,
	|	СтабильныеПериодыБезНомераНачало.РасчетПоФормуле,
	|	СтабильныеПериодыБезНомераНачало.ЗавершениеОП,
	|	СтабильныеПериодыБезНомераНачало.ДокРегистратор,
	|	СтабильныеПериодыБезНомераНачало.УслугаПодключена,
	|	СтабильныеПериодыБезНомераНачало.КонПер,
	|	СтабильныеПериодыБезНомераНачало.СоставнаяУслуга,
	|	СтабильныеПериодыБезНомераНачало.ВидТепловогоПункта,
	|	СтабильныеПериодыБезНомераНачало.ПериодНачисления,
	|	СтабильныеПериодыБезНомераНачало.МКДОткрыт,
	|	СтабильныеПериодыБезНомераНачало.Организация,
	|	СтабильныеПериодыБезНомераНачало.ТипСхемы,
	|	СтабильныеПериодыБезНомераНачало.МКД,
	|	СтабильныеПериодыБезНомераНачало.ПриборУчета,
	|	СтабильныеПериодыБезНомераНачало.НачПер,
	|	СтабильныеПериодыБезНомераНачало.Услуга,
	|	СтабильныеПериодыБезНомераНачало.ВидПлощадиМКД,
	|	СтабильныеПериодыБезНомераНачало.ДатаСостоянияПрибора,
	|	СтабильныеПериодыБезНомераНачало.НачалоОП,
	|	СтабильныеПериодыБезНомераНачало.ПериодРегистрации,
	|	СтабильныеПериодыБезНомераНачало.ТочкаУчета,
	|	СтабильныеПериодыБезНомераНачало.ПриборВведен,
	|	СтабильныеПериодыБезНомераНачало.Поставщик,
	|	СтабильныеПериодыБезНомераНачало.Район,
	|	СтабильныеПериодыБезНомераНачало.ДнейВПериоде,
	|	СтабильныеПериодыБезНомераНачало.НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыБезНомераНачало.ВидБлагоустройства,
	|	СтабильныеПериодыБезНомераНачало.ОбщаяПлощадь,
	|	СтабильныеПериодыБезНомераНачало.КоличествоЭтажей,
	|	СтабильныеПериодыБезНомераНачало.ГодПостройки,
	|	СтабильныеПериодыБезНомераНачало.ЗначениеПлощади
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПараметрыРасчета.Организация КАК Организация,
	|	ВсеПараметрыРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ВсеПараметрыРасчета.Район КАК Район,
	|	ВсеПараметрыРасчета.МКД КАК МКД,
	|	ВсеПараметрыРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ВсеПараметрыРасчета.НомерПозиции КАК НомерПозиции,
	|	ВсеПараметрыРасчета.ПриборУчета КАК УзелУчета,
	|	ВсеПараметрыРасчета.НачПер КАК НачПер,
	|	ВсеПараметрыРасчета.КонПер КАК КонПер,
	|	ВсеПараметрыРасчета.ДокРегистратор КАК ДокРегистратор,
	|	НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.ПриборУчета КАК ЧастьУзлаУчета,
	|	НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК ПриборВведен,
	|	НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.ПериодС КАК ДатаСостоянияПрибора,
	|	1 КАК КоэффициентПУ
	|ПОМЕСТИТЬ СтабильныеПериодыСоставУзла
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборэнргСостояниеПриборовУзловУчетаМКДГраницы КАК НаборэнргСостояниеПриборовУзловУчетаМКДГраницы
	|		ПО ВсеПараметрыРасчета.МКД = НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.МКД
	|			И ВсеПараметрыРасчета.ТочкаУчета = НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.ТочкаУчета
	|			И ВсеПараметрыРасчета.ПриборУчета = НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.УзелУчета
	|			И (ВЫБОР
	|				КОГДА ВсеПараметрыРасчета.НачПер = ВсеПараметрыРасчета.КонПер
	|					ТОГДА ВсеПараметрыРасчета.ДокРегистратор = НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.ДокРегистратор
	|				ИНАЧЕ ВсеПараметрыРасчета.НачПер >= НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.ПериодС
	|						И ВсеПараметрыРасчета.КонПер <= НаборэнргСостояниеПриборовУзловУчетаМКДГраницы.ПериодПо
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыСоставУзла.Организация КАК Организация,
	|	СтабильныеПериодыСоставУзла.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыСоставУзла.Район КАК Район,
	|	СтабильныеПериодыСоставУзла.МКД КАК МКД,
	|	СтабильныеПериодыСоставУзла.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыСоставУзла.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыСоставУзла.ЧастьУзлаУчета КАК ЧастьУзлаУчета,
	|	СтабильныеПериодыСоставУзла.ДокРегистратор КАК ДокРегистратор,
	|	ЕСТЬNULL(НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	СтабильныеПериодыСоставУзла КАК СтабильныеПериодыСоставУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы КАК НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы
	|		ПО СтабильныеПериодыСоставУзла.МКД = НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы.МКД
	|			И СтабильныеПериодыСоставУзла.ЧастьУзлаУчета = НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыСоставУзла.НачПер = СтабильныеПериодыСоставУзла.КонПер
	|					ТОГДА СтабильныеПериодыСоставУзла.ДокРегистратор = НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы.ДокРегистратор
	|				ИНАЧЕ СтабильныеПериодыСоставУзла.НачПер >= НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы.ПериодС
	|						И СтабильныеПериодыСоставУзла.КонПер <= НаборэнргВидыДифференцированностиПриборовУчетаМКДГраницы.ПериодПо
	|			КОНЕЦ)";
	
	ИтоговыйТекст = ИтоговыйТекст + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ИтоговыйТекст 	= ИтоговыйТекст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНормативаПерерасчет(Ложь);
	
	ИтоговыйТекст 	= ИтоговыйТекст + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ИтоговыйТекст 	= ИтоговыйТекст + 
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.*,
	|	ЕСТЬNULL(КлючиНорматива.КлючНорматива,ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяСсылка)) КАК КлючНорматива
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
	|		ПО ВсеПараметрыРасчета.ПериодНачисления = КлючиНорматива.ПериодНачисления
	|		И (ВсеПараметрыРасчета.НачалоОП = КлючиНорматива.НачалоОП)
	|		И (ВсеПараметрыРасчета.ЗавершениеОП = КлючиНорматива.ЗавершениеОП)
	|		И (ВсеПараметрыРасчета.НачПер = КлючиНорматива.НачПер)
	|		И (ВсеПараметрыРасчета.КонПер = КлючиНорматива.КонПер)
	|		И (ВсеПараметрыРасчета.ДокРегистратор = КлючиНорматива.ДокРегистратор)	
	|		И (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
	|		И (ВсеПараметрыРасчета.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ)
	|		И (КлючиНорматива.Измеритель = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))";
	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("МКД",			 МКД);
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериодаРасчета); 
	Запрос.УстановитьПараметр("ТипНачисления",	Перечисления.энргТипыНачислений.ОбщедомовыеНачисления); 
	Запрос.Текст 	= ИтоговыйТекст;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПоказанияПерерасчетМКД(МВТ,Организация,ПериодНачисленияНачало,ПериодНачисленияКонец,Район,МКД,КорректировкаПоказаний)
		
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= "ВЫБРАТЬ * ИЗ ПериодыПриемаПоказаний";
	Результат 						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	
	ПериодыПриемаПоказаний 			= Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ПериодыПриемаПоказаний.Вставить(Выборка.ПериодНачисления, Новый Структура("ДатаС,ДатаПо, НачалоПериодаРасчета", Выборка.ДатаС, Выборка.ДатаПо, Выборка.НачалоОП));
	КонецЦикла;
	
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	НачалоМесяца(ПериодНачисленияНачало -1));
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("МКД", 				МКД);																															 
	Запрос.Текст 					=
	"ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрезМКД.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрезМКД.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрезМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрезМКД.Показания КАК Показания
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК энргМаксимальныеПоказанияСрезМКД
	|ГДЕ
	|	энргМаксимальныеПоказанияСрезМКД.Организация = &Организация
	|	И энргМаксимальныеПоказанияСрезМКД.ПериодНачисления = &ПериодНачисления
	|	И энргМаксимальныеПоказанияСрезМКД.Район = &Район
	|	И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД";
	
	Результат 						= Запрос.Выполнить();
	тзМаксимальныеСрез 				= Результат.Выгрузить();
	
	ПредоставленныеПоказания 		= Новый ТаблицаЗначений;
	ПредоставленныеПоказания.Колонки.Добавить("МКД",						Новый ОписаниеТипов("СправочникСсылка.энргСтроения"));
	ПредоставленныеПоказания.Колонки.Добавить("ПериодНачисления",			Новый ОписаниеТипов("Дата"));
	ПредоставленныеПоказания.Колонки.Добавить("ПриборУчета",				Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	ПредоставленныеПоказания.Колонки.Добавить("Шкала",						Новый ОписаниеТипов("СправочникСсылка.энргШкалыПриборовУчета"));
	ПредоставленныеПоказания.Колонки.Добавить("ТарифнаяЗона",				Новый ОписаниеТипов("СправочникСсылка.энргТарифныеЗоны"));
	ПредоставленныеПоказания.Колонки.Добавить("НомерПозиции",				Новый ОписаниеТипов("Число"));
	ПредоставленныеПоказания.Колонки.Добавить("Разделитель",				Новый ОписаниеТипов("Число"));
	ПредоставленныеПоказания.Колонки.Добавить("ДатаРегистратора",			Новый ОписаниеТипов("Дата"));
	ПредоставленныеПоказания.Колонки.Добавить("ДокРегистратор",				Новый ОписаниеТипов(Метаданные.РегистрыСведений.энргПредоставленныеПоказания.Измерения.ДокРегистратор.Тип.Типы()));
	ПредоставленныеПоказания.Колонки.Добавить("ВСрок",						Новый ОписаниеТипов("Булево"));
	ПредоставленныеПоказания.Колонки.Добавить("Показания",					Новый ОписаниеТипов("Число"));
	ПредоставленныеПоказания.Колонки.Добавить("ПоказанияТекущегоПериода",	Новый ОписаниеТипов("Булево"));
	  	
	КорректировкаПоказаний.Сортировать("ПериодНачисления,ПриборУчетаПосле,ШкалаПосле,ТарифнаяЗонаПосле,ДатаПоказаний,РегистраторПоказаний,Разделитель");
		
	ПредыдущиеПоказания 							= -1;
	
	текПериодНачисления								= Неопределено;
	текПриборУчета 									= Неопределено;
	текШкала	 									= Неопределено;
	текТарифнаяЗона									= Неопределено;
	ПоказанияПриняты 								= Перечисления.энргСостояниеПоказаний.Приняты;
	
	Для Каждого Строка Из КорректировкаПоказаний Цикл
		
		Если НЕ текПериодНачисления = Строка.ПериодНачисления
			ИЛИ НЕ текПриборУчета = Строка.ПриборУчетаПосле
			ИЛИ НЕ текШкала = Строка.ШкалаПосле
			ИЛИ НЕ текТарифнаяЗона = Строка.ТарифнаяЗонаПосле Тогда
			ТекНомерПозиции 						= 0;
		КонецЕсли;
		
		Если НЕ текПриборУчета = Строка.ПриборУчетаПосле
			ИЛИ НЕ текШкала = Строка.ШкалаПосле
			ИЛИ НЕ текТарифнаяЗона = Строка.ТарифнаяЗонаПосле Тогда
			
			СтрокиМаксимальныеСрез 					= тзМаксимальныеСрез.НайтиСтроки(Новый Структура("ПриборУчета,Шкала,ТарифнаяЗона",Строка.ПриборУчетаПосле, Строка.ШкалаПосле,Строка.ТарифнаяЗонаПосле));
			СтрокаСреза 							= Неопределено;
			Если СтрокиМаксимальныеСрез.Количество() = 0 Тогда
				МаксимальныеПоказания 				= 0; 
			Иначе
				СтрокаСреза 						= СтрокиМаксимальныеСрез[0];
				МаксимальныеПоказания 				= СтрокаСреза.Показания;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПериодыПриемаПоказаний[Строка.ПериодНачисления] = Неопределено Тогда
			ВСрок 									= Истина;
			ПоказанияТекущегоПериода 				= Истина;
		Иначе
			НачалоПериодаРасчета 					= ПериодыПриемаПоказаний[Строка.ПериодНачисления].НачалоПериодаРасчета;
			ПоказанияС 								= ПериодыПриемаПоказаний[Строка.ПериодНачисления].ДатаС;		
			ПоказанияПО 							= ПериодыПриемаПоказаний[Строка.ПериодНачисления].ДатаПо;
			ВСрок 									= Строка.ДатаПоказаний >= НачалоПериодаРасчета и День(Строка.ДатаПоказаний)>=ПоказанияС и День(Строка.ДатаПоказаний)<=ПоказанияПО;
			ПоказанияТекущегоПериода 				= Строка.ДатаПоказаний >= НачалоПериодаРасчета;
		КонецЕсли; 		
		
		Если Строка.СостояниеПоказанийПосле = ПоказанияПриняты Тогда
			МаксимальныеПоказания 					= Строка.ПоказанияПосле;
			Если СтрокаСреза = Неопределено Тогда
				СтрокаСреза  						= тзМаксимальныеСрез.Добавить();
				СтрокаСреза.ПриборУчета 			= Строка.ПриборУчетаПосле;
				СтрокаСреза.Шкала					= Строка.ШкалаПосле;
				СтрокаСреза.ТарифнаяЗона			= Строка.ТарифнаяЗонаПосле;
				СтрокаСреза.Показания 				= МаксимальныеПоказания;	
			Иначе
				 СтрокаСреза.Показания 				= МаксимальныеПоказания;
			КонецЕсли; 			
		КонецЕсли;
				
		Если Строка.СостояниеПоказанийПосле = ПоказанияПриняты или ВСрок тогда
			// Записываем набор.
			СтрокаНабор  							= ПредоставленныеПоказания.Добавить();
			СтрокаНабор.ПериодНачисления 			= Строка.ПериодНачисления;
			СтрокаНабор.ПриборУчета					= Строка.ПриборУчетаПосле;
			СтрокаНабор.Шкала						= Строка.ШкалаПосле;
			СтрокаНабор.ТарифнаяЗона				= Строка.ТарифнаяЗонаПосле;
			СтрокаНабор.НомерПозиции				= ТекНомерПозиции;
			СтрокаНабор.ДатаРегистратора  			= Строка.ДатаПоказаний;
			СтрокаНабор.ДокРегистратор  			= Строка.РегистраторПоказаний;
			СтрокаНабор.Разделитель		  			= Строка.Разделитель;
			СтрокаНабор.Показания  					= МаксимальныеПоказания;
			СтрокаНабор.ВСрок  						= ВСрок;
			СтрокаНабор.ПоказанияТекущегоПериода	= ПоказанияТекущегоПериода;
			ТекНомерПозиции 						= ТекНомерПозиции +1;			
		КонецЕсли;
		
		текПериодНачисления 						= Строка.ПериодНачисления;
		текПриборУчета 								= Строка.ПриборУчетаПосле;
		текШкала	 								= Строка.ШкалаПосле;
		текТарифнаяЗона								= Строка.ТарифнаяЗонаПосле;			
	КонецЦикла;
	
	Запрос 											= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 			НачалоМесяца(ПериодНачисленияНачало -1));
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("Район", 						Район);
	Запрос.УстановитьПараметр("МКД", 						МКД);
	Запрос.УстановитьПараметр("ПредоставленныеПоказания", 	ПредоставленныеПоказания);
	Запрос.МенеджерВременныхТаблиц 					= МВТ;
	Запрос.Текст  									= 
	"ВЫБРАТЬ
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	ПредоставленныеПоказания.Шкала КАК Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредоставленныеПоказания.НомерПозиции КАК НомерПозиции,
	|	ПредоставленныеПоказания.Разделитель КАК Разделитель,
	|	ПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	ПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор,
	|	ПредоставленныеПоказания.ВСрок КАК ВСрок,
	|	ПредоставленныеПоказания.Показания КАК Показания,
	|	ПредоставленныеПоказания.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ яПредоставленныеПоказания
	|ИЗ
	|	&ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	яПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	яПредоставленныеПоказания.Организация КАК Организация,
	|	яПредоставленныеПоказания.Район КАК Район,
	|	яПредоставленныеПоказания.МКД КАК МКД,
	|	яПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	яПредоставленныеПоказания.Шкала КАК Шкала,
	|	яПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	яПредоставленныеПоказания.НомерПозиции КАК НомерПозиции,
	|	яПредоставленныеПоказания.Разделитель КАК Разделитель,
	|	яПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	яПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор,
	|	яПредоставленныеПоказания.ВСрок КАК ВСрок,
	|	яПредоставленныеПоказания.Показания КАК Показания,
	|	яПредоставленныеПоказания.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода,
	|	ГраницыОтчетногоПериода.ЗавершениеОП КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	яПредоставленныеПоказания КАК яПредоставленныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ПО яПредоставленныеПоказания.ПериодНачисления = ГраницыОтчетногоПериода.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	ПредоставленныеПоказания.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредоставленныеПоказания.Показания КАК Показания,
	|	ПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	ПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.ПериодНачисленияПоказаний КАК ПериодНачисленияПоказаний,
	|		МАКСИМУМ(ПредоставленныеПоказания.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|			ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|			ПредоставленныеПоказания.Шкала КАК Шкала,
	|			ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|			МАКСИМУМ(ПредоставленныеПоказания.ПериодНачисления) КАК ПериодНачисленияПоказаний
	|		ИЗ
	|			ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|				ПО ГраницыОтчетногоПериода.ПериодНачисления >= ПредоставленныеПоказания.ПериодНачисления
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГраницыОтчетногоПериода.ПериодНачисления,
	|			ПредоставленныеПоказания.ПриборУчета,
	|			ПредоставленныеПоказания.Шкала,
	|			ПредоставленныеПоказания.ТарифнаяЗона) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|			ПО ВложенныйЗапрос.ПериодНачисленияПоказаний = ПредоставленныеПоказания.ПериодНачисления
	|				И ВложенныйЗапрос.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|				И ВложенныйЗапрос.Шкала = ПредоставленныеПоказания.Шкала
	|				И ВложенныйЗапрос.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.ПриборУчета,
	|		ВложенныйЗапрос.Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.ПериодНачисленияПоказаний) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО ВложенныйЗапрос.ПериодНачисленияПоказаний = ПредоставленныеПоказания.ПериодНачисления
	|			И ВложенныйЗапрос.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И ВложенныйЗапрос.Шкала = ПредоставленныеПоказания.Шкала
	|			И ВложенныйЗапрос.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|			И ВложенныйЗапрос.НомерПозиции = ПредоставленныеПоказания.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|	ВложенныйЗапрос.Показания КАК Показания,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ГраницыОтчетногоПериода.НачалоОП КАК Период,
	|	ГраницыОтчетногоПериода.ЗавершениеОП КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ МаксимальныеПоказанияСрез
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(МаксимальныеПоказания.ПериодНачисления, МЕСЯЦ), СЕКУНДА, 1) КАК ПериодНачисления,
	|		МаксимальныеПоказания.МКД КАК МКД,
	|		МаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|		МаксимальныеПоказания.Шкала КАК Шкала,
	|		МаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|		-1 КАК НомерПозиции,
	|		МаксимальныеПоказания.Показания КАК Показания,
	|		МаксимальныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|		МаксимальныеПоказания.ДокРегистратор КАК ДокРегистратор
	|	ИЗ
	|		МаксимальныеПоказания КАК МаксимальныеПоказания
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ), СЕКУНДА, 1),
	|		энргМаксимальныеПоказанияСрезМКД.МКД,
	|		энргМаксимальныеПоказанияСрезМКД.ПриборУчета,
	|		энргМаксимальныеПоказанияСрезМКД.Шкала,
	|		энргМаксимальныеПоказанияСрезМКД.ТарифнаяЗона,
	|		-1,
	|		энргМаксимальныеПоказанияСрезМКД.Показания,
	|		энргМаксимальныеПоказанияСрезМКД.ДатаРегистратора,
	|		энргМаксимальныеПоказанияСрезМКД.ДокРегистратор
	|	ИЗ
	|		РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК энргМаксимальныеПоказанияСрезМКД
	|	ГДЕ
	|		энргМаксимальныеПоказанияСрезМКД.Организация = &Организация
	|		И энргМаксимальныеПоказанияСрезМКД.ПериодНачисления = &ПериодНачисления
	|		И энргМаксимальныеПоказанияСрезМКД.Район = &Район
	|		И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ПО ВложенныйЗапрос.ПериодНачисления = ГраницыОтчетногоПериода.ПериодНачисления"; 
		
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ВспомогательныеДанныеПерерасчетМКД(МВТ,Организация,ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета,Район,МКД)
	
	Текст  							= 
	"ВЫБРАТЬ
	|	энргДокументыНачислений.Организация КАК Организация,
	|	энргДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргДокументыНачислений.Район КАК Район,
	|	энргДокументыНачислений.МКД КАК МКД,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	энргДокументыНачислений.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользования,
	|	ЛОЖЬ КАК НормативПоДням
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|		ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.НачалоОП > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА ВложенныйЗапрос.НачалоОП
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.ЗавершениеОП > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ ВложенныйЗапрос.ЗавершениеОП
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|			ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГраницыОтчетногоПериода.Организация КАК Организация,
	|				ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) - 1
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодОкончания,
	|				ГраницыОтчетногоПериода.ЗавершениеОП КАК ЗавершениеОП,
	|				ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП
	|			ИЗ
	|				ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|							,
	|							Организация = &Организация
	|								И Район = &Район) КАК энргДлительностиПериодов
	|					ПО (ИСТИНА)) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП,
	|	ВложенныйЗапрос.Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода,
	|	СпособыРасчетаПоНаправлениям.Услуга,
	|	СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ,
	|	СпособыРасчетаПоНаправлениям.НормативПоДням
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|		ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.НачалоОП > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА ВложенныйЗапрос.НачалоОП
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.ЗавершениеОП > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ ВложенныйЗапрос.ЗавершениеОП
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|			ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГраницыОтчетногоПериода.Организация КАК Организация,
	|				ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|				ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП,
	|				ГраницыОтчетногоПериода.ЗавершениеОП КАК ЗавершениеОП,
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) - 1
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|							,
	|							Организация = &Организация
	|								И Район = &Район) КАК энргДлительностиПериодов
	|					ПО (ИСТИНА)) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(&НачалоПериода,) КАК СпособыРасчетаПоНаправлениям
	|		ПО (СпособыРасчетаПоНаправлениям.Организация = &Организация)
	|			И (СпособыРасчетаПоНаправлениям.Район = &Район)
	|			И ВложенныйЗапрос.Сезонность = СпособыРасчетаПоНаправлениям.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВыводПриборовУчетаМКД.Организация КАК Организация,
	|	энргВыводПриборовУчетаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргВыводПриборовУчетаМКД.МКД КАК МКД,
	|	энргВыводПриборовУчетаМКД.Район КАК Район,
	|	энргВыводПриборовУчетаМКД.МКД КАК Строение,
	|	энргВыводПриборовУчетаМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргВыводПриборовУчетаМКД.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргВыводПриборовУчетаМКД КАК энргВыводПриборовУчетаМКД
	|		ПО ГраницыОтчетногоПериода.Организация = энргВыводПриборовУчетаМКД.Организация
	|			И ГраницыОтчетногоПериода.ПериодНачисления = энргВыводПриборовУчетаМКД.ПериодНачисления
	|			И (энргВыводПриборовУчетаМКД.Организация = &Организация)
	|			И (энргВыводПриборовУчетаМКД.ПериодНачисления МЕЖДУ &ПериодНачисленияНачало И &ПериодНачисленияКонец)
	|			И (энргВыводПриборовУчетаМКД.Район = &Район)
	|			И (энргВыводПриборовУчетаМКД.МКД = &МКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияМКД.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияМКД.Район КАК Район,
	|	энргСреднийОбъемПотребленияМКД.МКД КАК МКД,
	|	энргСреднийОбъемПотребленияМКД.Услуга КАК Услуга,
	|	энргСреднийОбъемПотребленияМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияМКД.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияМКД.Объем КАК СреднийОбъем
	|ПОМЕСТИТЬ СреднееПотреблениеМКД
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК энргСреднийОбъемПотребленияМКД
	|ГДЕ
	|	энргСреднийОбъемПотребленияМКД.Организация = &Организация
	|	И энргСреднийОбъемПотребленияМКД.ПериодНачисления МЕЖДУ &ПериодНачисленияНачало И &ПериодНачисленияКонец
	|	И энргСреднийОбъемПотребленияМКД.Район = &Район
	|	И энргСреднийОбъемПотребленияМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериодыНачало.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НаправлениеИспользования КАК НаправлениеИспользования,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачало.Организация = ДлительностьПериодов.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|			И СтабильныеПериодыНачало.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачало.ПериодРегистрации < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> ДлительностьПериодов.НачалоОП)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> ДлительностьПериодов.ЗавершениеОП)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНачало.Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления,
	|	СтабильныеПериодыНачало.Район,
	|	СтабильныеПериодыНачало.МКД,
	|	СтабильныеПериодыНачало.Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.НачалоФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериодыНачало.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НаправлениеИспользования КАК НаправлениеИспользования,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачало.Организация = ДлительностьПериодов.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|			И СтабильныеПериодыНачало.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачало.ПериодРегистрации < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> ДлительностьПериодов.НачалоОП)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> ДлительностьПериодов.ЗавершениеОП)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНачало.Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления,
	|	СтабильныеПериодыНачало.Район,
	|	СтабильныеПериодыНачало.МКД,
	|	СтабильныеПериодыНачало.Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.КонецФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ВложенныйЗапрос.ПлощадьМОП КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.ВидПлощади КАК ВидПлощади,
	|		энргЗначениеПлощадейМКД.Площадь КАК ПлощадьМОП
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|			энргЗначениеПлощадейМКД.ВидПлощади КАК ВидПлощади,
	|			МАКСИМУМ(энргЗначениеПлощадейМКД.Период) КАК Период
	|		ИЗ
	|			ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначениеПлощадейМКД КАК энргЗначениеПлощадейМКД
	|				ПО ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначениеПлощадейМКД.Период
	|					И (энргЗначениеПлощадейМКД.Организация = &Организация)
	|					И (энргЗначениеПлощадейМКД.Район = &Район)
	|					И (энргЗначениеПлощадейМКД.МКД = &МКД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГраницыОтчетногоПериода.ПериодНачисления,
	|			энргЗначениеПлощадейМКД.ВидПлощади) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначениеПлощадейМКД КАК энргЗначениеПлощадейМКД
	|			ПО ВложенныйЗапрос.Период = энргЗначениеПлощадейМКД.Период
	|				И ВложенныйЗапрос.ВидПлощади = энргЗначениеПлощадейМКД.ВидПлощади
	|				И (энргЗначениеПлощадейМКД.Организация = &Организация)
	|				И (энргЗначениеПлощадейМКД.Район = &Район)
	|				И (энргЗначениеПлощадейМКД.МКД = &МКД)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.ВидПлощади = энргВидыУслуг.ВидПлощадиМКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&МКД КАК Строение,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ВложенныйЗапрос.Площадь КАК ПлощадьАбонентов,
	|	0 КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		СУММА(энргЗначенияПлощадей.Площадь) КАК Площадь
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период
	|		ИЗ
	|			ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					энргЗначенияПлощадей.Период КАК Период,
	|					энргЗначенияПлощадей.ВидПлощади КАК ВидПлощади,
	|					энргЗначенияПлощадей.КлючПомещения КАК КлючПомещения
	|				ИЗ
	|					РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадей
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|						ПО энргЗначенияПлощадей.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|							И (энргЗначенияПлощадей.Организация = &Организация)
	|							И (энргЗначенияПлощадей.Район = &Район)
	|							И (энргКлючиПомещений.Строение = &МКД)
	|							И (энргЗначенияПлощадей.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))) КАК ВложенныйЗапрос
	|				ПО ГраницыОтчетногоПериода.ЗавершениеОП > ВложенныйЗапрос.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГраницыОтчетногоПериода.ПериодНачисления,
	|			ВложенныйЗапрос.КлючПомещения) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадей
	|			ПО ВложенныйЗапрос.Период = энргЗначенияПлощадей.Период
	|				И ВложенныйЗапрос.КлючПомещения = энргЗначенияПлощадей.КлючПомещения
	|				И (энргЗначенияПлощадей.Организация = &Организация)
	|				И (энргЗначенияПлощадей.Район = &Район)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ПериодНачисления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО (НЕ энргВидыУслуг.СоставнаяУслуга)
	|			И (энргВидыУслуг.ТипУслуги = ЗНАЧЕНИЕ(Перечисление.энргТипыУслуг.КоммунальныеУслуги))";
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("МКД",					МКД);
	Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",			КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисленияНачало",	ПериодНачисленияНачало);
	Запрос.УстановитьПараметр("ПериодНачисленияКонец",	ПериодНачисленияКонец);
	Запрос.Текст 					= Текст;  	
	Запрос.Выполнить();
КонецПроцедуры

#КонецОбласти

#Область КорректировкаПотребленияСезонныхУслугМКД

Процедура ЗаписатьНаборыЗаписейНачислениеМКД(ДокументОбъект, Набор, НаборВыполненные, Ошибки)
	
	Попытка
		Если НЕ ДокументОбъект = Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
			ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;														
		
		Если НЕ НаборВыполненные = Неопределено Тогда
			НаборВыполненные.Записать(НаборВыполненные.ДополнительныеСвойства.Замещать);
		КонецЕсли;
										
		Набор.Записать(Ложь);		
		
		ЗафиксироватьТранзакцию();
	Исключение						
		ОтменитьТранзакцию();
		ИнформацияОбОшибке  					= ИнформацияОбОшибке();
		Ошибки 									= Ошибки +
		Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;

КонецПроцедуры

Процедура ПрочитатьВспомогательныеДанныеДляКорректировкиПотребленияСезонныхУслугМКД(МВТ,ГраницыПериода,Организация,ПериодНачисления,Район,ГодоваяКорректировка,МКД)
	
	Запрос 							= Новый Запрос();	
	Текст 							= ТекстЗапросаВспомогательныеДанныеДляКорректировкиПотребленияСезонныхУслугМКД();
			
	Если Не МКД = Неопределено Тогда
		Запрос.УстановитьПараметр("МКД",МКД);			
	Иначе
		Текст 						= СтрЗаменить(Текст,"И МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.МКД = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргДокументыНачислений.МКД = &МКД","");	
	КонецЕсли;
	Запрос.Текст 					= Текст; 	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 				ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоГода", 					НачалоГода(ПериодНачисления));
	Запрос.УстановитьПараметр("ОкончаниеГода", 					КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("Район", 							Район);
	Запрос.УстановитьПараметр("ЗавершениеОП", 					ГраницыПериода.ЗавершениеОП);
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

