#Область ПрограмныйИнтерфейс

Процедура СкорректироватьПотреблениеСезонныхУслуг(Организация, ПериодНачисления,Район,Строение,Помещение,Набор, НаборОбъемПомещений) Экспорт 
	Перем ДокументОбъект, НаборВыполненные, ТекЧастныйСектор, ТекМКД, ТекПериодНачисления, ЗамещатьНаборВыполненные;
	
	ГраницыПериода  						= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	МВТ  									= Новый МенеджерВременныхТаблиц;
	ЗаписыватьНаборыЗаписей 				= Набор = Неопределено;
	
	ПрочитатьВспомогательныеДанныеДляКорректировкиПотребленияСезонныхУслуг(МВТ,ГраницыПериода,Организация,ПериодНачисления,Район,Ложь,Строение,Помещение);
	
	Запрос 									= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 			= МВТ;
	Запрос.Текст 							= ТекстЗапросаДанныеДляКорректировкаПотребленияСезонныхУслуг();
	Результат  								= Запрос.Выполнить();
	
	Выборка  								= Результат.Выбрать();
	ТекЗавершениеОП 						= ГраницыПериода.ЗавершениеОП-1;
	
	Если Выборка.Количество() = 0 Тогда		
		ВыборкаДокументыОтменить 			= РезультатОтменитьКорректировкуСезонныхУслуг(ПериодНачисления,Организация,Район,Строение);
		Пока ВыборкаДокументыОтменить.Следующий() Цикл
			ДокументОбъектОтменить			= ВыборкаДокументыОтменить.Ссылка.ПолучитьОбъект();
			ДокументОбъектОтменить.УстановитьПометкуУдаления(Истина);			
		КонецЦикла;		
		РегистрыСведений.энргДокументыНачислений.УстановитьПометкуУдаленияДокументаНачислений(ПериодНачисления, Организация, Район, Строение, Перечисления.энргВидыОперацийНачисления.КорректировкаПотребленияСезонныхУслуг);
		Возврат;
	КонецЕсли;
	
	Ошибки 									= "";
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ТекМКД = Выборка.МКД Тогда
			
			Если НЕ ТекМКД = Неопределено Тогда
				Попытка 					
					энргНачисления.ЗаписатьНаборыЗаписейНачисление(ДокументОбъект, Набор, НаборВыполненные, НаборОбъемПомещений, Ошибки);
				Исключение
					ИнформацияОбОшибке  	= ИнформацияОбОшибке();
					Ошибки 					= Ошибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				КонецПопытки;
			КонецЕсли;
			
			энргНачисления.ПрочитатьНаборыЗаписейНачисление(Выборка,ДокументОбъект,Помещение,Набор,НаборОбъемПомещений,НаборВыполненные, Перечисления.энргВидыОперацийНачисления.КорректировкаПотребленияСезонныхУслуг);
		КонецЕсли;
		
		СтрокаНабора 						= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период 				= ТекЗавершениеОП;
		
		ТекПериодНачисления 				= Выборка.Организация;
		ТекЧастныйСектор					= Выборка.ЧастныйСектор;
		ТекМКД 								= Выборка.МКД;
	КонецЦикла;
	
	энргНачисления.ЗаписатьНаборыЗаписейНачисление(ДокументОбъект, Набор, НаборВыполненные, НаборОбъемПомещений, Ошибки);
		
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Снять средние начисления
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  ЧастныйСектор	 - 	 - 
//  Строение		 - 	 - 
//  Помещение		 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисления(Делегат) Экспорт
		
	МВТ  													= Новый МенеджерВременныхТаблиц;
	Делегат.Инициализировать(МВТ);
	ГраницыПериода 											= Делегат.ГраницыПериода();
	КонецПериодаРасчета 									= ГраницыПериода.ЗавершениеОП;
	РесурсыРН												= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы;
	ОписаниеПоляСуммы 										= РесурсыРН.Сумма.Тип;	
		
	Схема 													= Неопределено;
	
	ДанныеДляПерерасчета									= РезультатЗапросаПерерасчетСреднего(МВТ); 	
	
	Выборка  												= ДанныеДляПерерасчета.СписатьИзСреднего.выбрать();
	ВыборкаНачисленияПоПрибору 								= ДанныеДляПерерасчета.НачисленныйОбъем.Выбрать();
	ЕстьСледующийНачисленияПоПрибору 						= ВыборкаНачисленияПоПрибору.Следующий();
	
	ВидОперации 											= Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет;
	Сч 														= 0;
	
	Набор 													= Неопределено;
	НаборНачисленныйСредний 								= Неопределено;
	НаборВыполненные 										= Неопределено;
	ВидНачисленияПерерасчет 								= Перечисления.энргВидыНачислений.Перерасчет;
	
	Если Выборка.Количество() = 0 Тогда				
		Делегат.ОтменитьОперациюПерерасчетСреднихНачислений();		 		
	КонецЕсли; 		
	
	СтрокиНабораДоЗаписи 									= Неопределено;
	СтрокиНаборНачисленныйСреднийДоЗаписи 					= Неопределено;
	мОшибки 												= Новый Массив;
		
	текОрганизация											= Неопределено;
	текРайон 												= Неопределено;
	текМКД													= Неопределено;
	текЧастныйСектор 										= Неопределено;
	текСтроение 											= Неопределено;
	текПомещение 											= Неопределено;
	текТочкаУчета 											= Неопределено;
	текУслуга												= Неопределено;
	НадоСписатьОбъемУслуги 									= 0;
	НадоСписатьОбъемПотребленный							= 0;
	НадоСписатьОбъемУслугиПотери 							= 0;
	НадоСписатьОбъемПотребленныйПотери						= 0;
	
	СоответствиеНачисленияПоПрибору							= Новый Соответствие;
	СоответствиеДляСписания									= Новый Соответствие;
	СоответствиеОстаткаДоначисленияПоПрибору				= Новый Соответствие;
	
	КолонкиВыборки 											= ДанныеДляПерерасчета.СписатьИзСреднего.Колонки;
	КолонкиВыборкаНачисленияПоПрибору						= ДанныеДляПерерасчета.НачисленныйОбъем.Колонки;
			
	мИндексыСтрокДляСписания 								= Новый Массив;
	
	мОписаниеСтрокиНачислений 								= Новый Массив;
	Для Каждого КолонкаРезультат Из КолонкиВыборкаНачисленияПоПрибору Цикл
		 мОписаниеСтрокиНачислений.Добавить(КолонкаРезультат.Имя);
	КонецЦикла;
	ОписаниеСтрокиНачислений 								= СтрСоединить(мОписаниеСтрокиНачислений,",");
	
	мОписаниеСтрокиРесурсов 								= Новый Массив;
	НулевыеЗначенияРесурсов									= Новый Структура;
	Для Каждого КолонкаРезультат Из РесурсыРН Цикл
		 мОписаниеСтрокиРесурсов.Добавить(КолонкаРезультат.Имя);
		 НулевыеЗначенияРесурсов.Вставить(КолонкаРезультат.Имя, 0);
	КонецЦикла;
	ОписаниеСтрокиРесурсов 									= СтрСоединить(мОписаниеСтрокиРесурсов,",");
	
	ПериодНачисления 										= Делегат.ПериодНачисления;	
	
	Если Константы.энргПерерасчетСреднихЗначенийОтражатьВНачислениях.Получить() Тогда
		ВидНачисленияПерерасчетаСреднего = Перечисления.энргВидыНачислений.Начисление;
	Иначе
		ВидНачисленияПерерасчетаСреднего = Перечисления.энргВидыНачислений.Перерасчет;
	КонецЕсли;
	
	ВспомогательныеПараметры 								= Новый Структура("КонецПериодаРасчета,ПериодНачисления,ОписаниеПоляСуммы,ВидНачисленияПерерасчетаСреднего", КонецПериодаРасчета,ПериодНачисления,ОписаниеПоляСуммы,ВидНачисленияПерерасчетаСреднего);
	Пока Выборка.следующий() цикл
		Если НЕ текОрганизация = Выборка.Организация
			ИЛИ НЕ текРайон = Выборка.Район
			ИЛИ НЕ текМКД = Выборка.МКД
			ИЛИ НЕ текЧастныйСектор = Выборка.ЧастныйСектор
			ИЛИ НЕ текСтроение = Выборка.Строение
			ИЛИ НЕ текПомещение = Выборка.Помещение
			ИЛИ НЕ текТочкаУчета = Выборка.ТочкаУчета
			ИЛИ НЕ текУслуга = Выборка.Услуга Тогда
			 			
			Если НЕ текОрганизация = Неопределено Тогда
				ПолучитьОбъемыДляСписанияСреднего(СоответствиеДляСписания, СоответствиеНачисленияПоПрибору, СоответствиеОстаткаДоначисленияПоПрибору, РесурсыРН);
				ЗаполнитьНаборСписаниемСреднего(Набор, мИндексыСтрокДляСписания, СоответствиеНачисленияПоПрибору, ВспомогательныеПараметры);
				ДополнитьОстатокДоначисленияПоПриборамВНабор(Набор, мИндексыСтрокДляСписания, СоответствиеОстаткаДоначисленияПоПрибору, ВспомогательныеПараметры);				
			КонецЕсли;  			
			
			Если НЕ текРайон = Выборка.Район
				ИЛИ НЕ текМКД = Выборка.МКД Тогда
				
				Если НЕ текОрганизация = Неопределено Тогда
					Делегат.ПослеПроведенияМКД(мОшибки); 					
				КонецЕсли;				
				
				Делегат.ПередПроведенияМКД(Выборка.МКД,Выборка.ДокументПерерасчета,Выборка.ДокументПерерасчетаПометкаУдаления);
				Набор 										= Делегат.НаборОбъемНачислений();
				НаборНачисленныйСредний						= Делегат.НаборНачисленныйСредний();
			КонецЕсли;
			мИндексыСтрокДляСписания 						= Новый Массив;
			
			//--
			СоответствиеНачисленияПоПрибору					= Новый Соответствие;
			СоответствиеДляСписания							= Новый Соответствие;
			СоответствиеОстаткаДоначисленияПоПрибору		= Новый Соответствие;
			
			// ЗАполняем набор текущими начислениями
			Если Выборка.СписыватьПоПриборам Тогда 
				Пока ЕстьСледующийНачисленияПоПрибору
					И ВыборкаНачисленияПоПрибору.Организация = Выборка.Организация
					И ВыборкаНачисленияПоПрибору.Район = Выборка.Район
					И ВыборкаНачисленияПоПрибору.МКД = Выборка.МКД
					И ВыборкаНачисленияПоПрибору.ЧастныйСектор = Выборка.ЧастныйСектор
					И ВыборкаНачисленияПоПрибору.Строение = Выборка.Строение
					И ВыборкаНачисленияПоПрибору.Помещение = Выборка.Помещение
					И ВыборкаНачисленияПоПрибору.ТочкаУчета = Выборка.ТочкаУчета
					И ВыборкаНачисленияПоПрибору.Услуга = Выборка.Услуга Цикл
					
					ДанныеСтрокиНачислений 						= Новый Структура(ОписаниеСтрокиНачислений);
					ЗаполнитьЗначенияСвойств(ДанныеСтрокиНачислений, ВыборкаНачисленияПоПрибору);
					мИндексыСтрокДляСписания.Добавить(ДанныеСтрокиНачислений);
					
					//--
					ЗаполнитьСоответствиеЗначенияРесурсов(СоответствиеНачисленияПоПрибору, ВыборкаНачисленияПоПрибору, НулевыеЗначенияРесурсов, КолонкиВыборкаНачисленияПоПрибору, РесурсыРН);
					ЗаполнитьСоответствиеЗначенияРесурсов(СоответствиеОстаткаДоначисленияПоПрибору, ВыборкаНачисленияПоПрибору, НулевыеЗначенияРесурсов, КолонкиВыборкаНачисленияПоПрибору, РесурсыРН);
					
					ЕстьСледующийНачисленияПоПрибору 			= ВыборкаНачисленияПоПрибору.Следующий();
				КонецЦикла;			
			КонецЕсли;
						
			НадоСписатьОбъемУслуги 							= 0;
			НадоСписатьОбъемПотребленный					= 0;
			НадоСписатьОбъемУслугиПотери 					= 0;
			НадоСписатьОбъемПотребленныйПотери				= 0;			
			
		КонецЕсли;
		
		ДанныеНачисленыйСредний 	 						= Новый Структура(ОписаниеСтрокиНачислений);
		ЗаполнитьЗначенияСвойств(ДанныеНачисленыйСредний, Выборка);
		мИндексыСтрокДляСписания.Добавить(ДанныеНачисленыйСредний);
		
		СтрокаНабораНачисленныйСредний 						= НаборНачисленныйСредний.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(СтрокаНабораНачисленныйСредний,Выборка);
		СтрокаНабораНачисленныйСредний.Период 				= КонецПериодаРасчета - 1;
		
		НадоСписатьОбъемУслуги 								= НадоСписатьОбъемУслуги + Выборка.ОбъемУслуги;
		НадоСписатьОбъемПотребленный 						= НадоСписатьОбъемПотребленный + Выборка.ОбъемУслугиПотребленный;
		НадоСписатьОбъемУслугиПотери 						= НадоСписатьОбъемУслугиПотери + Выборка.ОбъемУслугиПотери;
		НадоСписатьОбъемПотребленныйПотери 					= НадоСписатьОбъемПотребленныйПотери + Выборка.ОбъемУслугиПотребленныйПотери;
		
		//--
		ЗаполнитьСоответствиеЗначенияРесурсов(СоответствиеДляСписания, Выборка, НулевыеЗначенияРесурсов, КолонкиВыборки, РесурсыРН);
					
		текОрганизация 										= Выборка.Организация;
		текРайон 											= Выборка.Район;
		текМКД	 											= Выборка.МКД;
		текЧастныйСектор 									= Выборка.ЧастныйСектор;
		текСтроение 										= Выборка.Строение;
		текПомещение 										= Выборка.Помещение;
		текТочкаУчета 										= Выборка.ТочкаУчета;
		текУслуга 											= Выборка.Услуга;		
	КонецЦикла;	
	
	Если НЕ текОрганизация = Неопределено Тогда
		ПолучитьОбъемыДляСписанияСреднего(СоответствиеДляСписания, СоответствиеНачисленияПоПрибору, СоответствиеОстаткаДоначисленияПоПрибору, РесурсыРН);
		ЗаполнитьНаборСписаниемСреднего(Набор, мИндексыСтрокДляСписания, СоответствиеНачисленияПоПрибору, ВспомогательныеПараметры);
		ДополнитьОстатокДоначисленияПоПриборамВНабор(Набор, мИндексыСтрокДляСписания, СоответствиеОстаткаДоначисленияПоПрибору, ВспомогательныеПараметры);
		
		Делегат.ПослеПроведенияМКД(мОшибки);	
	КонецЕсли;
	
	Если НЕ мОшибки.Количество() = 0 Тогда
		ВызватьИсключение СтрСоединить(мОшибки,Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСоответствиеЗначенияРесурсов(СоответствиеДляЗаполнения, Выборка, НулевыеЗначенияРесурсов, КолонкиВыборки, РесурсыРН)
	Если СоответствиеДляЗаполнения[Выборка.Шкала] = Неопределено Тогда
		
		СтруктураРесурсов			= Новый Структура;
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураРесурсов, НулевыеЗначенияРесурсов, Истина);
		ЗаполнитьЗначенияСвойств(СтруктураРесурсов, Выборка);
		
		СоответствиеСверхНорматива 	= Новый Соответствие;
		СоответствиеСверхНорматива.Вставить(Выборка.СверхНорматива, СтруктураРесурсов);
		
		СоответствиеТарифнойЗоны 	= Новый Соответствие;
		СоответствиеТарифнойЗоны.Вставить(Выборка.ТарифнаяЗона, СоответствиеСверхНорматива);
		//СоответствиеТарифнойЗоны.Вставить(Выборка.ТарифнаяЗона, СтруктураРесурсов);
		
		СоответствиеДляЗаполнения.Вставить(Выборка.Шкала, СоответствиеТарифнойЗоны);						
		
	ИначеЕсли СоответствиеДляЗаполнения[Выборка.Шкала][Выборка.ТарифнаяЗона] = Неопределено Тогда
		
		СтруктураРесурсов			= Новый Структура;
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураРесурсов, НулевыеЗначенияРесурсов, Истина);
		ЗаполнитьЗначенияСвойств(СтруктураРесурсов, Выборка);		
		
		СоответствиеСверхНорматива 	= Новый Соответствие;
		СоответствиеСверхНорматива.Вставить(Выборка.СверхНорматива, СтруктураРесурсов);
		
		//СоответствиеДляЗаполнения[Выборка.Шкала].Вставить(Выборка.ТарифнаяЗона, СтруктураРесурсов);
		СоответствиеДляЗаполнения[Выборка.Шкала].Вставить(Выборка.ТарифнаяЗона, СоответствиеСверхНорматива);
		
	ИначеЕсли СоответствиеДляЗаполнения[Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СверхНорматива] = Неопределено Тогда
		
		СтруктураРесурсов			= Новый Структура;
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураРесурсов, НулевыеЗначенияРесурсов, Истина);
		ЗаполнитьЗначенияСвойств(СтруктураРесурсов, Выборка);
		
		СоответствиеДляЗаполнения[Выборка.Шкала][Выборка.ТарифнаяЗона].Вставить(Выборка.СверхНорматива, СтруктураРесурсов);
		
	Иначе
		
		//СтруктураСписания 			= СоответствиеДляЗаполнения[Выборка.Шкала][Выборка.ТарифнаяЗона];
		СтруктураСписания 			= СоответствиеДляЗаполнения[Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СверхНорматива];
		Для Каждого КолонкаРезультат Из РесурсыРН Цикл
			Если КолонкиВыборки.Найти(КолонкаРезультат.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураСписания[КолонкаРезультат.Имя] = СтруктураСписания[КолонкаРезультат.Имя] + Выборка[КолонкаРезультат.Имя];
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьОбъемыДляСписанияСреднего(СоответствиеДляСписания, СоответствиеНачисленияПоПрибору, СоответствиеОстаткаДоначисленияПоПрибору, РесурсыРН)
	
	Для Каждого КлючЗначениеШкала из СоответствиеНачисленияПоПрибору Цикл
		Шкала				= КлючЗначениеШкала.Ключ;
		СписокТарифныхЗон 	= КлючЗначениеШкала.Значение;
		
		Для Каждого КлючЗначениеТарифнаяЗона из СписокТарифныхЗон Цикл 
			ТарифнаяЗона 			= КлючЗначениеТарифнаяЗона.Ключ;
			СписокСверхНорматива 	= КлючЗначениеТарифнаяЗона.Значение;
			//СтрокаРесурсовПоПрибору = КлючЗначениеТарифнаяЗона.Значение;
			
			Для Каждого КлючЗначениеСверхНорматива из СписокСверхНорматива Цикл 
				СверхНорматива 			= КлючЗначениеСверхНорматива.Ключ;
				СтрокаРесурсовПоПрибору = КлючЗначениеСверхНорматива.Значение;
				
				
				Если НЕ СоответствиеДляСписания[Шкала] = Неопределено 
					И НЕ СоответствиеДляСписания[Шкала][ТарифнаяЗона] = Неопределено 
					И НЕ СоответствиеДляСписания[Шкала][ТарифнаяЗона][СверхНорматива] = Неопределено Тогда
					
					СтрокаРесурсовПоСреднему 	= СоответствиеДляСписания[Шкала][ТарифнаяЗона][СверхНорматива];
					СтрокаДоначисленияРесурсов 	= СоответствиеОстаткаДоначисленияПоПрибору[Шкала][ТарифнаяЗона][СверхНорматива];
					
					Для Каждого КолонкаРезультат Из РесурсыРН Цикл
						РазницаРесурса = СтрокаРесурсовПоПрибору[КолонкаРезультат.Имя] - СтрокаРесурсовПоСреднему[КолонкаРезультат.Имя];
						СтрокаРесурсовПоПрибору[КолонкаРезультат.Имя] 		= 0;					
						СтрокаДоначисленияРесурсов[КолонкаРезультат.Имя] 	= 0;
						
						Если РазницаРесурса < 0 Тогда 
							СтрокаРесурсовПоПрибору[КолонкаРезультат.Имя] = - РазницаРесурса;
						Иначе 
							СтрокаДоначисленияРесурсов[КолонкаРезультат.Имя] = РазницаРесурса;
						КонецЕсли;					
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьНаборСписаниемСреднего(Набор, мИндексыСтрокДляСписания, СоответствиеНачисленияПоПрибору, ВспомогательныеПараметры)
	Для Сч = 0 По мИндексыСтрокДляСписания.ВГраница() Цикл
		СтрокаСписанияСреднего 	= мИндексыСтрокДляСписания[Сч];
		ПропуститьСтроку		= Ложь;
		ТекШкала 				= СтрокаСписанияСреднего.Шкала;
		ТекТарифнаяЗона 		= СтрокаСписанияСреднего.ТарифнаяЗона;
		ТекСверхНорматив 		= СтрокаСписанияСреднего.СверхНорматива;
		
		
		Если НЕ СоответствиеНачисленияПоПрибору[ТекШкала] = Неопределено 
			И НЕ СоответствиеНачисленияПоПрибору[ТекШкала][ТекТарифнаяЗона] = Неопределено
			И НЕ СоответствиеНачисленияПоПрибору[ТекШкала][ТекТарифнаяЗона][ТекСверхНорматив] = Неопределено
			И НЕ СтрокаСписанияСреднего.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
			
			СтрокаРесурсовПоПрибору 				= СоответствиеНачисленияПоПрибору[ТекШкала][ТекТарифнаяЗона][ТекСверхНорматив];
			
			СписываемОбъемУслуги 					= Мин(СтрокаРесурсовПоПрибору.ОбъемУслуги, СтрокаСписанияСреднего.ОбъемУслуги);
			СписываемОбъемПотребленный				= Мин(СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный, СтрокаСписанияСреднего.ОбъемУслугиПотребленный);
			СписываемОбъемУслугиПотери 				= Мин(СтрокаРесурсовПоПрибору.ОбъемУслугиПотери, СтрокаСписанияСреднего.ОбъемУслугиПотери);
			СписываемОбъемПотребленныйПотери		= Мин(СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленныйПотери, СтрокаСписанияСреднего.ОбъемУслугиПотребленныйПотери);					
			СписываемСумма 							= Окр(?(СтрокаРесурсовПоПрибору.ОбъемУслуги = СтрокаСписанияСреднего.ОбъемУслуги,  СтрокаСписанияСреднего.Сумма, СтрокаРесурсовПоПрибору.ОбъемУслуги * СтрокаСписанияСреднего.ЗначениеТарифа), ВспомогательныеПараметры.ОписаниеПоляСуммы.КвалификаторыЧисла.РазрядностьДробнойЧасти);
			
			
			Если СтрокаРесурсовПоПрибору.ОбъемУслуги = 0 и СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаРесурсовПоПрибору.ОбъемУслуги 					= СтрокаРесурсовПоПрибору.ОбъемУслуги - СписываемОбъемУслуги;
			СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный 		= СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный - СписываемОбъемПотребленный;
			СтрокаРесурсовПоПрибору.ОбъемУслугиПотери 				= СтрокаРесурсовПоПрибору.ОбъемУслугиПотери - СписываемОбъемУслугиПотери;
			СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленныйПотери	= СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленныйПотери - СписываемОбъемПотребленныйПотери;
			ВидНачисления 											= Перечисления.энргВидыНачислений.Перерасчет;
		Иначе 
			СписываемОбъемУслуги 					= СтрокаСписанияСреднего.ОбъемУслуги;
			СписываемОбъемПотребленный				= СтрокаСписанияСреднего.ОбъемУслугиПотребленный;
			СписываемОбъемУслугиПотери 				= СтрокаСписанияСреднего.ОбъемУслугиПотери;
			СписываемОбъемПотребленныйПотери		= СтрокаСписанияСреднего.ОбъемУслугиПотребленныйПотери;					
			СписываемСумма 							= СтрокаСписанияСреднего.Сумма;
			ВидНачисления 							= ВспомогательныеПараметры.ВидНачисленияПерерасчетаСреднего;
		КонецЕсли;
		
		СтрокаНабора 								= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаСписанияСреднего);
		СтрокаНабора.Период 						= ВспомогательныеПараметры.КонецПериодаРасчета - 1;
		СтрокаНабора.ПериодРасчета					= ВспомогательныеПараметры.ПериодНачисления;
		СтрокаНабора.ОбъемУслуги 					= - СписываемОбъемУслуги;
		СтрокаНабора.ОбъемУслугиПотребленный 		= - СписываемОбъемПотребленный;
		СтрокаНабора.ОбъемУслугиПотери 				= - СписываемОбъемУслугиПотери;
		СтрокаНабора.ОбъемУслугиПотребленныйПотери 	= - СписываемОбъемПотребленныйПотери;
		СтрокаНабора.Сумма 							= - СписываемСумма;
		СтрокаНабора.ВидНачисления 					= ВидНачисления;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ДополнитьОстатокДоначисленияПоПриборамВНабор(Набор, мИндексыСтрокДляСписания, СоответствиеОстаткаДоначисленияПоПрибору, ВспомогательныеПараметры)
	Для Сч = 0 По мИндексыСтрокДляСписания.ВГраница() Цикл
		СтрокаСписанияСреднего 	= мИндексыСтрокДляСписания[Сч];		
		ТекШкала 				= СтрокаСписанияСреднего.Шкала;
		ТекТарифнаяЗона 		= СтрокаСписанияСреднего.ТарифнаяЗона;
		ТекСверхНорматив 		= СтрокаСписанияСреднего.СверхНорматива;
		
		
		Если НЕ СоответствиеОстаткаДоначисленияПоПрибору[ТекШкала] = Неопределено 
			И НЕ СоответствиеОстаткаДоначисленияПоПрибору[ТекШкала][ТекТарифнаяЗона] = Неопределено
			И НЕ СоответствиеОстаткаДоначисленияПоПрибору[ТекШкала][ТекТарифнаяЗона][ТекСверхНорматив] = Неопределено
			И СтрокаСписанияСреднего.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
			
			СтрокаРесурсовПоПрибору 				= СоответствиеОстаткаДоначисленияПоПрибору[ТекШкала][ТекТарифнаяЗона][ТекСверхНорматив];
			Если СтрокаРесурсовПоПрибору.ОбъемУслуги = 0 и СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаДополнения 							= Окр(СтрокаРесурсовПоПрибору.ОбъемУслуги * СтрокаСписанияСреднего.ЗначениеТарифа, ВспомогательныеПараметры.ОписаниеПоляСуммы.КвалификаторыЧисла.РазрядностьДробнойЧасти); 			
			
			
			СтрокаНабора 								= Набор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаСписанияСреднего);
			СтрокаНабора.Период 						= ВспомогательныеПараметры.КонецПериодаРасчета - 1;
			СтрокаНабора.ПериодРасчета					= ВспомогательныеПараметры.ПериодНачисления;
			СтрокаНабора.ОбъемУслуги 					= Мин(СтрокаРесурсовПоПрибору.ОбъемУслуги, СтрокаНабора.ОбъемУслуги);
			СтрокаНабора.ОбъемУслугиПотребленный 		= Мин(СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный,СтрокаНабора.ОбъемУслугиПотребленный);
			СтрокаНабора.ОбъемУслугиПотери 				= СтрокаРесурсовПоПрибору.ОбъемУслугиПотери;
			СтрокаНабора.ОбъемУслугиПотребленныйПотери 	= СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленныйПотери;
			СтрокаНабора.Сумма 							= СуммаДополнения;
			СтрокаНабора.ВидНачисления 					= ВспомогательныеПараметры.ВидНачисленияПерерасчетаСреднего;
			
			СтрокаРесурсовПоПрибору.ОбъемУслуги				= СтрокаРесурсовПоПрибору.ОбъемУслуги - СтрокаНабора.ОбъемУслуги; 
			СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный	= СтрокаРесурсовПоПрибору.ОбъемУслугиПотребленный - СтрокаНабора.ОбъемУслугиПотребленный;
			
		КонецЕсли;
	КонецЦикла; 	
КонецПроцедуры


// Процедура - Снять средние начисления МКД
//
// Параметры:
//  Организация		 - 	 - 
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  МКД				 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисленияМКД(Организация,ПериодНачисления,Район,МКД,Документ) Экспорт
	перем ТекМКД,ДокументОбъект; 
	
	Если не ЗначениеЗаполнено(ПериодНачисления) или не ЗначениеЗаполнено(Район)  тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	ПрочитатьНеСписанныйСреднийМКД(МВТ,Организация,Район,МКД,НачалоПериодаРасчета);	
	результатЗапроса 								= РезультатЗапросаПерерасчетСреднегоМКД(МВТ,Организация, ПериодНачисления,Район,МКД); 	
	
	Выборка  										= результатЗапроса.выбрать();
	ВидОперации 									= Перечисления.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет;
	Набор 											= Неопределено;
	НаборНачисленныйСредний 						= Неопределено;
	ДокументСсылка 									= Неопределено;
	
	ВидНачисленияПерерасчет							= Перечисления.энргВидыНачислений.Перерасчет;
	
	Пока Выборка.следующий() цикл
		Если Документ = Неопределено тогда			
			Если  ДокументСсылка = Неопределено Тогда
				ДокументСсылка 						= Выборка.ДокументПерерасчета;
				ДокументОбъект 						= Неопределено;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка) тогда					
					ДокументСсылка 					= Документы.энргПерерасчетМКД.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  				= Документы.энргПерерасчетМКД.СоздатьДокумент();
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
					ДокументОбъект.район  			= Район;
					ДокументОбъект.Дата				= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 		= Организация;
					ДокументОбъект.ВидОперации 		= ВидОперации;
				КонецЕсли;
							 
				НаборНачисленныйСредний 			= РегистрыНакопления.энргНачисленныйСреднийОбъемМКД.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборНачисленныйСредний.Записать();
				
				Набор								= РегистрыНакопления.энргОбъемНачисленийМКД.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				Набор.Записать();				
			КонецЕсли;
		иначе
			Набор 									= Документ.Движения.энргНачисленныйСреднийОбъемМКД;
			Набор.Очистить(); 			
		КонецЕсли;		
		
		СтрокаНабора 								= НаборНачисленныйСредний.добавитьРасход();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
		СтрокаНабора.Организация 					= Организация;
		
		СтрокаНабора 								= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.ВидНачисления 					= ВидНачисленияПерерасчет;
		СтрокаНабора.ОбъемУслуги 					= - Выборка.ОбъемУслуги;
		СтрокаНабора.ПериодРасчета					= ГраницыПериода.ПериодНачисления;
	КонецЦикла;	
		
	Если Документ = Неопределено И Не Набор = Неопределено и Набор.Количество() > 0 тогда
		НачатьТранзакцию();
		Попытка
			Если Не ДокументОбъект = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Набор.ДополнительныеСвойства.Вставить("Организация",			Организация);
			Набор.ДополнительныеСвойства.Вставить("Район",					Район);
			Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",		ПериодНачисления);
			Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",		КонецПериодаРасчета-1);
			Набор.ДополнительныеСвойства.Вставить("ИзменятьОбъемНачислений", Истина);
			Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
			Набор.Записать(Ложь);						
			ЗафиксироватьТранзакцию();
		Исключение
			ОписаниеОшибки 							= ИнформацияОбОшибке();
			ОтменитьТранзакцию();
			ВызватьИсключение ПодробноеПредставлениеОшибки(ОписаниеОшибки);
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

Процедура СкорректироватьПотреблениеСезонныхУслугМКД(Организация, ПериодНачисления,Район,Строение,Набор) Экспорт 
		
КонецПроцедуры

Процедура ИзменитьПризнакСостояниеПрибора(Делегат) Экспорт 
	
	ПолучаемыеНаборы 				= Новый Массив;
	
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НастройкаСезонностиУслугВПериодеНачисления",		"НастройкаСезонностиУслуг"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ТочкиУчетаСИзменившимсяСостояниемПрибораУчета",	"ТочкиУчетаСИзменившимсяСостояниемПрибораУчета"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НаборЗаписейОбъемаНачисленийЗаПериод",			"НаборЗаписейОбъемаНачисленийЗаПериод"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ДокументыПерерасчета",							"ДокументыПерерасчета"));
		
	МВТ 							= Новый МенеджерВременныхТаблиц;
	Делегат.Инициализировать(МВТ,ПолучаемыеНаборы);
	
	Запрос  						= Новый Запрос(ТекстЗапросаИзменитьПризнакСостояниеПрибора());
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Результат  						= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьРезультатЗапросаИзменитьПризнакСостояниеПрибора(Результат, Делегат);	
	
КонецПроцедуры

Функция ЗаполнитьПоказанияДляПерерасчета(Организация,Район,Абонент,ПериодНачисленияКонец,Основания,Приемник,ИмяСвойства) Экспорт  
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Абонент",				Абонент);
	Запрос.УстановитьПараметр("ПериодНачисленияКонец",	ПериодНачисленияКонец);
	Запрос.УстановитьПараметр("ДокументыОснования",		Основания);
	Запрос.Текст 	="ВЫБРАТЬ
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчетаДо,
	|	ВложенныйЗапрос.Период КАК ДатаПоказаний,
	|	ВложенныйЗапрос.Регистратор КАК РегистраторПоказаний,
	|	ВложенныйЗапрос.Показание КАК ПоказанияДо,
	|	ВложенныйЗапрос.СостояниеПоказаний КАК СостояниеПоказанийДо,
	|	ВложенныйЗапрос.Переворот КАК ПереворотДо,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчетаПосле,
	|	ВложенныйЗапрос.Показание КАК ПоказанияПосле,
	|	ВложенныйЗапрос.СостояниеПоказаний КАК СостояниеПоказанийПосле,
	|	ВложенныйЗапрос.Переворот КАК ПереворотПосле,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ЕСТЬNULL(энргПредоставленныеПоказания.ВСрок, ЛОЖЬ) КАК ВСрокДо
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|		энргПоказанияПриборовУчета.Период КАК Период,
	|		энргПоказанияПриборовУчета.Регистратор КАК Регистратор,
	|		энргПоказанияПриборовУчета.Разделитель КАК Разделитель,
	|		энргПоказанияПриборовУчета.Показание КАК Показание,
	|		энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|		энргПоказанияПриборовУчета.КС КАК КС,
	|		энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|		энргПоказанияПриборовУчета.ПериодРегистрации КАК ДатаРегистратора
	|	ИЗ
	|		РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|	ГДЕ
	|		энргПоказанияПриборовУчета.Организация = &Организация
	|		И энргПоказанияПриборовУчета.Район = &Район
	|		И энргПоказанияПриборовУчета.Абонент = &Абонент
	|		И энргПоказанияПриборовУчета.ПериодНачисления <= &ПериодНачисленияКонец
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПоказанияПриборовУчета.ПриборУчета,
	|		энргПоказанияПриборовУчета.Период,
	|		энргПоказанияПриборовУчета.Регистратор,
	|		энргПоказанияПриборовУчета.Разделитель,
	|		энргПоказанияПриборовУчета.Показание,
	|		энргПоказанияПриборовУчета.СостояниеПоказаний,
	|		энргПоказанияПриборовУчета.КС,
	|		энргПоказанияПриборовУчета.Переворот,
	|		энргПоказанияПриборовУчета.ПериодРегистрации
	|	ИЗ
	|		РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|	ГДЕ
	|		энргПоказанияПриборовУчета.Организация = &Организация
	|		И энргПоказанияПриборовУчета.Район = &Район
	|		И энргПоказанияПриборовУчета.Абонент = &Абонент
	|		И энргПоказанияПриборовУчета.Регистратор В(&ДокументыОснования)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргОтклоненныеПерерасчетомПоказания КАК энргОтклоненныеПерерасчетомПоказания
	|		ПО ВложенныйЗапрос.Регистратор = энргОтклоненныеПерерасчетомПоказания.РегистраторПоказаний
	|			И ВложенныйЗапрос.ПриборУчета = энргОтклоненныеПерерасчетомПоказания.ПриборУчета
	|			И ВложенныйЗапрос.Разделитель = энргОтклоненныеПерерасчетомПоказания.Разделитель
	|			И (энргОтклоненныеПерерасчетомПоказания.ПериодНачисления <= &ПериодНачисленияКонец)
	|			И (энргОтклоненныеПерерасчетомПоказания.Район = &Район)
	|			И (энргОтклоненныеПерерасчетомПоказания.Абонент = &Абонент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|		ПО ВложенныйЗапрос.Регистратор = энргПредоставленныеПоказания.ДокРегистратор
	|			И ВложенныйЗапрос.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И ВложенныйЗапрос.Разделитель = энргПредоставленныеПоказания.Разделитель
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления <= &ПериодНачисленияКонец)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.Абонент = &Абонент)
	|ГДЕ
	|	энргОтклоненныеПерерасчетомПоказания.Район ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Регистратор";
	
	Результат  		= Запрос.Выполнить();
	Выборка 		= Результат.Выбрать();
	
	ТабличнаяЧасть 	= Приемник[ИмяСвойства];
	ТабличнаяЧасть.очистить();
	
	Пока Выборка.Следующий() цикл
		ЗаполнитьЗначенияСвойств(ТабличнаяЧасть.добавить(),Выборка);
	КонецЦикла;  
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Процедура ПрочитатьВспомогательныеДанныеДляКорректировкиПотребленияСезонныхУслуг(МВТ,ГраницыПериода,Организация,ПериодНачисления,Район,ГодоваяКорректировка,Строение,Помещение)
	
	Запрос 							= Новый Запрос();	
	Текст 							= ТекстЗапросаВспомогательныеДанныеДляКорректировкиПотребленияСезонныхУслуг();
	
	Если НЕ Помещение = Неопределено Тогда	
		ЧастныйСектор 				= НЕ ЗначениеЗаполнено(Строение);
		Запрос.УстановитьПараметр("ЧастныйСектор", 	ЧастныйСектор);
		Запрос.УстановитьПараметр("Строение",		Строение);
		Запрос.УстановитьПараметр("Помещение",		Помещение);
		Запрос.УстановитьПараметр("МКД",			?(ЧастныйСектор,Справочники.энргСтроения.ПустаяСсылка(),Строение));

	ИначеЕсли Не Строение = Неопределено И НЕ ЗначениеЗаполнено(Строение) Тогда
		ЧастныйСектор 				= Истина;
		Запрос.УстановитьПараметр("ЧастныйСектор", 	ЧастныйСектор);
		Запрос.УстановитьПараметр("МКД",			Справочники.энргСтроения.ПустаяСсылка());
		
		Текст 						= СтрЗаменить(Текст,"И (энргОбъемНачислений.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И Строение = &Строение","");
		
		Текст 						= СтрЗаменить(Текст,"И (энргОбъемНачислений.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (МКД = &МКД","И (ЛОЖЬ");
		
		
		
							
		
	ИначеЕсли Не Строение = Неопределено Тогда
		ЧастныйСектор 				= Ложь;
		Запрос.УстановитьПараметр("ЧастныйСектор", 	ЧастныйСектор);
		Запрос.УстановитьПараметр("МКД",			Строение);
		Запрос.УстановитьПараметр("Строение",		Строение);
		
		Текст 						= СтрЗаменить(Текст,"И (энргОбъемНачислений.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И Помещение = &Помещение","");
		
	Иначе
		Текст 						= СтрЗаменить(Текст,"И (энргОбъемНачислений.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор","");
		Текст 						= СтрЗаменить(Текст,"И ЧастныйСектор = &ЧастныйСектор","");
		
		Текст 						= СтрЗаменить(Текст,"И (энргОбъемНачислений.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И энргДокументыНачислений.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (МКД = &МКД","И (ИСТИНА");
		
		Текст 						= СтрЗаменить(Текст,"И (энргОбъемНачислений.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И Помещение = &Помещение",""); 		
	КонецЕсли;
	Запрос.Текст 					= Текст; 	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 				ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоГода", 					НачалоГода(ПериодНачисления));
	Запрос.УстановитьПараметр("ОкончаниеГода", 					КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("Район", 							Район);
	Запрос.УстановитьПараметр("ЗавершениеОП", 					ГраницыПериода.ЗавершениеОП);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОбработатьРезультатЗапросаИзменитьПризнакСостояниеПрибора(Результат, Делегат)  
	перем ТекОрганизация, ТекРайон, ТекМКД; 
	
	Ошибки 														= "";
	Выборка 													= Результат.Выбрать();
	
	Пока Выборка.следующий() цикл		 		
		Если НЕ ТекОрганизация = Выборка.Организация
			ИЛИ НЕ ТекМКД = Выборка.МКД Тогда						
			ДокументОбъект  									= Неопределено;			
			Делегат.ПередПроведениемМКД(Выборка.МКД,Выборка.ДокументНачисления, Выборка.ДокументНачисленияПометкаУдаления);
			Набор 												= Делегат.НаборОбъемНачислений;
			//НаборОбъемПомещений 								= Делегат.НаборОбъемНачисленийПомещений;			
		КонецЕсли; 				
		
		СтрокаНабораСнимаем										= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабораСнимаем, Выборка);
		СтрокаНабораСнимаем.Период								= Выборка.ЗавершениеОП-1;		
		СтрокаНабораСнимаем.Сумма 								= -СтрокаНабораСнимаем.Сумма;
		СтрокаНабораСнимаем.ОбъемУслуги 						= -СтрокаНабораСнимаем.ОбъемУслуги;
		СтрокаНабораСнимаем.ОбъемУслугиПотребленный 			= -СтрокаНабораСнимаем.ОбъемУслугиПотребленный;
		СтрокаНабораСнимаем.СуммаПоПовышенномуКоэффициенту 		= -СтрокаНабораСнимаем.СуммаПоПовышенномуКоэффициенту;
		СтрокаНабораСнимаем.ОбъемУслугиСоцНорма 				= -СтрокаНабораСнимаем.ОбъемУслугиСоцНорма;
		СтрокаНабораСнимаем.ОбъемУслугиПотребленныйСоцНорма 	= -СтрокаНабораСнимаем.ОбъемУслугиПотребленныйСоцНорма;
		СтрокаНабораСнимаем.ПериодРасчета 						= Выборка.ПериодРасчета;	
		
		
		СтрокаНабораДобавляем									= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабораДобавляем, Выборка);
		СтрокаНабораДобавляем.БылУстановленныйПриборВЭтомГоду	= НЕ Выборка.БылУстановленныйПриборВЭтомГоду;
		СтрокаНабораДобавляем.Период							= Выборка.ЗавершениеОП-1;
		СтрокаНабораДобавляем.ПериодРасчета 					= Выборка.ПериодРасчета;
		
		ТекОрганизация 											= Выборка.Организация;
		ТекРайон 												= Выборка.Район;
		ТекМКД 													= Выборка.МКД; 		
	КонецЦикла;	
	
	Если Не ТекМКД = Неопределено Тогда
		Делегат.ПослеПроведенияМКД(Ошибки);
	КонецЕсли;
		
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СнятьСредниеНачисления_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаПерерасчетСреднего(МВТ)
	
	Текст = 
	"ВЫБРАТЬ
	|	НачисленныйОбъем.Организация КАК Организация,
	|	НачисленныйОбъем.Район КАК Район,
	|	НачисленныйОбъем.Строение КАК Строение,
	|	НачисленныйОбъем.Помещение КАК Помещение,
	|	НачисленныйОбъем.Абонент КАК Абонент,
	|	НачисленныйОбъем.Услуга КАК Услуга,
	|	НачисленныйОбъем.ТочкаУчета КАК ТочкаУчета,
	|	НачисленныйОбъем.СпособНачисления КАК СпособНачисления,
	|	НачисленныйОбъем.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	НачисленныйОбъем.Измеритель КАК Измеритель,
	|	НачисленныйОбъем.ПриборУчета КАК ПриборУчета,
	|	НачисленныйОбъем.Шкала КАК Шкала,
	|	НачисленныйОбъем.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НачисленныйОбъем.ЗначениеТарифа КАК ЗначениеТарифа,
	|	НачисленныйОбъем.Поставщик КАК Поставщик,
	|	НачисленныйОбъем.ПериодРасчета КАК ПериодРасчета,
	|	НачисленныйОбъем.ПериодНачисления КАК ПериодНачисления,
	|	НачисленныйОбъем.ЧастныйСектор КАК ЧастныйСектор,
	|	НачисленныйОбъем.СверхНорматива КАК СверхНорматива,
	|	НачисленныйОбъем.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НачисленныйОбъем.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	СУММА(НачисленныйОбъем.ОбъемУслуги) КАК ОбъемУслуги,
	|	СУММА(НачисленныйОбъем.ОбъемУслугиПотери) КАК ОбъемУслугиПотери,
	|	СУММА(НачисленныйОбъем.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
	|	СУММА(НачисленныйОбъем.ОбъемУслугиПотребленныйПотери) КАК ОбъемУслугиПотребленныйПотери,
	|	СУММА(НачисленныйОбъем.ОбъемУслугиПотребленныйСоцНорма) КАК ОбъемУслугиПотребленныйСоцНорма,
	|	СУММА(НачисленныйОбъем.ОбъемУслугиСоцНорма) КАК ОбъемУслугиСоцНорма,
	|	СУММА(НачисленныйОбъем.Сумма) КАК Сумма,
	|	СУММА(НачисленныйОбъем.СуммаПоПовышенномуКоэффициенту) КАК СуммаПоПовышенномуКоэффициенту,
	|	НачисленныйОбъем.ВидБлагоустройства КАК ВидБлагоустройства,
	|	НачисленныйОбъем.ВидДифференцированности КАК ВидДифференцированности,
	|	НачисленныйОбъем.ВидПлощади КАК ВидПлощади,
	|	НачисленныйОбъем.ДатаПоверки КАК ДатаПоверки,
	|	НачисленныйОбъем.ЕстьСреднийПоВсемТочкамУслуги КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	НачисленныйОбъем.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	НачисленныйОбъем.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	НачисленныйОбъем.ЗначениеПлощади КАК ЗначениеПлощади,
	|	НачисленныйОбъем.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	НачисленныйОбъем.ЗначениеСоциальнойНормыРасчетныйСпособ КАК ЗначениеСоциальнойНормыРасчетныйСпособ,
	|	НачисленныйОбъем.ЗначениеТарифаРЭК КАК ЗначениеТарифаРЭК,
	|	НачисленныйОбъем.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	НачисленныйОбъем.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	НачисленныйОбъем.КлючНорматива КАК КлючНорматива,
	|	НачисленныйОбъем.КлючПомещения КАК КлючПомещения,
	|	НачисленныйОбъем.КлючСоцНорматива КАК КлючСоцНорматива,
	|	НачисленныйОбъем.КоличествоИзмеретелейНаправления КАК КоличествоИзмеретелейНаправления,
	|	НачисленныйОбъем.КоличествоКомнат КАК КоличествоКомнат,
	|	НачисленныйОбъем.КоличествоПроживающих КАК КоличествоПроживающих,
	|	НачисленныйОбъем.КоличествоПрописанных КАК КоличествоПрописанных,
	|	НачисленныйОбъем.КоличествоСобственников КАК КоличествоСобственников,
	|	НачисленныйОбъем.КонецПериода КАК КонецПериода,
	|	НачисленныйОбъем.КонечныеПоказания КАК КонечныеПоказания,
	|	НачисленныйОбъем.КоэффициентНорматива КАК КоэффициентНорматива,
	|	НачисленныйОбъем.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	НачисленныйОбъем.КоэффициентПУ КАК КоэффициентПУ,
	|	НачисленныйОбъем.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	НачисленныйОбъем.КоэффициентСезоности КАК КоэффициентСезоности,
	|	НачисленныйОбъем.КоэффициентФормула КАК КоэффициентФормула,
	|	НачисленныйОбъем.НачалоПериода КАК НачалоПериода,
	|	НачисленныйОбъем.НачальныеПоказания КАК НачальныеПоказания,
	|	НачисленныйОбъем.НормаПотребления КАК НормаПотребления,
	|	НачисленныйОбъем.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	НачисленныйОбъем.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	НачисленныйОбъем.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	НачисленныйОбъем.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	НачисленныйОбъем.ПлощадьМОП КАК ПлощадьМОП,
	|	НачисленныйОбъем.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	НачисленныйОбъем.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	НачисленныйОбъем.ПомещениеРодитель КАК ПомещениеРодитель,
	|	НачисленныйОбъем.ПриборЗависимой КАК ПриборЗависимой,
	|	НачисленныйОбъем.РасчетПоФормуле КАК РасчетПоФормуле,
	|	НачисленныйОбъем.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	НачисленныйОбъем.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	НачисленныйОбъем.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	НачисленныйОбъем.СоставнаяУслуга КАК СоставнаяУслуга,
	|	НачисленныйОбъем.СписатьИзНормы КАК СписатьИзНормы,
	|	НачисленныйОбъем.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	НачисленныйОбъем.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель
	|ПОМЕСТИТЬ НачисленияПоПриборам
	|ИЗ
	|	НачисленныйОбъем КАК НачисленныйОбъем
	|ГДЕ
	|	НачисленныйОбъем.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленныйОбъем.Организация,
	|	НачисленныйОбъем.Район,
	|	НачисленныйОбъем.Строение,
	|	НачисленныйОбъем.Помещение,
	|	НачисленныйОбъем.Абонент,
	|	НачисленныйОбъем.Услуга,
	|	НачисленныйОбъем.ТочкаУчета,
	|	НачисленныйОбъем.СпособНачисления,
	|	НачисленныйОбъем.НаправлениеИспользованияТУ,
	|	НачисленныйОбъем.Измеритель,
	|	НачисленныйОбъем.ПриборУчета,
	|	НачисленныйОбъем.Шкала,
	|	НачисленныйОбъем.ТарифнаяЗона,
	|	НачисленныйОбъем.ЗначениеТарифа,
	|	НачисленныйОбъем.Поставщик,
	|	НачисленныйОбъем.ПериодРасчета,
	|	НачисленныйОбъем.ПериодНачисления,
	|	НачисленныйОбъем.ЧастныйСектор,
	|	НачисленныйОбъем.СверхНорматива,
	|	НачисленныйОбъем.НеПрименятьСезонность,
	|	НачисленныйОбъем.БылУстановленныйПриборВЭтомГоду,
	|	НачисленныйОбъем.ВидБлагоустройства,
	|	НачисленныйОбъем.ВидДифференцированности,
	|	НачисленныйОбъем.ВидПлощади,
	|	НачисленныйОбъем.ДатаПоверки,
	|	НачисленныйОбъем.ЕстьСреднийПоВсемТочкамУслуги,
	|	НачисленныйОбъем.ЗависимаяТочкаУчета,
	|	НачисленныйОбъем.ЗависитОтУслуги,
	|	НачисленныйОбъем.ЗначениеПлощади,
	|	НачисленныйОбъем.ЗначениеСоциальнойНормы,
	|	НачисленныйОбъем.ЗначениеСоциальнойНормыРасчетныйСпособ,
	|	НачисленныйОбъем.ЗначениеТарифаРЭК,
	|	НачисленныйОбъем.ЗначениеТарифаСверхНорматива,
	|	НачисленныйОбъем.ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	НачисленныйОбъем.КлючНорматива,
	|	НачисленныйОбъем.КлючПомещения,
	|	НачисленныйОбъем.КлючСоцНорматива,
	|	НачисленныйОбъем.КоличествоИзмеретелейНаправления,
	|	НачисленныйОбъем.КоличествоКомнат,
	|	НачисленныйОбъем.КоличествоПроживающих,
	|	НачисленныйОбъем.КоличествоПрописанных,
	|	НачисленныйОбъем.КоличествоСобственников,
	|	НачисленныйОбъем.КонецПериода,
	|	НачисленныйОбъем.КонечныеПоказания,
	|	НачисленныйОбъем.КоэффициентНорматива,
	|	НачисленныйОбъем.КоэффициентНормативаНеПрименятьСезонность,
	|	НачисленныйОбъем.КоэффициентПУ,
	|	НачисленныйОбъем.КоэффициентРаспределенияОстатка,
	|	НачисленныйОбъем.КоэффициентСезоности,
	|	НачисленныйОбъем.КоэффициентФормула,
	|	НачисленныйОбъем.НачалоПериода,
	|	НачисленныйОбъем.НачальныеПоказания,
	|	НачисленныйОбъем.НормаПотребления,
	|	НачисленныйОбъем.ОснованиеПерерасчета,
	|	НачисленныйОбъем.ОснованиеПерерасчетаДата,
	|	НачисленныйОбъем.ОтключатьВНеполивнойСезон,
	|	НачисленныйОбъем.ПлощадьАбонентов,
	|	НачисленныйОбъем.ПлощадьМОП,
	|	НачисленныйОбъем.ПлощадьСобственнаяПоставка,
	|	НачисленныйОбъем.ПовыщающийКоэффициент,
	|	НачисленныйОбъем.ПомещениеРодитель,
	|	НачисленныйОбъем.ПриборЗависимой,
	|	НачисленныйОбъем.РасчетПоФормуле,
	|	НачисленныйОбъем.СниматьНачисленныйСредний,
	|	НачисленныйОбъем.СниматьНачисленныйСреднийЗависимыхТочек,
	|	НачисленныйОбъем.СниматьНачисленныйСреднийПоФормулам,
	|	НачисленныйОбъем.СоставнаяУслуга,
	|	НачисленныйОбъем.СписатьИзНормы,
	|	НачисленныйОбъем.ТарифнаяГруппа,
	|	НачисленныйОбъем.ТочкаУчетаРодитель";
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	ВложенныйЗапрос.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ВложенныйЗапрос.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	ВложенныйЗапрос.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВложенныйЗапрос.ПриборЗависимой КАК ПриборЗависимой,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.СверхНорматива КАК СверхНорматива,
	|	ВложенныйЗапрос.ОбъемНачисленный КАК ОбъемНачисленный,
	|	ЕСТЬNULL(ДокументыПерерасчет.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргПерерасчет.Пустаяссылка)) КАК ДокументПерерасчета,
	|	ЕСТЬNULL(ДокументыПерерасчет.ПометкаУдаления, ЛОЖЬ) КАК ДокументПерерасчетаПометкаУдаления,
	|	ВложенныйЗапрос.СписыватьПоПриборам КАК СписыватьПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеСписанныйСредний.Организация КАК Организация,
	|		НеСписанныйСредний.Район КАК Район,
	|		ВЫБОР
	|			КОГДА НеСписанныйСредний.ЧастныйСектор
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ИНАЧЕ НеСписанныйСредний.Строение
	|		КОНЕЦ КАК МКД,
	|		НеСписанныйСредний.ЧастныйСектор КАК ЧастныйСектор,
	|		НеСписанныйСредний.Строение КАК Строение,
	|		НеСписанныйСредний.Помещение КАК Помещение,
	|		НеСписанныйСредний.ПериодНачисления КАК ПериодНачисления,
	|		НеСписанныйСредний.ТочкаУчета КАК ТочкаУчета,
	|		НеСписанныйСредний.Услуга КАК Услуга,
	|		НеСписанныйСредний.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		НеСписанныйСредний.ЗначениеТарифа КАК ЗначениеТарифа,
	|		НеСписанныйСредний.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|		НеСписанныйСредний.ПриборУчета КАК ПриборУчета,
	|		НеСписанныйСредний.Шкала КАК Шкала,
	|		НеСписанныйСредний.ТарифнаяЗона КАК ТарифнаяЗона,
	|		НеСписанныйСредний.Сумма КАК Сумма,
	|		НеСписанныйСредний.ОбъемУслуги КАК ОбъемУслуги,
	|		НеСписанныйСредний.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|		НеСписанныйСредний.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|		НеСписанныйСредний.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|		НеСписанныйСредний.Поставщик КАК Поставщик,
	|		НеСписанныйСредний.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|		НеСписанныйСредний.ПриборЗависимой КАК ПриборЗависимой,
	|		НеСписанныйСредний.СпособНачисления КАК СпособНачисления,
	|		НеСписанныйСредний.Абонент КАК Абонент,
	|		НеСписанныйСредний.СверхНорматива КАК СверхНорматива,
	|		0 КАК ОбъемНачисленный,
	|		ИСТИНА КАК СписыватьПоПриборам
	|	ИЗ
	|		НеСписанныйСредний КАК НеСписанныйСредний
	|	ГДЕ
	|		(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.Строение, НеСписанныйСредний.Помещение, НеСписанныйСредний.ЧастныйСектор, НеСписанныйСредний.ТочкаУчета, НеСписанныйСредний.Услуга, НеСписанныйСредний.Абонент) В
	|				(ВЫБРАТЬ
	|					НачисленияПоПриборам.Организация,
	|					НачисленияПоПриборам.Район,
	|					НачисленияПоПриборам.Строение,
	|					НачисленияПоПриборам.Помещение,
	|					НачисленияПоПриборам.ЧастныйСектор,
	|					НачисленияПоПриборам.ТочкаУчета,
	|					НачисленияПоПриборам.Услуга,
	|					НачисленияПоПриборам.Абонент
	|				ИЗ
	|					НачисленияПоПриборам КАК НачисленияПоПриборам)
	|		И НЕ НеСписанныйСредний.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НеСписанныйСредний.Организация,
	|		НеСписанныйСредний.Район,
	|		ВЫБОР
	|			КОГДА НеСписанныйСредний.ЧастныйСектор
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ИНАЧЕ НеСписанныйСредний.Строение
	|		КОНЕЦ,
	|		НеСписанныйСредний.ЧастныйСектор,
	|		НеСписанныйСредний.Строение,
	|		НеСписанныйСредний.Помещение,
	|		НеСписанныйСредний.ПериодНачисления,
	|		НеСписанныйСредний.ТочкаУчета,
	|		НеСписанныйСредний.Услуга,
	|		НеСписанныйСредний.НаправлениеИспользованияТУ,
	|		НеСписанныйСредний.ЗначениеТарифа,
	|		НеСписанныйСредний.ТарифнаяГруппа,
	|		НеСписанныйСредний.ПриборУчета,
	|		НеСписанныйСредний.Шкала,
	|		НеСписанныйСредний.ТарифнаяЗона,
	|		НеСписанныйСредний.Сумма,
	|		НеСписанныйСредний.ОбъемУслуги,
	|		НеСписанныйСредний.ОбъемУслугиПотребленный,
	|		НеСписанныйСредний.ОбъемУслугиПотери,
	|		НеСписанныйСредний.ОбъемУслугиПотребленныйПотери,
	|		НеСписанныйСредний.Поставщик,
	|		НеСписанныйСредний.ЗависимаяТочкаУчета,
	|		НеСписанныйСредний.ПриборЗависимой,
	|		НеСписанныйСредний.СпособНачисления,
	|		НеСписанныйСредний.Абонент,
	|		НеСписанныйСредний.СверхНорматива,
	|		0,
	|		ЛОЖЬ
	|	ИЗ
	|		НеСписанныйСредний КАК НеСписанныйСредний
	|	ГДЕ
	|		(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ЧастныйСектор, НеСписанныйСредний.Строение, НеСписанныйСредний.Помещение, НеСписанныйСредний.ТочкаУчета, НеСписанныйСредний.Услуга) В
	|				(ВЫБРАТЬ
	|					НачисленныйОбъем.Организация,
	|					НачисленныйОбъем.Район,
	|					НачисленныйОбъем.ЧастныйСектор,
	|					НачисленныйОбъем.Строение,
	|					НачисленныйОбъем.Помещение,
	|					НачисленныйОбъем.ТочкаУчета,
	|					НачисленныйОбъем.Услуга
	|				ИЗ
	|					НачисленныйОбъем КАК НачисленныйОбъем
	|				ГДЕ
	|					НачисленныйОбъем.СниматьНачисленныйСреднийЗависимыхТочек)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НеСписанныйСредний.Организация,
	|		НеСписанныйСредний.Район,
	|		ВЫБОР
	|			КОГДА НеСписанныйСредний.ЧастныйСектор
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ИНАЧЕ НеСписанныйСредний.Строение
	|		КОНЕЦ,
	|		НеСписанныйСредний.ЧастныйСектор,
	|		НеСписанныйСредний.Строение,
	|		НеСписанныйСредний.Помещение,
	|		НеСписанныйСредний.ПериодНачисления,
	|		НеСписанныйСредний.ТочкаУчета,
	|		НеСписанныйСредний.Услуга,
	|		НеСписанныйСредний.НаправлениеИспользованияТУ,
	|		НеСписанныйСредний.ЗначениеТарифа,
	|		НеСписанныйСредний.ТарифнаяГруппа,
	|		НеСписанныйСредний.ПриборУчета,
	|		НеСписанныйСредний.Шкала,
	|		НеСписанныйСредний.ТарифнаяЗона,
	|		НеСписанныйСредний.Сумма,
	|		НеСписанныйСредний.ОбъемУслуги,
	|		НеСписанныйСредний.ОбъемУслугиПотребленный,
	|		НеСписанныйСредний.ОбъемУслугиПотери,
	|		НеСписанныйСредний.ОбъемУслугиПотребленныйПотери,
	|		НеСписанныйСредний.Поставщик,
	|		НеСписанныйСредний.ЗависимаяТочкаУчета,
	|		НеСписанныйСредний.ПриборЗависимой,
	|		НеСписанныйСредний.СпособНачисления,
	|		НеСписанныйСредний.Абонент,
	|		НеСписанныйСредний.СверхНорматива,
	|		0,
	|		ЛОЖЬ
	|	ИЗ
	|		НеСписанныйСредний КАК НеСписанныйСредний
	|	ГДЕ
	|		(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ЧастныйСектор, НеСписанныйСредний.Строение, НеСписанныйСредний.Помещение, НеСписанныйСредний.ТочкаУчета, НеСписанныйСредний.Услуга) В
	|				(ВЫБРАТЬ
	|					НачисленныйОбъем.Организация,
	|					НачисленныйОбъем.Район,
	|					НачисленныйОбъем.ЧастныйСектор,
	|					НачисленныйОбъем.Строение,
	|					НачисленныйОбъем.Помещение,
	|					НачисленныйОбъем.ЗависимаяТочкаУчета,
	|					НачисленныйОбъем.Услуга
	|				ИЗ
	|					НачисленныйОбъем КАК НачисленныйОбъем
	|				ГДЕ
	|					НЕ НачисленныйОбъем.СниматьНачисленныйСреднийПоФормулам)
	|		И НеСписанныйСредний.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоФормуламРасчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НеСписанныйСредний.Организация,
	|		НеСписанныйСредний.Район,
	|		ВЫБОР
	|			КОГДА НеСписанныйСредний.ЧастныйСектор
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ИНАЧЕ НеСписанныйСредний.Строение
	|		КОНЕЦ,
	|		НеСписанныйСредний.ЧастныйСектор,
	|		НеСписанныйСредний.Строение,
	|		НеСписанныйСредний.Помещение,
	|		НеСписанныйСредний.ПериодНачисления,
	|		НеСписанныйСредний.ТочкаУчета,
	|		НеСписанныйСредний.Услуга,
	|		НеСписанныйСредний.НаправлениеИспользованияТУ,
	|		НеСписанныйСредний.ЗначениеТарифа,
	|		НеСписанныйСредний.ТарифнаяГруппа,
	|		НеСписанныйСредний.ПриборУчета,
	|		НеСписанныйСредний.Шкала,
	|		НеСписанныйСредний.ТарифнаяЗона,
	|		НеСписанныйСредний.Сумма,
	|		НеСписанныйСредний.ОбъемУслуги,
	|		НеСписанныйСредний.ОбъемУслугиПотребленный,
	|		НеСписанныйСредний.ОбъемУслугиПотери,
	|		НеСписанныйСредний.ОбъемУслугиПотребленныйПотери,
	|		НеСписанныйСредний.Поставщик,
	|		НеСписанныйСредний.ЗависимаяТочкаУчета,
	|		НеСписанныйСредний.ПриборЗависимой,
	|		НеСписанныйСредний.СпособНачисления,
	|		НеСписанныйСредний.Абонент,
	|		НеСписанныйСредний.СверхНорматива,
	|		0,
	|		ЛОЖЬ
	|	ИЗ
	|		НеСписанныйСредний КАК НеСписанныйСредний
	|	ГДЕ
	|		(НеСписанныйСредний.Организация, НеСписанныйСредний.Район, НеСписанныйСредний.ЧастныйСектор, НеСписанныйСредний.Строение, НеСписанныйСредний.Помещение, НеСписанныйСредний.Услуга) В
	|				(ВЫБРАТЬ
	|					НачисленныйОбъем.Организация,
	|					НачисленныйОбъем.Район,
	|					НачисленныйОбъем.ЧастныйСектор,
	|					НачисленныйОбъем.Строение,
	|					НачисленныйОбъем.Помещение,
	|					НачисленныйОбъем.Услуга
	|				ИЗ
	|					НачисленныйОбъем КАК НачисленныйОбъем
	|				ГДЕ
	|					НачисленныйОбъем.ЕстьСреднийПоВсемТочкамУслуги)
	|		И НеСписанныйСредний.СпособНачисления В (ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоНормативу), ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыПерерасчет КАК ДокументыПерерасчет
	|		ПО ВложенныйЗапрос.Район = ДокументыПерерасчет.Район
	|			И ВложенныйЗапрос.МКД = ДокументыПерерасчет.МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ТочкаУчета,
	|	Услуга,
	|	ПериодНачисления УБЫВ,
	|	СверхНорматива УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоПриборам.Организация КАК Организация,
	|	НачисленияПоПриборам.Район КАК Район,
	|	ВЫБОР
	|		КОГДА НачисленияПоПриборам.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ НачисленияПоПриборам.Строение
	|	КОНЕЦ КАК МКД,
	|	НачисленияПоПриборам.ЧастныйСектор КАК ЧастныйСектор,
	|	НачисленияПоПриборам.Строение КАК Строение,
	|	НачисленияПоПриборам.Помещение КАК Помещение,
	|	НачисленияПоПриборам.Абонент КАК Абонент,
	|	НачисленияПоПриборам.Услуга КАК Услуга,
	|	НачисленияПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|	НачисленияПоПриборам.СпособНачисления КАК СпособНачисления,
	|	НачисленияПоПриборам.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	НачисленияПоПриборам.Измеритель КАК Измеритель,
	|	НачисленияПоПриборам.ПриборУчета КАК ПриборУчета,
	|	НачисленияПоПриборам.Шкала КАК Шкала,
	|	НачисленияПоПриборам.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НачисленияПоПриборам.ЗначениеТарифа КАК ЗначениеТарифа,
	|	НачисленияПоПриборам.Поставщик КАК Поставщик,
	|	НачисленияПоПриборам.ПериодРасчета КАК ПериодРасчета,
	|	НачисленияПоПриборам.ПериодНачисления КАК ПериодНачисления,
	|	НачисленияПоПриборам.СверхНорматива КАК СверхНорматива,
	|	НачисленияПоПриборам.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НачисленияПоПриборам.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	НачисленияПоПриборам.ОбъемУслуги КАК ОбъемУслуги,
	|	НачисленияПоПриборам.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	НачисленияПоПриборам.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	НачисленияПоПриборам.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	НачисленияПоПриборам.ОбъемУслугиПотребленныйСоцНорма КАК ОбъемУслугиПотребленныйСоцНорма,
	|	НачисленияПоПриборам.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	НачисленияПоПриборам.Сумма КАК Сумма,
	|	НачисленияПоПриборам.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	НачисленияПоПриборам.ВидБлагоустройства КАК ВидБлагоустройства,
	|	НачисленияПоПриборам.ВидДифференцированности КАК ВидДифференцированности,
	|	НачисленияПоПриборам.ВидПлощади КАК ВидПлощади,
	|	НачисленияПоПриборам.ДатаПоверки КАК ДатаПоверки,
	|	НачисленияПоПриборам.ЕстьСреднийПоВсемТочкамУслуги КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	НачисленияПоПриборам.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	НачисленияПоПриборам.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	НачисленияПоПриборам.ЗначениеПлощади КАК ЗначениеПлощади,
	|	НачисленияПоПриборам.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	НачисленияПоПриборам.ЗначениеСоциальнойНормыРасчетныйСпособ КАК ЗначениеСоциальнойНормыРасчетныйСпособ,
	|	НачисленияПоПриборам.ЗначениеТарифаРЭК КАК ЗначениеТарифаРЭК,
	|	НачисленияПоПриборам.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	НачисленияПоПриборам.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	НачисленияПоПриборам.КлючНорматива КАК КлючНорматива,
	|	НачисленияПоПриборам.КлючПомещения КАК КлючПомещения,
	|	НачисленияПоПриборам.КлючСоцНорматива КАК КлючСоцНорматива,
	|	НачисленияПоПриборам.КоличествоИзмеретелейНаправления КАК КоличествоИзмеретелейНаправления,
	|	НачисленияПоПриборам.КоличествоКомнат КАК КоличествоКомнат,
	|	НачисленияПоПриборам.КоличествоПроживающих КАК КоличествоПроживающих,
	|	НачисленияПоПриборам.КоличествоПрописанных КАК КоличествоПрописанных,
	|	НачисленияПоПриборам.КоличествоСобственников КАК КоличествоСобственников,
	|	НачисленияПоПриборам.КонецПериода КАК КонецПериода,
	|	НачисленияПоПриборам.КонечныеПоказания КАК КонечныеПоказания,
	|	НачисленияПоПриборам.КоэффициентНорматива КАК КоэффициентНорматива,
	|	НачисленияПоПриборам.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	НачисленияПоПриборам.КоэффициентПУ КАК КоэффициентПУ,
	|	НачисленияПоПриборам.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	НачисленияПоПриборам.КоэффициентСезоности КАК КоэффициентСезоности,
	|	НачисленияПоПриборам.КоэффициентФормула КАК КоэффициентФормула,
	|	НачисленияПоПриборам.НачалоПериода КАК НачалоПериода,
	|	НачисленияПоПриборам.НачальныеПоказания КАК НачальныеПоказания,
	|	НачисленияПоПриборам.НормаПотребления КАК НормаПотребления,
	|	НачисленияПоПриборам.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	НачисленияПоПриборам.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	НачисленияПоПриборам.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	НачисленияПоПриборам.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	НачисленияПоПриборам.ПлощадьМОП КАК ПлощадьМОП,
	|	НачисленияПоПриборам.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	НачисленияПоПриборам.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	НачисленияПоПриборам.ПомещениеРодитель КАК ПомещениеРодитель,
	|	НачисленияПоПриборам.ПриборЗависимой КАК ПриборЗависимой,
	|	НачисленияПоПриборам.РасчетПоФормуле КАК РасчетПоФормуле,
	|	НачисленияПоПриборам.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	НачисленияПоПриборам.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	НачисленияПоПриборам.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	НачисленияПоПриборам.СоставнаяУслуга КАК СоставнаяУслуга,
	|	НачисленияПоПриборам.СписатьИзНормы КАК СписатьИзНормы,
	|	НачисленияПоПриборам.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	НачисленияПоПриборам.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель
	|ИЗ
	|	НачисленияПоПриборам КАК НачисленияПоПриборам
	|ГДЕ
	|	(НачисленияПоПриборам.Организация, НачисленияПоПриборам.Район, НачисленияПоПриборам.Строение, НачисленияПоПриборам.Помещение, НачисленияПоПриборам.ЧастныйСектор, НачисленияПоПриборам.ТочкаУчета, НачисленияПоПриборам.Услуга, НачисленияПоПриборам.Шкала, НачисленияПоПриборам.Абонент) В
	|			(ВЫБРАТЬ
	|				НеСписанныйСредний.Организация,
	|				НеСписанныйСредний.Район,
	|				НеСписанныйСредний.Строение,
	|				НеСписанныйСредний.Помещение,
	|				НеСписанныйСредний.ЧастныйСектор,
	|				НеСписанныйСредний.ТочкаУчета,
	|				НеСписанныйСредний.Услуга,
	|				НеСписанныйСредний.Шкала,
	|				НеСписанныйСредний.Абонент
	|			ИЗ
	|				НеСписанныйСредний КАК НеСписанныйСредний)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачисленияПоПриборам.Организация,
	|	НачисленияПоПриборам.Район,
	|	МКД,
	|	НачисленияПоПриборам.ЧастныйСектор,
	|	НачисленияПоПриборам.Строение,
	|	НачисленияПоПриборам.Помещение,
	|	НачисленияПоПриборам.ТочкаУчета,
	|	НачисленияПоПриборам.Услуга";
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Результат  						= Запрос.ВыполнитьПакет();  
	Возврат Новый Структура("НачисленныйОбъем, СписатьИзСреднего",Результат[1], Результат[0]);
КонецФункции

Функция РезультатОтменитьКорректировкуСезонныхУслуг(ПериодНачисления,Организация,Район,Строение)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Строение",			Строение);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргПерерасчет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	НЕ энргПерерасчет.ПометкаУдаления
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг)
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(энргПерерасчет.Дата, МЕСЯЦ) = &ПериодНачисления
	|	И энргПерерасчет.Строение = &Строение";
	
	Если Строение = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргПерерасчет.Строение = &Строение","");
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

#КонецОбласти

#Область СнятьСредниеНачисленияМКД_ВспомогательныеПроцедурыИФункции

Процедура ПрочитатьНеСписанныйСреднийМКД(МВТ,Организация,Район, МКД, НачалоПериодаРасчета,ТаблицаПриемник = Неопределено)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 	=
	"ВЫБРАТЬ
	|	энргНачисленныйСреднийОбъемОстатки.Район КАК Район,
	|	энргНачисленныйСреднийОбъемОстатки.МКД КАК МКД,
	|	энргНачисленныйСреднийОбъемОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргНачисленныйСреднийОбъемОстатки.ТочкаУчета КАК ТочкаУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Услуга КАК Услуга,
	|	энргНачисленныйСреднийОбъемОстатки.ПриборУчета КАК ПриборУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Шкала КАК Шкала,
	|	энргНачисленныйСреднийОбъемОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргНачисленныйСреднийОбъемОстатки.Поставщик КАК Поставщик,
	|	энргНачисленныйСреднийОбъемОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги,
	|	энргНачисленныйСреднийОбъемОстатки.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ НеСписанныйСредний
	|ИЗ
	|	РегистрНакопления.энргНачисленныйСреднийОбъемМКД.Остатки(
	|			&НачалоПериодаРасчетаГраница,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргНачисленныйСреднийОбъемОстатки";
	
	Если ЗначениеЗаполнено(МКД) тогда
		Запрос.УстановитьПараметр("МКД",				МКД);
	иначе 		
		Текст 		= СтрЗаменить(Текст,"И МКД = &МКД","");	
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаГраница",Новый Граница(НачалоПериодаРасчета,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район",							Район);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.Текст 			= Текст;
	
	Если ТаблицаПриемник = Неопределено тогда
		Запрос.Выполнить();
	иначе
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"ПОМЕСТИТЬ НеСписанныйСредний","");
		Результат  			= Запрос.Выполнить();
		Выборка 			= Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПриемник.добавить(),Выборка);
		КонецЦикла;  		 
	КонецЕсли;
КонецПроцедуры

Функция РезультатЗапросаПерерасчетСреднегоМКД(МВТ,Организация,ПериодНачисления,Район,МКД,НачисленныйСреднийОбъем=Неопределено)
	
	ТекстРазделить 						= " 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Текст 	= "";
	Если НачисленныйСреднийОбъем <> Неопределено тогда
		Текст 	=
		"ВЫБРАТЬ
		|	НеСписанныйСредний.Район,
		|	НеСписанныйСредний.МКД,
		|	НеСписанныйСредний.ПериодНачисления,
		|	НеСписанныйСредний.ТочкаУчета,
		|	НеСписанныйСредний.Услуга,
		|	НеСписанныйСредний.ПриборУчета,
		|	НеСписанныйСредний.ОбъемУслуги,
		|	НеСписанныйСредний.Поставщик
		|ПОМЕСТИТЬ НеСписанныйСреднийБезГруппировки
		|ИЗ
		|	&НачисленныйСреднийОбъем КАК НеСписанныйСредний
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеСписанныйСреднийБезГруппировки.Район,
		|	НеСписанныйСреднийБезГруппировки.МКД,
		|	НеСписанныйСреднийБезГруппировки.ПериодНачисления,
		|	НеСписанныйСреднийБезГруппировки.ТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.Услуга,
		|	НеСписанныйСреднийБезГруппировки.ПриборУчета,
		|	СУММА(НеСписанныйСреднийБезГруппировки.ОбъемУслуги) КАК ОбъемУслуги,
		|	НеСписанныйСреднийБезГруппировки.Поставщик
		|ПОМЕСТИТЬ НеСписанныйСредний
		|ИЗ
		|	НеСписанныйСреднийБезГруппировки КАК НеСписанныйСреднийБезГруппировки
		|
		|СГРУППИРОВАТЬ ПО
		|	НеСписанныйСреднийБезГруппировки.Район,
		|	НеСписанныйСреднийБезГруппировки.МКД,
		|	НеСписанныйСреднийБезГруппировки.ПериодНачисления,
		|	НеСписанныйСреднийБезГруппировки.ТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.Услуга,
		|	НеСписанныйСреднийБезГруппировки.ПриборУчета,
		|	НеСписанныйСреднийБезГруппировки.Поставщик";
		
		Текст = Текст + ТекстРазделить;
	КонецЕсли;  
	
	Текст 	=Текст + 
	"ВЫБРАТЬ
	|	НеСписанныйСредний.Район КАК Район,
	|	НеСписанныйСредний.МКД КАК МКД,
	|	НеСписанныйСредний.ПериодНачисления КАК ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета КАК ТочкаУчета,
	|	НеСписанныйСредний.Услуга КАК Услуга,
	|	НеСписанныйСредний.ПриборУчета КАК ПриборУчета,
	|	НеСписанныйСредний.Шкала КАК Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НеСписанныйСредний.ОбъемУслуги КАК ОбъемУслуги,
	|	МИНИМУМ(энргПредоставленныеПоказания.ДатаРегистратора) КАК ДатаРегистратора,
	|	НеСписанныйСредний.Поставщик КАК Поставщик,
	|	НеСписанныйСредний.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДляСписанияМинДата
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НеСписанныйСредний КАК НеСписанныйСредний
	|		ПО энргПредоставленныеПоказания.Район = НеСписанныйСредний.Район
	|			И энргПредоставленныеПоказания.МКД = НеСписанныйСредний.МКД
	|			И энргПредоставленныеПоказания.ПриборУчета = НеСписанныйСредний.ПриборУчета
	|			И энргПредоставленныеПоказания.Шкала = НеСписанныйСредний.Шкала
	|			И энргПредоставленныеПоказания.ТарифнаяЗона = НеСписанныйСредний.ТарифнаяЗона
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.МКД = &МКД)
	|			И (энргПредоставленныеПоказания.ПоказанияТекущегоПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	НеСписанныйСредний.Район,
	|	НеСписанныйСредний.МКД,
	|	НеСписанныйСредний.ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета,
	|	НеСписанныйСредний.Услуга,
	|	НеСписанныйСредний.ПриборУчета,
	|	НеСписанныйСредний.Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона,
	|	НеСписанныйСредний.ОбъемУслуги,
	|	НеСписанныйСредний.Поставщик,
	|	НеСписанныйСредний.СпособНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписанияМинДата.Район КАК Район,
	|	ДанныеДляСписанияМинДата.МКД КАК МКД,
	|	ДанныеДляСписанияМинДата.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписанияМинДата.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписанияМинДата.Услуга КАК Услуга,
	|	ДанныеДляСписанияМинДата.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписанияМинДата.Шкала КАК Шкала,
	|	ДанныеДляСписанияМинДата.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписанияМинДата.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписанияМинДата.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(энргПредоставленныеПоказания.ДокРегистратор) КАК ДокРегистратор,
	|	ДанныеДляСписанияМинДата.Поставщик КАК Поставщик,
	|	ДанныеДляСписанияМинДата.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДляСписанияМинРегистратор
	|ИЗ
	|	ДанныеДляСписанияМинДата КАК ДанныеДляСписанияМинДата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказания
	|		ПО ДанныеДляСписанияМинДата.Район = энргПредоставленныеПоказания.Район
	|			И ДанныеДляСписанияМинДата.МКД = энргПредоставленныеПоказания.МКД
	|			И ДанныеДляСписанияМинДата.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И ДанныеДляСписанияМинДата.Шкала = энргПредоставленныеПоказания.Шкала
	|			И ДанныеДляСписанияМинДата.ТарифнаяЗона = энргПредоставленныеПоказания.ТарифнаяЗона
	|			И ДанныеДляСписанияМинДата.ДатаРегистратора = энргПредоставленныеПоказания.ДатаРегистратора
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.МКД = &МКД)
	|			И (энргПредоставленныеПоказания.ПоказанияТекущегоПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляСписанияМинДата.Район,
	|	ДанныеДляСписанияМинДата.МКД,
	|	ДанныеДляСписанияМинДата.ПериодНачисления,
	|	ДанныеДляСписанияМинДата.ТочкаУчета,
	|	ДанныеДляСписанияМинДата.Услуга,
	|	ДанныеДляСписанияМинДата.ПриборУчета,
	|	ДанныеДляСписанияМинДата.Шкала,
	|	ДанныеДляСписанияМинДата.ТарифнаяЗона,
	|	ДанныеДляСписанияМинДата.ОбъемУслуги,
	|	ДанныеДляСписанияМинДата.ДатаРегистратора,
	|	ДанныеДляСписанияМинДата.Поставщик,
	|	ДанныеДляСписанияМинДата.СпособНачисления 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписанияМинРегистратор.Район КАК Район,
	|	ДанныеДляСписанияМинРегистратор.МКД КАК МКД,
	|	ДанныеДляСписанияМинРегистратор.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписанияМинРегистратор.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.Услуга КАК Услуга,
	|	ДанныеДляСписанияМинРегистратор.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписанияМинРегистратор.Шкала КАК Шкала,
	|	ДанныеДляСписанияМинРегистратор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписанияМинРегистратор.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписанияМинРегистратор.ДокРегистратор КАК ДокументОснование,
	|	МАКСИМУМ(ЕСТЬNULL(энргПерерасчет.Ссылка, ЗНАЧЕНИЕ(Документ.энргПерерасчетМКД.Пустаяссылка))) КАК ДокументПерерасчета,
	|	ДанныеДляСписанияМинРегистратор.Поставщик КАК Поставщик,
	|	ДанныеДляСписанияМинРегистратор.СпособНачисления КАК СпособНачисления,
	|	ДанныеДляСписанияМинРегистратор.ДатаРегистратора КАК ДатаДокументаОснования
	|ИЗ
	|	ДанныеДляСписанияМинРегистратор КАК ДанныеДляСписанияМинРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргПерерасчетМКД КАК энргПерерасчет
	|		ПО ДанныеДляСписанияМинРегистратор.Район = энргПерерасчет.Район
	|			И (НАЧАЛОПЕРИОДА(энргПерерасчет.Дата, МЕСЯЦ) = &ПериодНачисления)
	|			И (энргПерерасчет.Организация = &Организация)
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляСписанияМинРегистратор.Район,
	|	ДанныеДляСписанияМинРегистратор.МКД,
	|	ДанныеДляСписанияМинРегистратор.ПериодНачисления,
	|	ДанныеДляСписанияМинРегистратор.ТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.Услуга,
	|	ДанныеДляСписанияМинРегистратор.ПриборУчета,
	|	ДанныеДляСписанияМинРегистратор.Шкала,
	|	ДанныеДляСписанияМинРегистратор.ТарифнаяЗона,
	|	ДанныеДляСписанияМинРегистратор.ОбъемУслуги,
	|	ДанныеДляСписанияМинРегистратор.ДокРегистратор,
	|	ДанныеДляСписанияМинРегистратор.Поставщик,
	|	ДанныеДляСписанияМинРегистратор.СпособНачисления,
	|	ДанныеДляСписанияМинРегистратор.ДатаРегистратора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД"; 	
	
	Если НачисленныйСреднийОбъем <> Неопределено тогда
		
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ ДанныеДляСписанияМинДата";
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ ДанныеДляСписанияМинРегистратор";
		
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ НеСписанныйСредний"; 						
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ НеСписанныйСреднийБезГруппировки"; 		
	КонецЕсли;  
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",			ПериодНачисления);
	Запрос.УстановитьПараметр("Район",						Район);
	Запрос.УстановитьПараметр("НачисленныйСреднийОбъем", 	НачисленныйСреднийОбъем);
	Если ЗначениеЗаполнено(МКД) тогда
		Запрос.УстановитьПараметр("МКД",					МКД);		
	иначе 		
		Текст 						= СтрЗаменить(Текст,"И МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.МКД = &МКД)","");
	КонецЕсли;
	
	Запрос.Текст 					= Текст;
	Результат  						= Запрос.Выполнить();  
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаВспомогательныеДанныеДляКорректировкиПотребленияСезонныхУслуг()
	
Текст  =
	"ВЫБРАТЬ
	|	НастройкиВыполненияГодовойКорректировки.Организация КАК Организация,
	|	НастройкиВыполненияГодовойКорректировки.Район КАК Район,
	|	НастройкиВыполненияГодовойКорректировки.МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА НастройкиВыполненияГодовойКорректировки.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, ГОД, -1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&НачалоГода, ГОД, -1), МЕСЯЦ, МЕСЯЦ(НастройкиВыполненияГодовойКорректировки.НачалоПериода) - 1)
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА НастройкиВыполненияГодовойКорректировки.КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоГода, ГОД, -1), ГОД)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&НачалоГода, ГОД, -1), МЕСЯЦ, МЕСЯЦ(НастройкиВыполненияГодовойКорректировки.КонецПериода) - 1)
	|	КОНЕЦ КАК КонецПериода,
	|	НастройкиВыполненияГодовойКорректировки.Месяц КАК Месяц
	|ПОМЕСТИТЬ НастройкиВыполненияГодовойКорректировки
	|ИЗ
	|	РегистрСведений.энргНастройкиВыполненияГодовойКорректировки.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (МКД = &МКД
	|					ИЛИ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))) КАК НастройкиВыполненияГодовойКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаСезонностиУслуг.МКД КАК Строение,
	|	энргНастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	энргНастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргНастройкаСезонностиУслуг.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ УслугиКорректироватьГодовойОбъемНабор
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|				И НЕ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				И МКД = &МКД) КАК энргНастройкаСезонностиУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНастройкаСезонностиУслуг.МКД,
	|	энргНастройкаСезонностиУслуг.Услуга,
	|	энргНастройкаСезонностиУслуг.НеПрименятьСезонность,
	|	энргНастройкаСезонностиУслуг.КорректироватьГодовойОбъем,
	|	1
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|				И МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)) КАК энргНастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ УслугиКорректироватьГодовойОбъем
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиКорректироватьГодовойОбъемНабор.Строение КАК Строение,
	|		УслугиКорректироватьГодовойОбъемНабор.Услуга КАК Услуга,
	|		МИНИМУМ(УслугиКорректироватьГодовойОбъемНабор.Приоритет) КАК Приоритет
	|	ИЗ
	|		УслугиКорректироватьГодовойОбъемНабор КАК УслугиКорректироватьГодовойОбъемНабор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УслугиКорректироватьГодовойОбъемНабор.Строение,
	|		УслугиКорректироватьГодовойОбъемНабор.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъемНабор КАК УслугиКорректироватьГодовойОбъемНабор
	|		ПО ВложенныйЗапрос.Строение = УслугиКорректироватьГодовойОбъемНабор.Строение
	|			И ВложенныйЗапрос.Услуга = УслугиКорректироватьГодовойОбъемНабор.Услуга
	|			И ВложенныйЗапрос.Приоритет = УслугиКорректироватьГодовойОбъемНабор.Приоритет
	|ГДЕ
	|	УслугиКорректироватьГодовойОбъемНабор.НеПрименятьСезонность
	|	И УслугиКорректироватьГодовойОбъемНабор.КорректироватьГодовойОбъем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.КорректировкаТекущегоПериода КАК КорректировкаТекущегоПериода,
	|	ВложенныйЗапрос.НачалоПериода КАК НачалоПериода,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода
	|ПОМЕСТИТЬ ТочкиДляКорректировкиТекущийПериод
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|		ВложенныйЗапрос.Строение КАК Строение,
	|		ВложенныйЗапрос.Помещение КАК Помещение,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.КорректировкаТекущегоПериода КАК КорректировкаТекущегоПериода,
	|		ЕСТЬNULL(НастройкиВыполненияГодовойКорректировкиМКД.НачалоПериода, ЕСТЬNULL(НастройкиВыполненияГодовойКорректировкиРайон.НачалоПериода, ДОБАВИТЬКДАТЕ(&НачалоГода, ГОД, -1))) КАК НачалоПериода,
	|		ЕСТЬNULL(НастройкиВыполненияГодовойКорректировкиМКД.КонецПериода, ЕСТЬNULL(НастройкиВыполненияГодовойКорректировкиРайон.КонецПериода, КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоГода, ГОД, -1), ГОД))) КАК КонецПериода
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация КАК Организация,
	|			энргСтабильныеПериоды.Район КАК Район,
	|			энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение КАК Строение,
	|			энргСтабильныеПериоды.Помещение КАК Помещение,
	|			энргСтабильныеПериоды.Абонент КАК Абонент,
	|			энргСтабильныеПериоды.Услуга КАК Услуга,
	|			ИСТИНА КАК КорректировкаТекущегоПериода
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъем КАК УслугиКорректироватьГодовойОбъем
	|				ПО (ВЫБОР
	|						КОГДА УслугиКорректироватьГодовойОбъем.Приоритет = 1
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ 
	|							ВЫБОР
	|								КОГДА энргСтабильныеПериоды.ЧастныйСектор
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПУстаяСсылка)
	|								ИНАЧЕ энргСтабильныеПериоды.Строение
	|							КОНЕЦ = УслугиКорректироватьГодовойОбъем.Строение
	|					КОНЕЦ)
	|					И энргСтабильныеПериоды.Услуга = УслугиКорректироватьГодовойОбъем.Услуга
	|					И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|					И (энргСтабильныеПериоды.Организация = &Организация)
	|					И (энргСтабильныеПериоды.Район = &Район)
	|					И (энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)
	|					И (энргСтабильныеПериоды.Строение = &Строение)
	|					И (энргСтабильныеПериоды.Помещение = &Помещение)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Абонент,
	|			энргСтабильныеПериоды.Услуга
	|		
	|		ИМЕЮЩИЕ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргСтабильныеПериоды.УслугаПодключена) > 1
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.Район,
	|			ВложенныйЗапрос.ЧастныйСектор,
	|			ВложенныйЗапрос.Строение,
	|			ВложенныйЗапрос.Помещение,
	|			ВложенныйЗапрос.Абонент,
	|			ВложенныйЗапрос.Услуга,
	|			ЛОЖЬ
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргСтабильныеПериоды.Организация КАК Организация,
	|				энргСтабильныеПериоды.Район КАК Район,
	|				энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|				энргСтабильныеПериоды.Строение КАК Строение,
	|				энргСтабильныеПериоды.Помещение КАК Помещение,
	|				энргСтабильныеПериоды.Услуга КАК Услуга,
	|				энргСтабильныеПериоды.Абонент КАК Абонент
	|			ИЗ
	|				РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|					ЛЕВОЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъемНабор КАК УслугиКорректироватьГодовойОбъемНабор
	|					ПО энргСтабильныеПериоды.Услуга = УслугиКорректироватьГодовойОбъемНабор.Услуга
	|						И (ВЫБОР
	|							КОГДА энргСтабильныеПериоды.ЧастныйСектор
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПУстаяСсылка)
	|							ИНАЧЕ энргСтабильныеПериоды.Строение
	|						КОНЕЦ = УслугиКорректироватьГодовойОбъемНабор.Строение)
	|			ГДЕ
	|				энргСтабильныеПериоды.Организация = &Организация
	|				И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|				И энргСтабильныеПериоды.Район = &Район
	|				И энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор
	|				И энргСтабильныеПериоды.Строение = &Строение
	|				И энргСтабильныеПериоды.Помещение = &Помещение
	|				И энргСтабильныеПериоды.НомерПозиции = 0
	|				И УслугиКорректироватьГодовойОбъемНабор.Строение ЕСТЬ NULL) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъем КАК УслугиКорректироватьГодовойОбъем
	|				ПО ВложенныйЗапрос.Услуга = УслугиКорректироватьГодовойОбъем.Услуга
	|					И (УслугиКорректироватьГодовойОбъем.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Абонент,
	|			энргСтабильныеПериоды.Услуга,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиКорректироватьГодовойОбъем КАК УслугиКорректироватьГодовойОбъем
	|				ПО (энргСтабильныеПериоды.Организация = &Организация)
	|					И (энргСтабильныеПериоды.ПериодНачисления = НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД))
	|					И (энргСтабильныеПериоды.Район = &Район)
	|					И (энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)
	|					И (энргСтабильныеПериоды.Строение = &Строение)
	|					И (энргСтабильныеПериоды.Помещение = &Помещение)
	|					И (энргСтабильныеПериоды.НомерПозиции = 0)
	|					И (энргСтабильныеПериоды.УслугаПодключена)
	|					И (ВЫБОР
	|						КОГДА энргСтабильныеПериоды.ЧастныйСектор
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПУстаяСсылка)
	|						ИНАЧЕ энргСтабильныеПериоды.Строение
	|					КОНЕЦ = УслугиКорректироватьГодовойОбъем.Строение)
	|					И энргСтабильныеПериоды.Услуга = УслугиКорректироватьГодовойОбъем.Услуга) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВыполненияГодовойКорректировки КАК НастройкиВыполненияГодовойКорректировкиМКД
	|			ПО ВложенныйЗапрос.Организация = НастройкиВыполненияГодовойКорректировкиМКД.Организация
	|				И ВложенныйЗапрос.Район = НастройкиВыполненияГодовойКорректировкиМКД.Район
	|				И (ВЫБОР
	|					КОГДА ВложенныйЗапрос.ЧастныйСектор
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ИНАЧЕ ВложенныйЗапрос.Строение
	|				КОНЕЦ = НастройкиВыполненияГодовойКорректировкиМКД.МКД)
	|				И (НЕ НастройкиВыполненияГодовойКорректировкиМКД.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|			ЛЕВОЕ СОЕДИНЕНИЕ НастройкиВыполненияГодовойКорректировки КАК НастройкиВыполненияГодовойКорректировкиРайон
	|			ПО ВложенныйЗапрос.Организация = НастройкиВыполненияГодовойКорректировкиРайон.Организация
	|				И ВложенныйЗапрос.Район = НастройкиВыполненияГодовойКорректировкиРайон.Район
	|				И (НастройкиВыполненияГодовойКорректировкиРайон.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ВложенныйЗапрос.КорректировкаТекущегоПериода
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЕСТЬNULL(НастройкиВыполненияГодовойКорректировкиМКД.Месяц, ЕСТЬNULL(НастройкиВыполненияГодовойКорректировкиРайон.Месяц, 1)) = МЕСЯЦ(&ПериодНАчисления)
	|			КОНЕЦ) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.СуммаПотребленный - ВложенныйЗапрос.Сумма КАК СуммаКорректировки,
	|	&ЗавершениеОП КАК ЗавершениеОП,
	|	ВложенныйЗапрос.ОбъемУслугиПотребленный - ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа
	|ПОМЕСТИТЬ КорректируемыеОбъемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргОбъемНачисленийОбороты.ЧастныйСектор КАК ЧастныйСектор,
	|		энргОбъемНачисленийОбороты.Строение КАК Строение,
	|		энргОбъемНачисленийОбороты.Помещение КАК Помещение,
	|		энргОбъемНачисленийОбороты.Абонент КАК Абонент,
	|		энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|		энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|		энргОбъемНачисленийОбороты.ЗначениеТарифа КАК ЗначениеТарифа,
	|		СУММА(энргОбъемНачисленийОбороты.СуммаОборот) КАК Сумма,
	|		СУММА(ВЫБОР
	|				КОГДА энргОбъемНачисленийОбороты.НеПрименятьСезонность
	|						И НЕ энргОбъемНачисленийОбороты.БылУстановленныйПриборВЭтомГоду
	|						И энргОбъемНачисленийОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)
	|					ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиОборот
	|				КОГДА энргОбъемНачисленийОбороты.НеПрименятьСезонность
	|						И НЕ энргОбъемНачисленийОбороты.БылУстановленныйПриборВЭтомГоду
	|						И энргОбъемНачисленийОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|					ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиОборот
	|				ИНАЧЕ энргОбъемНачисленийОбороты.ОбъемУслугиПотребленныйОборот
	|			КОНЕЦ * энргОбъемНачисленийОбороты.ЗначениеТарифа) КАК СуммаПотребленный,
	|		СУММА(энргОбъемНачисленийОбороты.ОбъемУслугиОборот) КАК ОбъемУслуги,
	|		СУММА(ВЫБОР
	|				КОГДА энргОбъемНачисленийОбороты.НеПрименятьСезонность
	|						И НЕ энргОбъемНачисленийОбороты.БылУстановленныйПриборВЭтомГоду
	|					ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиОборот
	|				ИНАЧЕ энргОбъемНачисленийОбороты.ОбъемУслугиПотребленныйОборот
	|			КОНЕЦ) КАК ОбъемУслугиПотребленный
	|	ИЗ
	|		РегистрНакопления.энргОбъемНачислений.Обороты(
	|				&НачалоГода,
	|				КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ),
	|				Год,
	|				Организация = &Организация
	|					И Район = &Район
	|					И НЕ(ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)
	|							И СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг))
	|					И ЧастныйСектор = &ЧастныйСектор
	|					И Строение = &Строение
	|					И Помещение = &Помещение) КАК энргОбъемНачисленийОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиДляКорректировкиТекущийПериод КАК ТочкиДляКорректировки
	|			ПО энргОбъемНачисленийОбороты.ЧастныйСектор = ТочкиДляКорректировки.ЧастныйСектор
	|				И энргОбъемНачисленийОбороты.Строение = ТочкиДляКорректировки.Строение
	|				И энргОбъемНачисленийОбороты.Помещение = ТочкиДляКорректировки.Помещение
	|				И (ВЫБОР
	|					КОГДА НЕ ТочкиДляКорректировки.Абонент ЕСТЬ NULL
	|						ТОГДА энргОбъемНачисленийОбороты.Абонент = ТочкиДляКорректировки.Абонент
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ)
	|				И энргОбъемНачисленийОбороты.Услуга = ТочкиДляКорректировки.Услуга
	|				И (ТочкиДляКорректировки.КорректировкаТекущегоПериода)
	|				И (энргОбъемНачисленийОбороты.ОбъемУслугиОборот <> энргОбъемНачисленийОбороты.ОбъемУслугиПотребленныйОборот)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргОбъемНачисленийОбороты.ЧастныйСектор,
	|		энргОбъемНачисленийОбороты.Строение,
	|		энргОбъемНачисленийОбороты.Помещение,
	|		энргОбъемНачисленийОбороты.Абонент,
	|		энргОбъемНачисленийОбороты.Услуга,
	|		энргОбъемНачисленийОбороты.Поставщик,
	|		энргОбъемНачисленийОбороты.ЗначениеТарифа
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВложенныйЗапрос.ЧастныйСектор,
	|		ВложенныйЗапрос.Строение,
	|		ВложенныйЗапрос.Помещение,
	|		ВложенныйЗапрос.Абонент,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.Поставщик,
	|		ВложенныйЗапрос.ЗначениеТарифа,
	|		ВложенныйЗапрос.Сумма,
	|		ВложенныйЗапрос.СуммаПотребленный,
	|		ВложенныйЗапрос.ОбъемУслуги,
	|		ВложенныйЗапрос.ОбъемУслугиПотребленный
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|			энргОбъемНачислений.Строение КАК Строение,
	|			энргОбъемНачислений.Помещение КАК Помещение,
	|			энргОбъемНачислений.Абонент КАК Абонент,
	|			энргОбъемНачислений.Услуга КАК Услуга,
	|			энргОбъемНачислений.Поставщик КАК Поставщик,
	|			энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|			СУММА(энргОбъемНачислений.Сумма) КАК Сумма,
	|			СУММА(ВЫБОР
	|					КОГДА энргОбъемНачислений.НеПрименятьСезонность
	|							И НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|							И энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)
	|						ТОГДА энргОбъемНачислений.ОбъемУслуги
	|					КОГДА энргОбъемНачислений.НеПрименятьСезонность
	|							И НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|							И энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|						ТОГДА энргОбъемНачислений.ОбъемУслуги
	|					ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|				КОНЕЦ * энргОбъемНачислений.ЗначениеТарифа) КАК СуммаПотребленный,
	|			СУММА(энргОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги,
	|			СУММА(ВЫБОР
	|					КОГДА энргОбъемНачислений.НеПрименятьСезонность
	|							И НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|							И энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)
	|						ТОГДА энргОбъемНачислений.ОбъемУслуги
	|					КОГДА энргОбъемНачислений.НеПрименятьСезонность
	|							И НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|							И энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|						ТОГДА энргОбъемНачислений.ОбъемУслуги
	|					ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|				КОНЕЦ) КАК ОбъемУслугиПотребленный,
	|			СУММА(энргОбъемНачислений.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленныйИзРН
	|		ИЗ
	|			РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиДляКорректировкиТекущийПериод КАК ТочкиДляКорректировки
	|				ПО энргОбъемНачислений.Период >= ТочкиДляКорректировки.НачалоПериода
	|					И (энргОбъемНачислений.Период <= КОНЕЦПЕРИОДА(ТочкиДляКорректировки.КонецПериода, МЕСЯЦ))
	|					И энргОбъемНачислений.Организация = ТочкиДляКорректировки.Организация
	|					И энргОбъемНачислений.Район = ТочкиДляКорректировки.Район
	|					И энргОбъемНачислений.ЧастныйСектор = ТочкиДляКорректировки.ЧастныйСектор
	|					И энргОбъемНачислений.Строение = ТочкиДляКорректировки.Строение
	|					И энргОбъемНачислений.Помещение = ТочкиДляКорректировки.Помещение
	|					И (ВЫБОР
	|						КОГДА НЕ ТочкиДляКорректировки.Абонент ЕСТЬ NULL
	|							ТОГДА энргОбъемНачислений.Абонент = ТочкиДляКорректировки.Абонент
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ)
	|					И энргОбъемНачислений.Услуга = ТочкиДляКорректировки.Услуга
	|					И (НЕ ТочкиДляКорректировки.КорректировкаТекущегоПериода)
	|					И (энргОбъемНачислений.Организация = &Организация)
	|					И (энргОбъемНачислений.Район = &Район)
	|					И (энргОбъемНачислений.ЧастныйСектор = &ЧастныйСектор)
	|					И (энргОбъемНачислений.Строение = &Строение)
	|					И (энргОбъемНачислений.Помещение = &Помещение)
	|					И (НЕ(энргОбъемНачислений.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)
	|							И энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг)))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргОбъемНачислений.ЧастныйСектор,
	|			энргОбъемНачислений.Строение,
	|			энргОбъемНачислений.Помещение,
	|			энргОбъемНачислений.Абонент,
	|			энргОбъемНачислений.Услуга,
	|			энргОбъемНачислений.Поставщик,
	|			энргОбъемНачислений.ЗначениеТарифа) КАК ВложенныйЗапрос
	|	ГДЕ
	|		ВложенныйЗапрос.ОбъемУслуги <> ВложенныйЗапрос.ОбъемУслугиПотребленныйИзРН) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.СуммаПотребленный > ВложенныйЗапрос.Сумма
	|				ТОГДА ВложенныйЗапрос.СуммаПотребленный - ВложенныйЗапрос.Сумма > 1
	|			КОГДА ВложенныйЗапрос.СуммаПотребленный < ВложенныйЗапрос.Сумма
	|				ТОГДА ВложенныйЗапрос.Сумма - ВложенныйЗапрос.СуммаПотребленный > 1
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргДокументыНачислений.МКД КАК МКД,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	энргДокументыНачислений.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|ГДЕ
	|	энргДокументыНачислений.Организация = &Организация
	|	И энргДокументыНачислений.ПериодНачисления = &ПериодНачисления
	|	И энргДокументыНачислений.Район = &Район
	|	И энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.КорректировкаПотребленияСезонныхУслуг)
	|	И энргДокументыНачислений.МКД = &МКД";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляКорректировкаПотребленияСезонныхУслуг()
	
	Текст  = 
	"ВЫБРАТЬ
	|	КорректируемыеОбъемы.Организация КАК Организация,
	|	КорректируемыеОбъемы.ПериодНачисления КАК ПериодНачисления,
	|	КорректируемыеОбъемы.ПериодНачисления КАК ПериодРасчета,
	|	КорректируемыеОбъемы.Район КАК Район,
	|	КорректируемыеОбъемы.ЧастныйСектор КАК ЧастныйСектор,
	|	КорректируемыеОбъемы.Строение КАК Строение,
	|	КорректируемыеОбъемы.Помещение КАК Помещение,
	|	КорректируемыеОбъемы.Абонент КАК Абонент,
	|	КорректируемыеОбъемы.Услуга КАК Услуга,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет) КАК ВидНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг) КАК СпособНачисления,
	|	КорректируемыеОбъемы.Поставщик КАК Поставщик,
	|	КорректируемыеОбъемы.СуммаКорректировки КАК Сумма,
	|	ВЫБОР
	|		КОГДА КорректируемыеОбъемы.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ КорректируемыеОбъемы.Строение
	|	КОНЕЦ КАК МКД,
	|	ЕСТЬNULL(ДокументыНачислений.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргПерерасчет.ПустаяСсылка)) КАК ДокументНачисления,
	|	ЕСТЬNULL(ДокументыНачислений.ПометкаУдаления, ЛОЖЬ) КАК ДокументНачисленияПометкаУдаления,
	|	КорректируемыеОбъемы.ЗавершениеОП КАК ЗавершениеОП,
	|	КорректируемыеОбъемы.ОбъемУслуги КАК ОбъемУслуги,
	|	КорректируемыеОбъемы.ЗначениеТарифа КАК ЗначениеТарифа
	|ИЗ
	|	КорректируемыеОбъемы КАК КорректируемыеОбъемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО (ВЫБОР
	|				КОГДА КорректируемыеОбъемы.ЧастныйСектор
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				ИНАЧЕ КорректируемыеОбъемы.Строение
	|			КОНЕЦ = ДокументыНачислений.МКД)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаИзменитьПризнакСостояниеПрибора()
	
	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.*,
	|	ЕСТЬNULL(ДокументыПерерасчета.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргПерерасчет.ПустаяСсылка)) КАК ДокументНачисления,
	|	ЕСТЬNULL(ДокументыПерерасчета.ПометкаУдаления, ЛОЖЬ) КАК ДокументНачисленияПометкаУдаления
	|ИЗ
	|	(ВЫБРАТЬ
	|		НаборЗаписейОбъемаНачисленийЗаПериод.*,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.ПериодРасчета КАК ПериодРасчета,
	|		ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП
	|	ИЗ
	|		НаборЗаписейОбъемаНачисленийЗаПериод КАК НаборЗаписейОбъемаНачисленийЗаПериод
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Организация КАК Организация,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.ПериодНачисления КАК ПериодНачисления,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Район КАК Район,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.МКД КАК МКД,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.ЧастныйСектор КАК ЧастныйСектор,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Строение КАК Строение,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Помещение КАК Помещение,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Услуга КАК Услуга,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.ТочкаУчета КАК ТочкаУчета,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.ЗавершениеОП КАК ЗавершениеОП,
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.ПериодНачисления КАК ПериодРасчета
	|			ИЗ
	|				ТочкиУчетаСИзменившимсяСостояниемПрибораУчета КАК ТочкиУчетаСИзменившимсяСостояниемПрибораУчета
	|					ЛЕВОЕ СОЕДИНЕНИЕ НастройкаСезонностиУслуг КАК НастройкаСезонностиУслугРайон
	|					ПО ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Организация = НастройкаСезонностиУслугРайон.Организация
	|						И ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Район = НастройкаСезонностиУслугРайон.Район
	|						И ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Услуга = НастройкаСезонностиУслугРайон.Услуга
	|						И ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.НаправлениеИспользованияТУ = НастройкаСезонностиУслугРайон.НаправлениеИспользованияТУ
	|						И (НастройкаСезонностиУслугРайон.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ НастройкаСезонностиУслуг КАК НастройкаСезонностиУслугМКД
	|					ПО ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Организация = НастройкаСезонностиУслугМКД.Организация
	|						И ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Район = НастройкаСезонностиУслугМКД.Район
	|						И ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.Услуга = НастройкаСезонностиУслугМКД.Услуга
	|						И ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.НаправлениеИспользованияТУ = НастройкаСезонностиУслугМКД.НаправлениеИспользованияТУ
	|						И ТочкиУчетаСИзменившимсяСостояниемПрибораУчета.МКД = НастройкаСезонностиУслугМКД.МКД
	|			ГДЕ
	|				ЕСТЬNULL(НастройкаСезонностиУслугРайон.КорректироватьГодовойОбъем, ЕСТЬNULL(НастройкаСезонностиУслугМКД.КорректироватьГодовойОбъем, ЛОЖЬ))
	|				И ЕСТЬNULL(НастройкаСезонностиУслугРайон.НеПрименятьСезонность, ЕСТЬNULL(НастройкаСезонностиУслугМКД.НеПрименятьСезонность, ЛОЖЬ))) КАК ВложенныйЗапрос
	|			ПО НаборЗаписейОбъемаНачисленийЗаПериод.Организация = ВложенныйЗапрос.Организация
	|				И НаборЗаписейОбъемаНачисленийЗаПериод.Район = ВложенныйЗапрос.Район
	|				И НаборЗаписейОбъемаНачисленийЗаПериод.Строение = ВложенныйЗапрос.Строение
	|				И НаборЗаписейОбъемаНачисленийЗаПериод.Помещение = ВложенныйЗапрос.Помещение
	|				И НаборЗаписейОбъемаНачисленийЗаПериод.Услуга = ВложенныйЗапрос.Услуга
	|				И НаборЗаписейОбъемаНачисленийЗаПериод.ТочкаУчета = ВложенныйЗапрос.ТочкаУчета
	|				И НаборЗаписейОбъемаНачисленийЗаПериод.НаправлениеИспользованияТУ = ВложенныйЗапрос.НаправлениеИспользованияТУ
	|				И (НЕ НаборЗаписейОбъемаНачисленийЗаПериод.БылУстановленныйПриборВЭтомГоду)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыПерерасчета КАК ДокументыПерерасчета
	|		ПО ВложенныйЗапрос.Организация = ДокументыПерерасчета.Организация
	|			И ВложенныйЗапрос.Район = ДокументыПерерасчета.Район
	|			И ВложенныйЗапрос.МКД = ДокументыПерерасчета.МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти