
#Область СлужебныйИнтерфейс

// Процедура - Начислить
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура Начислить(Организация, ПериодНачисления,Район,Строение,Помещение,Документ) Экспорт
		
	ГраницыПериода  						= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета					= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  					= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  							= ГраницыПериода.ДнейВПериоде; 
	ПериодНовогоТарифа 						= Константы.энргДеньНачалаПримененияНовогоТарифа.Получить();
	результатЗапроса 						= РезультатЗапросаИндивидуальныеНачисления(Организация, ПериодНачисления,Район,Строение,Помещение,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде); 	
	КонецПериода  							= КонецМесяца(ПериодНачисления);
	
	Набор 									= Неопределено;
	НаборОбъемПомещений 					= Неопределено;
	ЗаписыватьНаборыЗаписей 				= Документ = Неопределено;
	ОбработатьРезультатЗапросаНачислений(РезультатЗапроса, Набор, НаборОбъемПомещений, ЗаписыватьНаборыЗаписей, Помещение);
		
КонецПроцедуры

// Процедура - Начисление на ОДН
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  ДокументОбъект	 - 	 - 
//
Процедура НачислениеНаОДН(Организация,ПериодНачисления, Район,МКД, Документ)  Экспорт 
	
	ГраницыПериода  												= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета											= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  											= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  													= ГраницыПериода.ДнейВПериоде; 
	результатЗапроса 												= РезультатЗапросаНачисленияНаОДН(Организация, ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде); 	
	КонецПериода  													= КонецМесяца(ПериодНачисления);
	
	Выборка  														= результатЗапроса.выбрать();
	
	Сч 																= 0;
	ДокументСсылка 													= Неопределено;
	ДокументОбъект													= Неопределено;
	ТекМКД 															= Неопределено;
	ТекУслуга 														= Неопределено;
	ТекШкала 														= Неопределено;
	ТекТочкаУчета													= Неопределено;
	ТекПриборУчета													= Неопределено;
	ТекНачалоПериода												= Неопределено;
	ТекКонецПериода 												= Неопределено;
	ТекФормулаРасчета												= Неопределено;
	ТекПоставщик  													= Неопределено;
	СпособРасчетаПоПрибору 											= Перечисления.энргСпособНачислений.ПоПриборам;
	СпособРасчетаПоСреднему											= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	КлючТепловаяСоставляющая 										= энргРаботаСФормуламиРасчетаСервер.ТепловаяСоставляющаяКлюч();
	ФормулыРасчет 													= Неопределено;
	ПараметрыФормулы 												= Неопределено;
	ТекСпособНачисленияПоФормуле 									= Неопределено;
	Набор 															= РегистрыНакопления.энргОбъемНачисленийМКД.СоздатьНаборЗаписей();
	НачисляемПоФормуле 												= Ложь;	
	СпособРасчетаПоФормуле 											= Неопределено;	
	ОписаниеУслуг 													= Неопределено;
	НормативыПоУслугам 												= Неопределено;
	СтрокаОписания 													= Неопределено;
	ОписаниеУслуг 													= Неопределено;	
	СтрокиНабораДоЗаписи 											= Неопределено;	
	НачисленияПоУслугамТочки 										= Неопределено;
	НаборВыполненные 												= Неопределено;
	ЗамещатьНаборВыполненные 										= Истина;
	
	Если Выборка.Количество() > 0 Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Пока Выборка.следующий() цикл
		
		Если Документ = Неопределено и ДокументСсылка = Неопределено Тогда					
			ДокументСсылка											= Выборка.ДокументНачисления;
			ДокументОбъект 											= Неопределено;
			ПометкаУдаления 										= Выборка.ДокументНачисленияПометкаУдаления;
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда				
				ДокументСсылка 										= Документы.энргНачислениеМКД.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект  									= Документы.энргНачислениеМКД.СоздатьДокумент();
				ДокументОбъект.район  								= Район;
				ДокументОбъект.Дата									= КонецПериодаРасчета-1;
				ДокументОбъект.Организация 							= Организация;
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
				
				НаборВыполненные 									= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
				ЗаписьВыполненные									= НаборВыполненные.Добавить();
				ЗаписьВыполненные.Организация 						= Организация;
				ЗаписьВыполненные.ПериодНачисления 					= ПериодНачисления;
				ЗаписьВыполненные.Район			 					= Район;
				ЗаписьВыполненные.ВидОперацийНачисления 			= Перечисления.энргВидыОперацийНачисления.РасчетМКД;
				ЗаписьВыполненные.МКД 								= Выборка.МКД;
				ЗаписьВыполненные.ДокументНачисления 				= ДокументСсылка;
				ЗамещатьНаборВыполненные 							= Ложь;				
			ИначеЕсли ПометкаУдаления Тогда
				ДокументОбъект										= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления 						= Ложь;
				
				НаборВыполненные 									= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
				НаборВыполненные.Отбор.Организация.Установить(Организация);
				НаборВыполненные.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборВыполненные.Отбор.Район.Установить(Район);
				НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.РасчетМКД);
				НаборВыполненные.Отбор.МКД.Установить(Справочники.энргСтроения.ПустаяСсылка());
				
				ЗаписьВыполненные									= НаборВыполненные.Добавить();
				ЗаписьВыполненные.Организация 						= Организация;
				ЗаписьВыполненные.ПериодНачисления 					= ПериодНачисления;
				ЗаписьВыполненные.Район			 					= Район;
				ЗаписьВыполненные.ВидОперацийНачисления 			= Перечисления.энргВидыОперацийНачисления.РасчетМКД;
				ЗаписьВыполненные.МКД 								= Справочники.энргСтроения.ПустаяСсылка();
				ЗаписьВыполненные.ДокументНачисления 				= ДокументСсылка;
				ЗаписьВыполненные.ПометкаУдаления	 				= Ложь;				
			КонецЕсли;
			
			Набор 													= РегистрыНакопления.энргОбъемНачисленийМКД.СоздатьНаборЗаписей();
			Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
			Набор.ДополнительныеСвойства.Вставить("Район",				Район);
			Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
			Набор.Отбор.Регистратор.Установить(ДокументСсылка);
			
			Если НЕ МКД = Неопределено Тогда
				Набор.ДополнительныеСвойства.Вставить("МКД",	МКД);
				Если ДокументОбъект = Неопределено Тогда
					Набор.Прочитать();
					СтрокиНабораДоЗаписи 							= Набор.Выгрузить();
					СтрокиУдалить 									= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("МКД", МКД));
					Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
						СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
					КонецЦикла;
					Набор.Очистить();
				КонецЕсли;
			КонецЕсли;	
			
			Если ДокументОбъект = Неопределено Тогда
				Набор.Записать();
			КонецЕсли;		
		ИначеЕсли Не Документ = Неопределено Тогда
			Набор 													= Документ.Движения.энргОбъемНачисленийМКД;
		КонецЕсли;
				
		Если Не ТекМКД = Выборка.МКД Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ Не ТекНачалоПериода = Выборка.НачалоПериода Тогда
			
			Если НЕ ТекМКД = Неопределено Тогда
				СтрокаОписания.Вставить("ПараметрыФормулы", ПараметрыФормулы);
				ОписаниеУслуг.Добавить(СтрокаОписания); 				
				
				ДобавитьСтрокиНачисленияМКДПоФормуле(ПериодНачисления, Организация, Район, ТекМКД, ТекТочкаУчета, ОписаниеУслуг, НормативыПоУслугам, Набор);
			КонецЕсли;
			
			ОписаниеУслуг 											= Новый Массив;
			СтрокаОписания 											= Новый Структура("
			|Услуга, ФормулаРасчета, Поставщик, СпособНачисления, ПриборУчета, НачалоПериода, КонецПериода, ДокументСсылка, КонецПериодаРасчета, ОбъемУслугиПотребленный, ОбъемЗаПрошлыйГод, НеПрименятьСезонность",
			Выборка.Услуга, Выборка.ФормулаРасчета, Выборка.Поставщик, Выборка.СпособНачисления, Выборка.ПриборУчета, Выборка.НачалоПериода, Выборка.КонецПериода, ДокументСсылка, КонецПериодаРасчета, Выборка.ОбъемУслугиПотребленный, Выборка.ОбъемЗаПрошлыйГод, Выборка.НеПрименятьСезонность); 			
			
			ПараметрыФормулы 										= Новый Соответствие;
			НачисленияПоУслугамТочки 								= Новый Соответствие;
			НачисленияПоШкале 										= Новый Соответствие;
			
			НормативыПоУслугам  									= Новый Соответствие;
			НормативыПоУслугам.Вставить(Выборка.Услуга.УникальныйИдентификатор(), 	Выборка.НормаПотребления);			
			
		ИначеЕсли НЕ ТекУслуга = Выборка.Услуга Тогда
			СтрокаОписания.Вставить("ПараметрыФормулы", ПараметрыФормулы);
			ОписаниеУслуг.Добавить(СтрокаОписания);
			НачисленияПоУслугамТочки.Вставить(ТекУслуга, НачисленияПоШкале);
			
			ПараметрыФормулы 										= Новый Соответствие;
			НачисленияПоШкале 										= Новый Соответствие;
			
			СтрокаОписания 											= Новый Структура("
			|Услуга, ФормулаРасчета, Поставщик, СпособНачисления, ПриборУчета, НачалоПериода, КонецПериода, ДокументСсылка, КонецПериодаРасчета, ОбъемУслугиПотребленный, ОбъемЗаПрошлыйГод, НеПрименятьСезонность",
			Выборка.Услуга, Выборка.ФормулаРасчета, Выборка.Поставщик, Выборка.СпособНачисления, Выборка.ПриборУчета, Выборка.НачалоПериода, Выборка.КонецПериода, ДокументСсылка, КонецПериодаРасчета, Выборка.ОбъемУслугиПотребленный, Выборка.ОбъемЗаПрошлыйГод, Выборка.НеПрименятьСезонность);
			
			НормативыПоУслугам.Вставить(Выборка.Услуга.УникальныйИдентификатор(), 		Выборка.НормаПотребления);			
		ИначеЕсли НЕ ТекШкала = Выборка.Шкала Тогда
			НачисленияПоШкале 										= Новый Соответствие;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Выборка.ФормулаРасчета) Тогда
			СтрокаНабора 											= Набор.добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
			СтрокаНабора.Период 									= КонецПериодаРасчета-1;
			СтрокаНабора.Регистратор 								= ДокументСсылка;
			СтрокаНабора.ВидНачисления 								= Перечисления.энргВидыНачислений.Начисление;
			
			Если ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) и НЕ Выборка.ПривязанаКШкале и НЕ Выборка.РасчетПоФормуле Тогда
				ОбъемУслуги 										= 0;
				ОбъемУслугиПотребленный 							= 0;
				Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги] = Неопределено Тогда
					Если НЕ НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено Тогда
						ОбъемУслугиОсновной 						= НачисленияПоУслугамТочки[Выборка.ЗависитОтУслуги][Выборка.Шкала];
						ОбъемУслуги 								= ОбъемУслугиОсновной.ОбъемУслуги * Выборка.НормаПотребления;
						ОбъемУслугиПотребленный 					= ОбъемУслугиОсновной.ОбъемУслугиПотребленный * Выборка.НормаПотребления;
					КонецЕсли;
				КонецЕсли;
				СтрокаНабора.ОбъемУслуги 							= ОбъемУслуги;
				СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный;
			КонецЕсли;
			
			// ДельтаОбъемУслугиОДНСверхнорматива = Макс(СтрокаНабора.ОбъемУслуги - Выборка.ОбъемПоНорме,0);
			// Если СтрокаНабора.ОбъемУслуги > Выборка.ОбъемПоНорме Тогда
			//	СтрокаНабора.ОбъемУслуги					= Выборка.ОбъемПоНорме;
			//	СтрокаНабора.ОбъемУслугиОДНСверхнорматива	= ДельтаОбъемУслугиОДНСверхнорматива;
			// КонецЕсли; 
						 
		КонецЕсли; 		
		
		КлючШкалы 													= Выборка.Шкала.УникальныйИдентификатор();
		Если НЕ ПараметрыФормулы.Получить(КлючШкалы) = Неопределено Тогда
			ПараметрыФормулы[КлючШкалы].ОбъемУслуги 				= ПараметрыФормулы[КлючШкалы].ОбъемУслуги + Выборка.ОбъемУслуги;
			ПараметрыФормулы[КлючШкалы].ОбъемУслугиПотребленный		= ПараметрыФормулы[КлючШкалы].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
		Иначе
			ПараметрыФормулы.Вставить(КлючШкалы, 	Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
		КонецЕсли; 		
		
		Если НЕ НачисленияПоШкале[Выборка.Шкала] = Неопределено Тогда
			НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги 			 = НачисленияПоШкале[Выборка.Шкала].ОбъемУслуги + Выборка.ОбъемУслуги;
			НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный = НачисленияПоШкале[Выборка.Шкала].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
		Иначе
			НачисленияПоШкале.Вставить(Выборка.Шкала, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
		КонецЕсли;
		
		//закрытая схема
		Если Выборка.ЗакрытаяСхемаГВС Тогда
			СтрокаНабора.ОбъемУслуги = 0;
		КонецЕсли;
		
		
		
		Сч 															= Сч+1;
		ТекМКД 														= Выборка.МКД;
		ТекУслуга 													= Выборка.Услуга;
		ТекНачалоПериода											= Выборка.НачалоПериода;
		ТекКонецПериода												= Выборка.КонецПериода;
		ТекТочкаУчета 												= Выборка.ТочкаУчета;
		ТекШкала 													= Выборка.Шкала;
	КонецЦикла;	
	
	Если Не ОписаниеУслуг = Неопределено Тогда
		СтрокаОписания.Вставить("ПараметрыФормулы", ПараметрыФормулы);
		ОписаниеУслуг.Добавить(СтрокаОписания);
		
		ДобавитьСтрокиНачисленияМКДПоФормуле(ПериодНачисления, Организация, Район, ТекМКД, ТекТочкаУчета, ОписаниеУслуг, НормативыПоУслугам, Набор);
	КонецЕсли;
	
	Если Документ = Неопределено и НЕ Набор = Неопределено и (Набор.Количество() > 0 ИЛИ НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0) тогда
		
		Попытка 			
			Если НЕ ДокументОбъект  = Неопределено Тогда
				ДокументОбъект.ПометкаУдаления = Ложь;
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			 			
			Если НЕ НаборВыполненные = Неопределено Тогда
				НаборВыполненные.Записать(ЗамещатьНаборВыполненные);
			КонецЕсли;
			
			Если НЕ МКД = Неопределено и НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
				Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
					 ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
				КонецЦикла;				
			КонецЕсли;
						
			Набор.Записать(Ложь);
			ЗафиксироватьТранзакцию();
		Исключение
			ОписаниеОшибки 											= ИнформацияОбОшибке();
			ОтменитьТранзакцию();
			ВызватьИсключение ПодробноеПредставлениеОшибки(ОписаниеОшибки); 
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспредениеОбъемаМКД(Организация,ПериодНачисления, Район, Строение, Документ)  Экспорт 
	Перем ТекСтроение, ТекУслуга, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма, ТекМКДАбонентов, ТекУслугаАбонентов,
	ДокументОбъект, ДанныеПоУслуге, НаборВыполненные, ЗамещатьНаборВыполненные, ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам;
	
	МассивМКД_УК = Новый Массив;
	
	//РаспредениеОбъемаМКД_УК(Организация, ПериодНачисления, Район, Строение, Документ, МассивМКД_УК);
	
	ГраницыПериода  						= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);	
	МВТ 									= Новый МенеджерВременныхТаблиц;
	ПрочитатьВспомогательныеДанныеРаспределениеМКД(МВТ,Организация,ПериодНачисления,Район,Строение,ГраницыПериода);
	
	Запрос 									= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 			= МВТ;
	Запрос.Текст 							= ТекстЗапросаДанныеДляРаспределения(Строение);
	
	Результат  								= Запрос.ВыполнитьПакет();
	ВыборкаЗначенияТарифов 					= Результат[0].Выбрать();
	ВыборкаОбъемМКД							= Результат[1].Выбрать();
	ВыборкаАбоненты							= Результат[2].Выбрать();
	ВыборкаОбъемПоПриборуКорректировать		= Результат[3].Выбрать();
	ВыборкаРазделенныеЛицевыеСчета			= Результат[4].Выбрать();
	     		
	РазделенныеЛицевыеСчета 				= Новый Соответствие;
	КлючРазделенныеЛицевыеСчета 			= "Абонент,ЗначениеПлощади,СпособРаспределенияОбъемаПомещения,ФиксированныйОбъемПотребления,
	|ДоляПотребленияЧислитель,ДоляПотребленияЗнаменатель,КоличествоПроживающих,ТарифнаяГруппа,Поставщик";
	
	ЗначенияТарифов 						= Новый Соответствие;
	Если ВыборкаЗначенияТарифов.Количество() > 0 Тогда
		Пока ВыборкаЗначенияТарифов.Следующий() Цикл
			ХэшСтроки 						= ХэшСтрокиТарифа(ВыборкаЗначенияТарифов.ГруппаПотребителей,ВыборкаЗначенияТарифов.Услуга,ВыборкаЗначенияТарифов.Поставщик,ВыборкаЗначенияТарифов.ТарифнаяЗона);
			ОписаниеЗначения 				= Новый Структура("Значение,СтавкаНДС,НДСВнутри,ГруппаПотребителей,Услуга,Поставщик,ТарифнаяЗона");
			ЗаполнитьЗначенияСвойств(ОписаниеЗначения, ВыборкаЗначенияТарифов);			
			ЗначенияТарифов.Вставить(ХэшСтроки,ОписаниеЗначения); 			
		КонецЦикла;		
	КонецЕсли;
		
	Если ВыборкаОбъемМКД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаАбоненты.следующий();
	ЕстьРазделенныеЛицевыеСчета 			= ВыборкаРазделенныеЛицевыеСчета.Следующий();
	
	Отказ 									= Ложь;
	ТипыНачислений 							= энргНачисления.ТипыРасходовВФормулахРасчета();
	ТекстИсключения		 					= "";
	
	Пока ВыборкаОбъемМКД.Следующий() Цикл
		
		//Если МассивМКД_УК.Найти(ВыборкаОбъемМКД.Строение) <> Неопределено Тогда
		//	Продолжить;	
		//КонецЕсли;
		
		Если НЕ ТекСтроение = ВыборкаОбъемМКД.Строение 
			ИЛИ НЕ ТекУслуга = ВыборкаОбъемМКД.Услуга Тогда
												
			Если Не ТекУслуга  = Неопределено Тогда
				Если ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда
					РаспределитьОбъемПоУслугеМКД(ПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма);
				КонецЕсли;
				ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, ТекУслуга, НачисленияПоУслугам);
			КонецЕсли;
			
			Если НЕ ТекСтроение = ВыборкаОбъемМКД.Строение Тогда
				Если НЕ ТекСтроение = Неопределено Тогда
					// Рассчитываем норматив
					РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив,НачисленияПоУслугам,ЗначенияТарифов,ГраницыПериода,Отказ,НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП);
					ЗаписатьНаборыЗаписейПриРаспределении(Организация, ПериодНачисления, Район, ТекСтроение, Отказ, ДокументОбъект, ГраницыПериода, ТекстИсключения, НаборВыполненные, НаборЗаписей, НаборЗаписейНП, НаборЗаписейПомещений, НаборЗаписейСверхНорма, ЗамещатьНаборВыполненные);
				КонецЕсли;
				НачатьТранзакцию();
				// запоминаем свойства разделенных лицевых счетов по услугам
				Отказ 						= Ложь;
				РассчитыватьНорматив 		= Новый Массив;
				ПараметрыРасчетаНорматива 	= Новый Соответствие;
				РазделенныеЛицевыеСчета 	= Новый Соответствие;
				НачисленияПоУслугам 		= Новый Соответствие;
				Если ЕстьРазделенныеЛицевыеСчета Тогда
					ЗаполнитьРазделенныеЛицевыеСчета(КлючРазделенныеЛицевыеСчета, РазделенныеЛицевыеСчета, ВыборкаРазделенныеЛицевыеСчета, ВыборкаОбъемМКД);					
				КонецЕсли; 				
			КонецЕсли;			
						
			ДанныеПоУслуге 					= ДанныеПоУслугиДляРаспределения(ВыборкаОбъемМКД, РазделенныеЛицевыеСчета);
			
			ЗаполнитьДанныеАбонентовДляРаспределения(ДанныеПоУслуге, ВыборкаАбоненты, ВыборкаОбъемМКД, ВыборкаОбъемПоПриборуКорректировать);
						
			Если НЕ ТекСтроение = ВыборкаОбъемМКД.Строение Тогда
				ПрочитатьНаборыДляЗаписиПриРаспределении(Организация, ПериодНачисления, Район, ВыборкаОбъемМКД, ГраницыПериода, ДокументОбъект, НаборВыполненные, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма, ЗамещатьНаборВыполненные);
			КонецЕсли;		
		КонецЕсли;
		
		ЗаполнитьОбъемыМКДПриРаспределении(ВыборкаОбъемМКД, ДанныеПоУслуге);
		
		ТекСтроение							= ВыборкаОбъемМКД.Строение;
		ТекУслуга 							= ВыборкаОбъемМКД.Услуга;
	КонецЦикла; 	
	
	Если Не ТекСтроение = Неопределено Тогда		
		Если ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда
			РаспределитьОбъемПоУслугеМКД(ПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма);
		КонецЕсли;		
		ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, ТекУслуга, НачисленияПоУслугам);
		РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам, ЗначенияТарифов, ГраницыПериода, Отказ, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП);
		ЗаписатьНаборыЗаписейПриРаспределении(Организация, ПериодНачисления, Район, ТекСтроение, Отказ, ДокументОбъект, ГраницыПериода, ТекстИсключения, НаборВыполненные, НаборЗаписей, НаборЗаписейНП, НаборЗаписейПомещений, НаборЗаписейСверхНорма, ЗамещатьНаборВыполненные);
	КонецЕсли;
				
КонецПроцедуры

Процедура РаспредениеОбъемаМКД_УК(Организация,ПериодНачисления, Район,МКД, Документ,МассивМКД_УК)  Экспорт 
	
	ГраницыПериода  				= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	МВТ 							= Новый МенеджерВременныхТаблиц;
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);  
	Запрос.УстановитьПараметр("Дата",				ГраницыПериода.ЗавершениеОП-1);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				МКД);
	Запрос.УстановитьПараметр("НачалоПериода",		ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",		ГраницыПериода.ЗавершениеОП);
	Запрос.УстановитьПараметр("Поставщик",			Константы.энргПоставщикПоУмолчанию.Получить());
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД,
	               |	энргФормыУправленияМКДСрезПоследних.УК КАК УК
	               |ПОМЕСТИТЬ МКД_С_УТ
	               |ИЗ
	               |	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(
	               |			&КонецПериода,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И МКД = &МКД) КАК энргФормыУправленияМКДСрезПоследних
	               |ГДЕ
	               |	энргФормыУправленияМКДСрезПоследних.ФормаУправления = ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.УК)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргСостояниеМКДСрезПоследних.МКД КАК МКД
	               |ПОМЕСТИТЬ АктивныеМКД
	               |ИЗ
	               |	РегистрСведений.энргСостояниеМКД.СрезПоследних(
	               |			&КонецПериода,
	               |			Район = &Район
	               |				И Организация = &Организация
	               |				И МКД В
	               |					(ВЫБРАТЬ
	               |						МКД_С_УТ.МКД КАК МКД
	               |					ИЗ
	               |						МКД_С_УТ КАК МКД_С_УТ)) КАК энргСостояниеМКДСрезПоследних
	               |ГДЕ
	               |	энргСостояниеМКДСрезПоследних.Состояние
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргСостояниеМКДСрезПоследних.МКД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргОтложенныеДвиженияДокументов.Организация КАК Организация,
	               |	энргОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	               |	энргОтложенныеДвиженияДокументов.Район КАК Район,
	               |	энргОтложенныеДвиженияДокументов.Строение КАК Строение
	               |ПОМЕСТИТЬ ДокументыДляРаспределения
	               |ИЗ
	               |	РегистрСведений.энргОтложенныеДвиженияДокументов КАК энргОтложенныеДвиженияДокументов
	               |ГДЕ
	               |	энргОтложенныеДвиженияДокументов.Организация = &Организация
	               |	И энргОтложенныеДвиженияДокументов.ПериодНачисления = &ПериодНачисления
	               |	И энргОтложенныеДвиженияДокументов.Район = &Район
	               |	И энргОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.РаспределениеМКД)
	               |	И НЕ энргОтложенныеДвиженияДокументов.ЧастныйСектор
	               |	И энргОтложенныеДвиженияДокументов.Строение = &Строение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргСтабильныеПериодыМКД.Организация КАК Организация,
	               |	энргСтабильныеПериодыМКД.Район КАК Район,
	               |	энргСтабильныеПериодыМКД.МКД КАК МКД,
	               |	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	               |	энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	               |	энргСтабильныеПериодыМКД.ЗначениеПлощади КАК ПлощадьМОП,
	               |	энргСтабильныеПериодыМКД.ТипСхемы КАК ТипСхемы,
	               |	энргСтабильныеПериодыМКД.ВидТепловогоПункта КАК ВидТепловогоПункта,
	               |	энргСтабильныеПериодыМКД.СоставнаяУслуга КАК СоставнаяУслуга,
	               |	энргСтабильныеПериодыМКД.КлючНорматива КАК КлючНорматива
	               |ПОМЕСТИТЬ УслугиМКДРаспределять
	               |ИЗ
	               |	ДокументыДляРаспределения КАК ДокументыДляРаспределения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	               |		ПО ДокументыДляРаспределения.Организация = энргСтабильныеПериодыМКД.Организация
	               |			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	               |			И ДокументыДляРаспределения.Район = энргСтабильныеПериодыМКД.Район
	               |			И ДокументыДляРаспределения.Строение = энргСтабильныеПериодыМКД.МКД
	               |			И (энргСтабильныеПериодыМКД.НомерПозиции = 0)
	               |			И (энргСтабильныеПериодыМКД.НеРаспределятьНаАбонентов)
	               |			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	               |			И (энргСтабильныеПериодыМКД.Район = &Район)
	               |			И (энргСтабильныеПериодыМКД.МКД = &Строение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Договор КАК Договор,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Организация КАК Организация,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Район КАК Район
	               |ПОМЕСТИТЬ ОбъектыРасчетаТУ
	               |ИЗ
	               |	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	               |			&КонецПериода,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И Договор.Контрагент В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						МКД_С_УТ.УК КАК УК
	               |					ИЗ
	               |						МКД_С_УТ КАК МКД_С_УТ)) КАК бестАктивностьТочекУчетаНПСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСостояниеДоговоров.СрезПоследних(
	               |				&КонецПериода,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестСостояниеДоговоровСрезПоследних
	               |		ПО бестАктивностьТочекУчетаНПСрезПоследних.Организация = бестСостояниеДоговоровСрезПоследних.Организация
	               |			И бестАктивностьТочекУчетаНПСрезПоследних.Район = бестСостояниеДоговоровСрезПоследних.Район
	               |			И бестАктивностьТочекУчетаНПСрезПоследних.Договор = бестСостояниеДоговоровСрезПоследних.Договор
	               |ГДЕ
	               |	бестСостояниеДоговоровСрезПоследних.Состояние
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Договор,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Организация,
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыРасчетаТУ.ТочкаУчета КАК ТочкаУчета,
	               |	ОбъектыРасчетаТУ.ОбъектРасчета КАК ОбъектРасчета,
	               |	ОбъектыРасчетаТУ.Договор КАК Договор,
	               |	ОбъектыРасчетаТУ.Организация КАК Организация,
	               |	ОбъектыРасчетаТУ.Район КАК Район,
	               |	УслугиМКДРаспределять.Услуга КАК Услуга
	               |ПОМЕСТИТЬ ОбъектыРасчета
	               |ИЗ
	               |	ОбъектыРасчетаТУ КАК ОбъектыРасчетаТУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиМКДРаспределять КАК УслугиМКДРаспределять
	               |		ПО ОбъектыРасчетаТУ.Организация = УслугиМКДРаспределять.Организация
	               |			И ОбъектыРасчетаТУ.Район = УслугиМКДРаспределять.Район
	               |			И ОбъектыРасчетаТУ.ТочкаУчета = УслугиМКДРаспределять.ТочкаУчета
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъектыРасчетаТУ.ОбъектРасчета,
	               |	ОбъектыРасчетаТУ.ТочкаУчета,
	               |	ОбъектыРасчетаТУ.Договор,
	               |	ОбъектыРасчетаТУ.Организация,
	               |	ОбъектыРасчетаТУ.Район,
	               |	УслугиМКДРаспределять.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргОбъемНачисленийМКДОбороты.МКД КАК МКД,
	               |	энргОбъемНачисленийМКДОбороты.Услуга КАК Услуга,
	               |	СУММА(энргОбъемНачисленийМКДОбороты.ОбъемУслугиОборот) КАК ОбъемУслуги,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА энргОбъемНачисленийМКДОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	               |					ИЛИ энргОбъемНачисленийМКДОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК НачислятьПоНорме,
	               |	энргОбъемНачисленийМКДОбороты.ТочкаУчета КАК ТочкаУчета,
	               |	энргОбъемНачисленийМКДОбороты.СпособНачисления КАК СпособНачисления
	               |ПОМЕСТИТЬ ОбъемыМКД
	               |ИЗ
	               |	РегистрНакопления.энргОбъемНачисленийМКД.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И МКД В
	               |					(ВЫБРАТЬ
	               |						АктивныеМКД.МКД КАК МКД
	               |					ИЗ
	               |						АктивныеМКД КАК АктивныеМКД)) КАК энргОбъемНачисленийМКДОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргОбъемНачисленийМКДОбороты.Услуга,
	               |	энргОбъемНачисленийМКДОбороты.МКД,
	               |	энргОбъемНачисленийМКДОбороты.ТочкаУчета,
	               |	энргОбъемНачисленийМКДОбороты.СпособНачисления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргОбъемНачисленийОбороты.Строение КАК МКД,
	               |	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	               |	энргОбъемНачисленийОбороты.ОбъемУслугиОборот КАК ОбъемУслуги,
	               |	ВЫБОР
	               |		КОГДА энргОбъемНачисленийОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НачислятьПоНорме
	               |ПОМЕСТИТЬ ОбъемыПотребителей
	               |ИЗ
	               |	РегистрНакопления.энргОбъемНачислений.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И Строение В
	               |					(ВЫБРАТЬ
	               |						АктивныеМКД.МКД КАК МКД
	               |					ИЗ
	               |						АктивныеМКД КАК АктивныеМКД)
	               |				И НЕ Распределение) КАК энргОбъемНачисленийОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бестОбъемНачисленийНПОбороты.МКД,
	               |	бестОбъемНачисленийНПОбороты.Услуга,
	               |	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот,
	               |	ВЫБОР
	               |		КОГДА бестОбъемНачисленийНПОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ
	               |ИЗ
	               |	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И МКД В
	               |					(ВЫБРАТЬ
	               |						АктивныеМКД.МКД КАК МКД
	               |					ИЗ
	               |						АктивныеМКД КАК АктивныеМКД)
	               |				И НЕ Распределение) КАК бестОбъемНачисленийНПОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъемыПотребителей.МКД КАК МКД,
	               |	ОбъемыПотребителей.Услуга КАК Услуга,
	               |	СУММА(ОбъемыПотребителей.ОбъемУслуги) КАК ОбъемУслуги,
	               |	МАКСИМУМ(ОбъемыПотребителей.НачислятьПоНорме) КАК НачислятьПоНорме
	               |ПОМЕСТИТЬ ОбъемыПотребителейСгруппированные
	               |ИЗ
	               |	ОбъемыПотребителей КАК ОбъемыПотребителей
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъемыПотребителей.МКД,
	               |	ОбъемыПотребителей.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъемыМКД.МКД КАК МКД,
	               |	ОбъемыМКД.Услуга КАК Услуга,
	               |	ОбъемыМКД.НачислятьПоНорме КАК НачислятьПоНорме,
	               |	ОбъемыМКД.ТочкаУчета КАК ТочкаУчета,
	               |	МАКСИМУМ(ОбъектыРасчета.ОбъектРасчета) КАК ОбъектРасчета,
	               |	ОбъектыРасчета.Договор КАК Договор,
	               |	ОбъемыМКД.СпособНачисления КАК СпособНачисления,
	               |	МАКСИМУМ(ОбъемыМКД.ОбъемУслуги) КАК ОбъемУслугиМКД,
	               |	МАКСИМУМ(ЕСТЬNULL(ОбъемыПотребителейСгруппированные.ОбъемУслуги, 0)) КАК ОбъемУслугиРаспределение,
	               |	МАКСИМУМ(бестНачислениеНП.Ссылка) КАК ДокументНачисления
	               |ПОМЕСТИТЬ ДанныеДляРаспределения
	               |ИЗ
	               |	ОбъектыРасчета КАК ОбъектыРасчета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыМКД КАК ОбъемыМКД
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыПотребителейСгруппированные КАК ОбъемыПотребителейСгруппированные
	               |			ПО ОбъемыМКД.МКД = ОбъемыПотребителейСгруппированные.МКД
	               |				И ОбъемыМКД.Услуга = ОбъемыПотребителейСгруппированные.Услуга
	               |		ПО ОбъектыРасчета.ТочкаУчета = ОбъемыМКД.ТочкаУчета
	               |			И ОбъектыРасчета.Услуга = ОбъемыМКД.Услуга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеНП КАК бестНачислениеНП
	               |		ПО ОбъектыРасчета.Договор = бестНачислениеНП.Договор
	               |			И (бестНачислениеНП.Организация = &Организация)
	               |			И (бестНачислениеНП.Район = &Район)
	               |			И (бестНачислениеНП.Дата = &Дата)
	               |			И (НЕ бестНачислениеНП.ПометкаУдаления)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъемыМКД.НачислятьПоНорме,
	               |	ОбъектыРасчета.Договор,
	               |	ОбъемыМКД.СпособНачисления,
	               |	ОбъемыМКД.Услуга,
	               |	ОбъемыМКД.МКД,
	               |	ОбъемыМКД.ТочкаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеДляРаспределения.МКД КАК МКД,
	               |	ДанныеДляРаспределения.Услуга КАК Услуга,
	               |	ДанныеДляРаспределения.НачислятьПоНорме КАК НачислятьПоНорме,
	               |	ДанныеДляРаспределения.ТочкаУчета КАК ТочкаУчета,
	               |	ДанныеДляРаспределения.ОбъектРасчета КАК ОбъектРасчета,
	               |	ДанныеДляРаспределения.Договор КАК Договор,
	               |	ДанныеДляРаспределения.СпособНачисления КАК СпособНачисления,
	               |	ВЫБОР
	               |		КОГДА ДанныеДляРаспределения.НачислятьПоНорме
	               |			ТОГДА ДанныеДляРаспределения.ОбъемУслугиМКД
	               |		ИНАЧЕ ДанныеДляРаспределения.ОбъемУслугиМКД - ДанныеДляРаспределения.ОбъемУслугиРаспределение
	               |	КОНЕЦ КАК ОбъемУслуги,
	               |	ДанныеДляРаспределения.ОбъемУслугиРаспределение КАК ОбъемУслугиРаспределение,
	               |	ДанныеДляРаспределения.ОбъемУслугиМКД КАК ОбъемУслугиМКД,
	               |	ДанныеДляРаспределения.ДокументНачисления КАК ДокументНачисления
	               |ИЗ
	               |	ДанныеДляРаспределения КАК ДанныеДляРаспределения
	               |ИТОГИ
	               |	МАКСИМУМ(ДокументНачисления)
	               |ПО
	               |	Договор";
	
	Если НЕ ЗначениеЗаполнено(МКД) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И МКД = &МКД","");;
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргРаспределениеМКД.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргОтложенныеДвиженияДокументов.Строение = &Строение","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериодыМКД.Строение = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериоды.Строение = &Строение)","");		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Строение = &Строение","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (бестОбъектыРасчета.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И МКД = &Строение","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериоды.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргНомераСтрокСтабильногоПериода.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериодыМКД.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргДокументыНачислений.МКД = &Строение)","");		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДоговор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговор.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДоговор
	
		ВыборкаДетальныеЗаписи = ВыборкаДоговор.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ВыборкаДоговор.ДокументНачисления) Тогда
			ДокументОбъект = ВыборкаДоговор.ДокументНачисления.ПолучитьОбъект();
		Иначе
			ДокументОбъект = Документы.бестНачислениеНП.СоздатьДокумент();	
		КонецЕсли; 
		
		ДокументОбъект.Организация = Организация;
		ДокументОбъект.Договор = ВыборкаДоговор.Договор;
		ДокументОбъект.Район = Район;
		ДокументОбъект.Дата	= ГраницыПериода.ЗавершениеОП-1; 
		ДокументОбъект.Записать();
		
		ДокументОбъект.Движения.бестОбъемНачисленийНП.Прочитать();
		
		СтрокиМКД = Новый Массив;
		Для Каждого Строка Из ДокументОбъект.Движения.бестОбъемНачисленийНП Цикл
			Если Не Строка.Распределение И (Не ЗначениеЗаполнено(МКД) Или Строка.МКД <> МКД) Тогда
				Продолжить;	
			КонецЕсли; 
			СтрокиМКД.Добавить(Строка);	
		КонецЦикла;
		
		Для Каждого Строка Из СтрокиМКД Цикл
				ДокументОбъект.Движения.бестОбъемНачисленийНП.Удалить(Строка);
			КонецЦикла;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если МассивМКД_УК.Найти(ВыборкаДетальныеЗаписи.МКД) = Неопределено Тогда
				МассивМКД_УК.Добавить(ВыборкаДетальныеЗаписи.МКД);	
			КонецЕсли; 
						
			Запись = ДокументОбъект.Движения.бестОбъемНачисленийНП.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,ВыборкаДетальныеЗаписи);
			Запись.Период			= ДокументОбъект.Дата;
			Запись.ВидНачисления	= Перечисления.энргВидыНачислений.Начисление;
			Запись.Распределение	= Истина;
			Запись.Организация		= Организация;;
			Запись.Район			= Район;
			Запись.НачалоПериода    = ГраницыПериода.НачалоОП;
			Запись.КонецПериода		= ГраницыПериода.ЗавершениеОП;
			Запись.ПериодНачисления = ПериодНачисления;
			Запись.ПериодРасчета	= ПериодНачисления;			
		КонецЦикла;
		
		ДокументОбъект.Движения.бестОбъемНачисленийНП.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура - Снять средние начисления
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура СнятьСредниеНачисления(Организация,ПериодНачисления,Район,Строение,Помещение,Документ) Экспорт
	перем ТекСтроение,ТекЧастныйСектор,ДокументОбъект; 
	
	Если не ЗначениеЗаполнено(ПериодНачисления) или не ЗначениеЗаполнено(Район)  тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	      	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	ПрочитатьНеСписанныйСредний(МВТ,Организация,Район,Строение,Помещение,НачалоПериодаРасчета);	
	результатЗапроса 								= РезультатЗапросаПерерасчетСреднего(МВТ,Организация, ПериодНачисления, НачалоПериодаРасчета, КонецПериодаРасчета,Район,Строение,Помещение); 	
	
	Выборка  										= результатЗапроса.выбрать();
	ВидОперации 									= Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет;
	Сч 												= 0;
	
	Набор 											= Неопределено;
	НаборНачисленныйСредний 						= Неопределено;
	
	ВидНачисленияПерерасчет 						= Перечисления.энргВидыНачислений.Перерасчет;
	
	Если Выборка.Количество() = 0 Тогда				
		ВыборкаДокументыОтменить 					= РезультатОтменитьСнятьСредниеНачисления(ПериодНачисления,Организация,Район,Строение);
		Пока ВыборкаДокументыОтменить.Следующий() Цикл
			ДокументОбъектОтменить					= ВыборкаДокументыОтменить.Ссылка.ПолучитьОбъект();
			ДокументОбъектОтменить.УстановитьПометкуУдаления(Истина);
		КонецЦикла; 		
	КонецЕсли;
	
	СтрокиНабораДоЗаписи 							= Неопределено;
	СтрокиНаборНачисленныйСреднийДоЗаписи 			= Неопределено;
	Ошибки 											= "";
	
	Пока Выборка.следующий() цикл
		Если Документ = Неопределено тогда
			Если Не ТекЧастныйСектор = Выборка.ЧастныйСектор ИЛИ (НЕ ТекЧастныйСектор и Не ТекСтроение = Выборка.Строение) тогда 				
				Если Не ТекСтроение = Неопределено Тогда					
					Попытка
						Если ДокументОбъект<>Неопределено тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",						Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
							ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);										
						КонецЕсли;
						
						Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
						Набор.ДополнительныеСвойства.Вставить("Район",				Район);
						Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
						Набор.ДополнительныеСвойства.Вставить("Строение",			ТекСтроение);
						Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);
						Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
						Набор.Записать(Ложь);
						ЗафиксироватьТранзакцию();
					Исключение
						ОтменитьТранзакцию();
						ИнформацияОбОшибке  					= ИнформацияОбОшибке();
						Ошибки 									= Ошибки +
						Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
					КонецПопытки;
				КонецЕсли;
				НачатьТранзакцию();				
				ДокументСсылка 						= Выборка.ДокументПерерасчета;
				ПометкаУдаления 					= Выборка.ДокументПерерасчетаПометкаУдаления;
				ДокументОбъект  					= Неопределено;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка)  Тогда
					ДокументСсылка 					= Документы.энргПерерасчет.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  				= Документы.энргПерерасчет.СоздатьДокумент();
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
					ДокументОбъект.район  			= Район;
					ДокументОбъект.Строение			= ?(Выборка.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка(), Выборка.Строение);
					ДокументОбъект.Дата				= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 		= Организация;
					ДокументОбъект.ВидОперации 		= Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет;
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект  				= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 	= Ложь;
				КонецЕсли;
				 							 
				НаборНачисленныйСредний 			= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументСсылка);
				
				Если Не Помещение = Неопределено Тогда					
					НаборНачисленныйСредний.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
					Если ДокументОбъект = Неопределено Тогда
						НаборНачисленныйСредний.Прочитать();
						СтрокиНаборНачисленныйСреднийДоЗаписи 			= НаборНачисленныйСредний.Выгрузить();
						СтрокиУдалить 									= СтрокиНаборНачисленныйСреднийДоЗаписи.НайтиСтроки(Новый Структура("Помещение", Помещение));
						Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
							СтрокиНаборНачисленныйСреднийДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						НаборНачисленныйСредний.Очистить();
					КонецЕсли;					
				КонецЕсли;
								
				Если ДокументОбъект = Неопределено Тогда
					НаборНачисленныйСредний.Записать();
				КонецЕсли;
								
				Набор								= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				
				Если Не Помещение = Неопределено Тогда					
					Набор.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
					Если ДокументОбъект = Неопределено Тогда
						Набор.Прочитать();
						СтрокиНабораДоЗаписи 							= Набор.Выгрузить();
						СтрокиУдалить 									= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Помещение", Помещение));
						Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
							СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						Набор.Очистить();
					КонецЕсли;					
				КонецЕсли;
								
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
				КонецЕсли;				
			КонецЕсли;
		иначе
			ДокументОбъект 							= Документ;
			ОбъемНачислений 						= ДокументОбъект.СвязанныйПерерасчет;
		КонецЕсли;	
		
		СтрокаНабора 								= НаборНачисленныйСредний.добавитьРасход();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
		СтрокаНабора.Организация 					= Организация;
		
		// ЗначениеТарифа = ?(ЗначениеЗаполнено(Выборка.Сумма),Выборка.ОбъемУслугиНачислено/Выборка.СуммаНачислено,0);
		ЗначениеТарифа = Выборка.ЗначениеТарифаНачислено;
		
		СтрокаНабора 								= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.ВидНачисления 					= ВидНачисленияПерерасчет;
		СтрокаНабора.ОбъемУслуги 					= -Выборка.ОбъемУслуги;
		СтрокаНабора.Сумма		 					= -Выборка.ОбъемУслуги*ЗначениеТарифа;
		СтрокаНабора.ПериодРасчета					= ГраницыПериода.ПериодНачисления;
		СтрокаНабора.ПериодНачисления				= ГраницыПериода.ПериодНачисления;
		
		ТекЧастныйСектор 							= Выборка.ЧастныйСектор;
		ТекСтроение									= Выборка.Строение;
		Сч 											= Сч + 1;
	КонецЦикла;	
		 
	Если Не ТекСтроение = Неопределено Тогда					
		Попытка
			Если ДокументОбъект<>Неопределено тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",						Истина);
				ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
				ДокументОбъект.ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);										
			КонецЕсли;
			
			Если Набор.Количество() > 0 Тогда
				Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
				Набор.ДополнительныеСвойства.Вставить("Район",				Район);
				Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
				Набор.ДополнительныеСвойства.Вставить("Строение",			ТекСтроение);
				Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);
				
				Если НЕ Помещение = Неопределено и НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
					Набор.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
					Для Каждого СтрокаДобавить Из СтрокиНаборНачисленныйСреднийДоЗаписи Цикл
						ЗаполнитьЗначенияСвойств(НаборНачисленныйСредний.Добавить(), СтрокаДобавить);
					КонецЦикла;
					
					Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
						ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
					КонецЦикла;				
				КонецЕсли;
				
				Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);			
				Набор.Записать(Ложь);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке  					= ИнформацияОбОшибке();
			Ошибки 									= Ошибки +
			Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;  
	 	
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура СнятьСредниеНачисленияМКД(Организация,ПериодНачисления,Район,МКД,Документ) Экспорт
	перем ТекМКД,ДокументОбъект; 
	
	Если не ЗначениеЗаполнено(ПериодНачисления) или не ЗначениеЗаполнено(Район)  тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	ПрочитатьНеСписанныйСреднийМКД(МВТ,Организация,Район,МКД,НачалоПериодаРасчета);	
	результатЗапроса 								= РезультатЗапросаПерерасчетСреднегоМКД(МВТ,Организация, ПериодНачисления,Район,МКД); 	
	
	Выборка  										= результатЗапроса.выбрать();
	ВидОперации 									= Перечисления.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет;
	Набор 											= Неопределено;
	НаборНачисленныйСредний 						= Неопределено;
	ДокументСсылка 									= Неопределено;
	
	ВидНачисленияПерерасчет							= Перечисления.энргВидыНачислений.Перерасчет;
	
	Пока Выборка.следующий() цикл
		Если Документ = Неопределено тогда			
			Если  ДокументСсылка = Неопределено Тогда
				ДокументСсылка 						= Выборка.ДокументПерерасчета;
				ДокументОбъект 						= Неопределено;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка) тогда					
					ДокументСсылка 					= Документы.энргПерерасчетМКД.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  				= Документы.энргПерерасчетМКД.СоздатьДокумент();
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
					ДокументОбъект.район  			= Район;
					ДокументОбъект.Дата				= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 		= Организация;
					ДокументОбъект.ВидОперации 		= ВидОперации;
				КонецЕсли;
							 
				НаборНачисленныйСредний 			= РегистрыНакопления.энргНачисленныйСреднийОбъемМКД.СоздатьНаборЗаписей();
				НаборНачисленныйСредний.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборНачисленныйСредний.Записать();
				
				Набор								= РегистрыНакопления.энргОбъемНачисленийМКД.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				Набор.Записать();				
			КонецЕсли;
		иначе
			Набор 									= Документ.Движения.энргНачисленныйСреднийОбъемМКД;
			Набор.Очистить(); 			
		КонецЕсли;		
		
		СтрокаНабора 								= НаборНачисленныйСредний.добавитьРасход();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
		СтрокаНабора.Организация 					= Организация;
		
		СтрокаНабора 								= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП - 1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.ВидНачисления 					= ВидНачисленияПерерасчет;
		СтрокаНабора.ОбъемУслуги 					= - Выборка.ОбъемУслуги;
		СтрокаНабора.ПериодРасчета					= ГраницыПериода.ПериодНачисления;
	КонецЦикла;	
		
	Если Документ = Неопределено И Не Набор = Неопределено и Набор.Количество() > 0 тогда
		НачатьТранзакцию();
		Попытка
			Если Не ДокументОбъект = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Набор.ДополнительныеСвойства.Вставить("Организация",			Организация);
			Набор.ДополнительныеСвойства.Вставить("Район",					Район);
			Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",		ПериодНачисления);
			Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",		КонецПериодаРасчета-1);
			Набор.ДополнительныеСвойства.Вставить("ИзменятьОбъемНачислений", Истина);
			Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
			Набор.Записать(Ложь);						
			ЗафиксироватьТранзакцию();
		Исключение
			ОписаниеОшибки 							= ИнформацияОбОшибке();
			ОтменитьТранзакцию();
			ВызватьИсключение ПодробноеПредставлениеОшибки(ОписаниеОшибки);
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОтменитьЗакрытьПериода(Организация,ПериодНачисления,Район,МКД) Экспорт 
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 	=
	"ВЫБРАТЬ
	|	энргНачисление.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргНачисление КАК энргНачисление
	|ГДЕ
	|	энргНачисление.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачисление.МКД = &МКД
	|	И энргНачисление.Район = &Район
	|	И энргНачисление.Проведен
	|	И энргНачисление.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеМКД.Ссылка
	|ИЗ
	|	Документ.энргНачислениеМКД КАК энргНачислениеМКД
	|ГДЕ
	|	энргНачислениеМКД.Организация = &Организация
	|	И энргНачислениеМКД.Район = &Район
	|	И энргНачислениеМКД.Проведен
	|	И энргНачислениеМКД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Проведен
	|	И энргПерерасчет.Организация = &Организация
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПерерасчет.МКД = &МКД
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаПоказаний)
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	энргЗакрытиеПериода.Проведен
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.Организация = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	
	Если МКД = Неопределено тогда
		Текст 			= СтрЗаменить(Текст,"И энргНачисление.МКД = &МКД","");
		Текст			= СтрЗаменить(Текст,"И энргПерерасчет.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 		= Текст;
	Результат  			= Запрос.Выполнить();
	Выборка 			= Результат.Выбрать();
	Пока Выборка.Следующий() цикл  		
		ДокОбъект  		= Выборка.ссылка.получитьОбъект();
		ДокОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",истина);
		ДокОбъект.УстановитьПометкуУдаления(Истина);		
	КонецЦикла; 
	
КонецПроцедуры

Процедура НачислениеПоРассрочке(Организация,ПериодНачисления,Район,МКД,Документ)  Экспорт 
	
	Если НЕ ПолучитьФункциональнуюОпцию("энргИспользоватьРассрочку") Тогда
		Возврат;
	КонецЕсли;
		
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	ДифференцированныйСпособРасчетаПроцентов(Организация, ПериодНачисления,Район,МКД,Документ,КонецПериодаРасчета);
	
	Если МКД = Неопределено тогда
		//Набор 							= РегистрыСведений.энргВыполненныеНачисления.СоздатьНаборЗаписей();
		//Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		//Набор.Отбор.Район.установить(Район);
		//Набор.Отбор.ВидОперацииНачисления.установить(Перечисления.энргВидыОперацийНачисления.ПроцентыЗаРассрочку);		
		//Набор.ДополнительныеСвойства.Вставить("ЗаписьРазрешена");
		//Запись 							= Набор.Добавить();
		//Запись.ПериодНачисления 		= ПериодНачисления;
		//Запись.Район					= Район;
		//Запись.ВидОперацииНачисления	= Перечисления.энргВидыОперацийНачисления.ПроцентыЗаРассрочку;
		//Набор.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура НачислитьПеню(Организация,ПериодНачисления,Район,МКД,Абонент,Документ) Экспорт  
	
	НачислятьПеню = Константы.энргНачислятьПеню.Получить();
	
	Если не НачислятьПеню тогда		
		Если МКД = Неопределено тогда
			//Набор 							= РегистрыСведений.энргВыполненныеНачисления.СоздатьНаборЗаписей();
			//Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
			//Набор.Отбор.Район.установить(Район);
			//Набор.Отбор.ВидОперацииНачисления.установить(Перечисления.энргВидыОперацийНачисления.НачислениеПени);
			//Набор.ДополнительныеСвойства.Вставить("ЗаписьРазрешена");
			//Запись 							= Набор.Добавить();
			//Запись.ПериодНачисления 		= ПериодНачисления;
			//Запись.Район					= Район;
			//Запись.ВидОперацииНачисления	= Перечисления.энргВидыОперацийНачисления.НачислениеПени;
			//Набор.Записать();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Запрос  								= Новый Запрос;
	Запрос.Текст 							=
	"ВЫБРАТЬ
	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент
	|ИЗ
	|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&Период, ) КАК энргСтавкиРефинансированияСрезПоследних";
	Результат  								= Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена информация по ставке рефинансирования,
		|	 Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка  								= Результат.Выбрать();
	Выборка.Следующий();
	СтавкаРефинансирования  				= Выборка.Коэффициент; 
	// Настройки начисления пени.
	Запрос  								= Новый Запрос;
	Запрос.Текст 			=
	"ВЫБРАТЬ
	|	энргНастройкиНачисленияПениСрезПоследних.ГлубинаОтсрочки,
	|	энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты,
	|	энргНастройкиНачисленияПениСрезПоследних.МаксимальнаяГлубинаЗадолженности
	|ИЗ
	|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних(&Период, Организация =&Организация ) КАК энргНастройкиНачисленияПениСрезПоследних";
	
	Результат  								= Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки начисления пени, Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка  									= Результат.Выбрать();
	Выборка.Следующий();
	ГлубинаОтсрочки 							= Выборка.ГлубинаОтсрочки;
	КрайнийСрокОплаты 							= Выборка.КрайнийСрокОплаты;
	МаксимальнаяГлубинаЗадолженности 			= Выборка.МаксимальнаяГлубинаЗадолженности;
	
	// Настройки начисления пени.
	Выборка  									= Результат.Выбрать();
	Запрос  									= Новый Запрос;
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.Текст 								=
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстатки.Район,
	|	энргВзаиморасчетыПоМесяцамОстатки.МКД,
	|	энргВзаиморасчетыПоМесяцамОстатки.Абонент,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга,
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления, МЕСЯЦ, &ГлубинаОтсрочки + 1), ДЕНЬ, &КрайнийСрокОплаты) КАК ДатаНачалаНачисленияПени,
	|	МЕСЯЦ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления, МЕСЯЦ, &ГлубинаОтсрочки + 1), ДЕНЬ, &КрайнийСрокОплаты)) КАК МесяцПени,
	|	&СтавкаРефинансирования КАК СтавкаРефинансирования
	|ПОМЕСТИТЬ ДанныеЗадолженности
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&Период,
	|			Организация =&Организация И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И Услуга = &Услуга) КАК энргВзаиморасчетыПоМесяцамОстатки
	|ГДЕ
	|	МЕСЯЦ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления, МЕСЯЦ, &ГлубинаОтсрочки + 1), ДЕНЬ, &КрайнийСрокОплаты))  < &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(энргНачислениеПени.Ссылка) КАК Ссылка,
	|	энргНачислениеПени.Район,
	|	энргНачислениеПени.МКД
	|ПОМЕСТИТЬ ДокументыНачисления
	|ИЗ
	|	Документ.энргНачислениеПени КАК энргНачислениеПени
	|ГДЕ
	|	энргНачислениеПени.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачислениеПени.Организация = &Организация
	|	И энргНачислениеПени.Район = &Район
	|	И энргНачислениеПени.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Район,
	|	энргНачислениеПени.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.МКД КАК МКД,
	|	ДанныеЗадолженности.Абонент,
	|	ДанныеЗадолженности.Услуга,
	|	ДанныеЗадолженности.ПериодНачисления,
	|	ДанныеЗадолженности.СуммаОстаток КАК СуммаЗадолженности,
	|	ЕСТЬNULL(ДокументыНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.энргначислениеПени.ПустаяСсылка)) КАК ДокументНачисления,
	|	ВЫБОР
	|		КОГДА ДанныеЗадолженности.МесяцПени +1 < &ПериодНачисления
	|			ТОГДА &КоличествоДней
	|		ИНАЧЕ РАЗНОСТЬДАТ(ДанныеЗадолженности.ДатаНачалаНачисленияПени, &ТекущийДеньначисления, ДЕНЬ)
	|	КОНЕЦ КАК ДнейПросрочки,
	|	ДанныеЗадолженности.СтавкаРефинансирования,
	|	ДанныеЗадолженности.СуммаОстаток * ВЫБОР
	|		КОГДА ДанныеЗадолженности.МесяцПени + 1 < &ПериодНачисления
	|			ТОГДА &КоличествоДней
	|		ИНАЧЕ РАЗНОСТЬДАТ(ДанныеЗадолженности.ДатаНачалаНачисленияПени, &ТекущийДеньначисления, ДЕНЬ)
	|	КОНЕЦ * ДанныеЗадолженности.СтавкаРефинансирования / 100 КАК СУммаПени
	|ИЗ
	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачисления КАК ДокументыНачисления
	|		ПО ДанныеЗадолженности.Район = ДокументыНачисления.Район
	|			И ДанныеЗадолженности.МКД = ДокументыНачисления.МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД";
	Выборка  									= Результат.Выбрать();
	ТекМКД  									= Неопределено; 
	ДокументОбъект 							= Неопределено;
	Пока Выборка.Следующий() цикл
		
		Если ТекМКД <> Выборка.МКД тогда
			Если ТекМКД<> Неопределено тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДокументНачисления) тогда
				ДокументОбъект  				= Выборка.ДокументНачисления.ПолучитьОбъект();
				ДокументОбъект.ПометкаУдаления  = Ложь;
				ТабЧасть 						= ДокументОбъект.ДанныеНачислений;
			иначе
				ДокументОбъект  				= Документы.энргНачислениеПени.СоздатьДокумент();
				ТабЧасть 						= ДокументОбъект.ДанныеНачислений;
			КонецЕсли;		
			ТабЧасть.очистить();			
		КонецЕсли;	
		
		СтрокаНачислений  						= ТабЧасть.добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНачислений,Выборка);
		
		ТекМКД 									= Выборка.МКД;		
	КонецЦикла; 
	
	Если ТекМКД<> Неопределено тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Если МКД = Неопределено тогда
		//Набор 									= РегистрыСведений.энргВыполненныеНачисления.СоздатьНаборЗаписей();
		//Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		//Набор.Отбор.Район.установить(Район);
		//Набор.Отбор.ВидОперацииНачисления.установить(Перечисления.энргВидыОперацийНачисления.НачислениеПени);
		//Набор.ДополнительныеСвойства.Вставить("ЗаписьРазрешена");
		//Запись 								= Набор.Добавить();
		//Запись.ПериодНачисления 				= ПериодНачисления;
		//Запись.Район							= Район;
		//Запись.ВидОперацииНачисления			= Перечисления.энргВидыОперацийНачисления.НачислениеПени;
		//Набор.Записать();
	КонецЕсли; 	 
	
КонецПроцедуры

Процедура ЗакрытьПериодДляРедактирования(Организация,ПериодНачисления,Район) Экспорт  
			
	ДокуметЗакрытия 				= ДокуметЗакрытияПериода(Организация, ПериодНачисления,Район);
	
	Если не ЗначениеЗаполнено(ДокуметЗакрытия) тогда
		ДокументОбъект 				= Документы.энргЗакрытиеПериода.СоздатьДокумент();
	иначе
		ДокументОбъект 				= ДокуметЗакрытия.ПолучитьОбъект();  
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",Истина);
	ДокументОбъект.Организация 		= Организация;
	ДокументОбъект.Район 			= Район;
	ДокументОбъект.ПериодНачисления = ПериодНачисления;
	ДокументОбъект.записать(РежимЗаписиДокумента.Запись);	
	
КонецПроцедуры

Функция ДанныеПерерасчета(Организация,Район,КлючПомещения,Абонент,ПериодНачисленияНачало,ПериодНачисленияКонец,Набор,НаборПомещений,КорректировкаПоказаний) Экспорт 
	
	ДанныеПомещения  = Новый Структура("КлючПомещения,ДополнительныеСвойства",КлючПомещения,Новый Структура);
	энргПроведениеСервер.ПрочитатьДанныеСтроения(ДанныеПомещения);	
	
	ПериодНовогоТарифа 								= Константы.энргДеньНачалаПримененияНовогоТарифа.Получить();
	ДанныеПерерасчета  								= Новый Структура("ОбъемыНачислений,ПерерасчетСреднего,КорректировкаПоказаний");
		
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисленияНачало);
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисленияКонец);
	КонецПериодаРасчета								= ГраницыПериода.ЗавершениеОП;
	
	МВТ  											= Новый МенеджерВременныхТаблиц;
	
	ДанныеСтроения 									= ДанныеПомещения.ДополнительныеСвойства.ДанныеСтроения;
	ДанныеСтроения.Вставить("КлючПомещения", КлючПомещения);
	
	РезультатЗапроса  								= ПересчитатьИндивидуальныйОбъем(МВТ,Организация, ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета,Район,ДанныеСтроения,Абонент,КорректировкаПоказаний,ПериодНовогоТарифа);	
	
	ОбработатьРезультатЗапросаНачислений(РезультатЗапроса, Набор, НаборПомещений, Ложь);
				
КонецФункции

Функция ЗаполнитьПоказанияДляПерерасчета(Организация,Район,Абонент,ПериодНачисленияКонец,Основания,Приемник,ИмяСвойства) Экспорт  
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Абонент",				Абонент);
	Запрос.УстановитьПараметр("ПериодНачисленияКонец",	ПериодНачисленияКонец);
	Запрос.УстановитьПараметр("ДокументыОснования",		Основания);
	Запрос.Текст 	="ВЫБРАТЬ
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчетаДо,
	|	ВложенныйЗапрос.Период КАК ДатаПоказаний,
	|	ВложенныйЗапрос.Регистратор КАК РегистраторПоказаний,
	|	ВложенныйЗапрос.Показание КАК ПоказанияДо,
	|	ВложенныйЗапрос.СостояниеПоказаний КАК СостояниеПоказанийДо,
	|	ВложенныйЗапрос.Переворот КАК ПереворотДо,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчетаПосле,
	|	ВложенныйЗапрос.Показание КАК ПоказанияПосле,
	|	ВложенныйЗапрос.СостояниеПоказаний КАК СостояниеПоказанийПосле,
	|	ВложенныйЗапрос.Переворот КАК ПереворотПосле,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ЕСТЬNULL(энргПредоставленныеПоказания.ВСрок, ЛОЖЬ) КАК ВСрокДо
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|		энргПоказанияПриборовУчета.Период КАК Период,
	|		энргПоказанияПриборовУчета.Регистратор КАК Регистратор,
	|		энргПоказанияПриборовУчета.Разделитель КАК Разделитель,
	|		энргПоказанияПриборовУчета.Показание КАК Показание,
	|		энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|		энргПоказанияПриборовУчета.КС КАК КС,
	|		энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|		энргПоказанияПриборовУчета.ПериодРегистрации КАК ДатаРегистратора
	|	ИЗ
	|		РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|	ГДЕ
	|		энргПоказанияПриборовУчета.Организация = &Организация
	|		И энргПоказанияПриборовУчета.Район = &Район
	|		И энргПоказанияПриборовУчета.Абонент = &Абонент
	|		И энргПоказанияПриборовУчета.ПериодНачисления <= &ПериодНачисленияКонец
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПоказанияПриборовУчета.ПриборУчета,
	|		энргПоказанияПриборовУчета.Период,
	|		энргПоказанияПриборовУчета.Регистратор,
	|		энргПоказанияПриборовУчета.Разделитель,
	|		энргПоказанияПриборовУчета.Показание,
	|		энргПоказанияПриборовУчета.СостояниеПоказаний,
	|		энргПоказанияПриборовУчета.КС,
	|		энргПоказанияПриборовУчета.Переворот,
	|		энргПоказанияПриборовУчета.ПериодРегистрации
	|	ИЗ
	|		РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|	ГДЕ
	|		энргПоказанияПриборовУчета.Организация = &Организация
	|		И энргПоказанияПриборовУчета.Район = &Район
	|		И энргПоказанияПриборовУчета.Абонент = &Абонент
	|		И энргПоказанияПриборовУчета.Регистратор В(&ДокументыОснования)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргОтклоненныеПерерасчетомПоказания КАК энргОтклоненныеПерерасчетомПоказания
	|		ПО ВложенныйЗапрос.Регистратор = энргОтклоненныеПерерасчетомПоказания.РегистраторПоказаний
	|			И ВложенныйЗапрос.ПриборУчета = энргОтклоненныеПерерасчетомПоказания.ПриборУчета
	|			И ВложенныйЗапрос.Разделитель = энргОтклоненныеПерерасчетомПоказания.Разделитель
	|			И (энргОтклоненныеПерерасчетомПоказания.ПериодНачисления <= &ПериодНачисленияКонец)
	|			И (энргОтклоненныеПерерасчетомПоказания.Район = &Район)
	|			И (энргОтклоненныеПерерасчетомПоказания.Абонент = &Абонент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|		ПО ВложенныйЗапрос.Регистратор = энргПредоставленныеПоказания.ДокРегистратор
	|			И ВложенныйЗапрос.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И ВложенныйЗапрос.Разделитель = энргПредоставленныеПоказания.Разделитель
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления <= &ПериодНачисленияКонец)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.Абонент = &Абонент)
	|ГДЕ
	|	энргОтклоненныеПерерасчетомПоказания.Район ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Регистратор";
	
	Результат  		= Запрос.Выполнить();
	Выборка 		= Результат.Выбрать();
	
	ТабличнаяЧасть 	= Приемник[ИмяСвойства];
	ТабличнаяЧасть.очистить();
	
	Пока Выборка.Следующий() цикл
		ЗаполнитьЗначенияСвойств(ТабличнаяЧасть.добавить(),Выборка);
	КонецЦикла;  
	
КонецФункции

// Процедура - НачислитьЛьготы
//
// Параметры:
//  ПериодНачисления - 	 - 
//  Район			 - 	 - 
//  Дом				 - 	 - 
//  Абонент			 - 	 - 
//  Документ		 - 	 - 
//
Процедура НачислитьЛьготы(Организация, ПериодНачисления,Район,Строение,Абонент,Документ) Экспорт
	// TODO FIX ME
	Возврат;
	ГраницыПериода  								= энргРаботаСПериодомДействия.ГраницыРасчетногоПериода(Организация, ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	//ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	КолвоМесЗадолженности = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКоличествоМесяцевЗадолженностиДляРасчетаЛьготыСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоМесяцевЗадолженностиДляРасчетаЛьготы.СрезПоследних(
		|			&Конец,
		|			Организация = &Организация
		|				И Район = &Район) КАК энргКоличествоМесяцевЗадолженностиДляРасчетаЛьготыСрезПоследних";
	
	Запрос.УстановитьПараметр("Конец", КонецПериодаРасчета - 1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолвоМесЗадолженности =  ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	Запрос 											= новый Запрос;
	Запрос.Текст 									= ПолучитьТекстЗапросаДляЛьготников();
	Если Строение=Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"энргОбъемНачислений.Строение = &Строение", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Строение", Строение);
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода", 		КонецПериодаРасчета);	
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("МесяцЗадолженности", ДобавитьМесяц(КонецПериодаРасчета - 1, -КолвоМесЗадолженности));

	результатЗапроса 								= Запрос.Выполнить();								
	КонецПериода  									= КонецМесяца(ПериодНачисления);
	
	Выборка  										= результатЗапроса.выбрать();

	ТекЧастныйСектор 								= Ложь;
	ТекСтроение  									= Неопределено;
	ДокументОбъект 									= Неопределено;
	Набор 											= Неопределено;
	
	Пока Выборка.следующий() цикл
		
		Если Документ = Неопределено тогда			
			Если  ТекСтроение <> Выборка.Строение тогда
				Если ТекСтроение<>Неопределено тогда
					НачатьТранзакцию();
					Попытка
						Если НЕ ДокументОбъект = Неопределено Тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
						Набор.ДополнительныеСвойства.Вставить("Район",				Район);
						Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
						Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор",		ТекЧастныйСектор);
						Набор.ДополнительныеСвойства.Вставить("Строение",			ТекСтроение);
						Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);						
						Набор.Записать(Ложь);						
						ЗафиксироватьТранзакцию();
					Исключение
						ОтменитьТранзакцию();
					КонецПопытки;					
				КонецЕсли;
				
				ДокументСсылка 						= Выборка.СсылкаНаСущДок;
				ПометкаУдаления 					= Выборка.ПометкаУдаления;
				ДокументОбъект  					= Неопределено;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка)  Тогда
					ДокументСсылка 					= Документы.энргНачислениеДляЛьготныхЛиц.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  				= Документы.энргНачислениеДляЛьготныхЛиц.СоздатьДокумент();
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
					ДокументОбъект.район  			= Район;
					ДокументОбъект.МКД 				= ?(Выборка.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка(), Выборка.Строение);
					ДокументОбъект.Дата				= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 		= Организация;
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект  				= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 	= Ложь;
				КонецЕсли;
				
				Набор 								= РегистрыНакопления.энргОбъемНачисленийДляЛьготныхЛиц.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				
				Если Не Абонент = Неопределено Тогда					
					Набор.ДополнительныеСвойства.Вставить("Абонент",	Абонент);
					Если ДокументОбъект = Неопределено Тогда
						Набор.Прочитать();
						СтрокиНабораДоЗаписи 							= Набор.Выгрузить();
						СтрокиУдалить 									= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Абонент", Абонент));
						Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
							СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						Набор.Очистить();
					КонецЕсли;					
				КонецЕсли;
				
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
				КонецЕсли;				
			КонецЕсли;
		иначе
			Набор 									= Документ.Движения.энргОбъемНачисленийДляЛьготныхЛиц; 
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Выборка.Абонент) Тогда
			СтрокНабора 								= Набор.добавить();
			ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
			СтрокНабора.Период							= КонецПериодаРасчета-1;
			СтрокНабора.Регистратор						= ДокументСсылка;
			СтрокНабора.ПериодРасчета 					= ПериодНачисления;
		КонецЕсли;
		
		ТекЧастныйСектор								= Выборка.ЧастныйСектор;
		ТекСтроение										= Выборка.Строение;
	КонецЦикла;	
	
	Если Документ = Неопределено и НЕ Набор = Неопределено и Набор.Количество() > 0 Тогда
		НачатьТранзакцию();
		Попытка 			
			Если НЕ ДокументОбъект = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
			Набор.ДополнительныеСвойства.Вставить("Район",				Район);
			Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
			Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор",		ТекЧастныйСектор);
			Набор.ДополнительныеСвойства.Вставить("Строение",			ТекСтроение);
			Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);
			 			
			Если НЕ Абонент = Неопределено и НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
				Набор.ДополнительныеСвойства.Вставить("Абонент",	Абонент);
				Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
					ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
				КонецЦикла;				
			КонецЕсли; 			
			
			Набор.Записать(Ложь);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке  						= ИнформацияОбОшибке();
			ВызватьИсключение (ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

Процедура ВспомогательныеДанныеНачисления(МВТ,Организация,ПериодНачисления,Район,Строение,Помещение,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	
			
	Если Не Помещение = Неопределено тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",	НЕ ЗначениеЗаполнено(Помещение));
		Запрос.УстановитьПараметр("Строение",		Строение);
		Запрос.УстановитьПараметр("Помещение",		Помещение);		
	ИначеЕсли Не Строение = Неопределено Тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",	НЕ ЗначениеЗаполнено(Строение));
		Запрос.УстановитьПараметр("Строение",		Строение);
		Если ЗначениеЗаполнено(Строение) Тогда
			Запрос.УстановитьПараметр("МКД", 		Строение);
		КонецЕсли;		
	КонецЕсли; 	
	
	Запрос.УстановитьПараметр("НачалоВеденияУчета",		Константы.энргДатаНачалаВеденияУчета.Получить());	 // Дата
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 // Дата
	Запрос.УстановитьПараметр("Организация",			Организация);	 // Дата
	Запрос.УстановитьПараметр("Район",					Район);	 // Районы
	Запрос.УстановитьПараметр("ДнейВПериоде",			ДнейВПериоде );
	Запрос.УстановитьПараметр("ПериодНовогоТарифа",		ПериодНовогоТарифа); // Число;
	
	Запрос.Текст 					= ТекстЗапросаВспомогательныеДанныеНачисления(Строение,Помещение);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ВспомогательныеДанныеПерерасчет(МВТ,Организация,ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета,Район,ДанныеСтроения,Абонент,ПериодНовогоТарифа)
	
	Текст  							= 
	"ВЫБРАТЬ
	|	энргДокументыНачислений.Организация КАК Организация,
	|	энргДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргДокументыНачислений.Район КАК Район,
	|	энргДокументыНачислений.МКД КАК МКД,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	энргДокументыНачислений.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользования,
	|	ЛОЖЬ КАК НормативПоДням
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|		ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.НачалоОП > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА ВложенныйЗапрос.НачалоОП
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.ЗавершениеОП > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ ВложенныйЗапрос.ЗавершениеОП
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|			ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГраницыОтчетногоПериода.Организация КАК Организация,
	|				ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) - 1
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодОкончания,
	|				ГраницыОтчетногоПериода.ЗавершениеОП КАК ЗавершениеОП,
	|				ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП
	|			ИЗ
	|				ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргДлительностиПериодов.СрезПоследних(, Организация = &Организация) КАК энргДлительностиПериодов
	|					ПО (ИСТИНА)) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП,
	|	ВложенныйЗапрос.Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода,
	|	СпособыРасчетаПоНаправлениям.Услуга,
	|	СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ КАК НаправлениеИспользования,
	|	СпособыРасчетаПоНаправлениям.НормативПоДням
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|		ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.НачалоОП > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА ВложенныйЗапрос.НачалоОП
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.НачалоОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ ВложенныйЗапрос.ЗавершениеОП МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА ВложенныйЗапрос.ЗавершениеОП > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ ВложенныйЗапрос.ЗавершениеОП
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|			ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ГраницыОтчетногоПериода.Организация КАК Организация,
	|				ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|				ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП,
	|				ГраницыОтчетногоПериода.ЗавершениеОП КАК ЗавершениеОП,
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) - 1
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(ГраницыОтчетногоПериода.ЗавершениеОП)
	|									ТОГДА ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|								ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(ГраницыОтчетногоПериода.ЗавершениеОП)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргДлительностиПериодов.СрезПоследних(, Организация = &Организация) КАК энргДлительностиПериодов
	|					ПО (ИСТИНА)) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО ВложенныйЗапрос.Сезонность = СпособыРасчетаПоНаправлениям.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	энргЗначенияТарифов.Значение КАК ЗначениеТарифа,
	|	энргЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.ДатаСменыТарифа КАК ДатаСменыТарифа
	|ПОМЕСТИТЬ ЗначенияТарифов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.ГруппаПотребителей КАК ГруппаПотребителей,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.Поставщик КАК Поставщик,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ВложенныйЗапрос.ДатаСменыТарифа КАК ДатаСменыТарифа,
	|		МАКСИМУМ(энргЗначенияТарифов.Период) КАК ПериодЗначенияТарифов
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДлительностьПериодов.Организация КАК Организация,
	|			ДлительностьПериодов.ПериодНачисления КАК ПериодНачисления,
	|			ДлительностьПериодов.НачалоОП КАК НачалоОП,
	|			энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|			энргЗначенияТарифов.Услуга КАК Услуга,
	|			энргЗначенияТарифов.Поставщик КАК Поставщик,
	|			энргЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|			энргЗначенияТарифов.Регистратор КАК Регистратор,
	|			ДОБАВИТЬКДАТЕ(энргЗначенияТарифов.Период, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|		ИЗ
	|			РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|				ПО энргЗначенияТарифов.Услуга = ДлительностьПериодов.Услуга
	|					И (энргЗначенияТарифов.Период МЕЖДУ ДлительностьПериодов.НачалоОП И ДлительностьПериодов.ЗавершениеОП)
	|					И (энргЗначенияТарифов.Организация = &Организация)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|			ПО ВложенныйЗапрос.ГруппаПотребителей = энргЗначенияТарифов.ГруппаПотребителей
	|				И ВложенныйЗапрос.Услуга = энргЗначенияТарифов.Услуга
	|				И ВложенныйЗапрос.Поставщик = энргЗначенияТарифов.Поставщик
	|				И ВложенныйЗапрос.ТарифнаяЗона = энргЗначенияТарифов.ТарифнаяЗона
	|				И ВложенныйЗапрос.Организация = энргЗначенияТарифов.Организация
	|				И (энргЗначенияТарифов.Организация = &Организация)
	|				И ВложенныйЗапрос.НачалоОП > энргЗначенияТарифов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.ГруппаПотребителей,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.Поставщик,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.Регистратор,
	|		ВложенныйЗапрос.ДатаСменыТарифа) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ПО ВложенныйЗапрос.ГруппаПотребителей = энргЗначенияТарифов.ГруппаПотребителей
	|			И ВложенныйЗапрос.Услуга = энргЗначенияТарифов.Услуга
	|			И ВложенныйЗапрос.Поставщик = энргЗначенияТарифов.Поставщик
	|			И ВложенныйЗапрос.ТарифнаяЗона = энргЗначенияТарифов.ТарифнаяЗона
	|			И ВложенныйЗапрос.Организация = энргЗначенияТарифов.Организация
	|			И (энргЗначенияТарифов.Организация = &Организация)
	|			И ВложенныйЗапрос.ПериодЗначенияТарифов = энргЗначенияТарифов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияАбонентов.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияАбонентов.Район КАК Район,
	|	энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСреднийОбъемПотребленияАбонентов.Строение КАК Строение,
	|	энргСреднийОбъемПотребленияАбонентов.Помещение КАК Помещение,
	|	энргСреднийОбъемПотребленияАбонентов.Услуга КАК Услуга,
	|	энргСреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияАбонентов.Объем КАК СреднийОбъем
	|ПОМЕСТИТЬ СреднееПотреблениеАбонентов
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК энргСреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	энргСреднийОбъемПотребленияАбонентов.Организация = &Организация
	|	И энргСреднийОбъемПотребленияАбонентов.ПериодНачисления МЕЖДУ &ПериодНачисленияНачало И &ПериодНачисленияКонец
	|	И энргСреднийОбъемПотребленияАбонентов.Район = &Район
	|	И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор
	|	И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение
	|	И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение КАК Строение,
	|	СтабильныеПериодыНачало.Помещение КАК Помещение,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериодыНачало.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачало.Организация = ДлительностьПериодов.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|			И СтабильныеПериодыНачало.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачало.ПериодРегистрации < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> ДлительностьПериодов.НачалоОП)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> ДлительностьПериодов.ЗавершениеОП)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНачало.Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления,
	|	СтабильныеПериодыНачало.Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение,
	|	СтабильныеПериодыНачало.Помещение,
	|	СтабильныеПериодыНачало.Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.НачалоФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение КАК Строение,
	|	СтабильныеПериодыНачало.Помещение КАК Помещение,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериодыНачало.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачало.Организация = ДлительностьПериодов.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|			И СтабильныеПериодыНачало.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачало.ПериодРегистрации < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> ДлительностьПериодов.НачалоОП)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> ДлительностьПериодов.ЗавершениеОП)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНачало.Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления,
	|	СтабильныеПериодыНачало.Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение,
	|	СтабильныеПериодыНачало.Помещение,
	|	СтабильныеПериодыНачало.Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.КонецФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение КАК Строение,
	|	СтабильныеПериодыНачало.Помещение КАК Помещение,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа КАК ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор КАК Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	МАКСИМУМ(СтабильныеПериодыНачало.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомераСтрокЗначениеТарифа
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
	|		ПО СтабильныеПериодыНачало.Организация = ЗначенияТарифов.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ЗначенияТарифов.ПериодНачисления
	|			И СтабильныеПериодыНачало.ПериодРегистрации < ЗначенияТарифов.ДатаСменыТарифа
	|			И СтабильныеПериодыНачало.Услуга = ЗначенияТарифов.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНачало.Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления,
	|	СтабильныеПериодыНачало.Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение,
	|	СтабильныеПериодыНачало.Помещение,
	|	СтабильныеПериодыНачало.Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа,
	|	ЗначенияТарифов.ЗначениеСверхНорматива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Период КАК Период,
	|	энргОбъемНачисленийОбороты.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийОбороты.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.СуммаОборот КАК СуммаОборот,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот
	|ПОМЕСТИТЬ НачисленныйОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ЧастныйСектор = &ЧастныйСектор
	|				И Строение = &Строение
	|				И Помещение = &Помещение
	|				И Абонент = &Абонент
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	|				И НЕ СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеОДН)) КАК энргОбъемНачисленийОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемПерерасчетаОбороты.Организация КАК Организация,
	|	энргОбъемПерерасчетаОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемПерерасчетаОбороты.Услуга КАК Услуга,
	|	энргОбъемПерерасчетаОбороты.Поставщик КАК Поставщик,
	|	энргОбъемПерерасчетаОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемПерерасчетаОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемПерерасчетаОбороты.СпособНачисления КАК СпособНачисления,
	|	энргОбъемПерерасчетаОбороты.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемПерерасчетаОбороты.СуммаОборот КАК СуммаОборот,
	|	энргОбъемПерерасчетаОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот
	|ПОМЕСТИТЬ ОбъемПерерасчет
	|ИЗ
	|	РегистрНакопления.энргОбъемПерерасчета.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ЧастныйСектор = &ЧастныйСектор
	|				И Строение = &Строение
	|				И Помещение = &Помещение
	|				И Абонент = &Абонент) КАК энргОбъемПерерасчетаОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа,
	|	СУММА(ВложенныйЗапрос.СуммаОборот) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.ОбъемУслугиОборот) КАК ОбъемУслуги
	|ПОМЕСТИТЬ ОбъемДляКорректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		НачисленныйОбъем.Услуга КАК Услуга,
	|		НачисленныйОбъем.Поставщик КАК Поставщик,
	|		НачисленныйОбъем.ТочкаУчета КАК ТочкаУчета,
	|		НачисленныйОбъем.ПриборУчета КАК ПриборУчета,
	|		НачисленныйОбъем.СпособНачисления КАК СпособНачисления,
	|		НачисленныйОбъем.ЗначениеТарифа КАК ЗначениеТарифа,
	|		НачисленныйОбъем.СуммаОборот КАК СуммаОборот,
	|		НачисленныйОбъем.ОбъемУслугиОборот КАК ОбъемУслугиОборот
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленныйОбъем КАК НачисленныйОбъем
	|			ПО (НачисленныйОбъем.Период МЕЖДУ ГраницыОтчетногоПериода.НачалоОП И ГраницыОтчетногоПериода.ЗавершениеОП)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОбъемПерерасчет.Организация,
	|		ОбъемПерерасчет.ПериодНачисления,
	|		ОбъемПерерасчет.Услуга,
	|		ОбъемПерерасчет.Поставщик,
	|		ОбъемПерерасчет.ТочкаУчета,
	|		ОбъемПерерасчет.ПриборУчета,
	|		ОбъемПерерасчет.СпособНачисления,
	|		ОбъемПерерасчет.ЗначениеТарифа,
	|		-ОбъемПерерасчет.СуммаОборот,
	|		-ОбъемПерерасчет.ОбъемУслугиОборот
	|	ИЗ
	|		ОбъемПерерасчет КАК ОбъемПерерасчет) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.Поставщик,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.СпособНачисления,
	|	ВложенныйЗапрос.ЗначениеТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ВложенныйЗапрос.ПлощадьМОП КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.ВидПлощади КАК ВидПлощади,
	|		энргЗначениеПлощадейМКД.Площадь КАК ПлощадьМОП
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|			энргЗначениеПлощадейМКД.ВидПлощади КАК ВидПлощади,
	|			МАКСИМУМ(энргЗначениеПлощадейМКД.Период) КАК Период
	|		ИЗ
	|			ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначениеПлощадейМКД КАК энргЗначениеПлощадейМКД
	|				ПО ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначениеПлощадейМКД.Период
	|					И (энргЗначениеПлощадейМКД.Организация = &Организация)
	|					И (энргЗначениеПлощадейМКД.Район = &Район)
	|					И (энргЗначениеПлощадейМКД.МКД = &МКД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГраницыОтчетногоПериода.ПериодНачисления,
	|			энргЗначениеПлощадейМКД.ВидПлощади) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначениеПлощадейМКД КАК энргЗначениеПлощадейМКД
	|			ПО ВложенныйЗапрос.Период = энргЗначениеПлощадейМКД.Период
	|				И ВложенныйЗапрос.ВидПлощади = энргЗначениеПлощадейМКД.ВидПлощади
	|				И (энргЗначениеПлощадейМКД.Организация = &Организация)
	|				И (энргЗначениеПлощадейМКД.Район = &Район)
	|				И (энргЗначениеПлощадейМКД.МКД = &МКД)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.ВидПлощади = энргВидыУслуг.ВидПлощадиМКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ВложенныйЗапрос.Площадь КАК ПлощадьАбонентов,
	|	0 КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		СУММА(энргЗначенияПлощадей.Площадь) КАК Площадь
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период
	|		ИЗ
	|			ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					энргЗначенияПлощадей.Период КАК Период,
	|					энргЗначенияПлощадей.ВидПлощади КАК ВидПлощади,
	|					энргЗначенияПлощадей.КлючПомещения КАК КлючПомещения
	|				ИЗ
	|					РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадей
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|						ПО энргЗначенияПлощадей.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|							И (энргЗначенияПлощадей.Организация = &Организация)
	|							И (энргЗначенияПлощадей.Район = &Район)
	|							И (энргКлючиПомещений.Строение = &МКД)
	|							И (энргЗначенияПлощадей.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))) КАК ВложенныйЗапрос
	|				ПО ГраницыОтчетногоПериода.ЗавершениеОП > ВложенныйЗапрос.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГраницыОтчетногоПериода.ПериодНачисления,
	|			ВложенныйЗапрос.КлючПомещения) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадей
	|			ПО ВложенныйЗапрос.Период = энргЗначенияПлощадей.Период
	|				И ВложенныйЗапрос.КлючПомещения = энргЗначенияПлощадей.КлючПомещения
	|				И (энргЗначенияПлощадей.Организация = &Организация)
	|				И (энргЗначенияПлощадей.Район = &Район)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ПериодНачисления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО (НЕ энргВидыУслуг.СоставнаяУслуга)
	|			И (энргВидыУслуг.ТипУслуги = ЗНАЧЕНИЕ(Перечисление.энргТипыУслуг.КоммунальныеУслуги))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.Организация КАК Организация,
	|	ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериоды.Район КАК Район,
	|	энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСтабильныеПериоды.Строение КАК Строение,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериоды.ПриборВведен) КАК ПриборВведен
	|ПОМЕСТИТЬ НаличиеПриборовУчетаСНачалаГода
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачало КАК энргСтабильныеПериоды
	|		ПО (НАЧАЛОПЕРИОДА(ГраницыОтчетногоПериода.ПериодНачисления, ГОД) = НАЧАЛОПЕРИОДА(энргСтабильныеПериоды.ПериодНачисления, ГОД))
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Организация,
	|	ГраницыОтчетногоПериода.ПериодНачисления,
	|	энргСтабильныеПериоды.Район,
	|	энргСтабильныеПериоды.ЧастныйСектор,
	|	энргСтабильныеПериоды.Строение,
	|	энргСтабильныеПериоды.Помещение,
	|	энргСтабильныеПериоды.Услуга";
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ЧастныйСектор",			ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение",				ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("Помещение",				ДанныеСтроения.Помещение);
	Запрос.УстановитьПараметр("МКД",					?(ДанныеСтроения.ЧастныйСектор,Справочники.энргСтроения.ПустаяСсылка(),ДанныеСтроения.Строение));
	Запрос.УстановитьПараметр("Абонент",				Абонент);
	Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",			КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисленияНачало",	ПериодНачисленияНачало);
	Запрос.УстановитьПараметр("ПериодНачисленияКонец",	ПериодНачисленияКонец);
	Запрос.УстановитьПараметр("ПериодНовогоТарифа",		ПериодНовогоТарифа);
	Запрос.Текст 					= Текст;  	
	Запрос.Выполнить();	
	
КонецПроцедуры

Процедура ПоказанияПерерасчет(МВТ,Организация,ПериодНачисленияНачало,ПериодНачисленияКонец,Район,ДанныеСтроения,КорректировкаПоказаний)
		
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= "ВЫБРАТЬ * ИЗ ПериодыПриемаПоказаний";
	Результат 						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	
	ПериодыПриемаПоказаний 			= Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ПериодыПриемаПоказаний.Вставить(Выборка.ПериодНачисления, Новый Структура("ДатаС,ДатаПо, НачалоПериодаРасчета", Выборка.ДатаС, Выборка.ДатаПо, Выборка.НачалоОП));
	КонецЦикла;
	
	Запрос 							= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	НачалоМесяца(ПериодНачисленияНачало -1));
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("ЧастныйСектор",		ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Помещение", 			ДанныеСтроения.Помещение);
	Запрос.Текст 					=
	"ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрез.Показания КАК Показания
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|ГДЕ
	|	энргМаксимальныеПоказанияСрез.Организация = &Организация
	|	И энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПериодНачисления
	|	И энргМаксимальныеПоказанияСрез.Район = &Район
	|	И энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор
	|	И энргМаксимальныеПоказанияСрез.Строение = &Строение
	|	И энргМаксимальныеПоказанияСрез.Помещение = &Помещение";
	
	Результат 						= Запрос.Выполнить();
	тзМаксимальныеСрез 				= Результат.Выгрузить();
	
	ПредоставленныеПоказания 		= Новый ТаблицаЗначений;
	ПредоставленныеПоказания.Колонки.Добавить("ПериодНачисления",			Новый ОписаниеТипов("Дата"));
	ПредоставленныеПоказания.Колонки.Добавить("ПриборУчета",				Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	ПредоставленныеПоказания.Колонки.Добавить("Шкала",						Новый ОписаниеТипов("СправочникСсылка.энргШкалыПриборовУчета"));
	ПредоставленныеПоказания.Колонки.Добавить("ТарифнаяЗона",				Новый ОписаниеТипов("СправочникСсылка.энргТарифныеЗоны"));
	ПредоставленныеПоказания.Колонки.Добавить("НомерПозиции",				Новый ОписаниеТипов("Число"));
	ПредоставленныеПоказания.Колонки.Добавить("Разделитель",				Новый ОписаниеТипов("Число"));
	ПредоставленныеПоказания.Колонки.Добавить("ДатаРегистратора",			Новый ОписаниеТипов("Дата"));
	ПредоставленныеПоказания.Колонки.Добавить("ДокРегистратор",				Новый ОписаниеТипов(Метаданные.РегистрыСведений.энргПредоставленныеПоказания.Измерения.ДокРегистратор.Тип.Типы()));
	ПредоставленныеПоказания.Колонки.Добавить("ВСрок",						Новый ОписаниеТипов("Булево"));
	ПредоставленныеПоказания.Колонки.Добавить("Показания",					Новый ОписаниеТипов("Число"));
	ПредоставленныеПоказания.Колонки.Добавить("ПоказанияТекущегоПериода",	Новый ОписаниеТипов("Булево"));
	  	
	КорректировкаПоказаний.Сортировать("ПериодНачисления,ПриборУчетаПосле,ШкалаПосле,ТарифнаяЗонаПосле,ДатаПоказаний,РегистраторПоказаний,Разделитель");
		
	ПредыдущиеПоказания 							= -1;
	
	текПериодНачисления								= Неопределено;
	текПриборУчета 									= Неопределено;
	текШкала	 									= Неопределено;
	текТарифнаяЗона									= Неопределено;
	ПоказанияПриняты 								= Перечисления.энргСостояниеПоказаний.Приняты;
	
	Для Каждого Строка Из КорректировкаПоказаний Цикл
		
		Если НЕ текПериодНачисления = Строка.ПериодНачисления
			ИЛИ НЕ текПриборУчета = Строка.ПриборУчетаПосле
			ИЛИ НЕ текШкала = Строка.ШкалаПосле
			ИЛИ НЕ текТарифнаяЗона = Строка.ТарифнаяЗонаПосле Тогда
			ТекНомерПозиции 						= 0;
		КонецЕсли;
		
		Если НЕ текПриборУчета = Строка.ПриборУчетаПосле
			ИЛИ НЕ текШкала = Строка.ШкалаПосле
			ИЛИ НЕ текТарифнаяЗона = Строка.ТарифнаяЗонаПосле Тогда
			
			СтрокиМаксимальныеСрез 					= тзМаксимальныеСрез.НайтиСтроки(Новый Структура("ПриборУчета,Шкала,ТарифнаяЗона",Строка.ПриборУчетаПосле, Строка.ШкалаПосле,Строка.ТарифнаяЗонаПосле));
			СтрокаСреза 							= Неопределено;
			Если СтрокиМаксимальныеСрез.Количество() = 0 Тогда
				МаксимальныеПоказания 				= 0; 
			Иначе
				СтрокаСреза 						= СтрокиМаксимальныеСрез[0];
				МаксимальныеПоказания 				= СтрокаСреза.Показания;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПериодыПриемаПоказаний[Строка.ПериодНачисления] = Неопределено Тогда
			ВСрок 									= Истина;
			ПоказанияТекущегоПериода 				= Истина;
		Иначе
			НачалоПериодаРасчета 					= ПериодыПриемаПоказаний[Строка.ПериодНачисления].НачалоПериодаРасчета;
			ПоказанияС 								= ПериодыПриемаПоказаний[Строка.ПериодНачисления].ДатаС;		
			ПоказанияПО 							= ПериодыПриемаПоказаний[Строка.ПериодНачисления].ДатаПо;
			ВСрок 									= Строка.ПериодРегистрации >= НачалоПериодаРасчета и День(Строка.ПериодРегистрации)>=ПоказанияС и День(Строка.ПериодРегистрации)<=ПоказанияПО;
			ПоказанияТекущегоПериода 				= Строка.ПериодРегистрации >= НачалоПериодаРасчета;
		КонецЕсли; 		
		
		Если Строка.СостояниеПоказанийПосле = ПоказанияПриняты Тогда
			МаксимальныеПоказания 					= Строка.ПоказанияПосле;
			Если СтрокаСреза = Неопределено Тогда
				СтрокаСреза  						= тзМаксимальныеСрез.Добавить();
				СтрокаСреза.ПриборУчета 			= Строка.ПриборУчетаПосле;
				СтрокаСреза.Шкала					= Строка.ШкалаПосле;
				СтрокаСреза.ТарифнаяЗона			= Строка.ТарифнаяЗонаПосле;
				СтрокаСреза.Показания 				= МаксимальныеПоказания;	
			Иначе
				 СтрокаСреза.Показания 				= МаксимальныеПоказания;
			КонецЕсли; 			
		КонецЕсли;
				
		Если Строка.СостояниеПоказанийПосле = ПоказанияПриняты или ВСрок тогда
			// Записываем набор.
			СтрокаНабор  							= ПредоставленныеПоказания.Добавить();
			
			СтрокаНабор.ПериодНачисления 			= Строка.ПериодНачисления;
			СтрокаНабор.ПриборУчета					= Строка.ПриборУчетаПосле;
			СтрокаНабор.Шкала						= Строка.ШкалаПосле;
			СтрокаНабор.ТарифнаяЗона				= Строка.ТарифнаяЗонаПосле;
			СтрокаНабор.НомерПозиции				= ТекНомерПозиции;
			СтрокаНабор.ДатаРегистратора  			= Строка.ДатаПоказаний;
			СтрокаНабор.ДокРегистратор  			= Строка.РегистраторПоказаний;
			СтрокаНабор.Разделитель		  			= Строка.Разделитель;
			СтрокаНабор.Показания  					= МаксимальныеПоказания;
			СтрокаНабор.ВСрок  						= ВСрок;
			СтрокаНабор.ПоказанияТекущегоПериода	= ПоказанияТекущегоПериода;
			ТекНомерПозиции 						= ТекНомерПозиции +1;			
		КонецЕсли;
		
		текПериодНачисления 						= Строка.ПериодНачисления;
		текПриборУчета 								= Строка.ПриборУчетаПосле;
		текШкала	 								= Строка.ШкалаПосле;
		текТарифнаяЗона								= Строка.ТарифнаяЗонаПосле;			
	КонецЦикла;
	
	Запрос 											= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 			НачалоМесяца(ПериодНачисленияНачало -1));
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("Район", 						Район);
	Запрос.УстановитьПараметр("ЧастныйСектор",				ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение", 					ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("Помещение", 					ДанныеСтроения.Помещение);
	Запрос.УстановитьПараметр("ПредоставленныеПоказания", 	ПредоставленныеПоказания);
	Запрос.МенеджерВременныхТаблиц 					= МВТ;
	Запрос.Текст  									= 
	"ВЫБРАТЬ
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	ПредоставленныеПоказания.Шкала КАК Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредоставленныеПоказания.НомерПозиции КАК НомерПозиции,
	|	ПредоставленныеПоказания.Разделитель КАК Разделитель,
	|	ПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	ПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор,
	|	ПредоставленныеПоказания.ВСрок КАК ВСрок,
	|	ПредоставленныеПоказания.Показания КАК Показания,
	|	ПредоставленныеПоказания.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ яПредоставленныеПоказания
	|ИЗ
	|	&ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	яПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	яПредоставленныеПоказания.Организация КАК Организация,
	|	яПредоставленныеПоказания.Район КАК Район,
	|	яПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	яПредоставленныеПоказания.Строение КАК Строение,
	|	яПредоставленныеПоказания.Помещение КАК Помещение,
	|	яПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	яПредоставленныеПоказания.Шкала КАК Шкала,
	|	яПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	яПредоставленныеПоказания.НомерПозиции КАК НомерПозиции,
	|	яПредоставленныеПоказания.Разделитель КАК Разделитель,
	|	яПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	яПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор,
	|	яПредоставленныеПоказания.ВСрок КАК ВСрок,
	|	яПредоставленныеПоказания.Показания КАК Показания,
	|	яПредоставленныеПоказания.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода,
	|	ГраницыОтчетногоПериода.ЗавершениеОП КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	яПредоставленныеПоказания КАК яПредоставленныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ПО яПредоставленныеПоказания.ПериодНачисления = ГраницыОтчетногоПериода.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредоставленныеПоказания.Показания КАК Показания,
	|	ПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	ПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.ПериодНачисленияПоказаний КАК ПериодНачисленияПоказаний,
	|		МАКСИМУМ(ПредоставленныеПоказания.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|			ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|			ПредоставленныеПоказания.Шкала КАК Шкала,
	|			ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|			МАКСИМУМ(ПредоставленныеПоказания.ПериодНачисления) КАК ПериодНачисленияПоказаний
	|		ИЗ
	|			ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|				ПО ГраницыОтчетногоПериода.ПериодНачисления >= ПредоставленныеПоказания.ПериодНачисления
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГраницыОтчетногоПериода.ПериодНачисления,
	|			ПредоставленныеПоказания.ПриборУчета,
	|			ПредоставленныеПоказания.Шкала,
	|			ПредоставленныеПоказания.ТарифнаяЗона) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|			ПО ВложенныйЗапрос.ПериодНачисленияПоказаний = ПредоставленныеПоказания.ПериодНачисления
	|				И ВложенныйЗапрос.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|				И ВложенныйЗапрос.Шкала = ПредоставленныеПоказания.Шкала
	|				И ВложенныйЗапрос.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.ПриборУчета,
	|		ВложенныйЗапрос.Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.ПериодНачисленияПоказаний) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО ВложенныйЗапрос.ПериодНачисленияПоказаний = ПредоставленныеПоказания.ПериодНачисления
	|			И ВложенныйЗапрос.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И ВложенныйЗапрос.Шкала = ПредоставленныеПоказания.Шкала
	|			И ВложенныйЗапрос.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|			И ВложенныйЗапрос.НомерПозиции = ПредоставленныеПоказания.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|	ВложенныйЗапрос.Показания КАК Показания,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ГраницыОтчетногоПериода.НачалоОП КАК Период,
	|	ГраницыОтчетногоПериода.ЗавершениеОП КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ МаксимальныеПоказанияСрез
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(МаксимальныеПоказания.ПериодНачисления, МЕСЯЦ), СЕКУНДА, 1) КАК ПериодНачисления,
	|		МаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|		МаксимальныеПоказания.Шкала КАК Шкала,
	|		МаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|		-1 КАК НомерПозиции,
	|		МаксимальныеПоказания.Показания КАК Показания,
	|		МаксимальныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|		МаксимальныеПоказания.ДокРегистратор КАК ДокРегистратор
	|	ИЗ
	|		МаксимальныеПоказания КАК МаксимальныеПоказания
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ), СЕКУНДА, 1),
	|		энргМаксимальныеПоказанияСрез.ПриборУчета,
	|		энргМаксимальныеПоказанияСрез.Шкала,
	|		энргМаксимальныеПоказанияСрез.ТарифнаяЗона,
	|		-1,
	|		энргМаксимальныеПоказанияСрез.Показания,
	|		энргМаксимальныеПоказанияСрез.ДатаРегистратора,
	|		энргМаксимальныеПоказанияСрез.ДокРегистратор
	|	ИЗ
	|		РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|	ГДЕ
	|		энргМаксимальныеПоказанияСрез.Организация = &Организация
	|		И энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПериодНачисления
	|		И энргМаксимальныеПоказанияСрез.Район = &Район
	|		И энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор
	|		И энргМаксимальныеПоказанияСрез.Строение = &Строение
	|		И энргМаксимальныеПоказанияСрез.Помещение = &Помещение) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ПО ВложенныйЗапрос.ПериодНачисления = ГраницыОтчетногоПериода.ПериодНачисления"; 
		
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьСтабильныеПериоды(МВТ,ЭтоПерерасчет)  
	
	Текст 							= ТекстПолучитьСтабильныеПериоды(ЭтоПерерасчет);
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачалоВеденияУчета", Константы.энргДатаНачалаВеденияУчета.Получить());
	Запрос.УстановитьПараметр("КонецПериодаРасчета", Константы.энргДатаНачалаВеденияУчета.Получить());
	Запрос.МенеджерВременныхТаблиц	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчета(МВТ,РасчетПоФормуле,ЭтоПерерасчет,ИмяДокумента)
	
	Текст 							= ТекстПолучитьДанныеДляРасчета();
	Запрос  						= Новый Запрос(Текст); 	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РассчитатьИндивидуальныйОбъемПотребления(МВТ); 
	
	Текст  							= ТекстРассчитатьИндивидуальныйОбъемПотребления();
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НеПрименятьЗависимостьЕслиБольшеОднойТочки", Константы.энргНеПрименятьЗависимостьЕслиБольшеОднойТочки.Получить());
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти 

#Область ТекстЗапросов

#Область ИндвидуальныеНачисления

Функция ТекстЗапросаВспомогательныеДанныеНачисления(Строение, Помещение)
	Текст  = 
	"ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	энргПоставщикиНеНачислятьСрезПоследних.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ПоставщикиНеНачислять
	|ИЗ
	|	РегистрСведений.энргПоставщикиНеНачислять.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргПоставщикиНеНачислятьСрезПоследних
	|ГДЕ
	|	энргПоставщикиНеНачислятьСрезПоследних.Использование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Организация КАК Организация,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Район КАК Район,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ЗначенияПовышающихКоэффициентов
	|ИЗ
	|	РегистрСведений.энгрЗначенияПовышающихКоэффициентов.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК энгрЗначенияПовышающихКоэффициентовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
	|	энргЗначенияТарифовСрезПоследних.Район КАК Район,
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК Строение,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (МКД = &Строение
	|					ИЛИ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))) КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргТипСхемыГВССрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргТипСхемыГВССрезПоследних.Район КАК Район,
	|	энргТипСхемыГВССрезПоследних.МКД КАК Строение,
	|	энргТипСхемыГВССрезПоследних.ТипСхемы КАК ТипСхемы
	|ПОМЕСТИТЬ ТипСхемыГВС
	|ИЗ
	|	РегистрСведений.энргТипСхемыГВС.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &Строение) КАК энргТипСхемыГВССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргТипПринадлежностиМКДСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргТипПринадлежностиМКДСрезПоследних.Район КАК Район,
	|	энргТипПринадлежностиМКДСрезПоследних.МКД КАК Строение,
	|	энргТипПринадлежностиМКДСрезПоследних.ВидТепловогоПункта КАК ВидТепловогоПункта
	|ПОМЕСТИТЬ ВидыТепловыхПунктов
	|ИЗ
	|	РегистрСведений.энргТипПринадлежностиМКД.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &Строение) КАК энргТипПринадлежностиМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.НаправлениеИспользованияТУ КАК НаправлениеИспользования,
	|	НастройкаСезонностиУслуг.МКД КАК Строение,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (МКД = &Строение
	|					ИЛИ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))) КАК НастройкаСезонностиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНормаСкоростиДвиженияВодыСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргНормаСкоростиДвиженияВодыСрезПоследних.СкоростьДвижения КАК СкоростьДвижения
	|ПОМЕСТИТЬ НормаСкоростиДвиженияВоды
	|ИЗ
	|	РегистрСведений.энргНормаСкоростиДвиженияВоды.СрезПоследних(&КонецПериодаРасчета, Организация = &Организация) КАК энргНормаСкоростиДвиженияВодыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	энргВидыУслуг.Ссылка КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользования,
	|	ЛОЖЬ КАК НормативПоДням
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА &НачалоПериодаРасчета
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ &КонецПериодаРасчета
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета)
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	&ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода,
	|	СпособыРасчетаПоНаправлениям.Услуга,
	|	СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ,
	|	СпособыРасчетаПоНаправлениям.НормативПоДням
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|							ТОГДА &НачалоПериодаРасчета
	|						ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК НачалоФактическогоПериода,
	|		ВЫБОР
	|			КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|				ТОГДА ВЫБОР
	|						КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|							ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|						ИНАЧЕ &КонецПериодаРасчета
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК КонецФактическогоПериода,
	|		ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|		ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|			ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргДлительностиПериодов.Сезонность КАК Сезонность,
	|				ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|				МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|				ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|				МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодНачало,
	|				ВЫБОР
	|					КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|						ТОГДА ВЫБОР
	|								КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|									ТОГДА ГОД(&КонецПериодаРасчета)
	|								ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|							КОНЕЦ
	|					ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|				КОНЕЦ КАК ГодОкончания
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов.СрезПоследних(&НачалоПериодаРасчета, Организация = &Организация) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО ВложенныйЗапрос.Сезонность = СпособыРасчетаПоНаправлениям.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифов.Услуга КАК Услуга,
	|	энргЗначенияТарифов.Поставщик КАК Поставщик,
	|	энргЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК ЗначениеТарифа,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифов.Регистратор КАК Регистратор,
	|	ДОБАВИТЬКДАТЕ(энргЗначенияТарифов.Период, ДЕНЬ, &ПериодНовогоТарифа - 1) КАК ДатаСменыТарифа
	|ПОМЕСТИТЬ ЗначенияТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|				&НачалоПериодаРасчета,
	|				Организация = &Организация
	|					И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|		ПО энргЗначенияТарифов.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И энргЗначенияТарифов.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|			И энргЗначенияТарифов.Поставщик = энргЗначенияТарифовСрезПоследних.Поставщик
	|			И энргЗначенияТарифов.ТарифнаяЗона = энргЗначенияТарифовСрезПоследних.ТарифнаяЗона
	|			И (энргЗначенияТарифов.Период МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргДокументыНачислений.Организация КАК Организация,
	|	энргДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргДокументыНачислений.Район КАК Район,
	|	энргДокументыНачислений.МКД КАК МКД,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	энргДокументыНачислений.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|ГДЕ
	|	энргДокументыНачислений.Организация = &Организация
	|	И энргДокументыНачислений.ПериодНачисления = &ПериодНачисления
	|	И энргДокументыНачислений.Район = &Район
	|	И энргДокументыНачислений.МКД = &Строение
	|	И энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.Индивидуальные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияАбонентов.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияАбонентов.Район КАК Район,
	|	энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСреднийОбъемПотребленияАбонентов.Строение КАК Строение,
	|	энргСреднийОбъемПотребленияАбонентов.Помещение КАК Помещение,
	|	энргСреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияАбонентов.Услуга КАК Услуга,
	|	энргСреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияАбонентов.Объем КАК СреднийОбъем
	|ПОМЕСТИТЬ СреднееПотреблениеАбонентов
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК энргСреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	энргСреднийОбъемПотребленияАбонентов.Организация = &Организация
	|	И энргСреднийОбъемПотребленияАбонентов.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребленияАбонентов.Район = &Район
	|	И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор
	|	И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение
	|	И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыШкалы.Организация КАК Организация,
	|	энргСтабильныеПериодыШкалы.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыШкалы.Район КАК Район,
	|	энргСтабильныеПериодыШкалы.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСтабильныеПериодыШкалы.Строение КАК Строение,
	|	энргСтабильныеПериодыШкалы.Помещение КАК Помещение,
	|	энргСтабильныеПериодыШкалы.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыШкалы.Шкала КАК Шкала,
	|	энргСтабильныеПериодыШкалы.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериодыШкалы.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыШкалы КАК энргСтабильныеПериодыШкалы
	|ГДЕ
	|	энргСтабильныеПериодыШкалы.Организация = &Организация
	|	И энргСтабильныеПериодыШкалы.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыШкалы.Район = &Район
	|	И энргСтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор
	|	И энргСтабильныеПериодыШкалы.Строение = &Строение
	|	И энргСтабильныеПериодыШкалы.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыИзмерителиНаправлений.Организация КАК Организация,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Район КАК Район,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Строение КАК Строение,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Помещение КАК Помещение,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Услуга КАК Услуга,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыИзмерителиНаправлений.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Измеритель КАК Измеритель,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Количество КАК Количество,
	|	энргСтабильныеПериодыИзмерителиНаправлений.КлючНорматива КАК КлючНорматива
	|ПОМЕСТИТЬ СтабильныеПериодыИзмерителиНаправлений
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК энргСтабильныеПериодыИзмерителиНаправлений
	|ГДЕ
	|	энргСтабильныеПериодыИзмерителиНаправлений.Организация = &Организация
	|	И энргСтабильныеПериодыИзмерителиНаправлений.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыИзмерителиНаправлений.Район = &Район
	|	И энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор
	|	И энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение
	|	И энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрез.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргМаксимальныеПоказанияСрез.Район КАК Район,
	|	энргМаксимальныеПоказанияСрез.ЧастныйСектор КАК ЧастныйСектор,
	|	энргМаксимальныеПоказанияСрез.Строение КАК Строение,
	|	энргМаксимальныеПоказанияСрез.Помещение КАК Помещение,
	|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрез.Показания КАК Показания,
	|	энргМаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	энргМаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора,
	|	&НачалоПериодаРасчета КАК Период,
	|	&КонецПериодаРасчета КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ МаксимальныеПоказанияСрез
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|ГДЕ
	|	энргМаксимальныеПоказанияСрез.Организация = &Организация
	|	И энргМаксимальныеПоказанияСрез.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|	И энргМаксимальныеПоказанияСрез.Район = &Район
	|	И энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор
	|	И энргМаксимальныеПоказанияСрез.Строение = &Строение
	|	И энргМаксимальныеПоказанияСрез.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрез.Организация КАК Организация,
	|	энргМаксимальныеПоказанияСрез.ПериодНачисления КАК ПериодНачисления,
	|	энргМаксимальныеПоказанияСрез.Район КАК Район,
	|	энргМаксимальныеПоказанияСрез.ЧастныйСектор КАК ЧастныйСектор,
	|	энргМаксимальныеПоказанияСрез.Строение КАК Строение,
	|	энргМаксимальныеПоказанияСрез.Помещение КАК Помещение,
	|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрез.Показания КАК Показания
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|ГДЕ
	|	энргМаксимальныеПоказанияСрез.Организация = &Организация
	|	И энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПериодНачисления
	|	И энргМаксимальныеПоказанияСрез.Район = &Район
	|	И энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор
	|	И энргМаксимальныеПоказанияСрез.Строение = &Строение
	|	И энргМаксимальныеПоказанияСрез.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПредоставленныеПоказания.Организация КАК Организация,
	|	энргПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	энргПредоставленныеПоказания.Район КАК Район,
	|	энргПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПредоставленныеПоказания.Строение КАК Строение,
	|	энргПредоставленныеПоказания.Помещение КАК Помещение,
	|	энргПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргПредоставленныеПоказания.Шкала КАК Шкала,
	|	энргПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргПредоставленныеПоказания.НомерПозиции КАК НомерПозиции,
	|	энргПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор,
	|	энргПредоставленныеПоказания.Показания КАК Показания,
	|	энргПредоставленныеПоказания.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода,
	|	энргПредоставленныеПоказания.ВСрок КАК ВСрок,
	|	&КонецПериодаРасчета КАК КонецПериодаРасчета
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|ГДЕ
	|	энргПредоставленныеПоказания.Организация = &Организация
	|	И энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления
	|	И энргПредоставленныеПоказания.Район = &Район
	|	И энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор
	|	И энргПредоставленныеПоказания.Строение = &Строение
	|	И энргПредоставленныеПоказания.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргВыводПриборовУчета.Организация КАК Организация,
	|	энргВыводПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргВыводПриборовУчета.Район КАК Район,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргВыводПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргВыводПриборовУчета.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	РегистрСведений.энргВыводПриборовУчета КАК энргВыводПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО энргВыводПриборовУчета.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|			И (энргВыводПриборовУчета.Организация = &Организация)
	|			И (энргВыводПриборовУчета.ПериодНачисления = &ПериодНачисления)
	|			И (энргВыводПриборовУчета.Район = &Район)
	|			И (энргКлючиПомещений.Строение = &Строение)
	|			И (энргКлючиПомещений.Помещение = &Помещение)
	|			И (энргКлючиПомещений.ЧастныйСектор = &ЧастныйСектор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериода.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериода.ЧастныйСектор КАК ЧастныйСектор,
	|	энргНомераСтрокСтабильногоПериода.Строение КАК Строение,
	|	энргНомераСтрокСтабильногоПериода.Помещение КАК Помещение,
	|	энргНомераСтрокСтабильногоПериода.Услуга КАК Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НаправлениеИспользования КАК НаправлениеИспользования,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности,
	|	ДлительностьПериодов.НормативПоДням КАК НормативПоДням
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериода КАК энргНомераСтрокСтабильногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (энргНомераСтрокСтабильногоПериода.Организация = &Организация)
	|			И (энргНомераСтрокСтабильногоПериода.ПериодНачисления = &ПериодНачисления)
	|			И (энргНомераСтрокСтабильногоПериода.Район = &Район)
	|			И (энргНомераСтрокСтабильногоПериода.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)
	|			И (энргНомераСтрокСтабильногоПериода.Помещение = &Помещение)
	|			И энргНомераСтрокСтабильногоПериода.Услуга = ДлительностьПериодов.Услуга
	|			И энргНомераСтрокСтабильногоПериода.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериода.Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район,
	|	энргНомераСтрокСтабильногоПериода.ЧастныйСектор,
	|	энргНомераСтрокСтабильногоПериода.Строение,
	|	энргНомераСтрокСтабильногоПериода.Помещение,
	|	энргНомераСтрокСтабильногоПериода.Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.НачалоФактическогоПериода,
	|	ДлительностьПериодов.НормативПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериода.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериода.ЧастныйСектор КАК ЧастныйСектор,
	|	энргНомераСтрокСтабильногоПериода.Строение КАК Строение,
	|	энргНомераСтрокСтабильногоПериода.Помещение КАК Помещение,
	|	энргНомераСтрокСтабильногоПериода.Услуга КАК Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НаправлениеИспользования КАК НаправлениеИспользования,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности,
	|	ДлительностьПериодов.НормативПоДням КАК НормативПоДням
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериода КАК энргНомераСтрокСтабильногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (энргНомераСтрокСтабильногоПериода.Организация = &Организация)
	|			И (энргНомераСтрокСтабильногоПериода.ПериодНачисления = &ПериодНачисления)
	|			И (энргНомераСтрокСтабильногоПериода.Район = &Район)
	|			И (энргНомераСтрокСтабильногоПериода.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)
	|			И (энргНомераСтрокСтабильногоПериода.Помещение = &Помещение)
	|			И энргНомераСтрокСтабильногоПериода.Услуга = ДлительностьПериодов.Услуга
	|			И энргНомераСтрокСтабильногоПериода.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериода.Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район,
	|	энргНомераСтрокСтабильногоПериода.ЧастныйСектор,
	|	энргНомераСтрокСтабильногоПериода.Строение,
	|	энргНомераСтрокСтабильногоПериода.Помещение,
	|	энргНомераСтрокСтабильногоПериода.Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета,
	|	ДлительностьПериодов.НаправлениеИспользования,
	|	ДлительностьПериодов.КонецФактическогоПериода,
	|	ДлительностьПериодов.НормативПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериода.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериода.ЧастныйСектор КАК ЧастныйСектор,
	|	энргНомераСтрокСтабильногоПериода.Строение КАК Строение,
	|	энргНомераСтрокСтабильногоПериода.Помещение КАК Помещение,
	|	энргНомераСтрокСтабильногоПериода.Услуга КАК Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета КАК ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа КАК ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор КАК Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомераСтрокЗначениеТарифа
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериода КАК энргНомераСтрокСтабильногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
	|		ПО (энргНомераСтрокСтабильногоПериода.Организация = &Организация)
	|			И (энргНомераСтрокСтабильногоПериода.ПериодНачисления = &ПериодНачисления)
	|			И (энргНомераСтрокСтабильногоПериода.Район = &Район)
	|			И (энргНомераСтрокСтабильногоПериода.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)
	|			И (энргНомераСтрокСтабильногоПериода.Помещение = &Помещение)
	|			И энргНомераСтрокСтабильногоПериода.ДатаРегистратора < ЗначенияТарифов.ДатаСменыТарифа
	|			И энргНомераСтрокСтабильногоПериода.Услуга = ЗначенияТарифов.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериода.Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район,
	|	энргНомераСтрокСтабильногоПериода.ЧастныйСектор,
	|	энргНомераСтрокСтабильногоПериода.Строение,
	|	энргНомераСтрокСтабильногоПериода.Помещение,
	|	энргНомераСтрокСтабильногоПериода.Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета,
	|	ЗначенияТарифов.ДатаСменыТарифа,
	|	ЗначенияТарифов.ГруппаПотребителей,
	|	ЗначенияТарифов.Регистратор,
	|	ЗначенияТарифов.ЗначениеТарифа,
	|	ЗначенияТарифов.ЗначениеСверхНорматива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериодыМКД.Организация КАК Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район КАК Район,
	|		энргСтабильныеПериодыМКД.МКД КАК МКД,
	|		энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргСтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|	ГДЕ
	|		энргСтабильныеПериодыМКД.Организация = &Организация
	|		И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|		И энргСтабильныеПериодыМКД.Район = &Район
	|		И энргСтабильныеПериодыМКД.МКД = &МКД
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериодыМКД.Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район,
	|		энргСтабильныеПериодыМКД.МКД,
	|		энргСтабильныеПериодыМКД.Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = энргСтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргСтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = энргСтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргСтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериодыМКД.НомерПозиции
	|			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКД.Район = &Район)
	|			И (энргСтабильныеПериодыМКД.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКД.Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район,
	|	энргСтабильныеПериодыМКД.МКД,
	|	энргСтабильныеПериодыМКД.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонента) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериоды.Организация КАК Организация,
	|		энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериоды.Район КАК Район,
	|		энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение КАК Строение,
	|		энргСтабильныеПериоды.Помещение КАК Помещение,
	|		энргСтабильныеПериоды.Услуга КАК Услуга,
	|		МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади) КАК ПлощадьАбонента,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|					ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация КАК Организация,
	|			энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|			энргСтабильныеПериоды.Район КАК Район,
	|			энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение КАК Строение,
	|			энргСтабильныеПериоды.Помещение КАК Помещение,
	|			энргСтабильныеПериоды.Услуга КАК Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ГДЕ
	|			энргСтабильныеПериоды.Организация = &Организация
	|			И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|			И энргСтабильныеПериоды.Район = &Район
	|			И НЕ энргСтабильныеПериоды.ЧастныйСектор
	|			И энргСтабильныеПериоды.Строение = &МКД
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.ПериодНачисления,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ПО ВложенныйЗапрос.Организация = энргСтабильныеПериоды.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|				И ВложенныйЗапрос.Район = энргСтабильныеПериоды.Район
	|				И ВложенныйЗапрос.ЧастныйСектор = энргСтабильныеПериоды.ЧастныйСектор
	|				И ВложенныйЗапрос.Строение = энргСтабильныеПериоды.Строение
	|				И ВложенныйЗапрос.Помещение = энргСтабильныеПериоды.Помещение
	|				И ВложенныйЗапрос.Услуга = энргСтабильныеПериоды.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				И (энргСтабильныеПериоды.Организация = &Организация)
	|				И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|				И (энргСтабильныеПериоды.Район = &Район)
	|				И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|				И (энргСтабильныеПериоды.Строение = &МКД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		энргСтабильныеПериоды.Услуга) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериоды.Район КАК Район,
	|	энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСтабильныеПериоды.Строение КАК Строение,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериоды.ПриборВведен) КАК ПриборВведен
	|ПОМЕСТИТЬ НаличиеПриборовУчетаСНачалаГода
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|ГДЕ
	|	энргСтабильныеПериоды.Организация = &Организация
	|	И энргСтабильныеПериоды.ПериодНачисления МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД) И &ПериодНачисления
	|	И энргСтабильныеПериоды.Район = &Район
	|	И энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор
	|	И энргСтабильныеПериоды.Строение = &Строение
	|	И энргСтабильныеПериоды.Помещение = &Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Организация,
	|	энргСтабильныеПериоды.Район,
	|	энргСтабильныеПериоды.ЧастныйСектор,
	|	энргСтабильныеПериоды.Строение,
	|	энргСтабильныеПериоды.Помещение,
	|	энргСтабильныеПериоды.Услуга
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","энргСтабильныеПериоды","ПериодРегистрации",Истина,Ложь) + "
	|	ВЫБОР
	|		КОГДА энргСтабильныеПериоды.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ энргСтабильныеПериоды.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА энргСтабильныеПериоды.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргСтабильныеПериоды.Строение
	|	КОНЕЦ КАК МКД,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&КонецПериодаРасчета КАК ЗавершениеОП,
	|	&ДнейВПериоде КАК ДнейВПериоде
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|ГДЕ
	|	энргСтабильныеПериоды.Организация = &Организация
	|	И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериоды.Район = &Район
	|	И энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор
	|	И энргСтабильныеПериоды.Строение = &Строение
	|	И энргСтабильныеПериоды.Помещение = &Помещение";
		
	
	Если Строение = Неопределено Тогда
	    Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор","");
		Текст 		= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 		= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор","");
		Текст 		= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор","");
		Текст 		= СтрЗаменить(Текст,"И энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор","");
		Текст 		= СтрЗаменить(Текст,"И (энргКлючиПомещений.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыШкалы.Строение = &Строение)",""); 		
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение)","");
		
		Текст 		= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрез.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И энргПредоставленныеПоказания.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		Текст 		= СтрЗаменить(Текст,"И (МКД = &Строение","И (ИСТИНА");
		Текст 		= СтрЗаменить(Текст,"И МКД = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И энргДокументыНачислений.МКД = &Строение","");
			
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыШкалы.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрез.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И энргПредоставленныеПоказания.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &МКД","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &МКД)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &МКД","");	
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.МКД = &МКД)","");
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда	
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыШкалы.Строение = &Строение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрез.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И энргПредоставленныеПоказания.Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		Текст 		= СтрЗаменить(Текст,"И (МКД = &Строение","И (ИСТИНА");
		Текст 		= СтрЗаменить(Текст,"И МКД = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И энргДокументыНачислений.МКД = &Строение","И энргДокументыНачислений.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)");
		
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыШкалы.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрез.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И энргПредоставленныеПоказания.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)",""); 		
		
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &Строение","И ЛОЖЬ");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &МКД","И ЛОЖЬ");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &МКД)","И ЛОЖЬ");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &МКД","И ЛОЖЬ");	
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.МКД = &МКД)","И ЛОЖЬ");
		
	ИначеЕсли Помещение = Неопределено Тогда
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыШкалы.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");
		Текст 		= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрез.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И энргПредоставленныеПоказания.Помещение = &Помещение","");
		Текст 		= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");		
	КонецЕсли;	

	Возврат Текст;
	
КонецФункции

Функция ТекстПолучитьСтабильныеПериоды(ЭтоПерерасчет)
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьМОП) КАК ПлощадьМОП,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначенияПлощадейСтроений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначениеПлощадейМКД.Организация КАК Организация,
	|		ЗначениеПлощадейМКД.ПериодНачисления КАК ПериодНачисления,
	|		ЗначениеПлощадейМКД.Район КАК Район,
	|		ЗначениеПлощадейМКД.МКД КАК МКД,
	|		ЗначениеПлощадейМКД.Услуга КАК Услуга,
	|		ЗначениеПлощадейМКД.ПлощадьМОП КАК ПлощадьМОП,
	|		0 КАК ПлощадьАбонентов,
	|		0 КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеПлощадейМКД КАК ЗначениеПлощадейМКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗначениеИндивидуальныхПлощадей.Организация,
	|		ЗначениеИндивидуальныхПлощадей.ПериодНачисления,
	|		ЗначениеИндивидуальныхПлощадей.Район,
	|		ЗначениеИндивидуальныхПлощадей.Строение,
	|		ЗначениеИндивидуальныхПлощадей.Услуга,
	|		0,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьАбонентов,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеИндивидуальныхПлощадей КАК ЗначениеИндивидуальныхПлощадей) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПоказанияСрез.Организация КАК Организация,
	|	МаксимальныеПоказанияСрез.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныеПоказанияСрез.Район КАК Район,
	|	МаксимальныеПоказанияСрез.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныеПоказанияСрез.Строение КАК Строение,
	|	МаксимальныеПоказанияСрез.Помещение КАК Помещение,
	|	МаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	МаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныеПоказанияСрез.Показания КАК Показания,
	|	МаксимальныеПоказанияСрез.Период КАК Период,
	|	-1 КАК НомерПозиции,
	|	МаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	МаксимальныеПоказанияСрез.КонецПериодаРасчета
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение,
	|	ПредоставленныеПоказания.Помещение,
	|	ПредоставленныеПоказания.ПриборУчета,
	|	ПредоставленныеПоказания.Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона,
	|	ПредоставленныеПоказания.Показания,
	|	ПредоставленныеПоказания.ДатаРегистратора,
	|	ПредоставленныеПоказания.НомерПозиции,
	|	ПредоставленныеПоказания.ДокРегистратор,
	|	ПредоставленныеПоказания.КонецПериодаРасчета
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	ПоказанияНачало.Строение КАК Строение,
	|	ПоказанияНачало.Помещение КАК Помещение,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА ПоказанияНачало.КонецПериодаРасчета
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.ЧастныйСектор = ПоказанияКонец.ЧастныйСектор
	|			И ПоказанияНачало.Строение = ПоказанияКонец.Строение
	|			И ПоказанияНачало.Помещение = ПоказанияКонец.Помещение
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение КАК Строение,
	|	ПредоставленныеПоказания.Помещение КАК Помещение,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(ПредоставленныеПоказания.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоАбоненту
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение,
	|	ПредоставленныеПоказания.Помещение,
	|	ПредоставленныеПоказания.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение КАК Строение,
	|	ПредоставленныеПоказания.Помещение КАК Помещение,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	ПредоставленныеПоказания.Шкала КАК Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(ПредоставленныеПоказания.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказанияВСрок
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение,
	|	ПредоставленныеПоказания.Помещение,
	|	ПредоставленныеПоказания.ПриборУчета,
	|	ПредоставленныеПоказания.Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыНачало","Шкала",Истина,Ложь) + "	
	|	СтабильныеПериодыНачало.ПериодРегистрации,
	|	СтабильныеПериодыНачало.МКД,
	|	СтабильныеПериодыНачало.НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачало.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПривязанаКШкале
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоШкалы
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО СтабильныеПериодыНачало.Организация = СтабильныеПериодыШкалы.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СтабильныеПериодыШкалы.Район
	|			И СтабильныеПериодыНачало.ЧастныйСектор = СтабильныеПериодыШкалы.ЧастныйСектор
	|			И СтабильныеПериодыНачало.Строение = СтабильныеПериодыШкалы.Строение
	|			И СтабильныеПериодыНачало.Помещение = СтабильныеПериодыШкалы.Помещение
	|			И СтабильныеПериодыНачало.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|			И СтабильныеПериодыНачало.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыНачало.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтабильныеПериодыНачало.Шкала = СтабильныеПериодыШкалы.Шкала
	|			КОНЕЦ)	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокНачалоСезонности.Организация КАК Организация,
	|	НомераСтрокНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокНачалоСезонности.Район КАК Район,
	|	НомераСтрокНачалоСезонности.ЧастныйСектор КАК ЧастныйСектор,
	|	НомераСтрокНачалоСезонности.Строение КАК Строение,
	|	НомераСтрокНачалоСезонности.Помещение КАК Помещение,
	|	НомераСтрокНачалоСезонности.Услуга КАК Услуга,
	|	НомераСтрокНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокНачалоСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокНачалоСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокНачалоСезонности КАК НомераСтрокНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокНачалоСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокНачалоСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокНачалоСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокНачалоСезонности.ЧастныйСектор = СтабильныеПериодыНачало.ЧастныйСектор
	|			И НомераСтрокНачалоСезонности.Строение = СтабильныеПериодыНачало.Строение
	|			И НомераСтрокНачалоСезонности.Помещение = СтабильныеПериодыНачало.Помещение
	|			И НомераСтрокНачалоСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокНачалоСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокНачалоСезонности.НаправлениеИспользования = СтабильныеПериодыНачало.НаправлениеИспользованияТУ
	|			И НомераСтрокНачалоСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|			И (НЕ СтабильныеПериодыНачало.РасчетПоФормуле)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокКонецСезонности.Организация КАК Организация,
	|	НомераСтрокКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокКонецСезонности.Район КАК Район,
	|	НомераСтрокКонецСезонности.ЧастныйСектор КАК ЧастныйСектор,
	|	НомераСтрокКонецСезонности.Строение КАК Строение,
	|	НомераСтрокКонецСезонности.Помещение КАК Помещение,
	|	НомераСтрокКонецСезонности.Услуга КАК Услуга,
	|	НомераСтрокКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	НомераСтрокКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокКонецСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокКонецСезонности КАК НомераСтрокКонецСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокКонецСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокКонецСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокКонецСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокКонецСезонности.ЧастныйСектор = СтабильныеПериодыНачало.ЧастныйСектор
	|			И НомераСтрокКонецСезонности.Строение = СтабильныеПериодыНачало.Строение
	|			И НомераСтрокКонецСезонности.Помещение = СтабильныеПериодыНачало.Помещение
	|			И НомераСтрокКонецСезонности.Услуга = СтабильныеПериодыНачало.Услуга
	|			И НомераСтрокКонецСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокКонецСезонности.НаправлениеИспользования = СтабильныеПериодыНачало.НаправлениеИспользованияТУ
	|			И НомераСтрокКонецСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|			И (НЕ СтабильныеПериодыНачало.РасчетПоФормуле)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","НомерПозиции",Истина,Ложь) + "
	|	ВЫБОР
	|		КОГДА НомераСтрокЗначениеТарифа.НомерПозиции ЕСТЬ NULL
	|				ИЛИ ПредоставленныеПоказания.Помещение ЕСТЬ NULL
	|			ТОГДА СтабильныеПериоды.НомерПозиции
	|		КОГДА СтабильныеПериоды.НомерПозиции > НомераСтрокЗначениеТарифа.НомерПозиции
	|				И НЕ ПредоставленныеПоказания.Помещение ЕСТЬ NULL
	|			ТОГДА СтабильныеПериоды.НомерПозиции + 1
	|		ИНАЧЕ СтабильныеПериоды.НомерПозиции
	|	КОНЕЦ КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА НомераСтрокЗначениеТарифа.НомерПозиции ЕСТЬ NULL
	|				ИЛИ ПредоставленныеПоказания.Помещение ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА СтабильныеПериоды.НомерПозиции > НомераСтрокЗначениеТарифа.НомерПозиции
	|				И НЕ ПредоставленныеПоказания.Помещение ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УвеличениеПозиции,
	|	ЕСТЬNULL(НомераСтрокЗначениеТарифа.ЗначениеТарифа, 0) КАК ПредыдущееЗначениеТарифа,
	|	ЕСТЬNULL(НомераСтрокЗначениеТарифа.ЗначениеТарифаСверхНорматива,0) КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериоды.МКД,
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,	
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале 
	|ПОМЕСТИТЬ СтабильныеПериодыТариф
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокЗначениеТарифа КАК НомераСтрокЗначениеТарифа
	|		ПО СтабильныеПериоды.Организация = НомераСтрокЗначениеТарифа.Организация
	|			И СтабильныеПериоды.ПериодНачисления = НомераСтрокЗначениеТарифа.ПериодНачисления
	|			И СтабильныеПериоды.Район = НомераСтрокЗначениеТарифа.Район
	|			И СтабильныеПериоды.ЧастныйСектор = НомераСтрокЗначениеТарифа.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = НомераСтрокЗначениеТарифа.Строение
	|			И СтабильныеПериоды.Помещение = НомераСтрокЗначениеТарифа.Помещение
	|			И СтабильныеПериоды.Услуга = НомераСтрокЗначениеТарифа.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = НомераСтрокЗначениеТарифа.ТочкаУчета
	|			И (СтабильныеПериоды.ПриборВведен
	|					И НЕ СтабильныеПериоды.МенялосьСостояниеПУ
	|				ИЛИ СтабильныеПериоды.РасчетПоФормуле
	|					И НЕ СтабильныеПериоды.МенялосьСостояниеФормулы
	|				ИЛИ НЕ СтабильныеПериоды.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И НЕ СтабильныеПериоды.МенялосьСостояниеФормулы)	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоАбоненту КАК ПредоставленныеПоказания
	|		ПО СтабильныеПериоды.Организация = ПредоставленныеПоказания.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И СтабильныеПериоды.Район = ПредоставленныеПоказания.Район
	|			И СтабильныеПериоды.ЧастныйСектор = ПредоставленныеПоказания.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = ПредоставленныеПоказания.Строение
	|			И СтабильныеПериоды.Помещение = ПредоставленныеПоказания.Помещение
	|			И СтабильныеПериоды.ПриборУчета = ПредоставленныеПоказания.ПриборУчета 	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","НомерПозиции",Истина,Ложь) + " 	
	|	НомераСтрокЗначениеТарифа.НомерПозиции + 1,
	|	1,
	|	НомераСтрокЗначениеТарифа.ЗначениеТарифа,
	|	НомераСтрокЗначениеТарифа.ЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериоды.МКД,
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокЗначениеТарифа КАК НомераСтрокЗначениеТарифа
	|		ПО СтабильныеПериоды.Организация = НомераСтрокЗначениеТарифа.Организация
	|			И СтабильныеПериоды.ПериодНачисления = НомераСтрокЗначениеТарифа.ПериодНачисления
	|			И СтабильныеПериоды.Район = НомераСтрокЗначениеТарифа.Район
	|			И СтабильныеПериоды.ЧастныйСектор = НомераСтрокЗначениеТарифа.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = НомераСтрокЗначениеТарифа.Строение
	|			И СтабильныеПериоды.Помещение = НомераСтрокЗначениеТарифа.Помещение
	|			И СтабильныеПериоды.Услуга = НомераСтрокЗначениеТарифа.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = НомераСтрокЗначениеТарифа.ТочкаУчета
	|			И СтабильныеПериоды.НомерПозиции = НомераСтрокЗначениеТарифа.НомерПозиции
	|			И (СтабильныеПериоды.ПриборВведен
	|					И НЕ СтабильныеПериоды.МенялосьСостояниеПУ
	|				ИЛИ СтабильныеПериоды.РасчетПоФормуле
	|					И НЕ СтабильныеПериоды.МенялосьСостояниеФормулы
	|				ИЛИ НЕ СтабильныеПериоды.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И НЕ СтабильныеПериоды.МенялосьСостояниеФормулы)	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоАбоненту КАК ПредоставленныеПоказания
	|		ПО СтабильныеПериоды.Организация = ПредоставленныеПоказания.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И СтабильныеПериоды.Район = ПредоставленныеПоказания.Район
	|			И СтабильныеПериоды.ЧастныйСектор = ПредоставленныеПоказания.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = ПредоставленныеПоказания.Строение
	|			И СтабильныеПериоды.Помещение = ПредоставленныеПоказания.Помещение
	|			И СтабильныеПериоды.ПриборУчета = ПредоставленныеПоказания.ПриборУчета 	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" +	энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "	
	|	СтабильныеПериоды.МКД КАК МКД,
	|	СтабильныеПериоды.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериоды.НомерПозиции + ВЫБОР
	|	КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериоды.УвеличениеПозиции
	|		ИНАЧЕ СтабильныеПериоды.УвеличениеПозиции + 1
	|	КОНЕЦ КАК УвеличениеПозиции
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыТариф КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериоды.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериоды.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериоды.ЧастныйСектор = НомераСтрокНачалоСезонностиБезФормулы.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = НомераСтрокНачалоСезонностиБезФормулы.Строение
	|			И СтабильныеПериоды.Помещение = НомераСтрокНачалоСезонностиБезФормулы.Помещение
	|			И СтабильныеПериоды.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериоды.НомерПозиции - СтабильныеПериоды.УвеличениеПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции)
	|			И СтабильныеПериоды.ПериодРегистрации >= НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","ПериодРегистрации,НомерПозиции",Истина,Ложь) + "
	|	СтабильныеПериоды.МКД КАК МКД,
	|	НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности КАК ПериодРегистрации,
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериоды.НомерПозиции + 1 КАК НомерПозиции,
	|	1 КАК КоэффициентСезоности,
	|	СтабильныеПериоды.УвеличениеПозиции + 1 КАК УвеличениеПозиции
	|ИЗ
	|	СтабильныеПериодыТариф КАК СтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериоды.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериоды.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериоды.ЧастныйСектор = НомераСтрокНачалоСезонностиБезФормулы.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = НомераСтрокНачалоСезонностиБезФормулы.Строение
	|			И СтабильныеПериоды.Помещение = НомераСтрокНачалоСезонностиБезФормулы.Помещение
	|			И СтабильныеПериоды.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериоды.НомерПозиции - СтабильныеПериоды.УвеличениеПозиции = НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "	
	|	СтабильныеПериоды.МКД КАК МКД,
	|	СтабильныеПериоды.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериоды.ПериодРегистрации КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериоды.КоэффициентСезоности
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифа,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериоды.УвеличениеПозиции
	|		ИНАЧЕ СтабильныеПериоды.УвеличениеПозиции + 1
	|	КОНЕЦ КАК УвеличениеПозиции
	|ПОМЕСТИТЬ СтабильныеКонецСезонности
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериоды.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериоды.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериоды.ЧастныйСектор = НомераСтрокКонецСезонностиБезФормулы.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = НомераСтрокКонецСезонностиБезФормулы.Строение
	|			И СтабильныеПериоды.Помещение = НомераСтрокКонецСезонностиБезФормулы.Помещение
	|			И СтабильныеПериоды.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериоды.НомерПозиции - СтабильныеПериоды.УвеличениеПозиции > НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|			И СтабильныеПериоды.ПериодРегистрации >= НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","НомерПозиции,ПериодРегистрации",Истина,Ложь) + "		
	|	СтабильныеПериоды.МКД КАК МКД,
	|	НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + 1,
	|	НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности,
	|	0 КАК КоэффициентСезоности,
	|	СтабильныеПериоды.НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде,
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифа,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериоды.УвеличениеПозиции + 1 КАК УвеличениеПозиции
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериоды.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериоды.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериоды.ЧастныйСектор = НомераСтрокКонецСезонностиБезФормулы.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = НомераСтрокКонецСезонностиБезФормулы.Строение
	|			И СтабильныеПериоды.Помещение = НомераСтрокКонецСезонностиБезФормулы.Помещение
	|			И СтабильныеПериоды.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И (СтабильныеПериоды.НомерПозиции - СтабильныеПериоды.УвеличениеПозиции = НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","",Истина,Ложь) + "	
	|	СтабильныеПериоды.МКД КАК МКД,
	|	СтабильныеПериоды.КоэффициентСезоности,
	|	СтабильныеПериоды.НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифа,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериоды.ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА энргВидыДифференцированностиТарифныеЗоны.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона,
	|   СтабильныеПериоды.УвеличениеПозиции
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТарифнаяЗона
	|ИЗ
	|	СтабильныеКонецСезонности КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеПериоды.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","",Истина,Ложь) + "
	|	СтабильныеПериоды.МКД КАК МКД,
	|	СтабильныеПериоды.ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале,
	|	СтабильныеПериоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ПериодыПоказаний.Показания, 0) КАК Показания,
	|	СтабильныеПериоды.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	СтабильныеПериоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериоды.УвеличениеПозиции КАК УвеличениеПозиции
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	СтабильныеКонецСезонностиТарифнаяЗона КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргНачисление
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргВводНачальныхОстатков
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргОперацияСЛицевымСчетом
	|						И НЕ СтабильныеПериоды.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|					ТОГДА СтабильныеПериоды.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|					ТОГДА СтабильныеПериоды.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|					ТОГДА СтабильныеПериоды.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				ИНАЧЕ СтабильныеПериоды.ПериодРегистрации МЕЖДУ ПериодыПоказаний.НачалоПериодДействия И ПериодыПоказаний.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеПериоды.Организация = ПериодыПоказаний.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И СтабильныеПериоды.Район = ПериодыПоказаний.Район
	|			И СтабильныеПериоды.ЧастныйСектор = ПериодыПоказаний.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = ПериодыПоказаний.Строение
	|			И СтабильныеПериоды.Помещение = ПериодыПоказаний.Помещение
	|			И СтабильныеПериоды.ПриборУчета = ПериодыПоказаний.ПриборУчета
	|			И СтабильныеПериоды.Шкала = ПериодыПоказаний.Шкала
	|			И СтабильныеПериоды.ТарифнаяЗона = ПериодыПоказаний.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыПоказанияНачало","ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	СтабильныеПериодыПоказанияНачало.МКД КАК МКД,
	|	СтабильныеПериодыПоказанияНачало.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыПоказанияНачало.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации > СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|					ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|				КОНЕЦ
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.НачалоОП
	|			ТОГДА СтабильныеПериодыПоказанияНачало.НачалоОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации > СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ДатаРегистратора
	|		ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации > СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|					ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|				КОНЕЦ
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.НачалоОП
	|			ТОГДА СтабильныеПериодыПоказанияКонец.НачалоОП
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации > СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|			ТОГДА СтабильныеПериодыПоказанияКонец.ДатаРегистратора
	|		ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,
	|	СтабильныеПериодыПоказанияНачало.Показания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПриборУчета ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.Показания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|					ТОГДА СтабильныеПериодыПоказанияКонец.Показания
	|				ИНАЧЕ СтабильныеПериодыПоказанияНачало.Показания
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеПериодыПоказанияНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПоказанияНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПоказанияНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыПоказанияКонец.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	|	СтабильныеПериодыПоказанияНачало.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	СтабильныеПериодыПоказанияНачало.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	СтабильныеПериодыПоказанияНачало.УвеличениеПозиции
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияКонец
	|		ПО (СтабильныеПериодыПоказанияНачало.НомерПозиции = СтабильныеПериодыПоказанияКонец.НомерПозиции - 1)
	|			И СтабильныеПериодыПоказанияНачало.Организация = СтабильныеПериодыПоказанияКонец.Организация
	|			И СтабильныеПериодыПоказанияНачало.ПериодНачисления = СтабильныеПериодыПоказанияКонец.ПериодНачисления
	|			И СтабильныеПериодыПоказанияНачало.Район = СтабильныеПериодыПоказанияКонец.Район
	|			И СтабильныеПериодыПоказанияНачало.ЧастныйСектор = СтабильныеПериодыПоказанияКонец.ЧастныйСектор
	|			И СтабильныеПериодыПоказанияНачало.Строение = СтабильныеПериодыПоказанияКонец.Строение
	|			И СтабильныеПериодыПоказанияНачало.Помещение = СтабильныеПериодыПоказанияКонец.Помещение
	|			И СтабильныеПериодыПоказанияНачало.ТочкаУчета = СтабильныеПериодыПоказанияКонец.ТочкаУчета
	|			И СтабильныеПериодыПоказанияНачало.Услуга = СтабильныеПериодыПоказанияКонец.Услуга";
	
	Если ЭтоПерерасчет тогда
		Текст 						= СтрЗаменить(Текст,"энргВводНачальныхОстатков","энргНачисление");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстПолучитьДанныеДляРасчета()
	Текст   = 
	"ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","Периоды","ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "	
	|	ВЫБОР
	|		КОГДА Периоды.ЧастныйСектор
	|				И энргПомещения.Родитель ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|		КОГДА Периоды.ЧастныйСектор
	|				И энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|			ТОГДА Периоды.Помещение
	|		КОГДА энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|			ТОГДА Периоды.Помещение
	|		ИНАЧЕ энргПомещения.Родитель
	|	КОНЕЦ КАК ПомещениеРодитель,
	|	Периоды.МКД КАК МКД,
	|	Периоды.НачалоПериода КАК НачалоПериода,
	|	Периоды.КонецПериода КАК КонецПериода,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.НачальныеПоказания КАК НачПок,
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, -1) КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ КАК КонПок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказанияВСрок.Помещение ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПредоставленныеПоказанияВСрок.ВСрок
	|		КОНЕЦ) КАК ПоказанияВСрок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеВыводаПрибораУчета.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВыводПрибораУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказанияВСрок.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ПоказанияПредоставлены,
	|	ЕСТЬNULL(ДокументыНачислений.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргНачисление.ПустаяСсылка)) КАК ДокументНачисления,
	|	ЕСТЬNULL(ДокументыНачислений.ПометкаУдаления, ЛОЖЬ) КАК ДокументНачисленияПометкаУдаления,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА 1
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА 0
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|			ТОГДА 1
	//FIX ME	
	|		КОГДА НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА Периоды.НомерПозиции = 0
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА Периоды.НомерПозиции = 0
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА Периоды.НомерПозиции = 0
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоности, 		
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ))
	|	КОНЕЦ КАК НеПрименятьСезонность,	
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.ОбъемЗаПрошлыйГод, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.ОбъемЗаПрошлыйГод, ЛОЖЬ)) КАК ОбъемЗаПрошлыйГод,	
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ))
	|			ТОГДА  ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНеПрименятьСезонность, 1)) 
	|        ИНАЧЕ ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|	КОНЕЦ КАК КоэффициентНорматива,	 
	|	ВЫБОР
	|		КОГДА НЕ СпособыРасчетаПоНаправлениям.Услуга ЕСТЬ NULL
	|			ТОГДА СпособыРасчетаПоНаправлениям.ВидПлощади
	|		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка))
	|	КОНЕЦ КАК ВидПлощади,
	|	МАКСИМУМ(ЕСТЬNULL(ПредоставленныеПоказанияПоАбоненту.ПоказанияТекущегоПериода, ЛОЖЬ)) КАК ЕстьПоказанияАбонента,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.СледующийРегистратор КАК СледующийРегистратор,
	|	Периоды.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	Периоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	ЕСТЬNULL(ТипСхемыГВС.ТипСхемы, ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка)) КАК ТипСхемы,
	|	ЕСТЬNULL(ВидыТепловыхПунктов.ВидТепловогоПункта, ЗНАЧЕНИЕ(Перечисление.энргВидыТепловыхПунктов.ПустаяСсылка)) КАК ВидТепловогоПункта,
	|	энргВидыУслуг.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	энргВидыУслуг.СоциальныйНормативРавенНормативуПотребления КАК СоциальныйНормативРавенНормативуПотребления,
	|	ЕСТЬNULL(энргАбоненты.ФизЛицо, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	|		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УмножатьНаНормуРодительскойУслуги,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0) КАК ПлощадьМОП,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0) КАК ПлощадьАбонентов,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0) КАК ПлощадьСобственнаяПоставка,
	|	Периоды.УвеличениеПозиции КАК УвеличениеПозиции,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.НормативПоДням, ЛОЖЬ) КАК НормативПоДням,
	|	Периоды.ЗавершениеОП КАК ЗавершениеОП
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормой
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияВСрок КАК ПредоставленныеПоказанияВСрок
	|		ПО Периоды.Организация = ПредоставленныеПоказанияВСрок.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияВСрок.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияВСрок.Район
	|			И Периоды.ЧастныйСектор = ПредоставленныеПоказанияВСрок.ЧастныйСектор
	|			И Периоды.Строение = ПредоставленныеПоказанияВСрок.Строение
	|			И Периоды.Помещение = ПредоставленныеПоказанияВСрок.Помещение
	|			И Периоды.ПриборУчета = ПредоставленныеПоказанияВСрок.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказанияВСрок.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказанияВСрок.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.ЧастныйСектор = МаксимальныеПоказания.ЧастныйСектор
	|			И Периоды.Строение = МаксимальныеПоказания.Строение
	|			И Периоды.Помещение = МаксимальныеПоказания.Помещение
	|			И Периоды.ПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО Периоды.Организация = ДокументыНачислений.Организация
	|			И Периоды.ПериодНачисления = ДокументыНачислений.ПериодНачисления
	|			И Периоды.Район = ДокументыНачислений.Район
	|			И Периоды.МКД = ДокументыНачислений.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеАбонентов КАК СреднееПотреблениеАбонентов
	|		ПО Периоды.Организация = СреднееПотреблениеАбонентов.Организация
	|			И Периоды.ПериодНачисления = СреднееПотреблениеАбонентов.ПериодНачисления
	|			И Периоды.Район = СреднееПотреблениеАбонентов.Район
	|			И Периоды.ЧастныйСектор = СреднееПотреблениеАбонентов.ЧастныйСектор
	|			И Периоды.Строение = СреднееПотреблениеАбонентов.Строение
	|			И Периоды.Помещение = СреднееПотреблениеАбонентов.Помещение
	|			И Периоды.ТочкаУчета = СреднееПотреблениеАбонентов.ТочкаУчета
	|			И Периоды.Услуга = СреднееПотреблениеАбонентов.Услуга
	|			И Периоды.Шкала = СреднееПотреблениеАбонентов.Шкала
	|			И Периоды.ТарифнаяЗона = СреднееПотреблениеАбонентов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВыводаПрибораУчета КАК ДанныеВыводаПрибораУчета
	|		ПО Периоды.Организация = ДанныеВыводаПрибораУчета.Организация
	|			И Периоды.ПериодНачисления = ДанныеВыводаПрибораУчета.ПериодНачисления
	|			И Периоды.Район = ДанныеВыводаПрибораУчета.Район
	|			И Периоды.ЧастныйСектор = ДанныеВыводаПрибораУчета.ЧастныйСектор
	|			И Периоды.Строение = ДанныеВыводаПрибораУчета.Строение
	|			И Периоды.Помещение = ДанныеВыводаПрибораУчета.Помещение
	|			И Периоды.ТочкаУчета = ДанныеВыводаПрибораУчета.ТочкаУчета
	|			И Периоды.ПриборУчета = ДанныеВыводаПрибораУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Периоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Периоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО Периоды.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И Периоды.НаправлениеИспользованияТУ = СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.ЗависимыеУслуги КАК энргВидыУслугЗависимыеУслуги
	|		ПО Периоды.СоставнаяУслуга = энргВидыУслугЗависимыеУслуги.Ссылка
	|			И Периоды.Услуга = энргВидыУслугЗависимыеУслуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО Периоды.Помещение = энргПомещения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоАбоненту КАК ПредоставленныеПоказанияПоАбоненту
	|		ПО Периоды.Организация = ПредоставленныеПоказанияПоАбоненту.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияПоАбоненту.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияПоАбоненту.Район
	|			И Периоды.ЧастныйСектор = ПредоставленныеПоказанияПоАбоненту.ЧастныйСектор
	|			И Периоды.Строение = ПредоставленныеПоказанияПоАбоненту.Строение
	|			И Периоды.Помещение = ПредоставленныеПоказанияПоАбоненту.Помещение
	|			И Периоды.ПриборУчета = ПредоставленныеПоказанияПоАбоненту.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТипСхемыГВС КАК ТипСхемыГВС
	|		ПО Периоды.Организация = ТипСхемыГВС.Организация
	|			И Периоды.ПериодНачисления = ТипСхемыГВС.ПериодНачисления
	|			И Периоды.Район = ТипСхемыГВС.Район
	|			И Периоды.Строение = ТипСхемыГВС.Строение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыТепловыхПунктов КАК ВидыТепловыхПунктов
	|		ПО Периоды.Организация = ВидыТепловыхПунктов.Организация
	|			И Периоды.ПериодНачисления = ВидыТепловыхПунктов.ПериодНачисления
	|			И Периоды.Район = ВидыТепловыхПунктов.Район
	|			И Периоды.Строение = ВидыТепловыхПунктов.Строение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО Периоды.Абонент = энргАбоненты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСтроений КАК ЗначенияПлощадейСтроений
	|		ПО Периоды.Организация = ЗначенияПлощадейСтроений.Организация
	|			И Периоды.ПериодНачисления = ЗначенияПлощадейСтроений.ПериодНачисления
	|			И Периоды.Район = ЗначенияПлощадейСтроений.Район
	|			И Периоды.Услуга = ЗначенияПлощадейСтроений.Услуга
	|			И (НЕ Периоды.ЧастныйСектор)
	|			И Периоды.Строение = ЗначенияПлощадейСтроений.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеПриборовУчетаСНачалаГода КАК НаличиеПриборовУчетаСНачалаГода
	|		ПО Периоды.Организация = НаличиеПриборовУчетаСНачалаГода.Организация
	|			И Периоды.ПериодНачисления = НаличиеПриборовУчетаСНачалаГода.ПериодНачисления
	|			И Периоды.Район = НаличиеПриборовУчетаСНачалаГода.Район
	|			И Периоды.ЧастныйСектор = НаличиеПриборовУчетаСНачалаГода.ЧастныйСектор
	|			И Периоды.Строение = НаличиеПриборовУчетаСНачалаГода.Строение
	|			И Периоды.Помещение = НаличиеПриборовУчетаСНачалаГода.Помещение
	|			И Периоды.Услуга = НаличиеПриборовУчетаСНачалаГода.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьМКД
	|		ПО Периоды.Организация = УслугиНеПрименятьСезонностьМКД.Организация
	|			И Периоды.ПериодНачисления = УслугиНеПрименятьСезонностьМКД.ПериодНачисления
	|			И Периоды.Район = УслугиНеПрименятьСезонностьМКД.Район
	|			И (НЕ Периоды.ЧастныйСектор)
	|			И Периоды.Строение = УслугиНеПрименятьСезонностьМКД.Строение
	|			И Периоды.Услуга = УслугиНеПрименятьСезонностьМКД.Услуга
	|			И Периоды.НаправлениеИспользованияТУ = УслугиНеПрименятьСезонностьМКД.НаправлениеИспользования
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьРайон
	|		ПО Периоды.Организация = УслугиНеПрименятьСезонностьРайон.Организация
	|			И Периоды.ПериодНачисления = УслугиНеПрименятьСезонностьРайон.ПериодНачисления
	|			И Периоды.Район = УслугиНеПрименятьСезонностьРайон.Район
	|			И (УслугиНеПрименятьСезонностьРайон.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|			И Периоды.Услуга = УслугиНеПрименятьСезонностьРайон.Услуга
	|			И Периоды.НаправлениеИспользованияТУ = УслугиНеПрименятьСезонностьРайон.НаправлениеИспользования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО Периоды.Услуга = ДлительностьПериодов.Услуга
	|			И Периоды.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|			И Периоды.НаправлениеИспользованияТУ = ДлительностьПериодов.НаправлениеИспользования	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоставщикиНеНачислять КАК ПоставщикиНеНачислять
	|		ПО Периоды.Организация = ПоставщикиНеНачислять.Организация
	|			И Периоды.ПериодНачисления = ПоставщикиНеНачислять.ПериодНачисления
	|			И Периоды.Район = ПоставщикиНеНачислять.Район
	|			И Периоды.Поставщик = ПоставщикиНеНачислять.Район
	|ГДЕ
	|	Периоды.ЛСОткрыт
	|	И Периоды.УслугаПодключена
	|	И НЕ Периоды.БлокировочныйАкт
	|	И ПоставщикиНеНачислять.Поставщик ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","Периоды","ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь,Истина) + "	
	|	ВЫБОР
	|		КОГДА Периоды.ЧастныйСектор
	|				И энргПомещения.Родитель ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|		КОГДА Периоды.ЧастныйСектор
	|				И энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|			ТОГДА Периоды.Помещение
	|		КОГДА энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|			ТОГДА Периоды.Помещение
	|		ИНАЧЕ энргПомещения.Родитель
	|	КОНЕЦ,
	|	Периоды.МКД,
	|	Периоды.НачалоПериода,
	|	Периоды.КонецПериода,
	|	Периоды.ВидДифференцированности,
	|	Периоды.ТарифнаяЗона,
	|	Периоды.НачальныеПоказания,
	|	ЕСТЬNULL(ДокументыНачислений.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргНачисление.ПустаяСсылка)),
	|	ЕСТЬNULL(ДокументыНачислений.ПометкаУдаления, ЛОЖЬ),
	|	ЕСТЬNULL(СреднееПотреблениеАбонентов.СреднийОбъем, -1),
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА 1
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА 0
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА Периоды.НомерПозиции = 0
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА Периоды.НомерПозиции = 0
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА Периоды.НомерПозиции = 0
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА 1
	|		ИНАЧЕ Периоды.КоэффициентСезоности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ))
	|	КОНЕЦ,	
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.ОбъемЗаПрошлыйГод, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.ОбъемЗаПрошлыйГод, ЛОЖЬ)),	
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|				И (Периоды.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА НЕ энргВидыУслуг.КорректироватьГодовойОбъем
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, энргВидыУслуг.Сезонность) = ЗНАЧЕНИЕ(Перечисление.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|		КОГДА ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность, ЛОЖЬ))
	|			ТОГДА  ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНеПрименятьСезонность, 1)) 
	|        ИНАЧЕ ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива, 1))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ СпособыРасчетаПоНаправлениям.Услуга ЕСТЬ NULL
	|			ТОГДА СпособыРасчетаПоНаправлениям.ВидПлощади
	|		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка))
	|	КОНЕЦ,
	|	Периоды.ДнейВПериоде,
	|	Периоды.СледующийРегистратор,
	|	Периоды.ПредыдущееЗначениеТарифа,
	|	Периоды.ПредыдущееЗначениеТарифаСверхНорматива,
	|	ЕСТЬNULL(ТипСхемыГВС.ТипСхемы, ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка)),
	|	ЕСТЬNULL(ВидыТепловыхПунктов.ВидТепловогоПункта, ЗНАЧЕНИЕ(Перечисление.энргВидыТепловыхПунктов.ПустаяСсылка)),
	|	энргВидыУслуг.ИспользоватьПовыщающийКоэффициент,
	|	энргВидыУслуг.СоциальныйНормативРавенНормативуПотребления,
	|	ЕСТЬNULL(энргАбоненты.ФизЛицо, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	|		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0),
	|	Периоды.УвеличениеПозиции,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.НормативПоДням, ЛОЖЬ),
	|	Периоды.ЗавершениеОП	
	|;
	|//////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ДанныеДляРасчетаПередНормой","НомерПозиции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор,КлючНорматива,КоличествоПроживающих",Истина,Ложь) + "
	|	ДанныеДляРасчетаПередНормой.ПомещениеРодитель КАК ПомещениеРодитель,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК  СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.КонПок  КАК  КонПок,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.ТипСхемы  КАК ТипСхемы,
	|	ДанныеДляРасчетаПередНормой.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ДанныеДляРасчетаПередНормой.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	ДанныеДляРасчетаПередНормой.ФизЛицо КАК ФизЛицо,
	|	ДанныеДляРасчетаПередНормой.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.СоциальныйНормативРавенНормативуПотребления КАК СоциальныйНормативРавенНормативуПотребления,
	|	ДанныеДляРасчетаПередНормой.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка  КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчетаПередНормой.НормативПоДням,
	|	ДанныеДляРасчетаПередНормой.ЗавершениеОП,
	|	ЕСТЬNULL(СтабильныеПериодыИзмерителиНаправлений.Измеритель,ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка))  КАК Измеритель,
	|	ЕСТЬNULL(СтабильныеПериодыИзмерителиНаправлений.КлючНорматива,ДанныеДляРасчетаПередНормой.КлючНорматива) КАК КлючНорматива,
	|	ЕСТЬNULL(СтабильныеПериодыИзмерителиНаправлений.Количество,ДанныеДляРасчетаПередНормой.КоличествоПроживающих) КАК КоличествоПроживающих	
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормойИзмерители
	|	ИЗ ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыИзмерителиНаправлений КАК СтабильныеПериодыИзмерителиНаправлений
	|		ПО ДанныеДляРасчетаПередНормой.Организация = СтабильныеПериодыИзмерителиНаправлений.Организация
	|		И ДанныеДляРасчетаПередНормой.ПериодНачисления = СтабильныеПериодыИзмерителиНаправлений.ПериодНачисления
	|		И ДанныеДляРасчетаПередНормой.Район = СтабильныеПериодыИзмерителиНаправлений.Район
	|		И ДанныеДляРасчетаПередНормой.ЧастныйСектор = СтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор
	|		И ДанныеДляРасчетаПередНормой.Строение = СтабильныеПериодыИзмерителиНаправлений.Строение
	|		И ДанныеДляРасчетаПередНормой.Помещение = СтабильныеПериодыИзмерителиНаправлений.Помещение
	|		И ДанныеДляРасчетаПередНормой.Услуга = СтабильныеПериодыИзмерителиНаправлений.Услуга
	|		И ДанныеДляРасчетаПередНормой.ТочкаУчета = СтабильныеПериодыИзмерителиНаправлений.ТочкаУчета
	|		И ДанныеДляРасчетаПередНормой.НомерПозиции - ДанныеДляРасчетаПередНормой.УвеличениеПозиции = СтабильныеПериодыИзмерителиНаправлений.НомерПозиции"; 	
	
	Возврат Текст

КонецФункции

Функция ТекстРассчитатьИндивидуальныйОбъемПотребления()
	Текст  = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 1
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 2
	|			ИНАЧЕ 3
	|		КОНЕЦ) КАК Приоритет,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ДанныеДляРасчетаПередНормой.СреднийОбъем >= 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) КАК ПриборВведен,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) КАК ПоказанияВСрок,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК КоличествоТочекУчета
	|ПОМЕСТИТЬ ПриоритетНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	ДанныеДляРасчетаПередНормой.КоэффициентФормула <= 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода
	|
	|ИМЕЮЩИЕ
	|	(МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) = ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК ТочкаУчета,
	|	МИНИМУМ(ПриоритетНормы.ЕстьСреднийПоВсемТочкамУслуги) КАК ЕстьСреднийПоВсемТочкамУслуги
	|ПОМЕСТИТЬ ТочкиНачисленияНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ПриоритетНормы.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ПриоритетНормы.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ПриоритетНормы.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ПриоритетНормы.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ПриоритетНормы.НаправлениеИспользованияТУ
	|			И (ДанныеДляРасчетаПередНормой.КоэффициентФормула <= 0)
	|			И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 1
	|					ТОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|							И НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				КОГДА ПриоритетНормы.Приоритет = 2
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ДанныеДляРасчетаПередНормой","НомерПозиции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "
	|	ДанныеДляРасчетаПередНормой.ПомещениеРодитель КАК ПомещениеРодитель,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.Измеритель КАК Измеритель,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ДанныеДляРасчетаПередНормой.КонПок КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ЕСТЬNULL(ЗначенияТекущихСоциальныхНормПотребления.ЗначениеНорматива, 0) КАК СоциальнаяНормаПотребления,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ДанныеДляРасчетаПЕредНормой,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.Значение, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.ЗначениеСверхНорматива, 0) КАК ЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ВЫБОР
	|		КОГДА НЕ ВЫБОР
	|					КОГДА &НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|							И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) > 1
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|					ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		КОГДА ДанныеДляРасчетаПередНормой.КоэффициентФормула = 1
	|			ТОГДА ИСТИНА
	|		КОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,
	|	ЕСТЬNULL(ТочкиНачисленияНормы.ЕстьСреднийПоВсемТочкамУслуги, ЛОЖЬ) КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.ИспользоватьПовыщающийКоэффициент КАК ИспользоватьПовыщающийКоэффициент,
	|	ЕСТЬNULL(ЗначенияПовышающихКоэффициентов.Коэффициент, 1) КАК ПовышающийКоэффициент,
	|	ЕСТЬNULL(МКДНеНачислятьТЭМКД.НеНачислять, ЕСТЬNULL(МКДНеНачислятьТЭ.НеНачислять, ЛОЖЬ)) КАК ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА &НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|				И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.СоциальныйНормативРавенНормативуПотребления КАК СоциальныйНормативРавенНормативуПотребления,
	|	ДанныеДляРасчетаПередНормой.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ВЫБОР
	|		КОГДА НЕ ВЫБОР
	|					КОГДА &НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|							И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) > 1
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|					ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		КОГДА ТочкиНачисленияНормы.Организация ЕСТЬ NULL
	|				И НЕ ПриоритетНормы.Организация ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НачислятьПоПрибору,
	|	ДанныеДляРасчетаПередНормой.НормативПоДням,
	|	ДанныеДляРасчетаПередНормой.ЗавершениеОП,
	|	ЕСТЬNULL(НормаСкоростиДвиженияВоды.СкоростьДвижения, 0) КАК СкоростьДвижения	
	|ПОМЕСТИТЬ ДанныеДляРасчета
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормы КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ТочкиНачисленияНормы.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ТочкиНачисленияНормы.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ТочкиНачисленияНормы.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ТочкиНачисленияНормы.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ТочкиНачисленияНормы.НачалоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ПриоритетНормы.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ПриоритетНормы.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ПриоритетНормы.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ПриоритетНормы.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ПриоритетНормы.НачалоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихТарифов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихТарифов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихТарифов.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.ТарифнаяГруппа = ЗначенияТекущихТарифов.ГруппаПотребителей
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихТарифов.Услуга
	|			И ДанныеДляРасчетаПередНормой.Поставщик = ЗначенияТекущихТарифов.Поставщик
	|			И ДанныеДляРасчетаПередНормой.ТарифнаяЗона = ЗначенияТекущихТарифов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ЗначенияТекущихНормПотребления.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихСоциальныхНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихСоциальныхНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихСоциальныхНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихСоциальныхНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихСоциальныхНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючСоцНорматива = ЗначенияТекущихСоциальныхНормПотребления.КлючНорматива
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ЗначенияТекущихСоциальныхНормПотребления.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияПовышающихКоэффициентов.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ЗначенияПовышающихКоэффициентов.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭМКД
	|		ПО ДанныеДляРасчетаПередНормой.Организация = МКДНеНачислятьТЭМКД.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = МКДНеНачислятьТЭМКД.Район
	|			И ДанныеДляРасчетаПередНормой.Услуга = МКДНеНачислятьТЭМКД.Услуга
	|			И ДанныеДляРасчетаПередНормой.Строение = МКДНеНачислятьТЭМКД.Строение
	|			И ДанныеДляРасчетаПередНормой.ТипСхемы = МКДНеНачислятьТЭМКД.ТипСхемы
	|			И ДанныеДляРасчетаПередНормой.ВидТепловогоПункта = МКДНеНачислятьТЭМКД.ПринадлежностьКТепловомуПункту
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО ДанныеДляРасчетаПередНормой.Организация = МКДНеНачислятьТЭ.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = МКДНеНачислятьТЭ.Район
	|			И ДанныеДляРасчетаПередНормой.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И (ДанныеДляРасчетаПередНормой.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|			И ДанныеДляРасчетаПередНормой.ТипСхемы = МКДНеНачислятьТЭ.ТипСхемы
	|			И ДанныеДляРасчетаПередНормой.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту	
	|		ЛЕВОЕ СОЕДИНЕНИЕ НормаСкоростиДвиженияВоды КАК НормаСкоростиДвиженияВоды
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НормаСкоростиДвиженияВоды.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = НормаСкоростиДвиженияВоды.ПериодНачисления	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация КАК Организация,
	|	ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчета.Район КАК Район,
	|	ДанныеДляРасчета.МКД КАК МКД,
	|	ДанныеДляРасчета.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчета.Строение КАК Строение,
	|	ДанныеДляРасчета.ПомещениеРодитель КАК ПомещениеРодитель,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПомещениеРодитель = ДанныеДляРасчета.Помещение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокПомещения,
	|	ДанныеДляРасчета.Помещение КАК Помещение,
	|	ДанныеДляРасчета.Абонент КАК Абонент,
	|	ДанныеДляРасчета.Услуга КАК Услуга,
	|	ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчета.Шкала КАК Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен КАК ПриборВведен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|			ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|		КОНЕЦ * ДанныеДляРасчета.КоэффициентПУ КАК ЧИСЛО(15, 6)) КАК ОбъемУслугиПотребленный,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|						ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|					ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|				КОНЕЦ * ДанныеДляРасчета.КоэффициентПУ КАК ЧИСЛО(15, 6))
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СоциальныйНормативРавенНормативуПотребления
	|			ТОГДА ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|					КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|					ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДляРасчета.СоциальнаяНормаПотребления * ДанныеДляРасчета.НормаПотребления
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), ДанныеДляРасчета.КонецПериода, ДЕНЬ) / ВЫБОР
	|		КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|	КОНЕЦ) КАК ОбъемУслугиСоцНорма,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КАК СпособНачисления,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифа
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор ЕСТЬ NULL
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифа
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДляРасчета.СледующийРегистратор) = ТИП(Документ.энргУстановитьЗначениеТарифа)
	|			ТОГДА ДанныеДляРасчета.ПредыдущееЗначениеТарифа
	|		ИНАЧЕ ДанныеДляРасчета.ЗначениеТарифа
	|	КОНЕЦ КАК ЗначениеТарифа,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифаСверхНорматива
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор ЕСТЬ NULL
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифаСверхНорматива
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДляРасчета.СледующийРегистратор) = ТИП(Документ.энргУстановитьЗначениеТарифа)
	|			ТОГДА ДанныеДляРасчета.ПредыдущееЗначениеТарифаСверхНорматива
	|		ИНАЧЕ ДанныеДляРасчета.ЗначениеТарифа
	|	КОНЕЦ КАК ЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчета.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчета.НачПок КАК НачальныеПоказания,
	|	ДанныеДляРасчета.КонПок КАК КонечныеПоказания,
	|	ДанныеДляРасчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентФормула КАК КоэффициентФормула,
	|	ДанныеДляРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива КАК НормаПотребления,
	|	ДанныеДляРасчета.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ДанныеДляРасчета.КоличествоСобственников КАК КоличествоСобственников,
	|	ДанныеДляРасчета.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ДанныеДляРасчета.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ДанныеДляРасчета.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчета.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеДляРасчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДанныеДляРасчета.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ДанныеДляРасчета.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчета.КоличествоКомнат КАК КоличествоКомнат,
	|	1 КАК ПовыщающийКоэффициент,
	|	ДанныеДляРасчета.ДатаПоверки КАК ДатаПоверки,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК СниматьНачисленныйСредний,
	|	ДанныеДляРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчета.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчета.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеДляРасчета.Измеритель КАК Измеритель,
	|	ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	ДанныеДляРасчета.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	ДанныеДляРасчета.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	ДанныеДляРасчета.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	ДанныеДляРасчета.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ДанныеДляРасчета.ЗавершениеОП КАК ЗавершениеОП,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.Остаток)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокСпособРаспределенияОбъемаПомещения,
	|	ДанныеДляРасчета.НеПрименятьСезонность КАК НеПрименятьСезонность
	|ПОМЕСТИТЬ ОбъемыНачислений
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	(ДанныеДляРасчета.ПриборВведен
	|				И ДанныеДляРасчета.ЕстьПоказанияАбонента
	|				И ДанныеДляРасчета.НачислятьПоПрибору
	|				И НЕ ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)
	|				И ВЫБОР
	|					КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) = 0
	|							И ВЫБОР
	|								КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|									ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|								ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|							КОНЕЦ = 0
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|			)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.ЧастныйСектор,
	|	ДанныеДляРасчета.Строение,
	|	ДанныеДляРасчета.ПомещениеРодитель,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПомещениеРодитель = ДанныеДляРасчета.Помещение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчета.Помещение,
	|	ДанныеДляРасчета.Абонент,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПУстаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки),
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|			КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|			КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|				ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|			КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|				ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|			ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|		КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|			КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|					И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|			КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|				ТОГДА 1
	|			ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|		КОНЕЦ) КАК ЧИСЛО(15, 6)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|			КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|			КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|				ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|			КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|				ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|			ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|		КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|			КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|					И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|			КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|				ТОГДА 1
	|			ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|		КОНЕЦ) КАК ЧИСЛО(15, 6)),
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СоциальныйНормативРавенНормативуПотребления
	|			ТОГДА ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|					КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|					ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДляРасчета.СоциальнаяНормаПотребления * ДанныеДляРасчета.НормаПотребления
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|		КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|	КОНЕЦ),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу),
	|	ДанныеДляРасчета.ЗначениеТарифа,
	|	ДанныеДляРасчета.ЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентФормула,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоличествоПрописанных,
	|	ДанныеДляРасчета.КоличествоСобственников,
	|	ДанныеДляРасчета.КоличествоПроживающих,
	|	ДанныеДляРасчета.КоличествоЖильцов,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.КоэффициентПУ,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ВидДифференцированности,
	|	ДанныеДляРасчета.КоличествоКомнат,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ИспользоватьПовыщающийКоэффициент
	|				И НЕ ДанныеДляРасчета.НетВозможностьУстановкиПУ
	|			ТОГДА ДанныеДляРасчета.ПовышающийКоэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчета.ДатаПоверки,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчета.Измеритель,
	|	ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения,
	|	ДанныеДляРасчета.ФиксированныйОбъемПотребления,
	|	ДанныеДляРасчета.ДоляПотребленияЧислитель,
	|	ДанныеДляРасчета.ДоляПотребленияЗнаменатель,
	|	ДанныеДляРасчета.КоэффициентРаспределенияОстатка,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.Остаток)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.НеПрименятьСезонность
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПриборВведен
	|	И (ДанныеДляРасчета.НачислятьНорму
	|			ИЛИ НЕ ДанныеДляРасчета.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|	И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|	И НЕ ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.ЧастныйСектор,
	|	ДанныеДляРасчета.Строение,
	|	ДанныеДляРасчета.ПомещениеРодитель,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПомещениеРодитель = ДанныеДляРасчета.Помещение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчета.Помещение,
	|	ДанныеДляРасчета.Абонент,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * ДанныеДляРасчета.КоэффициентСезоности * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|			КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|				ТОГДА 1
	|			ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|		КОНЕЦ) КАК ЧИСЛО(15, 6)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * ДанныеДляРасчета.КоэффициентСезоности * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|						КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|							ТОГДА 1
	|						ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|					КОНЕЦ) КАК ЧИСЛО(15, 6))
	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СоциальныйНормативРавенНормативуПотребления
	|			ТОГДА ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|					КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|					ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДляРасчета.СоциальнаяНормаПотребления * ДанныеДляРасчета.НормаПотребления
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|		КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|	КОНЕЦ),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ЗначениеТарифа,
	|	ДанныеДляРасчета.ЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентФормула,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоличествоПрописанных,
	|	ДанныеДляРасчета.КоличествоСобственников,
	|	ДанныеДляРасчета.КоличествоПроживающих,
	|	ДанныеДляРасчета.КоличествоЖильцов,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.КоэффициентПУ,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ВидДифференцированности,
	|	ДанныеДляРасчета.КоличествоКомнат,
	|	1,
	|	ДанныеДляРасчета.ДатаПоверки,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчета.Измеритель,
	|	ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения,
	|	ДанныеДляРасчета.ФиксированныйОбъемПотребления,
	|	ДанныеДляРасчета.ДоляПотребленияЧислитель,
	|	ДанныеДляРасчета.ДоляПотребленияЗнаменатель,
	|	ДанныеДляРасчета.КоэффициентРаспределенияОстатка,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.Остаток)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.НеПрименятьСезонность
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И ДанныеДляРасчета.ЕстьСреднийПоВсемТочкамУслуги
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем >= 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|	И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|	И НЕ ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.ЧастныйСектор,
	|	ДанныеДляРасчета.Строение,
	|	ДанныеДляРасчета.ПомещениеРодитель,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПомещениеРодитель = ДанныеДляРасчета.Помещение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчета.Помещение,
	|	ДанныеДляРасчета.Абонент,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|			КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|			КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|				ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|			КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|				ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|			ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|		КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|			КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|					И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|			КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|				ТОГДА 1
	|			ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|		КОНЕЦ) КАК ЧИСЛО(15, 6)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|						КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|							ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|						КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|							ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|						КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|							ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|						ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|					КОНЕЦ * ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|						КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|								И НЕ ДанныеДляРасчета.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|							ТОГДА ВЫБОР
	|									КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|										ТОГДА 0
	|									ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|								КОНЕЦ
	|						ИНАЧЕ 1
	|					КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|						КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|							ТОГДА 1
	|						ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|					КОНЕЦ) КАК ЧИСЛО(15, 6))
	|		КОНЕЦ КАК ЧИСЛО(15, 6)),
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СоциальныйНормативРавенНормативуПотребления
	|			ТОГДА ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|					КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|					ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДляРасчета.СоциальнаяНормаПотребления * ДанныеДляРасчета.НормаПотребления
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|		КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|	КОНЕЦ),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ЗначениеТарифа,
	|	ДанныеДляРасчета.ЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентФормула,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоличествоПрописанных,
	|	ДанныеДляРасчета.КоличествоСобственников,
	|	ДанныеДляРасчета.КоличествоПроживающих,
	|	ДанныеДляРасчета.КоличествоЖильцов,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.КоэффициентПУ,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ВидДифференцированности,
	|	ДанныеДляРасчета.КоличествоКомнат,
	|	1,
	|	ДанныеДляРасчета.ДатаПоверки,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчета.Измеритель,
	|	ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения,
	|	ДанныеДляРасчета.ФиксированныйОбъемПотребления,
	|	ДанныеДляРасчета.ДоляПотребленияЧислитель,
	|	ДанныеДляРасчета.ДоляПотребленияЗнаменатель,
	|	ДанныеДляРасчета.КоэффициентРаспределенияОстатка,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.Остаток)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.НеПрименятьСезонность
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И НЕ ДанныеДляРасчета.ЕстьПоказанияАбонента
	|	И ДанныеДляРасчета.СреднийОбъем < 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И (ДанныеДляРасчета.НачислятьНорму
	|			ИЛИ НЕ ДанныеДляРасчета.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|	И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) >= 1
	|	И НЕ ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.ЧастныйСектор,
	|	ДанныеДляРасчета.Строение,
	|	ДанныеДляРасчета.ПомещениеРодитель,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПомещениеРодитель = ДанныеДляРасчета.Помещение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчета.Помещение,
	|	ДанныеДляРасчета.Абонент,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	0,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.СреднийОбъем * ДанныеДляРасчета.КоэффициентСезоности * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|			КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|				ТОГДА 1
	|			ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|		КОНЕЦ) КАК ЧИСЛО(15, 6)),
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СоциальныйНормативРавенНормативуПотребления
	|			ТОГДА ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|					КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|					ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДляРасчета.СоциальнаяНормаПотребления * ДанныеДляРасчета.НормаПотребления
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|		КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|	КОНЕЦ),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ЗначениеТарифа,
	|	ДанныеДляРасчета.ЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентФормула,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоличествоПрописанных,
	|	ДанныеДляРасчета.КоличествоСобственников,
	|	ДанныеДляРасчета.КоличествоПроживающих,
	|	ДанныеДляРасчета.КоличествоЖильцов,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.КоэффициентПУ,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ВидДифференцированности,
	|	ДанныеДляРасчета.КоличествоКомнат,
	|	1,
	|	ДанныеДляРасчета.ДатаПоверки,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчета.Измеритель,
	|	ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения,
	|	ДанныеДляРасчета.ФиксированныйОбъемПотребления,
	|	ДанныеДляРасчета.ДоляПотребленияЧислитель,
	|	ДанныеДляРасчета.ДоляПотребленияЗнаменатель,
	|	ДанныеДляРасчета.КоэффициентРаспределенияОстатка,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.Остаток)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.НеПрименятьСезонность
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем >= 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НеПрименятьСезонность
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|	И НЕ ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.ЧастныйСектор,
	|	ДанныеДляРасчета.Строение,
	|	ДанныеДляРасчета.ПомещениеРодитель,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ПомещениеРодитель = ДанныеДляРасчета.Помещение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ДанныеДляРасчета.Помещение,
	|	ДанныеДляРасчета.Абонент,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	0,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.ФиксированныйОбъемПотребления * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|			КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|				ТОГДА 1
	|			ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|		КОНЕЦ) КАК ЧИСЛО(15, 6)),
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА ДанныеДляРасчета.СоциальныйНормативРавенНормативуПотребления
	|			ТОГДА ДанныеДляРасчета.НормаПотребления * ВЫБОР
	|					КОГДА ДанныеДляРасчета.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.КоличествоЖильцов
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПроживающих = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПроживающих
	|					КОГДА НЕ ДанныеДляРасчета.КоличествоПрописанных = 0
	|						ТОГДА ДанныеДляРасчета.КоличествоПрописанных
	|					ИНАЧЕ ДанныеДляРасчета.КоличествоСобственников
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДляРасчета.СоциальнаяНормаПотребления * ДанныеДляРасчета.НормаПотребления
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ВЫБОР
	|		КОГДА ДанныеДляРасчета.НормативПоДням И НЕ ДанныеДляРасчета.НеПрименятьСезонность
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчета.ДнейВПериоде
	|	КОНЕЦ),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу),
	|	ДанныеДляРасчета.ЗначениеТарифа,
	|	ДанныеДляРасчета.ЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.КоэффициентСезоности,
	|	0,
	|	0,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.ЗависимаяТочкаУчета,
	|	ДанныеДляРасчета.КоэффициентФормула,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоличествоПрописанных,
	|	ДанныеДляРасчета.КоличествоСобственников,
	|	ДанныеДляРасчета.КоличествоПроживающих,
	|	ДанныеДляРасчета.КоличествоЖильцов,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.КоэффициентПУ,
	|	ДанныеДляРасчета.ТарифнаяГруппа,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ВидДифференцированности,
	|	ДанныеДляРасчета.КоличествоКомнат,
	|	1,
	|	ДанныеДляРасчета.ДатаПоверки,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчета.Измеритель,
	|	ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения,
	|	ДанныеДляРасчета.ФиксированныйОбъемПотребления,
	|	ДанныеДляРасчета.ДоляПотребленияЧислитель,
	|	ДанныеДляРасчета.ДоляПотребленияЗнаменатель,
	|	ДанныеДляРасчета.КоэффициентРаспределенияОстатка,
	|	ДанныеДляРасчета.ЗавершениеОП,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.Остаток)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДанныеДляРасчета.НеПрименятьСезонность
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	ДанныеДляРасчета.СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъемыНачислений.Организация КАК Организация,
	|	ОбъемыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемыНачислений.НачалоПериода КАК НачалоПериода,
	|	ОбъемыНачислений.КонецПериода КАК КонецПериода,
	|	ОбъемыНачислений.Район КАК Район,
	|	ОбъемыНачислений.МКД КАК МКД,
	|	ОбъемыНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	ОбъемыНачислений.Строение КАК Строение,
	|	ОбъемыНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
	|	ОбъемыНачислений.ПорядокПомещения КАК ПорядокПомещения,
	|	ОбъемыНачислений.Помещение КАК Помещение,
	|	ОбъемыНачислений.Абонент КАК Абонент,
	|	ОбъемыНачислений.Услуга КАК Услуга,
	|	ОбъемыНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемыНачислений.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ОбъемыНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемыНачислений.Шкала КАК Шкала,
	|	ОбъемыНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемыНачислений.ПриборВведен КАК ПриборВведен,
	|	ОбъемыНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ВЫБОР
	|		КОГДА ОбъемыНачислений.ОбъемУслуги > ОбъемыНачислений.ОбъемУслугиСоцНорма
	|				И ОбъемыНачислений.ОбъемУслугиСоцНорма > 0
	|			ТОГДА ОбъемыНачислений.ОбъемУслугиСоцНорма
	|		ИНАЧЕ ОбъемыНачислений.ОбъемУслуги
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ОбъемыНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	ОбъемыНачислений.СпособНачисления КАК СпособНачисления,
	|	ОбъемыНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВЫБОР
	|		КОГДА ОбъемыНачислений.ОбъемУслуги > ОбъемыНачислений.ОбъемУслугиСоцНорма
	|				И ОбъемыНачислений.ОбъемУслугиСоцНорма > 0
	|			ТОГДА ОбъемыНачислений.ОбъемУслугиСоцНорма
	|		ИНАЧЕ ОбъемыНачислений.ОбъемУслуги
	|	КОНЕЦ * ОбъемыНачислений.ЗначениеТарифа * ОбъемыНачислений.ПовыщающийКоэффициент КАК Сумма,
	|	ОбъемыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	ОбъемыНачислений.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ОбъемыНачислений.Поставщик КАК Поставщик,
	|	ОбъемыНачислений.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ОбъемыНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	ОбъемыНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	ОбъемыНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ОбъемыНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ОбъемыНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	ОбъемыНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ОбъемыНачислений.НормаПотребления КАК НормаПотребления,
	|	ОбъемыНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ОбъемыНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	ОбъемыНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ОбъемыНачислений.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ОбъемыНачислений.ВидПлощади КАК ВидПлощади,
	|	ОбъемыНачислений.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ОбъемыНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	ОбъемыНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ОбъемыНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ОбъемыНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	ОбъемыНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	ОбъемыНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	ОбъемыНачислений.ДатаПоверки КАК ДатаПоверки,
	|	ОбъемыНачислений.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ОбъемыНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ОбъемыНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ОбъемыНачислений.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	ОбъемыНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	ОбъемыНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ОбъемыНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ОбъемыНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ОбъемыНачислений.Измеритель КАК Измеритель,
	|	ОбъемыНачислений.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	ОбъемыНачислений.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	ОбъемыНачислений.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	ОбъемыНачислений.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	ОбъемыНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ОбъемыНачислений.ЗавершениеОП КАК ЗавершениеОП,
	|	ОбъемыНачислений.ПорядокСпособРаспределенияОбъемаПомещения КАК ПорядокСпособРаспределенияОбъемаПомещения,
	|	ОбъемыНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ЛОЖЬ КАК СверхНорматива
	|ИЗ
	|	ОбъемыНачислений КАК ОбъемыНачислений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъемыНачислений.Организация,
	|	ОбъемыНачислений.ПериодНачисления,
	|	ОбъемыНачислений.НачалоПериода,
	|	ОбъемыНачислений.КонецПериода,
	|	ОбъемыНачислений.Район,
	|	ОбъемыНачислений.МКД,
	|	ОбъемыНачислений.ЧастныйСектор,
	|	ОбъемыНачислений.Строение,
	|	ОбъемыНачислений.ПомещениеРодитель,
	|	ОбъемыНачислений.ПорядокПомещения,
	|	ОбъемыНачислений.Помещение,
	|	ОбъемыНачислений.Абонент,
	|	ОбъемыНачислений.Услуга,
	|	ОбъемыНачислений.ТочкаУчета,
	|	ОбъемыНачислений.ЗависитОтУслуги,
	|	ОбъемыНачислений.ПриборУчета,
	|	ОбъемыНачислений.Шкала,
	|	ОбъемыНачислений.ТарифнаяЗона,
	|	ОбъемыНачислений.ПриборВведен,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ОбъемыНачислений.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ОбъемыНачислений.ОбъемУслуги - ОбъемыНачислений.ОбъемУслугиСоцНорма
	|	КОНЕЦ,
	|	ОбъемыНачислений.ОбъемУслугиСоцНорма,
	|	ОбъемыНачислений.СпособНачисления,
	|	ОбъемыНачислений.ЗначениеТарифаСверхНорматива,
	|	(ОбъемыНачислений.ОбъемУслуги - ОбъемыНачислений.ОбъемУслугиСоцНорма) * ОбъемыНачислений.ЗначениеТарифаСверхНорматива,
	|	ОбъемыНачислений.ДокументНачисления,
	|	ОбъемыНачислений.ДокументНачисленияПометкаУдаления,
	|	ОбъемыНачислений.Поставщик,
	|	ОбъемыНачислений.КоэффициентСезоности,
	|	ОбъемыНачислений.НачальныеПоказания,
	|	ОбъемыНачислений.КонечныеПоказания,
	|	ОбъемыНачислений.РасчетПоФормуле,
	|	ОбъемыНачислений.ЗависимаяТочкаУчета,
	|	ОбъемыНачислений.КоэффициентФормула,
	|	ОбъемыНачислений.ЗначениеПлощади,
	|	ОбъемыНачислений.НормаПотребления,
	|	ОбъемыНачислений.КоличествоПрописанных,
	|	ОбъемыНачислений.КоличествоСобственников,
	|	ОбъемыНачислений.КоличествоПроживающих,
	|	ОбъемыНачислений.КоличествоЖильцов,
	|	ОбъемыНачислений.ВидПлощади,
	|	ОбъемыНачислений.ПоказанияВСрок,
	|	ОбъемыНачислений.КоэффициентПУ,
	|	ОбъемыНачислений.ТарифнаяГруппа,
	|	ОбъемыНачислений.ВидБлагоустройства,
	|	ОбъемыНачислений.ВидДифференцированности,
	|	ОбъемыНачислений.КоличествоКомнат,
	|	ОбъемыНачислений.ПовыщающийКоэффициент,
	|	ОбъемыНачислений.ДатаПоверки,
	|	ОбъемыНачислений.ЗакрытаяСхемаГВС,
	|	ОбъемыНачислений.СниматьНачисленныйСредний,
	|	ОбъемыНачислений.СоставнаяУслуга,
	|	ОбъемыНачислений.УмножатьНаНормуРодительскойУслуги,
	|	ОбъемыНачислений.ПлощадьМОП,
	|	ОбъемыНачислений.ПлощадьАбонентов,
	|	ОбъемыНачислений.ПлощадьСобственнаяПоставка,
	|	ОбъемыНачислений.НаправлениеИспользованияТУ,
	|	ОбъемыНачислений.Измеритель,
	|	ОбъемыНачислений.СпособРаспределенияОбъемаПомещения,
	|	ОбъемыНачислений.ФиксированныйОбъемПотребления,
	|	ОбъемыНачислений.ДоляПотребленияЧислитель,
	|	ОбъемыНачислений.ДоляПотребленияЗнаменатель,
	|	ОбъемыНачислений.КоэффициентРаспределенияОстатка,
	|	ОбъемыНачислений.ЗавершениеОП,
	|	ОбъемыНачислений.ПорядокСпособРаспределенияОбъемаПомещения,
	|	ОбъемыНачислений.НеПрименятьСезонность,
	|	ИСТИНА
	|ИЗ
	|	ОбъемыНачислений КАК ОбъемыНачислений
	|ГДЕ
	|	ОбъемыНачислений.ОбъемУслуги - ОбъемыНачислений.ОбъемУслугиСоцНорма > 0
	|	И НЕ ОбъемыНачислений.ОбъемУслугиСоцНорма = 0
	|	И НЕ ОбъемыНачислений.РасчетПоФормуле
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъемыНачислений.ПериодНачисления,
	|	ОбъемыНачислений.Район,
	|	ОбъемыНачислений.МКД,
	|	ОбъемыНачислений.ЧастныйСектор,
	|	ОбъемыНачислений.Строение,
	|	ОбъемыНачислений.ПомещениеРодитель,
	|	ОбъемыНачислений.ПорядокПомещения,
	|	ОбъемыНачислений.Помещение,
	|	ОбъемыНачислений.Абонент,
	|	ОбъемыНачислений.ТочкаУчета,
	|	ОбъемыНачислений.НачалоПериода,
	|	ОбъемыНачислений.КонецПериода,
	|	ОбъемыНачислений.ПорядокСпособРаспределенияОбъемаПомещения,
	|	ОбъемыНачислений.ЗависитОтУслуги";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область НачисленияМКД

Функция ТекстЗапросаВспомогательныеДанныеНачисленияМКД(ОтборПоМКД)
	Текст  =  
	"ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО энргЗначенияНормативовПотребленияСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|			И (энргВидыУслуг.НормативДляИндивидуальных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.МКД КАК Строение,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|				И (МКД = &МКД
	|					ИЛИ МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))) КАК НастройкаСезонностиУслуг	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(
	|			&КонецПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НеНачислять) КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|	ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|	ВложенныйЗапрос.Услуга КАК Услуга
	|ПОМЕСТИТЬ ДлительностьПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВложенныйЗапрос.НачалоФактическогоПериода КАК НачалоФактическогоПериода,
	|		ВложенныйЗапрос.КонецФактическогоПериода КАК КонецФактическогоПериода,
	|		энргВидыУслуг.Ссылка КАК Услуга
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ВЫБОР
	|				КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|						ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ТОГДА ВЫБОР
	|							КОГДА &НачалоПериодаРасчета > ВложенныйЗапрос.НачалоПериодаДействия
	|								ТОГДА &НачалоПериодаРасчета
	|							ИНАЧЕ ВложенныйЗапрос.НачалоПериодаДействия
	|						КОНЕЦ
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ КАК НачалоФактическогоПериода,
	|			ВЫБОР
	|				КОГДА &НачалоПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|						ИЛИ &КонецПериодаРасчета МЕЖДУ ВложенныйЗапрос.НачалоПериодаДействия И ВложенныйЗапрос.КонецПериодаДействия
	|					ТОГДА ВЫБОР
	|							КОГДА &КонецПериодаРасчета > ВложенныйЗапрос.КонецПериодаДействия
	|								ТОГДА ВложенныйЗапрос.КонецПериодаДействия
	|							ИНАЧЕ &КонецПериодаРасчета
	|						КОНЕЦ
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ КАК КонецФактическогоПериода,
	|			ВложенныйЗапрос.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|			ВложенныйЗапрос.КонецПериодаДействия КАК КонецПериодаДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВложенныйЗапрос.Сезонность КАК Сезонность,
	|				ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|				ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
	|			ИЗ
	|				(ВЫБРАТЬ
	|					энргДлительностиПериодов.Сезонность КАК Сезонность,
	|					ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|					МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|					ДЕНЬ(энргДлительностиПериодов.КонецПериода) + 1 КАК ДеньОкончания,
	|					МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|					ВЫБОР
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|							ТОГДА ВЫБОР
	|									КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|										ТОГДА ГОД(&КонецПериодаРасчета) - 1
	|									ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|								КОНЕЦ
	|						ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|					КОНЕЦ КАК ГодНачало,
	|					ВЫБОР
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|							ТОГДА ВЫБОР
	|									КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(&КонецПериодаРасчета)
	|										ТОГДА ГОД(&КонецПериодаРасчета)
	|									ИНАЧЕ ГОД(&КонецПериодаРасчета) + 1
	|								КОНЕЦ
	|						ИНАЧЕ ГОД(&КонецПериодаРасчета)
	|					КОНЕЦ КАК ГодОкончания
	|				ИЗ
	|					РегистрСведений.энргДлительностиПериодов.СрезПоследних(, ) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонность
	|		ПО ВложенныйЗапрос.Услуга = УслугиНеПрименятьСезонность.Услуга
	|ГДЕ
	|	УслугиНеПрименятьСезонность.Услуга ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрезМКД.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргМаксимальныеПоказанияСрезМКД.Район КАК Район,
	|	энргМаксимальныеПоказанияСрезМКД.МКД КАК МКД,
	|	энргМаксимальныеПоказанияСрезМКД.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрезМКД.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрезМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрезМКД.Показания КАК Показания,
	|	&НачалоПериодаРасчета КАК Период,
	|	-1 КАК НомерПозиции,
	|	энргМаксимальныеПоказанияСрезМКД.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК энргМаксимальныеПоказанияСрезМКД
	|ГДЕ
	|	энргМаксимальныеПоказанияСрезМКД.Организация = &Организация
	|	И энргМаксимальныеПоказанияСрезМКД.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|	И энргМаксимальныеПоказанияСрезМКД.Район = &Район
	|	И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПредоставленныеПоказанияМКД.Организация,
	|	энргПредоставленныеПоказанияМКД.ПериодНачисления,
	|	энргПредоставленныеПоказанияМКД.Район,
	|	энргПредоставленныеПоказанияМКД.МКД,
	|	энргПредоставленныеПоказанияМКД.ПриборУчета,
	|	энргПредоставленныеПоказанияМКД.Шкала,
	|	энргПредоставленныеПоказанияМКД.ТарифнаяЗона,
	|	энргПредоставленныеПоказанияМКД.Показания,
	|	энргПредоставленныеПоказанияМКД.ДатаРегистратора,
	|	энргПредоставленныеПоказанияМКД.НомерПозиции,
	|	энргПредоставленныеПоказанияМКД.ДокРегистратор
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказанияМКД
	|ГДЕ
	|	энргПредоставленныеПоказанияМКД.Организация = &Организация
	|	И энргПредоставленныеПоказанияМКД.ПериодНачисления = &ПериодНачисления
	|	И энргПредоставленныеПоказанияМКД.Район = &Район
	|	И энргПредоставленныеПоказанияМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.МКД КАК МКД,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА &КонецПериодаРасчета
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.МКД = ПоказанияКонец.МКД
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияМКД.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияМКД.Район КАК Район,
	|	энргСреднийОбъемПотребленияМКД.МКД КАК МКД,
	|	энргСреднийОбъемПотребленияМКД.Услуга КАК Услуга,
	|	энргСреднийОбъемПотребленияМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияМКД.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияМКД.Объем КАК СреднийОбъем
	|ПОМЕСТИТЬ СреднееПотреблениеМКД
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК энргСреднийОбъемПотребленияМКД
	|ГДЕ
	|	энргСреднийОбъемПотребленияМКД.Организация = &Организация
	|	И энргСреднийОбъемПотребленияМКД.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребленияМКД.Район = &Район
	|	И энргСреднийОбъемПотребленияМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ПОМЕСТИТЬ ЗначениеПлощадейМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериодыМКД.Организация КАК Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район КАК Район,
	|		энргСтабильныеПериодыМКД.МКД КАК МКД,
	|		энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргСтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|	ГДЕ
	|		энргСтабильныеПериодыМКД.Организация = &Организация
	|		И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|		И энргСтабильныеПериодыМКД.Район = &Район
	|		И энргСтабильныеПериодыМКД.МКД = &МКД
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериодыМКД.Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район,
	|		энргСтабильныеПериодыМКД.МКД,
	|		энргСтабильныеПериодыМКД.Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = энргСтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргСтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = энргСтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргСтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериодыМКД.НомерПозиции
	|			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКД.Район = &Район)
	|			И (энргСтабильныеПериодыМКД.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКД.Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район,
	|	энргСтабильныеПериодыМКД.МКД,
	|	энргСтабильныеПериодыМКД.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонента) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначениеИндивидуальныхПлощадей
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериоды.Организация КАК Организация,
	|		энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериоды.Район КАК Район,
	|		энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение КАК Строение,
	|		энргСтабильныеПериоды.Помещение КАК Помещение,
	|		энргСтабильныеПериоды.Услуга КАК Услуга,
	|		МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади) КАК ПлощадьАбонента,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА энргСтабильныеПериоды.Поставщик = энргСтабильныеПериоды.Абонент
	|					ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргСтабильныеПериоды.Организация КАК Организация,
	|			энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|			энргСтабильныеПериоды.Район КАК Район,
	|			энргСтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение КАК Строение,
	|			энргСтабильныеПериоды.Помещение КАК Помещение,
	|			энргСтабильныеПериоды.Услуга КАК Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ГДЕ
	|			энргСтабильныеПериоды.Организация = &Организация
	|			И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|			И энргСтабильныеПериоды.Район = &Район
	|			И НЕ энргСтабильныеПериоды.ЧастныйСектор
	|			И энргСтабильныеПериоды.Строение = &МКД
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтабильныеПериоды.Организация,
	|			энргСтабильныеПериоды.ПериодНачисления,
	|			энргСтабильныеПериоды.Район,
	|			энргСтабильныеПериоды.ЧастныйСектор,
	|			энргСтабильныеПериоды.Строение,
	|			энргСтабильныеПериоды.Помещение,
	|			энргСтабильныеПериоды.Услуга,
	|			энргСтабильныеПериоды.ТочкаУчета) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ПО ВложенныйЗапрос.Организация = энргСтабильныеПериоды.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|				И ВложенныйЗапрос.Район = энргСтабильныеПериоды.Район
	|				И ВложенныйЗапрос.ЧастныйСектор = энргСтабильныеПериоды.ЧастныйСектор
	|				И ВложенныйЗапрос.Строение = энргСтабильныеПериоды.Строение
	|				И ВложенныйЗапрос.Помещение = энргСтабильныеПериоды.Помещение
	|				И ВложенныйЗапрос.Услуга = энргСтабильныеПериоды.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				И (энргСтабильныеПериоды.Организация = &Организация)
	|				И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|				И (энргСтабильныеПериоды.Район = &Район)
	|				И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|				И (энргСтабильныеПериоды.Строение = &МКД)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтабильныеПериоды.Организация,
	|		энргСтабильныеПериоды.ПериодНачисления,
	|		энргСтабильныеПериоды.Район,
	|		энргСтабильныеПериоды.ЧастныйСектор,
	|		энргСтабильныеПериоды.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		энргСтабильныеПериоды.Услуга) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьМОП) КАК ПлощадьМОП,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначенияПлощадейСтроений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначениеПлощадейМКД.Организация КАК Организация,
	|		ЗначениеПлощадейМКД.ПериодНачисления КАК ПериодНачисления,
	|		ЗначениеПлощадейМКД.Район КАК Район,
	|		ЗначениеПлощадейМКД.МКД КАК МКД,
	|		ЗначениеПлощадейМКД.Услуга КАК Услуга,
	|		ЗначениеПлощадейМКД.ПлощадьМОП КАК ПлощадьМОП,
	|		0 КАК ПлощадьАбонентов,
	|		0 КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеПлощадейМКД КАК ЗначениеПлощадейМКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗначениеИндивидуальныхПлощадей.Организация,
	|		ЗначениеИндивидуальныхПлощадей.ПериодНачисления,
	|		ЗначениеИндивидуальныхПлощадей.Район,
	|		ЗначениеИндивидуальныхПлощадей.Строение,
	|		ЗначениеИндивидуальныхПлощадей.Услуга,
	|		0,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьАбонентов,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеИндивидуальныхПлощадей КАК ЗначениеИндивидуальныхПлощадей) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыШкалы.Организация КАК Организация,
	|	энргСтабильныеПериодыШкалы.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыШкалы.Район КАК Район,
	|	энргСтабильныеПериодыШкалы.МКД КАК МКД,
	|	энргСтабильныеПериодыШкалы.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыШкалы.Шкала КАК Шкала,
	|	энргСтабильныеПериодыШкалы.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериодыШкалы.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКДШкалы КАК энргСтабильныеПериодыШкалы
	|ГДЕ
	|	энргСтабильныеПериодыШкалы.Организация = &Организация
	|	И энргСтабильныеПериодыШкалы.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыШкалы.Район = &Район
	|	И энргСтабильныеПериодыШкалы.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПредоставленныеПоказанияМКД.Организация КАК Организация,
	|	энргПредоставленныеПоказанияМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргПредоставленныеПоказанияМКД.Район КАК Район,
	|	энргПредоставленныеПоказанияМКД.МКД КАК МКД,
	|	энргПредоставленныеПоказанияМКД.ПриборУчета КАК ПриборУчета,
	|	энргПредоставленныеПоказанияМКД.Шкала КАК Шкала,
	|	энргПредоставленныеПоказанияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(энргПредоставленныеПоказанияМКД.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказанияМКД
	|ГДЕ
	|	энргПредоставленныеПоказанияМКД.Организация = &Организация
	|	И энргПредоставленныеПоказанияМКД.ПериодНачисления = &ПериодНачисления
	|	И энргПредоставленныеПоказанияМКД.Район = &Район
	|	И энргПредоставленныеПоказанияМКД.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПредоставленныеПоказанияМКД.Организация,
	|	энргПредоставленныеПоказанияМКД.ПериодНачисления,
	|	энргПредоставленныеПоказанияМКД.Район,
	|	энргПредоставленныеПоказанияМКД.МКД,
	|	энргПредоставленныеПоказанияМКД.ПриборУчета,
	|	энргПредоставленныеПоказанияМКД.Шкала,
	|	энргПредоставленныеПоказанияМКД.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргВыводПриборовУчетаМКД.Организация КАК Организация,
	|	энргВыводПриборовУчетаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргВыводПриборовУчетаМКД.Район КАК Район,
	|	энргВыводПриборовУчетаМКД.МКД КАК МКД,
	|	энргВыводПриборовУчетаМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргВыводПриборовУчетаМКД.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	РегистрСведений.энргВыводПриборовУчетаМКД КАК энргВыводПриборовУчетаМКД
	|ГДЕ
	|	энргВыводПриборовУчетаМКД.Организация = &Организация
	|	И энргВыводПриборовУчетаМКД.ПериодНачисления = &ПериодНачисления
	|	И энргВыводПриборовУчетаМКД.Район = &Район
	|	И энргВыводПриборовУчетаМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрезМКД.Организация КАК Организация,
	|	энргМаксимальныеПоказанияСрезМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргМаксимальныеПоказанияСрезМКД.Район КАК Район,
	|	энргМаксимальныеПоказанияСрезМКД.МКД КАК МКД,
	|	энргМаксимальныеПоказанияСрезМКД.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрезМКД.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрезМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрезМКД.Показания КАК Показания
	|ПОМЕСТИТЬ МаксимальныеПоказания
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК энргМаксимальныеПоказанияСрезМКД
	|ГДЕ
	|	энргМаксимальныеПоказанияСрезМКД.Организация = &Организация
	|	И энргМаксимальныеПоказанияСрезМКД.ПериодНачисления = &ПериодНачисления
	|	И энргМаксимальныеПоказанияСрезМКД.Район = &Район
	|	И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПредоставленныеПоказанияМКД.Организация КАК Организация,
	|	энргПредоставленныеПоказанияМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргПредоставленныеПоказанияМКД.Район КАК Район,
	|	энргПредоставленныеПоказанияМКД.МКД КАК МКД,
	|	МАКСИМУМ(энргПредоставленныеПоказанияМКД.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоМКД
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказанияМКД
	|ГДЕ
	|	энргПредоставленныеПоказанияМКД.Организация = &Организация
	|	И энргПредоставленныеПоказанияМКД.ПериодНачисления = &ПериодНачисления
	|	И энргПредоставленныеПоказанияМКД.Район = &Район
	|	И энргПредоставленныеПоказанияМКД.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПредоставленныеПоказанияМКД.Организация,
	|	энргПредоставленныеПоказанияМКД.ПериодНачисления,
	|	энргПредоставленныеПоказанияМКД.Район,
	|	энргПредоставленныеПоказанияМКД.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД КАК МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериодаМКД.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.НачалоФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонности
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериодаМКД КАК энргНомераСтрокСтабильногоПериодаМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (энргНомераСтрокСтабильногоПериодаМКД.Организация = &Организация)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.Район = &Район)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)
	|			И энргНомераСтрокСтабильногоПериодаМКД.Услуга = ДлительностьПериодов.Услуга
	|			И энргНомераСтрокСтабильногоПериодаМКД.ДатаРегистратора < ДлительностьПериодов.НачалоФактическогоПериода
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.НачалоФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета,
	|	ДлительностьПериодов.НачалоФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД КАК МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериодаМКД.НомерПозиции) КАК НомерПозиции,
	|	ДлительностьПериодов.КонецФактическогоПериода КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонности
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериодаМКД КАК энргНомераСтрокСтабильногоПериодаМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО (энргНомераСтрокСтабильногоПериодаМКД.Организация = &Организация)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления = &ПериодНачисления)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.Район = &Район)
	|			И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)
	|			И энргНомераСтрокСтабильногоПериодаМКД.Услуга = ДлительностьПериодов.Услуга
	|			И энргНомераСтрокСтабильногоПериодаМКД.ДатаРегистратора < ДлительностьПериодов.КонецФактическогоПериода
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &НачалоПериодаРасчета)
	|			И (ДлительностьПериодов.КонецФактическогоПериода <> &КонецПериодаРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериодаМКД.Организация,
	|	энргНомераСтрокСтабильногоПериодаМКД.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаМКД.Район,
	|	энргНомераСтрокСтабильногоПериодаМКД.МКД,
	|	энргНомераСтрокСтабильногоПериодаМКД.ТочкаУчета,
	|	ДлительностьПериодов.КонецФактическогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыМКД.НомерПозиции КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА энргСтабильныеПериодыМКД.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ энргСтабильныеПериодыМКД.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	энргСтабильныеПериодыМКД.ДатаРегистратора КАК ДатаРегистратора,
	|	энргСтабильныеПериодыМКД.ДокРегистратор КАК ДокРегистратор,
	|	энргСтабильныеПериодыМКД.МКДОткрыт КАК МКДОткрыт,
	|	энргСтабильныеПериодыМКД.УслугаПодключена КАК УслугаПодключена,
	|	энргСтабильныеПериодыМКД.ПриборВведен КАК ПриборВведен,
	|	энргСтабильныеПериодыМКД.ПриборУчета КАК ПриборУчета,
	|	энргСтабильныеПериодыМКД.КоэффициентПУ КАК КоэффициентПУ,
	|	энргСтабильныеПериодыМКД.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргСтабильныеПериодыМКД.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргСтабильныеПериодыМКД.Поставщик КАК Поставщик,
	|	энргСтабильныеПериодыМКД.Бойлер КАК Бойлер,
	|	энргСтабильныеПериодыМКД.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&КонецПериодаРасчета КАК ЗавершениеОП,
	|	&ДнейВПериоде КАК ДнейВПериоде,
	|	энргСтабильныеПериодыМКД.ФормулаРасчета КАК ФормулаРасчета,
	|	энргСтабильныеПериодыМКД.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргСтабильныеПериодыМКД.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргСтабильныеПериодыМКД.КлючНорматива КАК КлючНорматива,
	|	энргСтабильныеПериодыМКД.Шкала КАК Шкала,
	|	энргСтабильныеПериодыМКД.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	энргСтабильныеПериодыМКД.ТипСхемы КАК ТипСхемы,
	|	энргСтабильныеПериодыМКД.ВидТепловогоПункта КАК ВидТепловогоПункта
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|ГДЕ
	|	энргСтабильныеПериодыМКД.Организация = &Организация
	|	И энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыМКД.Район = &Район
	|	И энргСтабильныеПериодыМКД.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачало.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыНачало.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериодыНачало.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыНачало.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыНачало.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыНачало.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыНачало.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыНачало.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыНачало.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыНачало.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыНачало.Поставщик КАК Поставщик,
	|	СтабильныеПериодыНачало.Бойлер КАК Бойлер,
	|	СтабильныеПериодыНачало.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	СтабильныеПериодыНачало.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыНачало.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыНачало.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыНачало.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыНачало.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачало.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачало.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачало.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачало.ВидТепловогоПункта КАК ВидТепловогоПункта
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоШкалы
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО СтабильныеПериодыНачало.Организация = СтабильныеПериодыШкалы.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СтабильныеПериодыШкалы.Район
	|			И СтабильныеПериодыНачало.МКД = СтабильныеПериодыШкалы.МКД
	|			И СтабильныеПериодыНачало.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|			И СтабильныеПериодыНачало.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыНачало.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтабильныеПериодыНачало.Шкала = СтабильныеПериодыШкалы.Шкала
	|			КОНЕЦ)";

	Если НЕ ОтборПоМКД тогда
		Текст 						= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргПредоставленныеПоказанияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргВыводПриборовУчетаМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.МКД = &МКД",""); 		
		
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.МКД = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериоды.Строение = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &МКД)","");		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьСтабильныеПериодыМКД()
	Текст  = 
	"ВЫБРАТЬ
	|	НомераСтрокНачалоСезонности.Организация КАК Организация,
	|	НомераСтрокНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокНачалоСезонности.Район КАК Район,
	|	НомераСтрокНачалоСезонности.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	НомераСтрокНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачало.Шкала КАК Шкала,
	|	НомераСтрокНачалоСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокНачалоСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокНачалоСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокНачалоСезонности КАК НомераСтрокНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокНачалоСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокНачалоСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокНачалоСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокНачалоСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокНачалоСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокНачалоСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераСтрокКонецСезонности.Организация КАК Организация,
	|	НомераСтрокКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	НомераСтрокКонецСезонности.Район КАК Район,
	|	НомераСтрокКонецСезонности.МКД КАК МКД,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	НомераСтрокКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачало.Шкала КАК Шкала,
	|	НомераСтрокКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	НомераСтрокКонецСезонности.ПериодСезонности КАК ПериодСезонности
	|ПОМЕСТИТЬ НомераСтрокКонецСезонностиБезФормулы
	|ИЗ
	|	НомераСтрокКонецСезонности КАК НомераСтрокКонецСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачало
	|		ПО НомераСтрокКонецСезонности.Организация = СтабильныеПериодыНачало.Организация
	|			И НомераСтрокКонецСезонности.ПериодНачисления = СтабильныеПериодыНачало.ПериодНачисления
	|			И НомераСтрокКонецСезонности.Район = СтабильныеПериодыНачало.Район
	|			И НомераСтрокКонецСезонности.МКД = СтабильныеПериодыНачало.МКД
	|			И НомераСтрокКонецСезонности.ТочкаУчета = СтабильныеПериодыНачало.ТочкаУчета
	|			И НомераСтрокКонецСезонности.НомерПозиции = СтабильныеПериодыНачало.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоШкалы.Организация КАК Организация,
	|	СтабильныеПериодыНачалоШкалы.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачалоШкалы.Район КАК Район,
	|	СтабильныеПериодыНачалоШкалы.МКД КАК МКД,
	|	СтабильныеПериодыНачалоШкалы.Услуга КАК Услуга,
	|	СтабильныеПериодыНачалоШкалы.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачалоШкалы.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыНачалоШкалы.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоШкалы.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыНачалоШкалы.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыНачалоШкалы.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыНачалоШкалы.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыНачалоШкалы.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыНачалоШкалы.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыНачалоШкалы.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыНачалоШкалы.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыНачалоШкалы.Поставщик КАК Поставщик,
	|	СтабильныеПериодыНачалоШкалы.Бойлер КАК Бойлер,
	|	СтабильныеПериодыНачалоШкалы.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	ВЫБОР
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность
	|				И (СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА 1
	|		КОГДА НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|				И ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|				И ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность ЕСТЬ NULL
	|				И НЕ УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность
	|				И (СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода)
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА ДлительностьПериодов.НачалоФактическогоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоШкалы.ПериодРегистрации МЕЖДУ ДлительностьПериодов.НачалоФактическогоПериода И ДлительностьПериодов.КонецФактическогоПериода
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СезонностьНачало,
	|	СтабильныеПериодыНачалоШкалы.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоШкалы.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоШкалы.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.НеПрименятьСезонность, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.НеПрименятьСезонность,Ложь)) КАК НеПрименятьСезонность,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.ОбъемЗаПрошлыйГод, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.ОбъемЗаПрошлыйГод,Ложь)) КАК ОбъемЗаПрошлыйГод,
	|	ЕСТЬNULL(УслугиНеПрименятьСезонностьМКД.КоэффициентНорматива, ЕСТЬNULL(УслугиНеПрименятьСезонностьРайон.КоэффициентНорматива,1)) КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоШкалы.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыНачалоШкалы.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыНачалоШкалы.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыНачалоШкалы.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыНачалоШкалы.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачалоШкалы.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачалоШкалы.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыНачалоШкалы.Шкала КАК Шкала,
	|	СтабильныеПериодыНачалоШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоШкалы.ПривязанаКШкале КАК ПривязанаКШкале
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоСезонности
	|ИЗ
	|	СтабильныеПериодыНачалоШкалы КАК СтабильныеПериодыНачалоШкалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПериодов КАК ДлительностьПериодов
	|		ПО СтабильныеПериодыНачалоШкалы.Услуга = ДлительностьПериодов.Услуга
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = ДлительностьПериодов.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьМКД
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьМКД.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьМКД.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьМКД.Район
	|			И СтабильныеПериодыНачалоШкалы.МКД = УслугиНеПрименятьСезонностьМКД.Строение
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьМКД.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиНеПрименятьСезонность КАК УслугиНеПрименятьСезонностьРайон
	|		ПО СтабильныеПериодыНачалоШкалы.Организация = УслугиНеПрименятьСезонностьРайон.Организация
	|			И СтабильныеПериодыНачалоШкалы.ПериодНачисления = УслугиНеПрименятьСезонностьРайон.ПериодНачисления
	|			И СтабильныеПериодыНачалоШкалы.Район = УслугиНеПрименятьСезонностьРайон.Район
	|			И (УслугиНеПрименятьСезонностьРайон.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|			И СтабильныеПериодыНачалоШкалы.Услуга = УслугиНеПрименятьСезонностьРайон.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоСезонности.Организация КАК Организация,
	|	СтабильныеПериодыНачалоСезонности.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачалоСезонности.Район КАК Район,
	|	СтабильныеПериодыНачалоСезонности.МКД КАК МКД,
	|	СтабильныеПериодыНачалоСезонности.Услуга КАК Услуга,
	|	СтабильныеПериодыНачалоСезонности.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыНачалоСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыНачалоСезонности.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыНачалоСезонности.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыНачалоСезонности.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыНачалоСезонности.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыНачалоСезонности.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыНачалоСезонности.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыНачалоСезонности.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыНачалоСезонности.Поставщик КАК Поставщик,
	|	СтабильныеПериодыНачалоСезонности.Бойлер КАК Бойлер,
	|	СтабильныеПериодыНачалоСезонности.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачалоСезонности.СезонностьНачало
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	ВЫБОР
	|		КОГДА НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА СтабильныеПериодыНачалоСезонности.НомерПозиции > НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УвеличениеПозиции,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыНачалоСезонности.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыНачалоСезонности.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыНачалоСезонности.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыНачалоСезонности.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачалоСезонности.Шкала КАК Шкала,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачалоСезонности.ВидТепловогоПункта КАК ВидТепловогоПункта
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.Шкала = НомераСтрокНачалоСезонностиБезФормулы.Шкала
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоСезонности.Организация,
	|	СтабильныеПериодыНачалоСезонности.ПериодНачисления,
	|	СтабильныеПериодыНачалоСезонности.Район,
	|	СтабильныеПериодыНачалоСезонности.МКД,
	|	СтабильныеПериодыНачалоСезонности.Услуга,
	|	СтабильныеПериодыНачалоСезонности.ТочкаУчета,
	|	СтабильныеПериодыНачалоСезонности.НомерПозиции + 1,
	|	НомераСтрокНачалоСезонностиБезФормулы.ПериодСезонности,
	|	СтабильныеПериодыНачалоСезонности.ДокРегистратор,
	|	СтабильныеПериодыНачалоСезонности.МКДОткрыт,
	|	СтабильныеПериодыНачалоСезонности.УслугаПодключена,
	|	СтабильныеПериодыНачалоСезонности.ПриборВведен,
	|	СтабильныеПериодыНачалоСезонности.ПриборУчета,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентПУ,
	|	СтабильныеПериодыНачалоСезонности.ВидБлагоустройства,
	|	СтабильныеПериодыНачалоСезонности.ЗначениеПлощади,
	|	СтабильныеПериодыНачалоСезонности.Поставщик,
	|	СтабильныеПериодыНачалоСезонности.Бойлер,
	|	СтабильныеПериодыНачалоСезонности.МенялосьСостояниеПУ,
	|	1,
	|	СтабильныеПериодыНачалоСезонности.НачалоОП,
	|	СтабильныеПериодыНачалоСезонности.ЗавершениеОП,
	|	СтабильныеПериодыНачалоСезонности.ДнейВПериоде,
	|	1,
	|	СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность,
	|	СтабильныеПериодыНачалоСезонности.ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачалоСезонности.КоэффициентНорматива,
	|	СтабильныеПериодыНачалоСезонности.ФормулаРасчета,
	|	СтабильныеПериодыНачалоСезонности.РасчетПоФормуле,
	|	СтабильныеПериодыНачалоСезонности.СоставнаяУслуга,
	|	СтабильныеПериодыНачалоСезонности.КлючНорматива,
	|	СтабильныеПериодыНачалоСезонности.НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыНачалоСезонности.Шкала,
	|	СтабильныеПериодыНачалоСезонности.ВидДифференцированности,
	|	СтабильныеПериодыНачалоСезонности.ПривязанаКШкале,
	|	СтабильныеПериодыНачалоСезонности.ТипСхемы,
	|	СтабильныеПериодыНачалоСезонности.ВидТепловогоПункта
	|ИЗ
	|	СтабильныеПериодыНачалоСезонности КАК СтабильныеПериодыНачалоСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокНачалоСезонностиБезФормулы КАК НомераСтрокНачалоСезонностиБезФормулы
	|		ПО СтабильныеПериодыНачалоСезонности.Организация = НомераСтрокНачалоСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыНачалоСезонности.ПериодНачисления = НомераСтрокНачалоСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыНачалоСезонности.МКД = НомераСтрокНачалоСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыНачалоСезонности.Услуга = НомераСтрокНачалоСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыНачалоСезонности.ТочкаУчета = НомераСтрокНачалоСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыНачалоСезонности.Шкала = НомераСтрокНачалоСезонностиБезФормулы.Шкала
	|			И СтабильныеПериодыНачалоСезонности.НомерПозиции = НомераСтрокНачалоСезонностиБезФормулы.НомерПозиции
	|			И (НЕ СтабильныеПериодыНачалоСезонности.НеПрименятьСезонность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыСезонность.Организация КАК Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район КАК Район,
	|	СтабильныеПериодыСезонность.МКД КАК МКД,
	|	СтабильныеПериодыСезонность.Услуга КАК Услуга,
	|	СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыСезонность.НомерПозиции + ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + СтабильныеПериодыСезонность.УвеличениеПозиции > СтабильныеПериодыСезонность.НомерПозиции
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерПозиции,
	|	СтабильныеПериодыСезонность.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыСезонность.ДокРегистратор КАК ДокРегистратор,
	|	ВЫБОР
	|		КОГДА НомераСтрокКонецСезонностиБезФормулы.НомерПозиции ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыСезонность.КоэффициентСезоности
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыСезонность.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыСезонность.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыСезонность.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыСезонность.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыСезонность.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыСезонность.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыСезонность.Поставщик КАК Поставщик,
	|	СтабильныеПериодыСезонность.Бойлер КАК Бойлер,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыСезонность.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыСезонность.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыСезонность.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыСезонность.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.Шкала КАК Шкала,
	|	СтабильныеПериодыСезонность.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыСезонность.ВидТепловогоПункта КАК ВидТепловогоПункта
	|ПОМЕСТИТЬ СтабильныеКонецСезонности
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.Шкала = НомераСтрокКонецСезонностиБезФормулы.Шкала
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтабильныеПериодыСезонность.Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район,
	|	СтабильныеПериодыСезонность.МКД,
	|	СтабильныеПериодыСезонность.Услуга,
	|	СтабильныеПериодыСезонность.ТочкаУчета,
	|	НомераСтрокКонецСезонностиБезФормулы.НомерПозиции + 1,
	|	НомераСтрокКонецСезонностиБезФормулы.ПериодСезонности,
	|	СтабильныеПериодыСезонность.ДокРегистратор,
	|	0,
	|	СтабильныеПериодыСезонность.НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде,
	|	СтабильныеПериодыСезонность.МКДОткрыт,
	|	СтабильныеПериодыСезонность.УслугаПодключена,
	|	СтабильныеПериодыСезонность.ПриборВведен,
	|	СтабильныеПериодыСезонность.ПриборУчета,
	|	СтабильныеПериодыСезонность.КоэффициентПУ,
	|	СтабильныеПериодыСезонность.ВидБлагоустройства,
	|	СтабильныеПериодыСезонность.ЗначениеПлощади,
	|	СтабильныеПериодыСезонность.Поставщик,
	|	СтабильныеПериодыСезонность.Бойлер,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.ФормулаРасчета,
	|	СтабильныеПериодыСезонность.РасчетПоФормуле,
	|	СтабильныеПериодыСезонность.СоставнаяУслуга,
	|	СтабильныеПериодыСезонность.КлючНорматива,
	|	СтабильныеПериодыСезонность.НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.Шкала,
	|	СтабильныеПериодыСезонность.ВидДифференцированности,
	|	СтабильныеПериодыСезонность.ПривязанаКШкале,
	|	СтабильныеПериодыСезонность.ТипСхемы,
	|	СтабильныеПериодыСезонность.ВидТепловогоПункта
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокКонецСезонностиБезФормулы КАК НомераСтрокКонецСезонностиБезФормулы
	|		ПО СтабильныеПериодыСезонность.Организация = НомераСтрокКонецСезонностиБезФормулы.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокКонецСезонностиБезФормулы.ПериодНачисления
	|			И СтабильныеПериодыСезонность.МКД = НомераСтрокКонецСезонностиБезФормулы.МКД
	|			И СтабильныеПериодыСезонность.Услуга = НомераСтрокКонецСезонностиБезФормулы.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокКонецСезонностиБезФормулы.ТочкаУчета
	|			И СтабильныеПериодыСезонность.Шкала = НомераСтрокКонецСезонностиБезФормулы.Шкала
	|			И (СтабильныеПериодыСезонность.НомерПозиции - СтабильныеПериодыСезонность.УвеличениеПозиции = НомераСтрокКонецСезонностиБезФормулы.НомерПозиции)
	|			И (НЕ СтабильныеПериодыСезонность.НеПрименятьСезонность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеКонецСезонности.Организация КАК Организация,
	|	СтабильныеКонецСезонности.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеКонецСезонности.Район КАК Район,
	|	СтабильныеКонецСезонности.МКД КАК МКД,
	|	СтабильныеКонецСезонности.Услуга КАК Услуга,
	|	СтабильныеКонецСезонности.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеКонецСезонности.НомерПозиции КАК НомерПозиции,
	|	СтабильныеКонецСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеКонецСезонности.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеКонецСезонности.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонности.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеКонецСезонности.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеКонецСезонности.ПриборВведен КАК ПриборВведен,
	|	СтабильныеКонецСезонности.ПриборУчета КАК ПриборУчета,
	|	СтабильныеКонецСезонности.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеКонецСезонности.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеКонецСезонности.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеКонецСезонности.Поставщик КАК Поставщик,
	|	СтабильныеКонецСезонности.Бойлер КАК Бойлер,
	|	СтабильныеКонецСезонности.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеКонецСезонности.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеКонецСезонности.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеКонецСезонности.КлючНорматива КАК КлючНорматива,
	|	СтабильныеКонецСезонности.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеКонецСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонности.Шкала КАК Шкала,
	|	СтабильныеКонецСезонности.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеКонецСезонности.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ВЫБОР
	|		КОГДА энргВидыДифференцированностиТарифныеЗоны.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона,
	|	СтабильныеКонецСезонности.ТипСхемы КАК ТипСхемы,
	|	СтабильныеКонецСезонности.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеКонецСезонности.КоэффициентНорматива КАК КоэффициентНорматива
	|ПОМЕСТИТЬ СтабильныеКонецСезонностиТарифнаяЗона
	|ИЗ
	|	СтабильныеКонецСезонности КАК СтабильныеКонецСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеКонецСезонности.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеКонецСезонностиТарифнаяЗона.Организация КАК Организация,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Район КАК Район,
	|	СтабильныеКонецСезонностиТарифнаяЗона.МКД КАК МКД,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Услуга КАК Услуга,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НомерПозиции КАК НомерПозиции,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Шкала КАК Шкала,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидДифференцированности КАК ВидДифференцированности,
	|	ЕСТЬNULL(ПериодыПоказаний.Показания, 0) КАК Показания,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НачалоОП КАК НачалоОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеКонецСезонностиТарифнаяЗона.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеКонецСезонностиТарифнаяЗона.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПриборВведен КАК ПриборВведен,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ПриборУчета КАК ПриборУчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Поставщик КАК Поставщик,
	|	СтабильныеКонецСезонностиТарифнаяЗона.Бойлер КАК Бойлер,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеКонецСезонностиТарифнаяЗона.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеКонецСезонностиТарифнаяЗона.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КлючНорматива КАК КлючНорматива,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеКонецСезонностиТарифнаяЗона.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ТипСхемы КАК ТипСхемы,
	|	СтабильныеКонецСезонностиТарифнаяЗона.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеКонецСезонностиТарифнаяЗона.КоэффициентНорматива КАК КоэффициентНорматива
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	СтабильныеКонецСезонностиТарифнаяЗона КАК СтабильныеКонецСезонностиТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.энргНачислениеМКД
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.энргВводНачальныхОстатковМКД
	|					ТОГДА ПериодыПоказаний.ПризнакНачалаПериода
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.энргОткрытиеМКД
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчетаМКД
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				КОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугамиМКД
	|					ТОГДА СтабильныеКонецСезонностиТарифнаяЗона.ДокРегистратор = ПериодыПоказаний.ДокРегистратор
	|				ИНАЧЕ СтабильныеКонецСезонностиТарифнаяЗона.ПериодРегистрации МЕЖДУ ПериодыПоказаний.НачалоПериодДействия И ПериодыПоказаний.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Организация = ПериодыПоказаний.Организация
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Район = ПериодыПоказаний.Район
	|			И СтабильныеКонецСезонностиТарифнаяЗона.МКД = ПериодыПоказаний.МКД
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ПриборУчета = ПериодыПоказаний.ПриборУчета
	|			И СтабильныеКонецСезонностиТарифнаяЗона.Шкала = ПериодыПоказаний.Шкала
	|			И СтабильныеКонецСезонностиТарифнаяЗона.ТарифнаяЗона = ПериодыПоказаний.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыПоказанияНачало.Организация КАК Организация,
	|	СтабильныеПериодыПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыПоказанияНачало.Район КАК Район,
	|	СтабильныеПериодыПоказанияНачало.МКД КАК МКД,
	|	СтабильныеПериодыПоказанияНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыПоказанияНачало.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыПоказанияНачало.НомерПозиции КАК НомерПозиции,
	|	СтабильныеПериодыПоказанияНачало.Шкала КАК Шкала,
	|	СтабильныеПериодыПоказанияНачало.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериодыПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияНачало.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления = &НачалоВеденияУчета
	|			ТОГДА ВЫБОР
	|					КОГДА СтабильныеПериодыПоказанияКонец.ПериодРегистрации < СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|						ТОГДА СтабильныеПериодыПоказанияНачало.ПериодНачисления
	|					ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтабильныеПериодыПоказанияКонец.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,
	|	СтабильныеПериодыПоказанияНачало.Показания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПоказанияКонец.ПриборУчета ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыПоказанияНачало.Показания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтабильныеПериодыПоказанияНачало.ПриборУчета = СтабильныеПериодыПоказанияКонец.ПриборУчета
	|					ТОГДА СтабильныеПериодыПоказанияКонец.Показания
	|				ИНАЧЕ СтабильныеПериодыПоказанияНачало.Показания
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныеПоказания,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентСезоности КАК КоэффициентСезоности,
	|	СтабильныеПериодыПоказанияНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПоказанияНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПоказанияНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	ЕСТЬNULL(СтабильныеПериодыПоказанияКонец.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	|	СтабильныеПериодыПоказанияНачало.МКДОткрыт КАК МКДОткрыт,
	|	СтабильныеПериодыПоказанияНачало.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыПоказанияНачало.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыПоказанияНачало.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыПоказанияНачало.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыПоказанияНачало.Поставщик КАК Поставщик,
	|	СтабильныеПериодыПоказанияНачало.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериодыПоказанияНачало.Бойлер КАК Бойлер,
	|	СтабильныеПериодыПоказанияНачало.ФормулаРасчета КАК ФормулаРасчета,
	|	СтабильныеПериодыПоказанияНачало.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыПоказанияНачало.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериодыПоказанияНачало.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыПоказанияНачало.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	СтабильныеПериодыПоказанияНачало.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыПоказанияНачало.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыПоказанияНачало.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыПоказанияНачало.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыПоказанияНачало.КоэффициентНорматива КАК КоэффициентНорматива
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказанияКонец
	|		ПО СтабильныеПериодыПоказанияНачало.Организация = СтабильныеПериодыПоказанияКонец.Организация
	|			И (СтабильныеПериодыПоказанияНачало.НомерПозиции = СтабильныеПериодыПоказанияКонец.НомерПозиции - 1)
	|			И СтабильныеПериодыПоказанияНачало.ПериодНачисления = СтабильныеПериодыПоказанияКонец.ПериодНачисления
	|			И СтабильныеПериодыПоказанияНачало.Район = СтабильныеПериодыПоказанияКонец.Район
	|			И СтабильныеПериодыПоказанияНачало.МКД = СтабильныеПериодыПоказанияКонец.МКД
	|			И СтабильныеПериодыПоказанияНачало.ТочкаУчета = СтабильныеПериодыПоказанияКонец.ТочкаУчета
	|			И СтабильныеПериодыПоказанияНачало.Услуга = СтабильныеПериодыПоказанияКонец.Услуга";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПолучитьДанныеДляРасчетаМКД(ИмяДокумента)	
	Текст  = 
	"ВЫБРАТЬ
	|	Периоды.НачалоПериода КАК НачалоПериода,
	|	Периоды.КонецПериода КАК КонецПериода,
	|	Периоды.Организация КАК Организация,
	|	Периоды.ПериодНачисления КАК ПериодНачисления,
	|	Периоды.Район КАК Район,
	|	Периоды.МКД КАК МКД,
	|	Периоды.Услуга КАК Услуга,
	|	Периоды.ТочкаУчета КАК ТочкаУчета,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.Шкала КАК Шкала,
	|	Периоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	Периоды.НачальныеПоказания КАК НачПок,
	|	ЕСТЬNULL(СреднееПотребление.СреднийОбъем, -1) КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ КАК КонПок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.МКД ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПредоставленныеПоказания.ВСрок
	|		КОНЕЦ) КАК ПоказанияВСрок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеВыводаПрибораУчета.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВыводПрибораУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ПоказанияПредоставлены,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаДокумента.Ссылка, ЗНАЧЕНИЕ(Документ.энргНачислениеМКД.ПустаяСсылка))) КАК ДокументНачисления,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаДокумента.ПометкаУдаления, ЛОЖЬ)) КАК ДокументНачисленияПометкаУдаления,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	Периоды.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощадиМКД, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|	МАКСИМУМ(ЕСТЬNULL(ПредоставленныеПоказанияПоМКД.ПоказанияТекущегоПериода, ЛОЖЬ)) КАК ЕстьПоказанияМКД,
	|	Периоды.МКДОткрыт КАК МКДОткрыт,
	|	Периоды.УслугаПодключена КАК УслугаПодключена,
	|	Периоды.ПриборВведен КАК ПриборВведен,
	|	Периоды.ПриборУчета КАК ПриборУчета,
	|	Периоды.КоэффициентПУ КАК КоэффициентПУ,
	|	Периоды.ВидБлагоустройства КАК ВидБлагоустройства,
	|	Периоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	Периоды.Поставщик КАК Поставщик,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.Бойлер КАК Бойлер,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)) КАК ФормулаРасчета,
	|	Периоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Периоды.КлючНорматива КАК КлючНорматива,
	|	Периоды.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	Периоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	Периоды.ТипСхемы КАК ТипСхемы,
	|	Периоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК ЗависитОтУслуги,
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗакрытаяСхемаГВС,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0) КАК ПлощадьМОП,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0) КАК ПлощадьАбонентов,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0) КАК ПлощадьСобственнаяПоставка,
	|	Периоды.КоэффициентНорматива КАК КоэффициентНорматива
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормой
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО Периоды.Организация = ПредоставленныеПоказания.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказания.Район
	|			И Периоды.МКД = ПредоставленныеПоказания.МКД
	|			И Периоды.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И Периоды.Шкала = ПредоставленныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.МКД = МаксимальныеПоказания.МКД
	|			И Периоды.ПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргНачислениеМКД КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(Периоды.ПериодНачисления, МЕСЯЦ))
	|			И Периоды.Организация = ТаблицаДокумента.Организация
	|			И Периоды.Район = ТаблицаДокумента.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеМКД КАК СреднееПотребление
	|		ПО Периоды.Организация = СреднееПотребление.Организация
	|			И Периоды.ПериодНачисления = СреднееПотребление.ПериодНачисления
	|			И Периоды.Район = СреднееПотребление.Район
	|			И Периоды.МКД = СреднееПотребление.МКД
	|			И Периоды.Услуга = СреднееПотребление.Услуга
	|			И Периоды.ТочкаУчета = СреднееПотребление.ТочкаУчета
	|			И Периоды.Шкала = СреднееПотребление.Шкала
	|			И Периоды.ТарифнаяЗона = СреднееПотребление.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВыводаПрибораУчета КАК ДанныеВыводаПрибораУчета
	|		ПО Периоды.Организация = ДанныеВыводаПрибораУчета.Организация
	|			И Периоды.ПериодНачисления = ДанныеВыводаПрибораУчета.ПериодНачисления
	|			И Периоды.Район = ДанныеВыводаПрибораУчета.Район
	|			И Периоды.МКД = ДанныеВыводаПрибораУчета.МКД
	|			И Периоды.ТочкаУчета = ДанныеВыводаПрибораУчета.ТочкаУчета
	|			И Периоды.ПриборУчета = ДанныеВыводаПрибораУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Периоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Периоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоМКД КАК ПредоставленныеПоказанияПоМКД
	|		ПО Периоды.Организация = ПредоставленныеПоказанияПоМКД.Организация
	|			И Периоды.ПериодНачисления = ПредоставленныеПоказанияПоМКД.ПериодНачисления
	|			И Периоды.Район = ПредоставленныеПоказанияПоМКД.Район
	|			И Периоды.МКД = ПредоставленныеПоказанияПоМКД.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО Периоды.Организация = МКДНеНачислятьТЭ.Организация
	|			И Периоды.Район = МКДНеНачислятьТЭ.Район
	|			И Периоды.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И Периоды.ТипСхемы = МКДНеНачислятьТЭ.ТипСхемы
	|			И Периоды.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту
	|			И (ВЫБОР
	|				КОГДА МКДНеНачислятьТЭ.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|					ТОГДА Периоды.МКД = МКДНеНачислятьТЭ.МКД
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСтроений КАК ЗначенияПлощадейСтроений
	|		ПО Периоды.Организация = ЗначенияПлощадейСтроений.Организация
	|			И Периоды.ПериодНачисления = ЗначенияПлощадейСтроений.ПериодНачисления
	|			И Периоды.Район = ЗначенияПлощадейСтроений.Район
	|			И Периоды.Услуга = ЗначенияПлощадейСтроений.Услуга
	|			И Периоды.МКД = ЗначенияПлощадейСтроений.МКД
	|ГДЕ
	|	Периоды.МКДОткрыт
	|	И Периоды.УслугаПодключена
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Организация,
	|	Периоды.ПериодНачисления,
	|	Периоды.МКД,
	|	Периоды.Шкала,
	|	Периоды.ПривязанаКШкале,
	|	Периоды.ТарифнаяЗона,
	|	Периоды.КонецПериода,
	|	Периоды.НачалоПериода,
	|	Периоды.Район,
	|	Периоды.ТочкаУчета,
	|	Периоды.НачальныеПоказания,
	|	ЕСТЬNULL(СреднееПотребление.СреднийОбъем, -1),
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания,
	|	Периоды.Услуга,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ,
	|	Периоды.КоэффициентСезоности,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощадиМКД, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)),
	|	Периоды.ДнейВПериоде,
	|	Периоды.МКДОткрыт,
	|	Периоды.УслугаПодключена,
	|	Периоды.ПриборВведен,
	|	Периоды.ПриборУчета,
	|	Периоды.КоэффициентПУ,
	|	Периоды.ВидБлагоустройства,
	|	Периоды.ЗначениеПлощади,
	|	Периоды.Поставщик,
	|	Периоды.ВидДифференцированности,
	|	Периоды.Бойлер,
	|	Периоды.РасчетПоФормуле,
	|	ВЫРАЗИТЬ(Периоды.ФормулаРасчета КАК СТРОКА(1000)),
	|	Периоды.СоставнаяУслуга,
	|	Периоды.КлючНорматива,
	|	Периоды.НеРаспределятьНаАбонентов,
	|	Периоды.НеПрименятьСезонность,
	|	Периоды.ОбъемЗаПрошлыйГод,
	|	Периоды.ТипСхемы,
	|	Периоды.ВидТепловогоПункта,
	|	ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА МКДНеНачислятьТЭ.НеНачислять
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0),
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0),
	|	Периоды.КоэффициентНорматива";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаРассчитатьОбъемПотребленияМКД()
	Текст  =  
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ТОГДА 2
	|			ИНАЧЕ 3
	|		КОНЕЦ) КАК Приоритет
	|ПОМЕСТИТЬ ПриоритетНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	(НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|			ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиНачисленияНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ПриоритетНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 2
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.УслугаПодключена КАК УслугаПодключена,
	|	ДанныеДляРасчетаПередНормой.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчетаПередНормой.Шкала КАК Шкала,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.МКДОткрыт КАК МКДОткрыт,
	|	ДанныеДляРасчетаПередНормой.ПриборВведен КАК ПриборВведен,
	|	ДанныеДляРасчетаПередНормой.НачПок КАК НачПок,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.КонПок КАК КонПок,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ДанныеДляРасчетаПЕредНормой,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеДляРасчетаПередНормой.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляРасчетаПередНормой.Поставщик КАК Поставщик,
	|	ДанныеДляРасчетаПередНормой.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчетаПередНормой.Бойлер КАК Бойлер,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияМКД КАК ЕстьПоказанияМКД,
	|	ВЫБОР
	|		КОГДА НЕ ТочкиНачисленияНормы.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеДляРасчетаПередНормой.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчетаПередНормой.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	ДанныеДляРасчетаПередНормой.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) * ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчетаПередНормой.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчетаПередНормой.ЗначениеПлощади
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчетаПередНормой.ПлощадьАбонентов - ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка + ДанныеДляРасчетаПередНормой.ПлощадьМОП = 0
	|						ТОГДА 0
	|					ИНАЧЕ (ДанныеДляРасчетаПередНормой.ПлощадьАбонентов - ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчетаПередНормой.ПлощадьАбонентов - ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка + ДанныеДляРасчетаПередНормой.ПлощадьМОП)
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчетаПередНормой.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчетаПередНормой.ДнейВПериоде) КАК ОбъемПоНорме,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности
	|ПОМЕСТИТЬ ДанныеДляРасчета
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормы КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.МКД = ТочкиНачисленияНормы.МКД
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация КАК Организация,
	|	ДанныеДляРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчета.Район КАК Район,
	|	ДанныеДляРасчета.МКД КАК МКД,
	|	ДанныеДляРасчета.Услуга КАК Услуга,
	|	ДанныеДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчета.Шкала КАК Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен КАК ПриборВведен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|				ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|			ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|		КОНЕЦ * ДанныеДляРасчета.КоэффициентПУ КАК ЧИСЛО(15, 6)) КАК ОбъемУслугиПотребленный,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ДанныеДляРасчета.КонПок < ДанныеДляРасчета.НачПок
	|						ТОГДА ДанныеДляРасчета.МаксимальноВозможныеПоказания - ДанныеДляРасчета.НачПок + ДанныеДляРасчета.КонПок
	|					ИНАЧЕ ДанныеДляРасчета.КонПок - ДанныеДляРасчета.НачПок
	|				КОНЕЦ * ДанныеДляРасчета.КоэффициентПУ КАК ЧИСЛО(15, 6))
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам) КАК СпособНачисления,
	|	ДанныеДляРасчета.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик КАК Поставщик,
	|	ДанныеДляРасчета.Бойлер КАК Бойлер,
	|	ДанныеДляРасчета.НачПок КАК НачальныеПоказания,
	|	ДанныеДляРасчета.КонПок КАК КонечныеПоказания,
	|	ДанныеДляРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива КАК НормаПотребления,
	|	ДанныеДляРасчета.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета КАК ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод1,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов КАК НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС КАК ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод КАК СниматьНачисленныйСредний,
	|	ДанныеДляРасчета.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме КАК ОбъемУслугиНорматив,
	|	ДанныеДляРасчета.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.ПоказанияПредоставлены
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная),
	|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки),
	|	ДанныеДляРасчета.ПриборВведен,
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|						ТОГДА 0
	|					ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде),
	|	ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|						ТОГДА 0
	|					ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.Бойлер,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления* ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.Бойлер,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления* ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем >= 0
	|	И ДанныеДляРасчета.ПриборВведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|				ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|			ИНАЧЕ 1
	|		КОНЕЦ * ВЫБОР
	|			КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива * ВЫБОР
	|					КОГДА НЕ ДанныеДляРасчета.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|						ТОГДА ДанныеДляРасчета.ЗначениеПлощади
	|					ИНАЧЕ 1
	|				КОНЕЦ * ВЫБОР
	|					КОГДА ДанныеДляРасчета.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП = 0
	|									ТОГДА 0
	|								ИНАЧЕ (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка) / (ДанныеДляРасчета.ПлощадьАбонентов - ДанныеДляРасчета.ПлощадьСобственнаяПоставка + ДанныеДляРасчета.ПлощадьМОП)
	|							КОНЕЦ
	|					ИНАЧЕ 1
	|				КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6))
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.Бойлер,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления* ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ПоказанияВСрок
	|	И НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем < 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НачислятьНорму
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчета.Организация,
	|	ДанныеДляРасчета.ПериодНачисления,
	|	ДанныеДляРасчета.НачалоПериода,
	|	ДанныеДляРасчета.КонецПериода,
	|	ДанныеДляРасчета.Район,
	|	ДанныеДляРасчета.МКД,
	|	ДанныеДляРасчета.Услуга,
	|	ДанныеДляРасчета.ТочкаУчета,
	|	ДанныеДляРасчета.ПриборУчета,
	|	ДанныеДляРасчета.Шкала,
	|	ДанныеДляРасчета.ТарифнаяЗона,
	|	ДанныеДляРасчета.ПриборВведен,
	|	0,
	|	ВЫРАЗИТЬ(ДанныеДляРасчета.КоэффициентСезоности * ДанныеДляРасчета.СреднийОбъем * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) / ДанныеДляРасчета.ДнейВПериоде) КАК ЧИСЛО(15, 6)),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему),
	|	ДанныеДляРасчета.ДокументНачисления,
	|	ДанныеДляРасчета.ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчета.Поставщик,
	|	ДанныеДляРасчета.Бойлер,
	|	0,
	|	0,
	|	ДанныеДляРасчета.ЗначениеПлощади,
	|	ДанныеДляРасчета.НормаПотребления * ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.ВидПлощади,
	|	ДанныеДляРасчета.ПоказанияВСрок,
	|	ДанныеДляРасчета.ФормулаРасчета,
	|	ДанныеДляРасчета.РасчетПоФормуле,
	|	ДанныеДляРасчета.СоставнаяУслуга,
	|	ДанныеДляРасчета.НеПрименятьСезонность,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ЗависитОтУслуги,
	|	ДанныеДляРасчета.ПривязанаКШкале,
	|	ДанныеДляРасчета.ВидБлагоустройства,
	|	ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.НеРаспределятьНаАбонентов,
	|	ДанныеДляРасчета.ЗакрытаяСхемаГВС,
	|	НЕ ДанныеДляРасчета.ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчета.ПлощадьМОП,
	|	ДанныеДляРасчета.ПлощадьАбонентов,
	|	ДанныеДляРасчета.ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчета.ОбъемПоНорме,
	|	ДанныеДляРасчета.КоэффициентНорматива,
	|	ДанныеДляРасчета.КоэффициентСезоности
	|ИЗ
	|	ДанныеДляРасчета КАК ДанныеДляРасчета
	|ГДЕ
	|	НЕ ДанныеДляРасчета.ВыводПрибораУчета
	|	И ДанныеДляРасчета.СреднийОбъем >= 0
	|	И ДанныеДляРасчета.ПриборВведен
	|	И ДанныеДляРасчета.НеПрименятьСезонность
	|	И ДанныеДляРасчета.ОбъемЗаПрошлыйГод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	ТочкаУчета,
	|	НачалоПериода,
	|	СоставнаяУслуга,
	|	Услуга";
			
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область НачислениеЛьгот

Функция ПолучитьТекстЗапросаДляЛьготников()
	Возврат
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВложенныйЗапрос.НачалоПериода КАК НачалоПериода,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.КолвоЖильцов КАК КолвоЖильцов,
	|	ВложенныйЗапрос.НормаПотребления КАК НормаПотребления,
	|	ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	энргВидыУслуг.ВидПлощади <> ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.пустаяссылка) КАК РасчетПоПлощади
	|ПОМЕСТИТЬ энргОбъемНачислений
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Организация КАК Организация,
	|		&Район КАК Район,
	|		энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|		энргОбъемНачислений.Строение КАК Строение,
	|		энргОбъемНачислений.Помещение КАК Помещение,
	|		энргОбъемНачислений.Абонент КАК Абонент,
	|		энргОбъемНачислений.Услуга КАК Услуга,
	|		энргОбъемНачислений.Поставщик КАК Поставщик,
	|		энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|		энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|		энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|		ВЫБОР
	|			КОГДА энргОбъемНачислений.КоличествоПроживающих <> 0
	|				ТОГДА энргОбъемНачислений.КоличествоПроживающих
	|			КОГДА энргОбъемНачислений.КоличествоПрописанных <> 0
	|				ТОГДА энргОбъемНачислений.КоличествоПрописанных
	|			КОГДА энргОбъемНачислений.КоличествоСобственников <> 0
	|				ТОГДА энргОбъемНачислений.КоличествоСобственников
	|		КОНЕЦ КАК КолвоЖильцов,
	|		энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|		ВЫБОР
	|			КОГДА энргОбъемНачислений.Услуга.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.пустаяссылка)
	|				ТОГДА энргОбъемНачислений.ОбъемУслуги
	|			ИНАЧЕ энргОбъемНачислений.ЗначениеПлощади
	|		КОНЕЦ КАК ОбъемУслуги
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргОбъемНачисленийОбороты.Период КАК Период,
	|			энргОбъемНачисленийОбороты.Регистратор КАК Регистратор,
	|			энргОбъемНачисленийОбороты.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			РегистрНакопления.энргОбъемНачислений.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Запись,
	|					Организация = &Организация
	|						И Район = &Район
	|						И ЧастныйСектор = &ЧастныйСектор
	|						И Строение = &Строение) КАК энргОбъемНачисленийОбороты) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|			ПО ВложенныйЗапрос.Период = энргОбъемНачислений.Период
	|				И ВложенныйЗапрос.Регистратор = энргОбъемНачислений.Регистратор
	|				И ВложенныйЗапрос.НомерСтроки = энргОбъемНачислений.НомерСтроки) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
	|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
	|	энргВзаиморасчетыПоМесяцамОстатки.МКД КАК МКД,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ энргВзаиморасчетыПоМесяцамОстатки
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&МесяцЗадолженности,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &Строение
	|				И ПериодНачисления <= &МесяцЗадолженности) КАК энргВзаиморасчетыПоМесяцамОстатки
	|ГДЕ
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Строение КАК Строение,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.КолвоЖильцов КАК КолвоЖильцов,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.РасчетПоПлощади КАК РасчетПоПлощади
	|ПОМЕСТИТЬ ВТ_ТолькоПоОтборам
	|ИЗ
	|	энргОбъемНачислений КАК энргОбъемНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргВзаиморасчетыПоМесяцамОстатки КАК энргВзаиморасчетыПоМесяцамОстатки
	|		ПО энргОбъемНачислений.Организация = энргВзаиморасчетыПоМесяцамОстатки.Организация
	|			И энргОбъемНачислений.Район = энргВзаиморасчетыПоМесяцамОстатки.Район
	|			И энргОбъемНачислений.Строение = энргВзаиморасчетыПоМесяцамОстатки.МКД
	|			И энргОбъемНачислений.Услуга = энргВзаиморасчетыПоМесяцамОстатки.Услуга
	|			И энргОбъемНачислений.Абонент = энргВзаиморасчетыПоМесяцамОстатки.Абонент
	|			И энргОбъемНачислений.Поставщик = энргВзаиморасчетыПоМесяцамОстатки.Поставщик
	|ГДЕ
	|	энргВзаиморасчетыПоМесяцамОстатки.Организация ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Начало КАК Период,
	|	энргПроживаниеЖильцовСрезПоследних.Жилец КАК Жилец,
	|	энргПроживаниеЖильцовСрезПоследних.Состояние КАК Состояние,
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_Жильцы
	|ИЗ
	|	РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(&Начало, ) КАК энргПроживаниеЖильцовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО энргПроживаниеЖильцовСрезПоследних.Организация = ВТ_ТолькоПоОтборам.Организация
	|			И энргПроживаниеЖильцовСрезПоследних.Район = ВТ_ТолькоПоОтборам.Район
	|			И энргПроживаниеЖильцовСрезПоследних.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргПроживаниеЖильцов.Период, ДЕНЬ),
	|	энргПроживаниеЖильцов.Жилец,
	|	энргПроживаниеЖильцов.Состояние,
	|	ВТ_ТолькоПоОтборам.Абонент
	|ИЗ
	|	РегистрСведений.энргПроживаниеЖильцов КАК энргПроживаниеЖильцов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО энргПроживаниеЖильцов.Организация = ВТ_ТолькоПоОтборам.Организация
	|			И энргПроживаниеЖильцов.Район = ВТ_ТолькоПоОтборам.Район
	|			И энргПроживаниеЖильцов.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|ГДЕ
	|	энргПроживаниеЖильцов.Период МЕЖДУ &Начало И &Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Жильцы.Период КАК ПериодС,
	|	Жильцы.Жилец КАК Жилец,
	|	Жильцы.Состояние КАК Состояние,
	|	ЕСТЬNULL(Жильцы1.Период, &Конец) КАК ПериодПо,
	|	Жильцы.Абонент КАК Абонент
	|ПОМЕСТИТЬ СтабильныеТолькоДляЖильцов
	|ИЗ
	|	ВТ_Жильцы КАК Жильцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Жильцы КАК Жильцы1
	|		ПО Жильцы.Период < Жильцы1.Период
	|			И Жильцы.Жилец = Жильцы1.Жилец
	|ГДЕ
	|	Жильцы.Период <> &Конец
	|;
	|
	|ВЫБРАТЬ
	|	энргЖильцыЛьготныхКатегорийСрезПоследних.Жилец КАК Жилец,
	|	ВЫБОР
	|		КОГДА энргЖильцыЛьготныхКатегорийСрезПоследних.Состояние
	|			ТОГДА энргЖильцыЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.пустаяссылка)
	|	КОНЕЦ КАК Льгота,
	|	&Начало КАК Период,
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_Льготы
	|ИЗ
	|	ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(&Начало, ) КАК энргЖильцыЛьготныхКатегорийСрезПоследних
	|		ПО ВТ_ТолькоПоОтборам.Абонент = энргЖильцыЛьготныхКатегорийСрезПоследних.Абонент
	|			И ВТ_ТолькоПоОтборам.Район = энргЖильцыЛьготныхКатегорийСрезПоследних.Район
	|			И ВТ_ТолькоПоОтборам.Организация = энргЖильцыЛьготныхКатегорийСрезПоследних.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЖильцыЛьготныхКатегорий.Жилец,
	|	ВЫБОР
	|		КОГДА энргЖильцыЛьготныхКатегорий.Состояние
	|			ТОГДА энргЖильцыЛьготныхКатегорий.ЛьготнаяКатегория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.пустаяссылка)
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(энргЖильцыЛьготныхКатегорий.Период, ДЕНЬ),
	|	ВТ_ТолькоПоОтборам.Абонент
	|ИЗ
	|	РегистрСведений.энргЖильцыЛьготныхКатегорий КАК энргЖильцыЛьготныхКатегорий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО энргЖильцыЛьготныхКатегорий.Организация = ВТ_ТолькоПоОтборам.Организация
	|			И энргЖильцыЛьготныхКатегорий.Район = ВТ_ТолькоПоОтборам.Район
	|			И энргЖильцыЛьготныхКатегорий.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|ГДЕ
	|	энргЖильцыЛьготныхКатегорий.Период МЕЖДУ &Начало И &Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Жильцы.Период КАК Период,
	|	ВТ_Жильцы.Жилец КАК Жилец
	|ПОМЕСТИТЬ ПериодыЖильцыЛьготы
	|ИЗ
	|	ВТ_Жильцы КАК ВТ_Жильцы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Льготы.Период,
	|	ВТ_Льготы.Жилец
	|ИЗ
	|	ВТ_Льготы КАК ВТ_Льготы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыЖильцыЛьготы.Период КАК Период,
	|	ПериодыЖильцыЛьготы.Жилец КАК Жилец
	|ПОМЕСТИТЬ ПериодЖЛБезПовт
	|ИЗ
	|	ПериодыЖильцыЛьготы КАК ПериодыЖильцыЛьготы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодЖЛБезПовт.Период КАК ПериодС,
	|	ПериодЖЛБезПовт.Жилец КАК Жилец,
	|	МИНИМУМ(ЕСТЬNULL(ПериодЖЛБезПовт1.Период, &Конец)) КАК ПериодПо
	|ПОМЕСТИТЬ СтабильныеПериодыДляВсехБезРесурсов
	|ИЗ
	|	ПериодЖЛБезПовт КАК ПериодЖЛБезПовт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодЖЛБезПовт КАК ПериодЖЛБезПовт1
	|		ПО ПериодЖЛБезПовт.Жилец = ПериодЖЛБезПовт1.Жилец
	|			И ПериодЖЛБезПовт.Период < ПериодЖЛБезПовт1.Период
	|ГДЕ
	|	ПериодЖЛБезПовт.Период <> &Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодЖЛБезПовт.Период,
	|	ПериодЖЛБезПовт.Жилец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Льготы.Жилец КАК Жилец,
	|	ВТ_Льготы.Период КАК ПериодС,
	|	ЕСТЬNULL(ВТ_Льготы1.Период, &Конец) КАК ПериодПо,
	|	ВТ_Льготы.Льгота КАК Льгота
	|ПОМЕСТИТЬ СтабильныеПериодыТолькоДляЛьгот
	|ИЗ
	|	ВТ_Льготы КАК ВТ_Льготы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Льготы КАК ВТ_Льготы1
	|		ПО ВТ_Льготы.Жилец = ВТ_Льготы1.Жилец
	|			И ВТ_Льготы.Период < ВТ_Льготы1.Период
	|ГДЕ
	|	ВТ_Льготы.Период <> &Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДляВсехБезРесурсов.ПериодС КАК ПериодС,
	|	СтабильныеПериодыДляВсехБезРесурсов.ПериодПо КАК ПериодПо,
	|	СтабильныеПериодыДляВсехБезРесурсов.Жилец КАК Жилец,
	|	СтабильныеПериодыТолькоДляЛьгот.Льгота КАК Льгота,
	|	СтабильныеТолькоДляЖильцов.Состояние КАК Состояние,
	|	СтабильныеТолькоДляЖильцов.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОбъединенныеСтабильныеПериоды
	|ИЗ
	|	СтабильныеПериодыДляВсехБезРесурсов КАК СтабильныеПериодыДляВсехБезРесурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеТолькоДляЖильцов КАК СтабильныеТолькоДляЖильцов
	|		ПО СтабильныеПериодыДляВсехБезРесурсов.Жилец = СтабильныеТолькоДляЖильцов.Жилец
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодС >= СтабильныеТолькоДляЖильцов.ПериодС
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодПо <= СтабильныеТолькоДляЖильцов.ПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыТолькоДляЛьгот КАК СтабильныеПериодыТолькоДляЛьгот
	|		ПО СтабильныеПериодыДляВсехБезРесурсов.Жилец = СтабильныеПериодыТолькоДляЛьгот.Жилец
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодС >= СтабильныеПериодыТолькоДляЛьгот.ПериодС
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодПо <= СтабильныеПериодыТолькоДляЛьгот.ПериодПо
	|ГДЕ
	|	СтабильныеТолькоДляЖильцов.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеЖильцов.регистрация)
	|	И СтабильныеПериодыТолькоДляЛьгот.Льгота <> ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.Пустаяссылка)
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ТолькоПоОтборам.НачалоПериода КАК Период,
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОбъединениеПериодовСНачислениями
	|ИЗ
	|	ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТолькоПоОтборам.КонецПериода,
	|	ВТ_ТолькоПоОтборам.Абонент
	|ИЗ
	|	ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъединенныеСтабильныеПериоды.ПериодС,
	|	ОбъединенныеСтабильныеПериоды.Абонент
	|ИЗ
	|	ОбъединенныеСтабильныеПериоды КАК ОбъединенныеСтабильныеПериоды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъединенныеСтабильныеПериоды.ПериодПо,
	|	ОбъединенныеСтабильныеПериоды.Абонент
	|ИЗ
	|	ОбъединенныеСтабильныеПериоды КАК ОбъединенныеСтабильныеПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъединениеПериодовСНачислениями.Период КАК Период,
	|	ОбъединениеПериодовСНачислениями.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОбъединениеПериодовСНачислениямиБезПовт
	|ИЗ
	|	ОбъединениеПериодовСНачислениями КАК ОбъединениеПериодовСНачислениями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъединениеПериодовСНачислениямиБезПовт.Абонент КАК Абонент,
	|	ОбъединениеПериодовСНачислениямиБезПовт.Период КАК ПериодC,
	|	МИНИМУМ(ЕСТЬNULL(ОбъединениеПериодовСНачислениямиБезПовт1.Период, &Конец)) КАК ПериодПо
	|ПОМЕСТИТЬ СтабльныеПериодыБезРесурсовОбъединение
	|ИЗ
	|	ОбъединениеПериодовСНачислениямиБезПовт КАК ОбъединениеПериодовСНачислениямиБезПовт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъединениеПериодовСНачислениямиБезПовт КАК ОбъединениеПериодовСНачислениямиБезПовт1
	|		ПО ОбъединениеПериодовСНачислениямиБезПовт.Период < ОбъединениеПериодовСНачислениямиБезПовт1.Период
	|			И ОбъединениеПериодовСНачислениямиБезПовт.Абонент = ОбъединениеПериодовСНачислениямиБезПовт1.Абонент
	|ГДЕ
	|	ОбъединениеПериодовСНачислениямиБезПовт.Период <> &Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединениеПериодовСНачислениямиБезПовт.Период,
	|	ОбъединениеПериодовСНачислениямиБезПовт.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент,
	|	ВТ_ТолькоПоОтборам.Район КАК Район,
	|	ВТ_ТолькоПоОтборам.Организация КАК Организация,
	|	ВТ_ТолькоПоОтборам.Строение КАК Строение,
	|	ВТ_ТолькоПоОтборам.ЗначениеТарифа КАК ЗначениеТарифа,
	|	СтабльныеПериодыБезРесурсовОбъединение.ПериодC КАК ПериодC,
	|	СтабльныеПериодыБезРесурсовОбъединение.ПериодПо КАК ПериодПо,
	|	ВТ_ТолькоПоОтборам.КолвоЖильцов КАК КолвоЖильцов,
	|	ВТ_ТолькоПоОтборам.НормаПотребления КАК НормаПотребления,
	|	ВТ_ТолькоПоОтборам.ОбъемУслуги КАК ОбъемУслуги,
	|	ОбъединенныеСтабильныеПериоды.Жилец КАК Жилец,
	|	ОбъединенныеСтабильныеПериоды.Льгота КАК Льгота,
	|	ВТ_ТолькоПоОтборам.Услуга КАК Услуга,
	|	ВТ_ТолькоПоОтборам.РасчетПоПлощади КАК РасчетПоПлощади,
	|	ВТ_ТолькоПоОтборам.Поставщик КАК Поставщик,
	|	РАЗНОСТЬДАТ(ВТ_ТолькоПоОтборам.НачалоПериода, ВТ_ТолькоПоОтборам.КонецПериода, ДЕНЬ) КАК РазностьДатПоНачислениям
	|ПОМЕСТИТЬ ПакетДляРасчетаПодготовка
	|ИЗ
	|	СтабльныеПериодыБезРесурсовОбъединение КАК СтабльныеПериодыБезРесурсовОбъединение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъединенныеСтабильныеПериоды КАК ОбъединенныеСтабильныеПериоды
	|		ПО СтабльныеПериодыБезРесурсовОбъединение.Абонент = ОбъединенныеСтабильныеПериоды.Абонент
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодC >= ОбъединенныеСтабильныеПериоды.ПериодС
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодПо <= ОбъединенныеСтабильныеПериоды.ПериодПо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО СтабльныеПериодыБезРесурсовОбъединение.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодC >= ВТ_ТолькоПоОтборам.НачалоПериода
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодПо <= ВТ_ТолькоПоОтборам.КонецПериода
	|ГДЕ
	|	ВТ_ТолькоПоОтборам.КолвоЖильцов <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетДляРасчетаПодготовка.Абонент КАК Абонент,
	|	ПакетДляРасчетаПодготовка.Район КАК Район,
	|	ПакетДляРасчетаПодготовка.Организация КАК Организация,
	|	ПакетДляРасчетаПодготовка.Строение КАК Строение,
	|	ПакетДляРасчетаПодготовка.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ПакетДляРасчетаПодготовка.ПериодC КАК ПериодC,
	|	ПакетДляРасчетаПодготовка.ПериодПо КАК ПериодПо,
	|	ПакетДляРасчетаПодготовка.КолвоЖильцов КАК КолвоЖильцов,
	|	ПакетДляРасчетаПодготовка.НормаПотребления КАК НормаПотребления,
	|	ПакетДляРасчетаПодготовка.ОбъемУслуги КАК ОбъемУслуги,
	|	ПакетДляРасчетаПодготовка.Жилец КАК Жилец,
	|	ПакетДляРасчетаПодготовка.Льгота КАК Льгота,
	|	ПакетДляРасчетаПодготовка.Услуга КАК Услуга,
	|	энргЗначенияСоциальныхНормативовДляЛьгот.ЗначениеНорматива КАК ЗначениеНорматива,
	|	ПакетДляРасчетаПодготовка.РасчетПоПлощади КАК РасчетПоПлощади,
	|	ЕСТЬNULL(энргЗначенияЛьготныхКатегорий.ПроцентОтНачислений, 0) КАК ПроцентЛьготы,
	|	ПакетДляРасчетаПодготовка.Поставщик КАК Поставщик,
	|	ПакетДляРасчетаПодготовка.РазностьДатПоНачислениям КАК РазностьДатПоНачислениям
	|ПОМЕСТИТЬ ПакетДляРасчета
	|ИЗ
	|	ПакетДляРасчетаПодготовка КАК ПакетДляРасчетаПодготовка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИспользованиеСоцНормативовВУслугах.СрезПоследних(&Конец, ) КАК энргИспользованиеСоцНормативовВУслугахСрезПоследних
	|		ПО ПакетДляРасчетаПодготовка.Услуга = энргИспользованиеСоцНормативовВУслугахСрезПоследних.Услуга
	|			И ПакетДляРасчетаПодготовка.Район = энргИспользованиеСоцНормативовВУслугахСрезПоследних.Район
	|			И ПакетДляРасчетаПодготовка.Организация = энргИспользованиеСоцНормативовВУслугахСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияСоциальныхНормативовДляЛьгот.СрезПоследних(&Конец, ) КАК энргЗначенияСоциальныхНормативовДляЛьгот
	|		ПО (энргИспользованиеСоцНормативовВУслугахСрезПоследних.Использование)
	|			И ПакетДляРасчетаПодготовка.Организация = энргЗначенияСоциальныхНормативовДляЛьгот.Организация
	|			И ПакетДляРасчетаПодготовка.Район = энргЗначенияСоциальныхНормативовДляЛьгот.Район
	|			И ПакетДляРасчетаПодготовка.КолвоЖильцов = энргЗначенияСоциальныхНормативовДляЛьгот.КоличествоПрописанных
	|			И ПакетДляРасчетаПодготовка.Услуга = энргЗначенияСоциальныхНормативовДляЛьгот.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияЛьготныхКатегорий.СрезПоследних(&Конец, ) КАК энргЗначенияЛьготныхКатегорий
	|		ПО ПакетДляРасчетаПодготовка.Организация = энргЗначенияЛьготныхКатегорий.Организация
	|			И ПакетДляРасчетаПодготовка.Район = энргЗначенияЛьготныхКатегорий.Район
	|			И ПакетДляРасчетаПодготовка.Льгота = энргЗначенияЛьготныхКатегорий.ЛьготнаяКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетДляРасчета.Абонент КАК Абонент,
	|	ПакетДляРасчета.Район КАК Район,
	|	ПакетДляРасчета.Организация КАК Организация,
	|	ПакетДляРасчета.Строение КАК Строение,
	|	ПакетДляРасчета.ЗначениеТарифа КАК ЗначениеТарифа,
	|	МИНИМУМ(ПакетДляРасчета.ПериодC) КАК НачалоПериода,
	|	МАКСИМУМ(ПакетДляРасчета.ПериодПо) КАК КонецПериода,
	|	ПакетДляРасчета.Жилец КАК Жилец,
	|	ПакетДляРасчета.Льгота КАК ЛьготнаяКатегория,
	|	ПакетДляРасчета.ПроцентЛьготы КАК ПроцентЛьготы,
	|	ПакетДляРасчета.Услуга КАК Услуга,
	|	энргНачислениеДляЛьготныхЛиц.Ссылка КАК СсылкаНаСущДок,
	|	энргНачислениеДляЛьготныхЛиц.ПометкаУдаления КАК ПометкаУдаления,
	|	ПакетДляРасчета.Поставщик КАК Поставщик,
	|	СУММА(ВЫБОР
	|			КОГДА ПакетДляРасчета.РасчетПоПлощади
	|				ТОГДА ВЫБОР
	|						КОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов < ПакетДляРасчета.ЗначениеНорматива
	|							ТОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов
	|						ИНАЧЕ ПакетДляРасчета.ЗначениеНорматива
	|					КОНЕЦ * ПакетДляРасчета.ПроцентЛьготы * 0.01 * ПакетДляРасчета.ЗначениеТарифа * ПакетДляРасчета.НормаПотребления * (РАЗНОСТЬДАТ(ПакетДляРасчета.ПериодC, ПакетДляРасчета.ПериодПо, ДЕНЬ) / ПакетДляРасчета.РазностьДатПоНачислениям)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов < ПакетДляРасчета.НормаПотребления
	|						ТОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов
	|					ИНАЧЕ ПакетДляРасчета.НормаПотребления
	|				КОНЕЦ * ПакетДляРасчета.ПроцентЛьготы * 0.01 * ПакетДляРасчета.ЗначениеТарифа * (РАЗНОСТЬДАТ(ПакетДляРасчета.ПериодC, ПакетДляРасчета.ПериодПо, ДЕНЬ) / ПакетДляРасчета.РазностьДатПоНачислениям)
	|		КОНЕЦ) КАК СуммаЛьготы
	|ИЗ
	|	ПакетДляРасчета КАК ПакетДляРасчета
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.энргНачислениеДляЛьготныхЛиц КАК энргНачислениеДляЛьготныхЛиц
	|		ПО ПакетДляРасчета.Район = энргНачислениеДляЛьготныхЛиц.Район
	|			И ПакетДляРасчета.Организация = энргНачислениеДляЛьготныхЛиц.Организация
	|			И ПакетДляРасчета.Строение = энргНачислениеДляЛьготныхЛиц.МКД
	|			И (энргНачислениеДляЛьготныхЛиц.Дата = &КонецМинусСекунда)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПакетДляРасчета.Абонент,
	|	ПакетДляРасчета.Район,
	|	ПакетДляРасчета.Организация,
	|	ПакетДляРасчета.Строение,
	|	ПакетДляРасчета.ЗначениеТарифа,
	|	ПакетДляРасчета.Жилец,
	|	ПакетДляРасчета.Льгота,
	|	ПакетДляРасчета.ПроцентЛьготы,
	|	ПакетДляРасчета.Услуга,
	|	энргНачислениеДляЛьготныхЛиц.Ссылка,
	|	энргНачислениеДляЛьготныхЛиц.ПометкаУдаления,
	|	ПакетДляРасчета.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Строение";
КонецФункции 

#КонецОбласти

#Область РаспределениеМКД

Функция ТекстЗапросаВспомогательныеДанныеРаспределениеМКД(Строение)
	
	Текст 							=
	"ВЫБРАТЬ
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО энргЗначенияНормативовПотребленияСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|			И (энргВидыУслуг.НормативДляИндивидуальных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОтложенныеДвиженияДокументов.Организация КАК Организация,
	|	энргОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	|	энргОтложенныеДвиженияДокументов.Район КАК Район,
	|	энргОтложенныеДвиженияДокументов.Строение КАК Строение
	|ПОМЕСТИТЬ ДокументыДляРаспределения
	|ИЗ
	|	РегистрСведений.энргОтложенныеДвиженияДокументов КАК энргОтложенныеДвиженияДокументов
	|ГДЕ
	|	энргОтложенныеДвиженияДокументов.Организация = &Организация
	|	И энргОтложенныеДвиженияДокументов.ПериодНачисления = &ПериодНачисления
	|	И энргОтложенныеДвиженияДокументов.Район = &Район
	|	И энргОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.РаспределениеМКД)
	|	И НЕ энргОтложенныеДвиженияДокументов.ЧастныйСектор
	|	И энргОтложенныеДвиженияДокументов.Строение = &Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО энргДокументыНачислений.Организация = ДокументыДляРаспределения.Организация
	|			И энргДокументыНачислений.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И энргДокументыНачислений.Район = ДокументыДляРаспределения.Район
	|			И (энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.Индивидуальные))
	|			И энргДокументыНачислений.МКД = ДокументыДляРаспределения.Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКД.Организация КАК Организация,
	|	энргСтабильныеПериодыМКД.Район КАК Район,
	|	энргСтабильныеПериодыМКД.МКД КАК МКД,
	|	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|	энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыМКД.ЗначениеПлощади КАК ПлощадьМОП,
	|	энргСтабильныеПериодыМКД.ТипСхемы КАК ТипСхемы,
	|	энргСтабильныеПериодыМКД.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	энргСтабильныеПериодыМКД.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргСтабильныеПериодыМКД.КлючНорматива КАК КлючНорматива
	|ПОМЕСТИТЬ УслугиМКДРаспределять
	|ИЗ
	|	ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|		ПО ДокументыДляРаспределения.Организация = энргСтабильныеПериодыМКД.Организация
	|			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	|			И ДокументыДляРаспределения.Район = энргСтабильныеПериодыМКД.Район
	|			И ДокументыДляРаспределения.Строение = энргСтабильныеПериодыМКД.МКД
	|			И (энргСтабильныеПериодыМКД.НомерПозиции = 0)
	|			И (НЕ энргСтабильныеПериодыМКД.НеРаспределятьНаАбонентов)
	|			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКД.Район = &Район)
	|			И (энргСтабильныеПериодыМКД.МКД = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиМКД.Организация КАК Организация,
	|	УслугиМКД.Район КАК Район,
	|	УслугиМКД.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ФормулаРасчетаНорматива КАК ФормулаРасчетаНорматива,
	|	СУММА(1) КАК КоличествоСовпадений
	|ПОМЕСТИТЬ ВозможныеФормулыРасчетаНорматива
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		УслугиМКДРаспределять.Организация КАК Организация,
	|		УслугиМКДРаспределять.Район КАК Район,
	|		УслугиМКДРаспределять.МКД КАК МКД,
	|		УслугиМКДРаспределять.Услуга КАК Услуга
	|	ИЗ
	|		УслугиМКДРаспределять КАК УслугиМКДРаспределять) КАК УслугиМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.Район КАК Район,
	|			ВложенныйЗапрос.МКД КАК МКД,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.ФормулаРасчетаНорматива КАК ФормулаРасчетаНорматива,
	|			энргФормулыРасчетаНормативаУслуги.Услуга КАК УслугаПараметр
	|		ИЗ
	|			(ВЫБРАТЬ
	|				УслугиМКДРаспределять.Организация КАК Организация,
	|				УслугиМКДРаспределять.Район КАК Район,
	|				УслугиМКДРаспределять.МКД КАК МКД,
	|				УслугиМКДРаспределять.Услуга КАК Услуга,
	|				энргФормулыРасчетаНорматива.Ссылка КАК ФормулаРасчетаНорматива
	|			ИЗ
	|				УслугиМКДРаспределять КАК УслугиМКДРаспределять
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргФормулыРасчетаНорматива КАК энргФормулыРасчетаНорматива
	|					ПО УслугиМКДРаспределять.Услуга = энргФормулыРасчетаНорматива.Услуга
	|						И УслугиМКДРаспределять.ТипСхемы = энргФормулыРасчетаНорматива.ТипСхемы
	|						И УслугиМКДРаспределять.ВидТепловогоПункта = энргФормулыРасчетаНорматива.ВидТепловогоПункта) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргФормулыРасчетаНорматива.Услуги КАК энргФормулыРасчетаНормативаУслуги
	|				ПО ВложенныйЗапрос.ФормулаРасчетаНорматива = энргФормулыРасчетаНормативаУслуги.Ссылка) КАК ВложенныйЗапрос
	|		ПО УслугиМКД.Организация = ВложенныйЗапрос.Организация
	|			И УслугиМКД.Район = ВложенныйЗапрос.Район
	|			И УслугиМКД.МКД = ВложенныйЗапрос.МКД
	|			И УслугиМКД.Услуга = ВложенныйЗапрос.УслугаПараметр
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиМКД.Организация,
	|	УслугиМКД.Район,
	|	УслугиМКД.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ФормулаРасчетаНорматива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	энргФормулыРасчетаНорматива.ФормулаРасчетаНормативаПотребления КАК ФормулаРасчетаНормативаПотребления
	|ПОМЕСТИТЬ ФормулыРасчетаНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозможныеФормулыРасчетаНорматива.Организация КАК Организация,
	|		ВозможныеФормулыРасчетаНорматива.Район КАК Район,
	|		ВозможныеФормулыРасчетаНорматива.МКД КАК МКД,
	|		ВозможныеФормулыРасчетаНорматива.Услуга КАК Услуга,
	|		МАКСИМУМ(ВозможныеФормулыРасчетаНорматива.ФормулаРасчетаНорматива) КАК ФормулаРасчетаНорматива
	|	ИЗ
	|		ВозможныеФормулыРасчетаНорматива КАК ВозможныеФормулыРасчетаНорматива
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВозможныеФормулыРасчетаНорматива.Организация КАК Организация,
	|				ВозможныеФормулыРасчетаНорматива.Район КАК Район,
	|				ВозможныеФормулыРасчетаНорматива.МКД КАК МКД,
	|				ВозможныеФормулыРасчетаНорматива.Услуга КАК Услуга,
	|				МАКСИМУМ(ВозможныеФормулыРасчетаНорматива.КоличествоСовпадений) КАК КоличествоСовпадений
	|			ИЗ
	|				ВозможныеФормулыРасчетаНорматива КАК ВозможныеФормулыРасчетаНорматива
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВозможныеФормулыРасчетаНорматива.Организация,
	|				ВозможныеФормулыРасчетаНорматива.Район,
	|				ВозможныеФормулыРасчетаНорматива.МКД,
	|				ВозможныеФормулыРасчетаНорматива.Услуга) КАК ВложенныйЗапрос
	|			ПО ВозможныеФормулыРасчетаНорматива.Организация = ВложенныйЗапрос.Организация
	|				И ВозможныеФормулыРасчетаНорматива.Район = ВложенныйЗапрос.Район
	|				И ВозможныеФормулыРасчетаНорматива.МКД = ВложенныйЗапрос.МКД
	|				И ВозможныеФормулыРасчетаНорматива.Услуга = ВложенныйЗапрос.Услуга
	|				И ВозможныеФормулыРасчетаНорматива.КоличествоСовпадений = ВложенныйЗапрос.КоличествоСовпадений
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозможныеФормулыРасчетаНорматива.Организация,
	|		ВозможныеФормулыРасчетаНорматива.Район,
	|		ВозможныеФормулыРасчетаНорматива.МКД,
	|		ВозможныеФормулыРасчетаНорматива.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргФормулыРасчетаНорматива КАК энргФормулыРасчетаНорматива
	|		ПО ВложенныйЗапрос.ФормулаРасчетаНорматива = энргФормулыРасчетаНорматива.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиМКДРаспределять.Организация КАК Организация,
	|	УслугиМКДРаспределять.Район КАК Район,
	|	УслугиМКДРаспределять.МКД КАК МКД,
	|	УслугиМКДРаспределять.Услуга КАК Услуга,
	|	УслугиМКДРаспределять.ПлощадьМОП КАК ПлощадьМОП,
	|	ЕСТЬNULL(ФормулыРасчетаНорматива.ФормулаРасчетаНормативаПотребления, """") КАК ФормулаРасчетаНормативаПотребления,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК ЗначениеНорматива,
	|	энргВидыУслуг.ВидПлощади КАК ВидПлощади,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги
	|ПОМЕСТИТЬ УслугиМКДРаспределятьВспомогательныеДанные
	|ИЗ
	|	УслугиМКДРаспределять КАК УслугиМКДРаспределять
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФормулыРасчетаНорматива КАК ФормулыРасчетаНорматива
	|		ПО УслугиМКДРаспределять.Организация = ФормулыРасчетаНорматива.Организация
	|			И УслугиМКДРаспределять.Район = ФормулыРасчетаНорматива.Район
	|			И УслугиМКДРаспределять.МКД = ФормулыРасчетаНорматива.МКД
	|			И УслугиМКДРаспределять.Услуга = ФормулыРасчетаНорматива.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО УслугиМКДРаспределять.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО УслугиМКДРаспределять.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И УслугиМКДРаспределять.Район = ЗначенияТекущихНормПотребления.Район
	|			И УслугиМКДРаспределять.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			И УслугиМКДРаспределять.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|	энргВидыУслуг.НачислятьПоСостояниюНаНачалоРасчетногоПериода КАК НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|ПОМЕСТИТЬ ПоследниеНомераСтрока
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляРаспределения.Организация КАК Организация,
	|		ДокументыДляРаспределения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляРаспределения.Район КАК Район,
	|		ДокументыДляРаспределения.Строение КАК Строение,
	|		энргНомераСтрокСтабильногоПериода.Помещение КАК Помещение,
	|		NULL КАК ОбъектРасчета,
	|		энргНомераСтрокСтабильногоПериода.Услуга КАК Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНомераСтрокСтабильногоПериода КАК энргНомераСтрокСтабильногоПериода
	|			ПО ДокументыДляРаспределения.Организация = энргНомераСтрокСтабильногоПериода.Организация
	|				И ДокументыДляРаспределения.ПериодНачисления = энргНомераСтрокСтабильногоПериода.ПериодНачисления
	|				И ДокументыДляРаспределения.Район = энргНомераСтрокСтабильногоПериода.Район
	|				И ДокументыДляРаспределения.Строение = энргНомераСтрокСтабильногоПериода.Строение
	|				И (энргНомераСтрокСтабильногоПериода.Организация = &Организация)
	|				И (энргНомераСтрокСтабильногоПериода.ПериодНачисления = &ПериодНачисления)
	|				И (энргНомераСтрокСтабильногоПериода.Район = &Район)
	|				И (НЕ энргНомераСтрокСтабильногоПериода.ЧастныйСектор)
	|				И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументыДляРаспределения.Организация,
	|		ДокументыДляРаспределения.ПериодНачисления,
	|		ДокументыДляРаспределения.Район,
	|		ДокументыДляРаспределения.Строение,
	|		энргНомераСтрокСтабильногоПериода.Помещение,
	|		энргНомераСтрокСтабильногоПериода.Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ДокументыДляРаспределения.Организация,
	|		ДокументыДляРаспределения.ПериодНачисления,
	|		ДокументыДляРаспределения.Район,
	|		энргНомераСтрокСтабильногоПериода.МКД,
	|		энргНомераСтрокСтабильногоПериода.Договор,
	|		энргНомераСтрокСтабильногоПериода.ОбъектРасчета,
	|		энргНомераСтрокСтабильногоПериода.Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета,
	|		МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции)
	|	ИЗ
	|		ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК энргНомераСтрокСтабильногоПериода
	|			ПО ДокументыДляРаспределения.Организация = энргНомераСтрокСтабильногоПериода.Организация
	|				И ДокументыДляРаспределения.ПериодНачисления = энргНомераСтрокСтабильногоПериода.ПериодНачисления
	|				И ДокументыДляРаспределения.Район = энргНомераСтрокСтабильногоПериода.Район
	|				И (энргНомераСтрокСтабильногоПериода.Организация = &Организация)
	|				И (энргНомераСтрокСтабильногоПериода.ПериодНачисления = &ПериодНачисления)
	|				И (энргНомераСтрокСтабильногоПериода.Район = &Район)
	|				И (энргНомераСтрокСтабильногоПериода.МКД = &Строение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументыДляРаспределения.Организация,
	|		ДокументыДляРаспределения.ПериодНачисления,
	|		ДокументыДляРаспределения.Район,
	|		энргНомераСтрокСтабильногоПериода.Договор,
	|		энргНомераСтрокСтабильногоПериода.ОбъектРасчета,
	|		энргНомераСтрокСтабильногоПериода.Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета,
	|		энргНомераСтрокСтабильногоПериода.МКД) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеНомераСтрока.Организация КАК Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления КАК ПериодНачисления,
	|	ПоследниеНомераСтрока.Район КАК Район,
	|	ПоследниеНомераСтрока.Строение КАК Строение,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	энргСтабильныеПериоды.Абонент КАК Абонент,
	|	ПоследниеНомераСтрока.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.ПриборВведен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриборов,
	|	МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	МАКСИМУМ(энргСтабильныеПериоды.КоличествоЖильцов) КАК КоличествоЖильцов,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Абонент = энргСтабильныеПериоды.Поставщик
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьСобственнаяПоставка,
	|	МАКСИМУМ(энргСтабильныеПериоды.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	энргСтабильныеПериоды.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ АбонентыДляРаспределения
	|ИЗ
	|	ПоследниеНомераСтрока КАК ПоследниеНомераСтрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО ПоследниеНомераСтрока.Организация = энргСтабильныеПериоды.Организация
	|			И ПоследниеНомераСтрока.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|			И (энргСтабильныеПериоды.Строение = &Строение)
	|			И ПоследниеНомераСтрока.Район = энргСтабильныеПериоды.Район
	|			И ПоследниеНомераСтрока.Строение = энргСтабильныеПериоды.Строение
	|			И ПоследниеНомераСтрока.Помещение = энргСтабильныеПериоды.Помещение
	|			И ПоследниеНомераСтрока.Услуга = энргСтабильныеПериоды.Услуга
	|			И ПоследниеНомераСтрока.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|					ТОГДА энргСтабильныеПериоды.НомерПозиции = 0
	|				ИНАЧЕ ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			КОНЕЦ)
	|			И (энргСтабильныеПериоды.ЛСОткрыт)
	|			И (энргСтабильныеПериоды.УслугаПодключена)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ПоследниеНомераСтрока.Помещение = энргПомещения.Ссылка
	|			И (энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Помещение,
	|	энргСтабильныеПериоды.Абонент,
	|	ПоследниеНомераСтрока.Услуга,
	|	энргСтабильныеПериоды.Поставщик,
	|	энргСтабильныеПериоды.ЗначениеПлощади
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Договор,
	|	энргСтабильныеПериоды.ОбъектРасчета,
	|	ПоследниеНомераСтрока.Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.ПриборВведен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади),
	|	МАКСИМУМ(0),
	|	МАКСИМУМ(0),
	|	МАКСИМУМ(энргСтабильныеПериоды.ТарифнаяГруппа),
	|	&Поставщик
	|ИЗ
	|	ПоследниеНомераСтрока КАК ПоследниеНомераСтрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК энргСтабильныеПериоды
	|		ПО ПоследниеНомераСтрока.Организация = энргСтабильныеПериоды.Организация
	|			И ПоследниеНомераСтрока.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (энргСтабильныеПериоды.МКД = &Строение)
	|			И ПоследниеНомераСтрока.Район = энргСтабильныеПериоды.Район
	|			И ПоследниеНомераСтрока.Строение = энргСтабильныеПериоды.МКД
	|			И ПоследниеНомераСтрока.Помещение = энргСтабильныеПериоды.Договор
	|			И ПоследниеНомераСтрока.ОбъектРасчета = энргСтабильныеПериоды.ОбъектРасчета
	|			И ПоследниеНомераСтрока.Услуга = энргСтабильныеПериоды.Услуга
	|			И ПоследниеНомераСтрока.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|					ТОГДА энргСтабильныеПериоды.НомерПозиции = 0
	|				ИНАЧЕ ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			КОНЕЦ)
	|			И (энргСтабильныеПериоды.ДоговорЗаключен)
	|			И (энргСтабильныеПериоды.ОбъектРасчетаПодключен)
	|			И (энргСтабильныеПериоды.УслугаПодключена)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Договор,
	|	энргСтабильныеПериоды.ОбъектРасчета,
	|	ПоследниеНомераСтрока.Услуга,
	|	энргСтабильныеПериоды.ЗначениеПлощади
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеНомераСтрока.Организация КАК Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления КАК ПериодНачисления,
	|	ПоследниеНомераСтрока.Район КАК Район,
	|	ПоследниеНомераСтрока.Строение КАК Строение,
	|	энргПомещения.Родитель КАК ПомещениеРодитель,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	энргСтабильныеПериоды.Абонент КАК Абонент,
	|	ПоследниеНомераСтрока.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериоды.СпособРаспределенияОбъемаПомещения) КАК СпособРаспределенияОбъемаПомещения,
	|	МАКСИМУМ(энргСтабильныеПериоды.ФиксированныйОбъемПотребления) КАК ФиксированныйОбъемПотребления,
	|	МАКСИМУМ(энргСтабильныеПериоды.ДоляПотребленияЧислитель) КАК ДоляПотребленияЧислитель,
	|	МАКСИМУМ(энргСтабильныеПериоды.ДоляПотребленияЗнаменатель) КАК ДоляПотребленияЗнаменатель,
	|	МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	МАКСИМУМ(энргСтабильныеПериоды.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(энргСтабильныеПериоды.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	МАКСИМУМ(энргСтабильныеПериоды.Поставщик) КАК Поставщик
	|ПОМЕСТИТЬ АбонентыРазделенныеЛицевыеСчета
	|ИЗ
	|	ПоследниеНомераСтрока КАК ПоследниеНомераСтрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО ПоследниеНомераСтрока.Организация = энргСтабильныеПериоды.Организация
	|			И ПоследниеНомераСтрока.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|			И (энргСтабильныеПериоды.Строение = &Строение)
	|			И ПоследниеНомераСтрока.Район = энргСтабильныеПериоды.Район
	|			И ПоследниеНомераСтрока.Строение = энргСтабильныеПериоды.Строение
	|			И ПоследниеНомераСтрока.Помещение = энргСтабильныеПериоды.Помещение
	|			И ПоследниеНомераСтрока.Услуга = энргСтабильныеПериоды.Услуга
	|			И ПоследниеНомераСтрока.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|					ТОГДА энргСтабильныеПериоды.НомерПозиции = 0
	|				ИНАЧЕ ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			КОНЕЦ)
	|			И (энргСтабильныеПериоды.ЛСОткрыт)
	|			И (энргСтабильныеПериоды.УслугаПодключена)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ПоследниеНомераСтрока.Помещение = энргПомещения.Ссылка
	|			И (НЕ энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Помещение,
	|	энргПомещения.Родитель,
	|	энргСтабильныеПериоды.Абонент,
	|	ПоследниеНомераСтрока.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ВсегоАбонентов КАК ВсегоАбонентов,
	|	ВложенныйЗапрос.ВсегоСУстановелннымПриборомУчета КАК ВсегоСУстановелннымПриборомУчета,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|	ЕСТЬNULL(энргДокументыНачислений.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргРаспределениеМКД.ПустаяСсылка)) КАК ДокументРаспределения,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.ВидПлощадиМКД = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПлощадьМОПУказана,
	|	энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ
	|ПОМЕСТИТЬ ДанныеМКДПоУслугам
	|ИЗ
	|	(ВЫБРАТЬ
	|		АбонентыДляРаспределения.Организация КАК Организация,
	|		АбонентыДляРаспределения.ПериодНачисления КАК ПериодНачисления,
	|		АбонентыДляРаспределения.Район КАК Район,
	|		АбонентыДляРаспределения.Строение КАК Строение,
	|		АбонентыДляРаспределения.Услуга КАК Услуга,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АбонентыДляРаспределения.Помещение) КАК ВсегоАбонентов,
	|		СУММА(АбонентыДляРаспределения.КоличествоПриборов) КАК ВсегоСУстановелннымПриборомУчета,
	|		СУММА(АбонентыДляРаспределения.ЗначениеПлощади) КАК ВсегоПлощадьАбонентов,
	|		СУММА(АбонентыДляРаспределения.ПлощадьСобственнаяПоставка) КАК ВсегоПлощадьАбонентовСобственнаяПоставка
	|	ИЗ
	|		АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АбонентыДляРаспределения.Организация,
	|		АбонентыДляРаспределения.ПериодНачисления,
	|		АбонентыДляРаспределения.Район,
	|		АбонентыДляРаспределения.Строение,
	|		АбонентыДляРаспределения.Услуга) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|		ПО ВложенныйЗапрос.Организация = энргДокументыНачислений.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = энргДокументыНачислений.ПериодНачисления
	|			И ВложенныйЗапрос.Район = энргДокументыНачислений.Район
	|			И ВложенныйЗапрос.Строение = энргДокументыНачислений.МКД
	|			И (энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.РаспределениеМКД))
	|			И (энргДокументыНачислений.ПериодНачисления = &ПериодНачисления)
	|			И (энргДокументыНачислений.Организация = &Организация)
	|			И (энргДокументыНачислений.Район = &Район)
	|			И (энргДокументыНачислений.МКД = &Строение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.Организация КАК Организация,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.Район КАК Район,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.МКД КАК МКД,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.Услуга КАК Услуга,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.РаспределятьПолностью КАК РаспределятьПолностью
	|ПОМЕСТИТЬ ИсторияСоглашенийОРаспределенииСверхнормативногоОДН
	|ИЗ
	|	РегистрСведений.энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И МКД = &Строение
	|				И Район = &Район) КАК энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиМКДРаспределятьВспомогательныеДанные.Район КАК Район,
	|	УслугиМКДРаспределятьВспомогательныеДанные.МКД КАК Строение,
	|	УслугиМКДРаспределятьВспомогательныеДанные.Услуга КАК Услуга,
	|	ЕСТЬNULL(энргОбъемНачисленийМКДОбороты.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(энргОбъемНачисленийМКДОбороты.СпособНачисления, ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка)) КАК СпособНачисления,
	|	ЕСТЬNULL(энргОбъемНачисленийМКДОбороты.ОбъемУслугиОборот, 0) КАК ОбъемУслугиОборот,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ПлощадьМОП КАК ПлощадьМОП,
	|	ЕСТЬNULL(энргОбъемНачисленийМКДОбороты.ОбъемУслугиНормативОборот, 0) КАК ОбъемУслугиНормативОборот,
	|	ЕСТЬNULL(ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.РаспределятьПолностью, ЛОЖЬ) КАК РаспределятьПолностью,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ВидПлощади КАК ВидПлощади,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ЗначениеНорматива КАК ЗначениеНорматива,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ФормулаРасчетаНормативаПотребления КАК ФормулаРасчетаНорматива
	|ПОМЕСТИТЬ ОбъемыДляРаспределения
	|ИЗ
	|	УслугиМКДРаспределятьВспомогательныеДанные КАК УслугиМКДРаспределятьВспомогательныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачисленийМКД.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &Строение) КАК энргОбъемНачисленийМКДОбороты
	|		ПО (энргОбъемНачисленийМКДОбороты.Организация = УслугиМКДРаспределятьВспомогательныеДанные.Организация)
	|			И (энргОбъемНачисленийМКДОбороты.Район = УслугиМКДРаспределятьВспомогательныеДанные.Район)
	|			И (энргОбъемНачисленийМКДОбороты.МКД = УслугиМКДРаспределятьВспомогательныеДанные.МКД)
	|			И (энргОбъемНачисленийМКДОбороты.Услуга = УслугиМКДРаспределятьВспомогательныеДанные.Услуга)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсторияСоглашенийОРаспределенииСверхнормативногоОДН КАК ИсторияСоглашенийОРаспределенииСверхнормативногоОДН
	|		ПО УслугиМКДРаспределятьВспомогательныеДанные.Организация = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Организация
	|			И УслугиМКДРаспределятьВспомогательныеДанные.Район = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Район
	|			И УслугиМКДРаспределятьВспомогательныеДанные.МКД = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.МКД
	|			И УслугиМКДРаспределятьВспомогательныеДанные.Услуга = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Организация КАК Организация,
	|	энргОбъемНачисленийОбороты.Район КАК Район,
	|	энргОбъемНачисленийОбороты.Распределение КАК Распределение,
	|	энргОбъемНачисленийОбороты.Строение КАК Строение,
	|	энргОбъемНачисленийОбороты.Помещение КАК Помещение,
	|	энргОбъемНачисленийОбороты.Абонент КАК Абонент,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачисленийОбороты.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачисленийОбороты.Измеритель КАК Измеритель,
	|	энргОбъемНачисленийОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала КАК Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачисленийОбороты.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачисленийОбороты.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачисленийОбороты.Сумма КАК Сумма,
	|	энргОбъемНачисленийОбороты.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачисленийОбороты.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	энргОбъемНачисленийОбороты.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачисленийОбороты.КонецПериода КАК КонецПериода,
	|	энргОбъемНачисленийОбороты.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачисленийОбороты.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачисленийОбороты.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачисленийОбороты.КоличествоПрописанных КАК КоличествоПрописанных,
	|	0 КАК КоличествоЖильцов,
	|	энргОбъемНачисленийОбороты.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачисленийОбороты.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачисленийОбороты.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачисленийОбороты.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачисленийОбороты.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачисленийОбороты.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачисленийОбороты.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачисленийОбороты.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачисленийОбороты.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачисленийОбороты.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачисленийОбороты.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачисленийОбороты.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачисленийОбороты.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачисленийОбороты.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачисленийОбороты.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачисленийОбороты.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачисленийОбороты.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачисленийОбороты.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачисленийОбороты.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачисленийОбороты.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачисленийОбороты.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачисленийОбороты.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачисленийОбороты.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачисленийОбороты.ПомещениеРодитель КАК ПомещениеРодитель
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО (энргОбъемНачисленийОбороты.Период = &Период)
	|			И энргОбъемНачисленийОбороты.Регистратор = ДокументыНачислений.ДокументНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Организация,
	|	энргОбъемНачисленийОбороты.Район,
	|	энргОбъемНачисленийОбороты.Распределение,
	|	энргОбъемНачисленийОбороты.Строение,
	|	энргОбъемНачисленийОбороты.Помещение,
	|	ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка),
	|	энргОбъемНачисленийОбороты.Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление),
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка),
	|	энргОбъемНачисленийОбороты.ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона,
	|	0,
	|	энргОбъемНачисленийОбороты.Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления,
	|	энргОбъемНачисленийОбороты.ЧастныйСектор,
	|	энргОбъемНачисленийОбороты.СверхНорматива,
	|	0,
	|	энргОбъемНачисленийОбороты.ОбъемУслуги,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный,
	|	0,
	|	энргОбъемНачисленийОбороты.НачалоПериода,
	|	энргОбъемНачисленийОбороты.КонецПериода,
	|	энргОбъемНачисленийОбороты.НачальныеПоказания,
	|	энргОбъемНачисленийОбороты.КонечныеПоказания,
	|	энргОбъемНачисленийОбороты.КоличествоКомнат,
	|	0,
	|	энргОбъемНачисленийОбороты.КоличествоЖильцов,
	|	энргОбъемНачисленийОбороты.ЗначениеПлощади,
	|	энргОбъемНачисленийОбороты.НормаПотребления,
	|	энргОбъемНачисленийОбороты.КоэффициентПУ,
	|	энргОбъемНачисленийОбороты.РасчетПоФормуле,
	|	энргОбъемНачисленийОбороты.ВидБлагоустройства,
	|	энргОбъемНачисленийОбороты.ТарифнаяГруппа,
	|	энргОбъемНачисленийОбороты.ДатаПоверки,
	|	энргОбъемНачисленийОбороты.ОтключатьВНеполивнойСезон,
	|	энргОбъемНачисленийОбороты.ЗависимаяТочкаУчета,
	|	энргОбъемНачисленийОбороты.КоэффициентРасчета,
	|	энргОбъемНачисленийОбороты.ВидДифференцированности,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчета,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчетаДата,
	|	энргОбъемНачисленийОбороты.ПриборЗависимой,
	|	энргОбъемНачисленийОбороты.СписатьИзНормы,
	|	энргОбъемНачисленийОбороты.ПовыщающийКоэффициент,
	|	0,
	|	0,
	|	энргОбъемНачисленийОбороты.СниматьНачисленныйСредний,
	|	энргОбъемНачисленийОбороты.ПлощадьМОП,
	|	0,
	|	энргОбъемНачисленийОбороты.ПлощадьСобственнаяПоставка,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргПомещения.Пустаяссылка)
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО (энргОбъемНачисленийОбороты.Период = &Период)
	|			И энргОбъемНачисленийОбороты.Регистратор = ДокументыНачислений.ДокументНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачислений.Активность КАК Активность,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Распределение КАК Распределение,
	|	энргОбъемНачислений.Строение КАК Строение,
	|	энргОбъемНачислений.Помещение КАК Помещение,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачислений.Измеритель КАК Измеритель,
	|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачислений.Шкала КАК Шкала,
	|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачислений.Сумма КАК Сумма,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель
	|ПОМЕСТИТЬ ОбъемНачисленийПоПриборуУчетаКорректироватьИндивидуальныйОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Запись,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ Распределение
	|				И НЕ ЧастныйСектор
	|				И Строение = &Строение
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	|				И СпособНачисления В (ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам), ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему))
	|				И Услуга В
	|					(ВЫБРАТЬ
	|						энргВидыУслуг.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.энргВидыУслуг КАК энргВидыУслуг
	|					ГДЕ
	|						энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ)) КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		ПО энргОбъемНачисленийОбороты.Период = энргОбъемНачислений.Период
	|			И энргОбъемНачисленийОбороты.Регистратор = энргОбъемНачислений.Регистратор
	|			И энргОбъемНачисленийОбороты.НомерСтроки = энргОбъемНачислений.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Район КАК Район,
	|	энргОбъемНачисленийОбороты.Организация КАК Организация,
	|	энргОбъемНачисленийОбороты.Распределение КАК Распределение,
	|	бестОбъектыРасчета.МКД КАК Строение,
	|	энргОбъемНачисленийОбороты.ОбъектРасчета КАК Абонент,
	|	энргОбъемНачисленийОбороты.Договор КАК Помещение,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления КАК СпособНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользованияТУ,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.Пустаяссылка) КАК Измеритель,
	|	энргОбъемНачисленийОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала КАК Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	1 КАК ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ЛОЖЬ КАК ЧастныйСектор,
	|	ЛОЖЬ КАК СверхНорматива,
	|	0 КАК Сумма,
	|	энргОбъемНачисленийОбороты.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	0 КАК СуммаПоПовышенномуКоэффициенту,
	|	энргОбъемНачисленийОбороты.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачисленийОбороты.КонецПериода КАК КонецПериода,
	|	энргОбъемНачисленийОбороты.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачисленийОбороты.КонечныеПоказания КАК КонечныеПоказания,
	|	0 КАК КоличествоКомнат,
	|	0 КАК КоличествоПрописанных,
	|	0 КАК КоличествоЖильцов,
	|	энргОбъемНачисленийОбороты.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачисленийОбороты.НормаПотребления КАК НормаПотребления,
	|	0 КАК КоэффициентПУ,
	|	энргОбъемНачисленийОбороты.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка) КАК ВидБлагоустройства,
	|	ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка) КАК ТарифнаяГруппа,
	|	энргОбъемНачисленийОбороты.ДатаПоверки КАК ДатаПоверки,
	|	ЛОЖЬ КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачисленийОбороты.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачисленийОбороты.КоэффициентРасчета КАК КоэффициентРасчета,
	|	энргОбъемНачисленийОбороты.ВидДифференцированности КАК ВидДифференцированности,
	|	"""" КАК ОснованиеПерерасчета,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ОснованиеПерерасчетаДата,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка) КАК ПриборЗависимой,
	|	ЛОЖЬ КАК СписатьИзНормы,
	|	энргОбъемНачисленийОбороты.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	0 КАК КоличествоСобственников,
	|	0 КАК КоличествоПроживающих,
	|	ЛОЖЬ КАК СниматьНачисленныйСредний,
	|	0 КАК ПлощадьМОП,
	|	0 КАК ПлощадьАбонентов,
	|	0 КАК ПлощадьСобственнаяПоставка,
	|	0 КАК КоэффициентРаспределенияОстатка,
	|	0 КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачисленийОбороты.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачисленийОбороты.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка) КАК ПомещениеРодитель
	|ПОМЕСТИТЬ ОбъемНачисленийНП
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО энргОбъемНачисленийОбороты.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|			И (бестОбъектыРасчета.МКД = &Строение)
	|			И (энргОбъемНачисленийОбороты.Период = &Период)
	|			И (энргОбъемНачисленийОбороты.Организация = &Организация)
	|			И (энргОбъемНачисленийОбороты.Район = &Район)
	|			И (НЕ энргОбъемНачисленийОбороты.Распределение)";
	
	Если Строение = Неопределено Тогда		
		Текст 						= СтрЗаменить(Текст,"И (энргРаспределениеМКД.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И энргОтложенныеДвиженияДокументов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &Строение)","");		
		Текст 						= СтрЗаменить(Текст,"И Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И (бестОбъектыРасчета.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И МКД = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргДокументыНачислений.МКД = &Строение)","");		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляРаспределения(Строение)
	Текст 							= 
	"ВЫБРАТЬ
	|	ЗначенияТекущихТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТекущихТарифов.Услуга КАК Услуга,
	|	ЗначенияТекущихТарифов.Поставщик КАК Поставщик,
	|	ЗначенияТекущихТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЗначенияТекущихТарифов.Значение КАК Значение,
	|	ЗначенияТекущихТарифов.СтавкаНДС КАК СтавкаНДС,
	|	ЗначенияТекущихТарифов.НДСВнутри КАК НДСВнутри
	|ИЗ
	|	ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|ГДЕ
	|	(ЗначенияТекущихТарифов.ГруппаПотребителей, ЗначенияТекущихТарифов.Услуга, ЗначенияТекущихТарифов.Поставщик) В
	|			(ВЫБРАТЬ
	|				АбонентыДляРаспределения.ТарифнаяГруппа,
	|				АбонентыДляРаспределения.Услуга,
	|				АбонентыДляРаспределения.Поставщик
	|			ИЗ
	|				АбонентыДляРаспределения КАК АбонентыДляРаспределения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ВсегоАбонентов КАК ВсегоАбонентов,
	|	ВложенныйЗапрос.ПлощадьМОП КАК ПлощадьМОП,
	|	ВложенныйЗапрос.ВсегоСУстановелннымПриборомУчета КАК ВсегоСУстановелннымПриборомУчета,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|	ВложенныйЗапрос.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|	ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	ВложенныйЗапрос.ОбъемУслугиНорматив КАК ОбъемУслугиНорматив,
	|	ВложенныйЗапрос.РаспределятьПолностью КАК РаспределятьПолностью,
	|	ВложенныйЗапрос.НачисленаТолькоНорма КАК НачисленаТолькоНорма,
	|	ВложенныйЗапрос.ДокументРаспределения КАК ДокументРаспределения,
	|	ВложенныйЗапрос.ЕстьНачислениеПоПриборам КАК ЕстьНачислениеПоПриборам,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ПлощадьМОПУказана КАК ПлощадьМОПУказана,
	|	ВложенныйЗапрос.ВидПлощади КАК ВидПлощади,
	|	ВложенныйЗапрос.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ВложенныйЗапрос.ЗначениеНорматива КАК ЗначениеНорматива,
	|	ВложенныйЗапрос.ФормулаРасчетаНорматива КАК ФормулаРасчетаНорматива,
	|	ВложенныйЗапрос.НеРаспределятьСверхнорматив КАК НеРаспределятьСверхнорматив
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеМКДПоУслугам.Строение КАК Строение,
	|		ДанныеМКДПоУслугам.Услуга КАК Услуга,
	|		ДанныеМКДПоУслугам.ВсегоАбонентов КАК ВсегоАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоСУстановелннымПриборомУчета КАК ВсегоСУстановелннымПриборомУчета,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|		ДанныеМКДПоУслугам.ПлощадьМОПУказана КАК ПлощадьМОПУказана,
	|		ДанныеМКДПоУслугам.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|		СУММА(ОбъемыДляРаспределения.ОбъемУслугиОборот) КАК ОбъемУслуги,
	|		СУММА(ОбъемыДляРаспределения.ОбъемУслугиНормативОборот) КАК ОбъемУслугиНорматив,
	|		МАКСИМУМ(ОбъемыДляРаспределения.РаспределятьПолностью) КАК РаспределятьПолностью,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ОбъемыДляРаспределения.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК НачисленаТолькоНорма,
	|		МАКСИМУМ(ОбъемыДляРаспределения.ПлощадьМОП) КАК ПлощадьМОП,
	|		ДанныеМКДПоУслугам.ДокументРаспределения КАК ДокументРаспределения,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ОбъемыДляРаспределения.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ЕстьНачислениеПоПриборам,
	|		ОбъемыДляРаспределения.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ОбъемыДляРаспределения.СпособНачисления КАК СпособНачисления,
	|		ОбъемыДляРаспределения.ВидПлощади КАК ВидПлощади,
	|		ОбъемыДляРаспределения.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|		ВЫРАЗИТЬ(ОбъемыДляРаспределения.ФормулаРасчетаНорматива КАК СТРОКА(1000)) КАК ФормулаРасчетаНорматива,
	|		ОбъемыДляРаспределения.ЗначениеНорматива КАК ЗначениеНорматива,
	|		ВЫРАЗИТЬ(ДанныеМКДПоУслугам.Услуга КАК Справочник.энргВидыУслуг).НормативДляИндивидуальных
	|			И ВЫРАЗИТЬ(ДанныеМКДПоУслугам.Услуга КАК Справочник.энргВидыУслуг).КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК НеРаспределятьСверхнорматив
	|	ИЗ
	|		ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыДляРаспределения КАК ОбъемыДляРаспределения
	|			ПО ДанныеМКДПоУслугам.Район = ОбъемыДляРаспределения.Район
	|				И ДанныеМКДПоУслугам.Строение = ОбъемыДляРаспределения.Строение
	|				И ДанныеМКДПоУслугам.Услуга = ОбъемыДляРаспределения.Услуга
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеМКДПоУслугам.Строение,
	|		ДанныеМКДПоУслугам.Услуга,
	|		ДанныеМКДПоУслугам.ВсегоАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоСУстановелннымПриборомУчета,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентовСобственнаяПоставка,
	|		ДанныеМКДПоУслугам.КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|		ДанныеМКДПоУслугам.ПлощадьМОПУказана,
	|		ОбъемыДляРаспределения.ТарифнаяЗона,
	|		ОбъемыДляРаспределения.СпособНачисления,
	|		ДанныеМКДПоУслугам.ДокументРаспределения,
	|		ОбъемыДляРаспределения.ВидПлощади,
	|		ОбъемыДляРаспределения.ЗависитОтУслуги,
	|		ВЫРАЗИТЬ(ОбъемыДляРаспределения.ФормулаРасчетаНорматива КАК СТРОКА(1000)),
	|		ОбъемыДляРаспределения.ЗначениеНорматива) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АбонентыДляРаспределения.Организация КАК Организация,
	|	АбонентыДляРаспределения.Район КАК Район,
	|	АбонентыДляРаспределения.Строение КАК Строение,
	|	АбонентыДляРаспределения.Помещение КАК Помещение,
	|	АбонентыДляРаспределения.Абонент КАК Абонент,
	|	АбонентыДляРаспределения.Услуга КАК Услуга,
	|	АбонентыДляРаспределения.ЗначениеПлощади КАК ЗначениеПлощадиДляРаспределения,
	|	АбонентыДляРаспределения.ТарифнаяГруппа КАК ТарифнаяГруппаДляРаспределения,
	|	АбонентыДляРаспределения.Поставщик КАК ПоставщикДляРаспределения,
	|	АбонентыДляРаспределения.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	ОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	ОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ОбъемНачислений.Измеритель КАК Измеритель,
	|	ОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемНачислений.Шкала КАК Шкала,
	|	ОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ОбъемНачислений.Поставщик КАК Поставщик,
	|	ОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	ОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	ОбъемНачислений.Сумма КАК Сумма,
	|	ОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	ОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ОбъемНачислений.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	ОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	ОбъемНачислений.КонецПериода КАК КонецПериода,
	|	ОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	ОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	ОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	ОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	ОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	ОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	ОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ОбъемНачислений.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	ОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	ОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	ОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	ОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	ОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	ОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	ОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	ОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	ОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ВЫБОР
	|		КОГДА ОбъемНачислений.Абонент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИндивидуальныеНачисления,
	|	ЛОЖЬ КАК НП,
	|	ЛОЖЬ КАК ПомещениеСРазделенными,
	|	АбонентыДляРаспределения.Помещение КАК ПомещениеРодитель
	|ИЗ
	|	АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачислений КАК ОбъемНачислений
	|		ПО АбонентыДляРаспределения.Район = ОбъемНачислений.Район
	|			И АбонентыДляРаспределения.Строение = ОбъемНачислений.Строение
	|			И АбонентыДляРаспределения.Услуга = ОбъемНачислений.Услуга
	|			И АбонентыДляРаспределения.Помещение = ОбъемНачислений.Помещение
	|ГДЕ
	|	АбонентыДляРаспределения.Помещение ССЫЛКА Справочник.энргПомещения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АбонентыДляРаспределения.Организация,
	|	АбонентыДляРаспределения.Район,
	|	АбонентыДляРаспределения.Строение,
	|	АбонентыДляРаспределения.Помещение,
	|	АбонентыДляРаспределения.Абонент,
	|	АбонентыДляРаспределения.Услуга,
	|	АбонентыДляРаспределения.ЗначениеПлощади,
	|	АбонентыДляРаспределения.ТарифнаяГруппа,
	|	АбонентыДляРаспределения.Поставщик,
	|	0,
	|	ОбъемНачислений.ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления,
	|	ОбъемНачислений.СпособНачисления,
	|	ОбъемНачислений.НаправлениеИспользованияТУ,
	|	ОбъемНачислений.Измеритель,
	|	ОбъемНачислений.ПриборУчета,
	|	ОбъемНачислений.Шкала,
	|	ОбъемНачислений.ТарифнаяЗона,
	|	ОбъемНачислений.ЗначениеТарифа,
	|	ОбъемНачислений.Поставщик,
	|	ОбъемНачислений.ПериодРасчета,
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.ЧастныйСектор,
	|	ОбъемНачислений.СверхНорматива,
	|	ОбъемНачислений.Сумма,
	|	ОбъемНачислений.ОбъемУслуги,
	|	ОбъемНачислений.ОбъемУслугиПотребленный,
	|	ОбъемНачислений.СуммаПоПовышенномуКоэффициенту,
	|	ОбъемНачислений.НачалоПериода,
	|	ОбъемНачислений.КонецПериода,
	|	ОбъемНачислений.НачальныеПоказания,
	|	ОбъемНачислений.КонечныеПоказания,
	|	ОбъемНачислений.КоличествоКомнат,
	|	ОбъемНачислений.КоличествоПрописанных,
	|	ОбъемНачислений.ЗначениеПлощади,
	|	ОбъемНачислений.НормаПотребления,
	|	ОбъемНачислений.КоэффициентПУ,
	|	ОбъемНачислений.РасчетПоФормуле,
	|	ОбъемНачислений.ВидБлагоустройства,
	|	ОбъемНачислений.ТарифнаяГруппа,
	|	ОбъемНачислений.ДатаПоверки,
	|	ОбъемНачислений.ОтключатьВНеполивнойСезон,
	|	ОбъемНачислений.ЗависимаяТочкаУчета,
	|	ОбъемНачислений.КоэффициентРасчета,
	|	ОбъемНачислений.ВидДифференцированности,
	|	ОбъемНачислений.ОснованиеПерерасчета,
	|	ОбъемНачислений.ОснованиеПерерасчетаДата,
	|	ОбъемНачислений.ПриборЗависимой,
	|	ОбъемНачислений.СписатьИзНормы,
	|	ОбъемНачислений.ПовыщающийКоэффициент,
	|	ОбъемНачислений.КоличествоСобственников,
	|	ОбъемНачислений.КоличествоПроживающих,
	|	ОбъемНачислений.СниматьНачисленныйСредний,
	|	ОбъемНачислений.ПлощадьМОП,
	|	ОбъемНачислений.ПлощадьАбонентов,
	|	ОбъемНачислений.ПлощадьСобственнаяПоставка,
	|	ОбъемНачислений.КоэффициентРаспределенияОстатка,
	|	ОбъемНачислений.ОбъемУслугиСоцНорма,
	|	ОбъемНачислений.СоставнаяУслуга,
	|	ОбъемНачислений.НеПрименятьСезонность,
	|	ВЫБОР
	|		КОГДА ОбъемНачислений.Абонент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	АбонентыДляРаспределения.Помещение
	|ИЗ
	|	АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийНП КАК ОбъемНачислений
	|		ПО АбонентыДляРаспределения.Район = ОбъемНачислений.Район
	|			И АбонентыДляРаспределения.Строение = ОбъемНачислений.Строение
	|			И АбонентыДляРаспределения.Услуга = ОбъемНачислений.Услуга
	|			И АбонентыДляРаспределения.Абонент = ОбъемНачислений.Абонент
	|			И АбонентыДляРаспределения.Помещение = ОбъемНачислений.Помещение
	|ГДЕ
	|	АбонентыДляРаспределения.Абонент ССЫЛКА Справочник.бестОбъектыРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АбонентыРазделенныеЛицевыеСчета.Организация,
	|	АбонентыРазделенныеЛицевыеСчета.Район,
	|	АбонентыРазделенныеЛицевыеСчета.Строение,
	|	АбонентыРазделенныеЛицевыеСчета.Помещение,
	|	АбонентыРазделенныеЛицевыеСчета.Абонент,
	|	АбонентыРазделенныеЛицевыеСчета.Услуга,
	|	АбонентыРазделенныеЛицевыеСчета.ЗначениеПлощади,
	|	АбонентыРазделенныеЛицевыеСчета.ТарифнаяГруппа,
	|	АбонентыРазделенныеЛицевыеСчета.Поставщик,
	|	0,
	|	ОбъемНачислений.ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления,
	|	ОбъемНачислений.СпособНачисления,
	|	ОбъемНачислений.НаправлениеИспользованияТУ,
	|	ОбъемНачислений.Измеритель,
	|	ОбъемНачислений.ПриборУчета,
	|	ОбъемНачислений.Шкала,
	|	ОбъемНачислений.ТарифнаяЗона,
	|	ОбъемНачислений.ЗначениеТарифа,
	|	ОбъемНачислений.Поставщик,
	|	ОбъемНачислений.ПериодРасчета,
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.ЧастныйСектор,
	|	ОбъемНачислений.СверхНорматива,
	|	ОбъемНачислений.Сумма,
	|	ОбъемНачислений.ОбъемУслуги,
	|	ОбъемНачислений.ОбъемУслугиПотребленный,
	|	ОбъемНачислений.СуммаПоПовышенномуКоэффициенту,
	|	ОбъемНачислений.НачалоПериода,
	|	ОбъемНачислений.КонецПериода,
	|	ОбъемНачислений.НачальныеПоказания,
	|	ОбъемНачислений.КонечныеПоказания,
	|	ОбъемНачислений.КоличествоКомнат,
	|	ОбъемНачислений.КоличествоПрописанных,
	|	ОбъемНачислений.ЗначениеПлощади,
	|	ОбъемНачислений.НормаПотребления,
	|	ОбъемНачислений.КоэффициентПУ,
	|	ОбъемНачислений.РасчетПоФормуле,
	|	ОбъемНачислений.ВидБлагоустройства,
	|	ОбъемНачислений.ТарифнаяГруппа,
	|	ОбъемНачислений.ДатаПоверки,
	|	ОбъемНачислений.ОтключатьВНеполивнойСезон,
	|	ОбъемНачислений.ЗависимаяТочкаУчета,
	|	ОбъемНачислений.КоэффициентРасчета,
	|	ОбъемНачислений.ВидДифференцированности,
	|	ОбъемНачислений.ОснованиеПерерасчета,
	|	ОбъемНачислений.ОснованиеПерерасчетаДата,
	|	ОбъемНачислений.ПриборЗависимой,
	|	ОбъемНачислений.СписатьИзНормы,
	|	ОбъемНачислений.ПовыщающийКоэффициент,
	|	ОбъемНачислений.КоличествоСобственников,
	|	ОбъемНачислений.КоличествоПроживающих,
	|	ОбъемНачислений.СниматьНачисленныйСредний,
	|	ОбъемНачислений.ПлощадьМОП,
	|	ОбъемНачислений.ПлощадьАбонентов,
	|	ОбъемНачислений.ПлощадьСобственнаяПоставка,
	|	ОбъемНачислений.КоэффициентРаспределенияОстатка,
	|	ОбъемНачислений.ОбъемУслугиСоцНорма,
	|	ОбъемНачислений.СоставнаяУслуга,
	|	ОбъемНачислений.НеПрименятьСезонность,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	АбонентыРазделенныеЛицевыеСчета.ПомещениеРодитель
	|ИЗ
	|	АбонентыРазделенныеЛицевыеСчета КАК АбонентыРазделенныеЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемНачислений КАК ОбъемНачислений
	|		ПО АбонентыРазделенныеЛицевыеСчета.Район = ОбъемНачислений.Район
	|			И АбонентыРазделенныеЛицевыеСчета.Строение = ОбъемНачислений.Строение
	|			И АбонентыРазделенныеЛицевыеСчета.Услуга = ОбъемНачислений.Услуга
	|			И АбонентыРазделенныеЛицевыеСчета.Помещение = ОбъемНачислений.Помещение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Строение,
	|	Услуга,
	|	Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеМКДПоУслугам.Организация КАК Организация,
	|	ДанныеМКДПоУслугам.Район КАК Район,
	|	ДанныеМКДПоУслугам.Строение КАК Строение,
	|	ДанныеМКДПоУслугам.Услуга КАК Услуга,
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачислений.Активность КАК Активность,
	|	энргОбъемНачислений.Распределение КАК Распределение,
	|	энргОбъемНачислений.Помещение КАК Помещение,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачислений.Измеритель КАК Измеритель,
	|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачислений.Шкала КАК Шкала,
	|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачислений.Сумма КАК Сумма,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель
	|ИЗ
	|	ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийПоПриборуУчетаКорректироватьИндивидуальныйОбъем КАК энргОбъемНачислений
	|		ПО ДанныеМКДПоУслугам.Организация = энргОбъемНачислений.Организация
	|			И ДанныеМКДПоУслугам.Район = энргОбъемНачислений.Район
	|			И ДанныеМКДПоУслугам.Строение = энргОбъемНачислений.Строение
	|			И ДанныеМКДПоУслугам.Услуга = энргОбъемНачислений.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Строение,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазличныеМКД.Организация КАК Организация,
	|	РазличныеМКД.ПериодНачисления КАК ПериодНачисления,
	|	РазличныеМКД.Район КАК Район,
	|	РазличныеМКД.Строение КАК Строение,
	|	АбонентыРазделенныеЛицевыеСчета.ПомещениеРодитель КАК ПомещениеРодитель,
	|	АбонентыРазделенныеЛицевыеСчета.Помещение КАК Помещение,
	|	АбонентыРазделенныеЛицевыеСчета.Абонент КАК Абонент,
	|	АбонентыРазделенныеЛицевыеСчета.Услуга КАК Услуга,
	|	АбонентыРазделенныеЛицевыеСчета.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	АбонентыРазделенныеЛицевыеСчета.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	АбонентыРазделенныеЛицевыеСчета.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	АбонентыРазделенныеЛицевыеСчета.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	АбонентыРазделенныеЛицевыеСчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	АбонентыРазделенныеЛицевыеСчета.КоличествоПроживающих КАК КоличествоПроживающих,
	|	АбонентыРазделенныеЛицевыеСчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	АбонентыРазделенныеЛицевыеСчета.Поставщик КАК Поставщик
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеМКДПоУслугам.Организация КАК Организация,
	|		ДанныеМКДПоУслугам.ПериодНачисления КАК ПериодНачисления,
	|		ДанныеМКДПоУслугам.Район КАК Район,
	|		ДанныеМКДПоУслугам.Строение КАК Строение
	|	ИЗ
	|		ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам) КАК РазличныеМКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ АбонентыРазделенныеЛицевыеСчета КАК АбонентыРазделенныеЛицевыеСчета
	|		ПО РазличныеМКД.Организация = АбонентыРазделенныеЛицевыеСчета.Организация
	|			И РазличныеМКД.ПериодНачисления = АбонентыРазделенныеЛицевыеСчета.ПериодНачисления
	|			И РазличныеМКД.Район = АбонентыРазделенныеЛицевыеСчета.Район
	|			И РазличныеМКД.Строение = АбонентыРазделенныеЛицевыеСчета.Строение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Строение,
	|	ПомещениеРодитель,
	|	Помещение";
		
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Начислить_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаИндивидуальныеНачисления(Организация,ПериодНачисления,Район,Строение,Помещение,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде)
	МВТ  = Новый МенеджерВременныхТаблиц;
	ВспомогательныеДанныеНачисления(МВТ,Организация, ПериодНачисления,Район,Строение,Помещение,НачалоПериодаРасчета,КонецПериодаРасчета,ПериодНовогоТарифа,ДнейВПериоде);
	ПолучитьСтабильныеПериоды(МВТ,Ложь);
	ПолучитьДанныеДляРасчета(МВТ,ЛОЖЬ,Ложь,"энргНачисление");
	Возврат РассчитатьИндивидуальныйОбъемПотребления(МВТ);
КонецФункции

Процедура ОбработатьРезультатЗапросаНачислений(РезультатЗапроса, Набор, НаборОбъемПомещений, ЗаписыватьНаборыЗаписей, Помещение = Неопределено)
	
	Перем ТекПериодНачисления, ТекОрганизация, ТекРайон, ТекСтроение,ТекМКД,ТекПомещениеРодитель,ТекПомещение,ТекТочкаУчета, ТекНачалоПериода, ТекЗавершениеОП,
	ТекКонецПериода, ДокументОбъект,ДокументСсылка, СтрокиНабораДоЗаписи, НаборВыполненные;
	
	Ошибки 									= "";
	Выборка  								= РезультатЗапроса.выбрать();
	
	ТекЧастныйСектор						= Ложь;	
	НачисленияПоУслугам 					= Новый Соответствие;
	НачисленияПоУслугамПомещения 			= Новый Соответствие;
	ПлощадиПомещенийПоУслугам 				= Новый Соответствие;
	ЗамещатьНаборВыполненные 				= Истина;
	
	ПересчитатьСтроки 						= Новый Массив;
	ПересчитатьСтрокиПоПлощади 				= Новый Массив;
	ПересчитатьСтрокиПоФормуле 				= Новый Соответствие;
	
	Пока Выборка.следующий() цикл
				
		Если НЕ ТекПериодНачисления = Выборка.ПериодНачисления
			ИЛИ НЕ ТекЧастныйСектор = Выборка.ЧастныйСектор
			ИЛИ НЕ ТекСтроение = Выборка.Строение
			ИЛИ НЕ ТекПомещение = Выборка.Помещение
			ИЛИ НЕ ТекТочкаУчета = Выборка.ТочкаУчета
			ИЛИ НЕ ТекНачалоПериода = Выборка.НачалоПериода
			ИЛИ НЕ ТекКонецПериода = Выборка.КонецПериода Тогда
			
			НачисленияПоУслугам 			= Новый Соответствие;
			ПараметрыФормулы 				= Новый Соответствие;
		КонецЕсли;		
		
		Если НЕ ТекПомещениеРодитель = Выборка.ПомещениеРодитель Тогда
			ПересчитатьСтрокиНачисление(Набор, НачисленияПоУслугамПомещения, ПересчитатьСтроки, ПересчитатьСтрокиПоПлощади, ПлощадиПомещенийПоУслугам, ТекПомещениеРодитель);
			ПересчитатьСтроки 				= Новый Массив;
			ПересчитатьСтрокиПоПлощади 		= Новый Массив;
			ПлощадиПомещенийПоУслугам 		= Новый Соответствие;
			НачисленияПоУслугамПомещения 	= Новый Соответствие;
		КонецЕсли;
		 		
		Если НЕ ТекМКД = Выборка.МКД И ЗаписыватьНаборыЗаписей Тогда
			ТекЗавершениеОП = Выборка.КонецПериода;
			Если НЕ ТекМКД = Неопределено Тогда					
				ЗаписатьНаборыЗаписейНачисление(ДокументОбъект, ЗамещатьНаборВыполненные, ТекЗавершениеОП, Набор, НаборВыполненные, НаборОбъемПомещений, ТекОрганизация, Ошибки, ТекПериодНачисления, ТекРайон, ТекМКД, ТекЧастныйСектор);					
			КонецЕсли;
			ДокументОбъект  				= Неопределено;
			НаборВыполненные 				= Неопределено;
			ЗамещатьНаборВыполненные 		= Истина;
			ПрочитатьНаборыЗаписейНачисление(Выборка, ДокументОбъект, Помещение, ЗамещатьНаборВыполненные, ТекЗавершениеОП, Набор, НаборОбъемПомещений, НаборВыполненные);
		КонецЕсли; 				
		
		ЗаполнитьНаборыЗаписейНачисление(Выборка, ДокументСсылка, Набор, НаборОбъемПомещений, НачисленияПоУслугам, НачисленияПоУслугамПомещения, ПересчитатьСтроки, ПересчитатьСтрокиПоПлощади, ПлощадиПомещенийПоУслугам, ПересчитатьСтрокиПоФормуле);
		
		ТекОрганизация 						= Выборка.Организация;
		ТекПериодНачисления 				= Выборка.ПериодНачисления;
		ТекРайон 							= Выборка.Район;
		ТекМКД 								= Выборка.МКД;
		ТекЧастныйСектор					= Выборка.ЧастныйСектор;
		ТекСтроение							= Выборка.Строение;
		ТекПомещениеРодитель 				= Выборка.ПомещениеРодитель;
		ТекПомещение						= Выборка.Помещение;
		ТекТочкаУчета						= Выборка.ТочкаУчета;
		ТекНачалоПериода					= Выборка.НачалоПериода;
		ТекКонецПериода 					= Выборка.КонецПериода;
		ТекЗавершениеОП 					= Выборка.ЗавершениеОП;
	КонецЦикла;	
	
	ПересчитатьСтрокиНачисление(Набор, НачисленияПоУслугамПомещения, ПересчитатьСтроки, ПересчитатьСтрокиПоПлощади, ПлощадиПомещенийПоУслугам, ТекПомещениеРодитель);
	ПересчитатьСтрокиПоФормуле(Набор, НачисленияПоУслугамПомещения, ПересчитатьСтрокиПоФормуле);
	
	Если ЗаписыватьНаборыЗаписей И НЕ Набор = Неопределено и Набор.Количество() > 0 Тогда
		ЗаписатьНаборыЗаписейНачисление(ДокументОбъект, ЗамещатьНаборВыполненные, ТекЗавершениеОП, Набор, НаборВыполненные, НаборОбъемПомещений, ТекОрганизация, Ошибки, ТекПериодНачисления, ТекРайон, ТекМКД, ТекЧастныйСектор);	
	КонецЕсли;
	
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСтрокиНачисление(Набор, НачисленияПоУслугамПомещения, ПересчитатьСтроки, ПересчитатьСтрокиПоПлощади, ПлощадиПомещенийПоУслугам, ТекПомещениеРодитель)
		
	Если ПересчитатьСтрокиПоПлощади.Количество() > 0 Тогда
		Для Сч = 0 По ПересчитатьСтрокиПоПлощади.ВГраница() Цикл
			СтрокНабора 								= Набор.Получить(ПересчитатьСтрокиПоПлощади[Сч]);
			Если НЕ ПлощадиПомещенийПоУслугам[СтрокНабора.Услуга][СтрокНабора.НачалоПериода].Площадь = 0 Тогда
				СтрокНабора.ОбъемУслуги 				= (НачисленияПоУслугамПомещения[СтрокНабора.Услуга][СтрокНабора.ТарифнаяЗона].ОбъемУслуги * СтрокНабора.ЗначениеПлощади / ПлощадиПомещенийПоУслугам[СтрокНабора.Услуга][СтрокНабора.НачалоПериода].Площадь);
				СтрокНабора.ОбъемУслугиПотребленный		= (НачисленияПоУслугамПомещения[СтрокНабора.Услуга][СтрокНабора.ТарифнаяЗона].ОбъемУслугиПотребленный * СтрокНабора.ЗначениеПлощади / ПлощадиПомещенийПоУслугам[СтрокНабора.Услуга][СтрокНабора.НачалоПериода].Площадь);
			Иначе
				СтрокНабора.ОбъемУслуги 				= 0;
				СтрокНабора.ОбъемУслугиПотребленный 	= 0;
			КонецЕсли;					
			СтрокНабора.Сумма 							= СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа;
			УстановитьСуммуПоПовышенномуКоэффициенту(СтрокНабора);	
		КонецЦикла;				
	КонецЕсли;
	
	Если ПересчитатьСтроки.Количество() > 0 Тогда
		Для Сч = 0 По ПересчитатьСтроки.ВГраница() Цикл
			СтрокНабора 								= Набор.Получить(ПересчитатьСтроки[Сч]);
			СтрокНабора.ОбъемУслуги 					= (НачисленияПоУслугамПомещения[СтрокНабора.Услуга][СтрокНабора.ТарифнаяЗона].ОбъемУслуги - НачисленияПоУслугамПомещения[СтрокНабора.Услуга][СтрокНабора.ТарифнаяЗона].ОбъемУслугиОстаток) * СтрокНабора.КоэффициентРаспределенияОстатка;
			СтрокНабора.ОбъемУслугиПотребленный			= (НачисленияПоУслугамПомещения[СтрокНабора.Услуга][СтрокНабора.ТарифнаяЗона].ОбъемУслугиПотребленный - НачисленияПоУслугамПомещения[СтрокНабора.Услуга][СтрокНабора.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток)* СтрокНабора.КоэффициентРаспределенияОстатка;
			СтрокНабора.Сумма 							= СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа;
			УстановитьСуммуПоПовышенномуКоэффициенту(СтрокНабора);	
		КонецЦикла;				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСтрокиПоФормуле(Набор, НачисленияПоУслугамПомещения, ПересчитатьСтрокиПоФормуле)
	
	СпособПоФормуле 							= Перечисления.энргСпособНачислений.ПоФормуламРасчета;
	
	Для Каждого СтрокаПоФормуле Из ПересчитатьСтрокиПоФормуле Цикл
		СтрокаНабора 							= Набор[СтрокаПоФормуле.Значение.ИндексСтроки];
		СтрокаНабора.СпособНачисления 			= СпособПоФормуле;
		ОбъемУслуги 							= 0;
		ОбъемУслугиПотребленный 				= 0;
		ПараметрыФормулы 						= СтрокаПоФормуле.Значение.ПараметрыФормулы;
		Для Каждого ПараметрФормулы Из ПараметрыФормулы Цикл
			ОбъемУслуги 						= ОбъемУслуги + ПараметрФормулы.ОбъемУслуги * ПараметрФормулы.КоэффициентФормула;
			ОбъемУслугиПотребленный 			= ОбъемУслугиПотребленный + ПараметрФормулы.ОбъемУслугиПотребленный * ПараметрФормулы.КоэффициентФормула;
		КонецЦикла;
		СтрокаНабора.ОбъемУслуги				= ОбъемУслуги;
		СтрокаНабора.ОбъемУслугиПотребленный	= ОбъемУслугиПотребленный;
		СтрокаНабора.Сумма 						= СтрокаНабора.ЗначениеТарифа * СтрокаНабора.ОбъемУслуги; 
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьНаборыЗаписейНачисление(Выборка, ДокументСсылка, Набор, НаборОбъемПомещений, НачисленияПоУслугам, НачисленияПоУслугамПомещения, ПересчитатьСтроки, ПересчитатьСтрокиПоПлощади, ПлощадиПомещенийПоУслугам, ПересчитатьСтрокиПоФормуле)
	
	ВидНачисления 											= Перечисления.энргВидыНачислений.Начисление;	
	ЕстьСумма 												= Истина;
	ЕстьНачисления 											= Истина;
	КлючФормулы 											= "ИндексСтроки,ПараметрыФормулы";
	КлючиПараметровФормулы 									= "ТочкаУчета,Услуга,КоэффициентФормула,ОбъемУслуги,ОбъемУслугиПотребленный";
		
	Если ЗначениеЗаполнено(Выборка.Абонент) И Выборка.ПомещениеРодитель = Выборка.Помещение Тогда
		СтрокНабора 										= Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.Регистратор								= ДокументСсылка;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
	ИначеЕсли  ЗначениеЗаполнено(Выборка.Абонент) и Выборка.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
		СтрокНабора 										= Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.Регистратор								= ДокументСсылка;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
		СтрокНабора.ОбъемУслуги 							= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслуги * Выборка.ДоляПотребленияЧислитель / Выборка.ДоляПотребленияЗнаменатель;
		СтрокНабора.ОбъемУслугиПотребленный					= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный * Выборка.ДоляПотребленияЧислитель / Выборка.ДоляПотребленияЗнаменатель;
		СтрокНабора.Сумма 									= СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа;
		
		НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиОстаток 				= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиОстаток + СтрокНабора.ОбъемУслуги;
		НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток 	= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток + СтрокНабора.ОбъемУслугиПотребленный;
		
	ИначеЕсли  ЗначениеЗаполнено(Выборка.Абонент) и Выборка.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда 
		СтрокНабора 										= Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.Регистратор								= ДокументСсылка;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
		
		НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиОстаток 				= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиОстаток + СтрокНабора.ОбъемУслуги;
		НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток 	= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток + СтрокНабора.ОбъемУслугиПотребленный;
		
	ИначеЕсли  ЗначениеЗаполнено(Выборка.Абонент) и Выборка.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда
		СтрокНабора 										= Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.Регистратор								= ДокументСсылка;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
		
		ПересчитатьСтроки.Добавить(Набор.Индекс(СтрокНабора));
		
	ИначеЕсли   ЗначениеЗаполнено(Выборка.Абонент) Тогда
		СтрокНабора 										= Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.Регистратор								= ДокументСсылка;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;			
		Если ЗначениеЗаполнено(Выборка.ВидПлощади) Тогда
			ПересчитатьСтрокиПоПлощади.Добавить(Набор.Индекс(СтрокНабора));
		Иначе
			КоличествоЖильцов 								= ?(НЕ Выборка.КоличествоПроживающих = 0, Выборка.КоличествоПроживающих, ?(НЕ Выборка.КоличествоПрописанных = 0, Выборка.КоличествоПрописанных, Выборка.КоличествоСобственников));
			СтрокНабора.ОбъемУслугиПотребленный				= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный * КоличествоЖильцов /  НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].КоличествоЧеловек; 
			СтрокНабора.ОбъемУслуги 						= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслуги * КоличествоЖильцов /  НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].КоличествоЧеловек; 
			НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиОстаток 				= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиОстаток + СтрокНабора.ОбъемУслуги;
			НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток 	= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток + СтрокНабора.ОбъемУслугиПотребленный;
		КонецЕсли;
	Иначе
		СтрокНабора 										= НаборОбъемПомещений.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.Регистратор								= ДокументСсылка;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
		ЕстьСумма 											= Ложь;
		
		Если НачисленияПоУслугамПомещения[Выборка.Услуга] = Неопределено Тогда
			СоотвествиеПоШкалам 							= Новый Соответствие;
			СоотвествиеПоТарифнамЗонам 						= Новый Соответствие;
			СоотвествиеПоТарифнамЗонам.Вставить(Выборка.ТарифнаяЗона,  Новый Структура("КоличествоЧеловек,ОбъемУслуги,ОбъемУслугиПотребленный,ОбъемУслугиОстаток,ОбъемУслугиПотребленныйОстаток", Выборка.КоличествоЖильцов,Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный,0,0));
			НачисленияПоУслугамПомещения.Вставить(Выборка.Услуга,СоотвествиеПоТарифнамЗонам)
		ИначеЕсли НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона] = Неопределено Тогда
			НачисленияПоУслугамПомещения[Выборка.Услуга].Вставить(Выборка.ТарифнаяЗона, Новый Структура("КоличествоЧеловек,ОбъемУслуги,ОбъемУслугиПотребленный,ОбъемУслугиОстаток,ОбъемУслугиПотребленныйОстаток", Выборка.КоличествоЖильцов, Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный,0,0));
		Иначе	
			НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].КоличествоЧеловек 		= Выборка.КоличествоЖильцов;
			НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслуги 				= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслуги + Выборка.ОбъемУслуги;
			НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный	= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
		КонецЕсли;			
	КонецЕсли;
	
	Если Выборка.ПомещениеРодитель = Выборка.Помещение И ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) Тогда
		ОбъемУслуги 										= 0;
		ОбъемУслугиПотребленный								= 0;
		
		Если НачисленияПоУслугам.Получить(Выборка.ЗависитОтУслуги) <> Неопределено И НЕ НачисленияПоУслугам[Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления] = Неопределено Тогда 
			ОбъемУслуги 									= НачисленияПоУслугам[Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслуги;
			ОбъемУслугиПотребленный 						= НачисленияПоУслугам[Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслугиПотребленный;
		КонецЕсли;	
		
		Если Выборка.СверхНорматива Тогда
			ОбъемУслуги 									= МАКС(ОбъемУслуги - Выборка.ОбъемУслугиСоцНорма, 0);
			ОбъемУслугиПотребленный 						= 0;
		Иначе
			ОбъемУслуги 									= Мин(ОбъемУслуги,Выборка.ОбъемУслугиСоцНорма);
		КонецЕсли;
		
		СтрокНабора.ОбъемУслуги 							= ОбъемУслуги * ?(Выборка.УмножатьНаНормуРодительскойУслуги,Выборка.НормаПотребления,1);
		СтрокНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный * ?(Выборка.УмножатьНаНормуРодительскойУслуги,Выборка.НормаПотребления,1);
		Если ЕстьСумма Тогда
			СтрокНабора.Сумма 								= СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.Абонент) Тогда				
			НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслуги 				= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслуги + СтрокНабора.ОбъемУслуги - Выборка.ОбъемУслуги;
			НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный 	= НачисленияПоУслугамПомещения[Выборка.Услуга][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный + СтрокНабора.ОбъемУслугиПотребленный - Выборка.ОбъемУслугиПотребленный;
		КонецЕсли;			
	КонецЕсли; 
	
	Если ЕстьСумма Тогда
		УстановитьСуммуПоПовышенномуКоэффициенту(СтрокНабора);	
	КонецЕсли;
	
	Если Выборка.РасчетПоФормуле Тогда
		ПересчитатьСтрокиПоФормуле.Вставить(Выборка.ТочкаУчета,Новый Структура(КлючФормулы, Набор.Индекс(СтрокНабора),Новый Массив));
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(Выборка.ЗависимаяТочкаУчета) Тогда
		Если ПересчитатьСтрокиПоФормуле.Получить(Выборка.ЗависимаяТочкаУчета) = Неопределено Тогда 				
			ПересчитатьСтрокиПоФормуле.Вставить(Выборка.ТочкаУчета,Новый Структура(КлючФормулы, Набор.Индекс(СтрокНабора),Новый Массив));				
		КонецЕсли;
		
		ПараметрФормулы 									= Новый Структура(КлючиПараметровФормулы);
		ПараметрФормулы.ТочкаУчета 							= Выборка.ТочкаУчета;
		ПараметрФормулы.Услуга 								= Выборка.Услуга;
		ПараметрФормулы.КоэффициентФормула					= Выборка.КоэффициентФормула;
		ПараметрФормулы.КоэффициентФормула					= Выборка.КоэффициентФормула;
		ПараметрФормулы.ОбъемУслуги 						= СтрокНабора.ОбъемУслуги;
		ПараметрФормулы.ОбъемУслугиПотребленный 			= СтрокНабора.ОбъемУслугиПотребленный;
		
		ПересчитатьСтрокиПоФормуле[Выборка.ЗависимаяТочкаУчета].ПараметрыФормулы.Добавить(ПараметрФормулы);			
	КонецЕсли;
	
	Если НачисленияПоУслугам[Выборка.Услуга] = Неопределено Тогда
		СоотвествиеПоШкалам 								= Новый Соответствие;
		СоотвествиеПоТарифнамЗонам 							= Новый Соответствие;
		СоотвествиеПоСпособам 								= Новый Соответствие;
		СоотвествиеПоСпособам.Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
		СоотвествиеПоТарифнамЗонам.Вставить(Выборка.ТарифнаяЗона, СоотвествиеПоСпособам);
		СоотвествиеПоШкалам.Вставить(Выборка.Шкала, СоотвествиеПоТарифнамЗонам);
		НачисленияПоУслугам.Вставить(Выборка.Услуга,СоотвествиеПоШкалам)
	ИначеЕсли НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала] = Неопределено Тогда
		СоотвествиеПоТарифнамЗонам 							= Новый Соответствие;
		СоотвествиеПоСпособам 								= Новый Соответствие;
		СоотвествиеПоСпособам.Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
		СоотвествиеПоТарифнамЗонам.Вставить(Выборка.ТарифнаяЗона, СоотвествиеПоСпособам);
		НачисленияПоУслугам[Выборка.Услуга].Вставить(Выборка.Шкала, СоотвествиеПоТарифнамЗонам);
	ИначеЕсли НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона] = Неопределено Тогда
		СоотвествиеПоСпособам 								= Новый Соответствие;
		СоотвествиеПоСпособам.Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
		НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала].Вставить(Выборка.ТарифнаяЗона, СоотвествиеПоСпособам);
	ИначеЕсли НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления] = Неопределено Тогда
		НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона].Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный));
	Иначе	
		НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслуги = НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслуги + Выборка.ОбъемУслуги;
		НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслугиПотребленный = НачисленияПоУслугам[Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
	КонецЕсли; 		   		                                                 
	
	// запоминаем значения площадей для того чтобы пересчитать объем коммунальных квартир		
	Если Выборка.ПорядокПомещения  = 0 Тогда
		// если будут возникать ошибки суммарной площади (изменений в один день) исправить соотвествие на хранение площадей для каждого помещения
		НачалоПериода 			= НачалоДня(Выборка.НачалоПериода);
		Если ПлощадиПомещенийПоУслугам[Выборка.Услуга] = Неопределено Тогда
			ПлощадиПоПериодам  = Новый Соответствие;
			ПлощадиПоПериодам.Вставить(НачалоПериода, Новый Структура("Площадь,Помещения",Выборка.ЗначениеПлощади, Новый Массив));
			ПлощадиПомещенийПоУслугам.Вставить(Выборка.Услуга, ПлощадиПоПериодам);
		ИначеЕсли ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода] = Неопределено Тогда
			ПлощадиПомещенийПоУслугам[Выборка.Услуга].Вставить(НачалоПериода, Новый Структура("Площадь,Помещения",Выборка.ЗначениеПлощади, Новый Массив));
		ИначеЕсли ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Помещения.Найти(Выборка.Помещение) = Неопределено Тогда 
			ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Площадь = ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Площадь + Выборка.ЗначениеПлощади;
			ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Помещения.добавить(Выборка.Помещение);
		КонецЕсли;
	КонецЕсли;		
	
	//закрытая схема
	Если Выборка.ЗакрытаяСхемаГВС Тогда
		СтрокНабора.ОбъемУслуги 							= 0;
		СтрокНабора.Сумма 									= 0;
	КонецЕсли;

КонецПроцедуры

Процедура ПрочитатьНаборыЗаписейНачисление(Выборка, ДокументОбъект, Помещение, ЗамещатьНаборВыполненные, КонецПериодаРасчета, Набор, НаборОбъемПомещений, НаборВыполненные)
	
	НачатьТранзакцию();
	ДокументСсылка 									= Выборка.ДокументНачисления;
	ПометкаУдаления 								= Выборка.ДокументНачисленияПометкаУдаления;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка)  Тогда
		ДокументСсылка 								= Документы.энргНачисление.ПолучитьСсылку(Новый УникальныйИдентификатор());
		ДокументОбъект  							= Документы.энргНачисление.СоздатьДокумент();
		ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
		ДокументОбъект.район  						= Выборка.Район;
		ДокументОбъект.МКД 							= Выборка.МКД;
		ДокументОбъект.Дата							= КонецПериодаРасчета-1;
		ДокументОбъект.Организация 					= Выборка.Организация;
		
		НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		ЗаписьВыполненные							= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 				= Выборка.Организация;
		ЗаписьВыполненные.Район		 				= Выборка.Район;
		ЗаписьВыполненные.ПериодНачисления 			= Выборка.ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления		= Перечисления.энргВидыОперацийНачисления.Индивидуальные;
		ЗаписьВыполненные.МКД 						= Выборка.МКД;
		ЗаписьВыполненные.ДокументНачисления 		= ДокументСсылка;
		ЗамещатьНаборВыполненные 					= Ложь;
	ИначеЕсли ПометкаУдаления Тогда
		ДокументОбъект  							= ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления 				= Ложь;
		
		НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненные 							= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненные.Отбор.Организация.Установить(Выборка.Организация);
		НаборВыполненные.Отбор.ПериодНачисления.Установить(Выборка.ПериодНачисления);
		НаборВыполненные.Отбор.Район.Установить(Выборка.Район);
		НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.Индивидуальные);
		НаборВыполненные.Отбор.МКД.Установить(Выборка.МКД);
		
		ЗаписьВыполненные							= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 				= Выборка.Организация;
		ЗаписьВыполненные.Район		 				= Выборка.Район;
		ЗаписьВыполненные.ПериодНачисления 			= Выборка.ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления 	= Перечисления.энргВидыОперацийНачисления.Индивидуальные;
		ЗаписьВыполненные.МКД 						= Выборка.МКД;
		ЗаписьВыполненные.ДокументНачисления 		= ДокументСсылка;
		ЗаписьВыполненные.ПометкаУдаления	 		= Ложь;
	КонецЕсли;
	
	Набор 											= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Если Не Помещение = Неопределено Тогда					
		Набор.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
		Если ДокументОбъект = Неопределено Тогда
			Набор.Прочитать();
			СтрокиНабораДоЗаписи 					= Набор.Выгрузить();
			СтрокиУдалить 							= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Помещение", Помещение));
			Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
				СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
			КонецЦикла;
			Набор.Очистить();
		КонецЕсли;					
	КонецЕсли;
	
	НаборОбъемПомещений								= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
	НаборОбъемПомещений.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Если Не Помещение = Неопределено Тогда					
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Помещение",	Помещение);
		Если ДокументОбъект = Неопределено Тогда
			НаборОбъемПомещений.Прочитать();
			СтрокиНабораДоЗаписиПомещения			= НаборОбъемПомещений.Выгрузить();
			СтрокиУдалитьПомещения					= СтрокиНабораДоЗаписиПомещения.НайтиСтроки(Новый Структура("Помещение", Помещение));
			Для Каждого СтрокаУдалить ИЗ СтрокиУдалитьПомещения Цикл
				СтрокиНабораДоЗаписиПомещения.Удалить(СтрокаУдалить);
			КонецЦикла;
			НаборОбъемПомещений.Очистить();
		КонецЕсли;					
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		Набор.Записать();
		НаборОбъемПомещений.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаписатьНаборыЗаписейНачисление(ДокументОбъект, ЗамещатьНаборВыполненные, КонецПериодаРасчета, Набор, НаборВыполненные, НаборОбъемПомещений, Организация, Ошибки, ПериодНачисления, Район, ТекМКД, ТекЧастныйСектор)
	
	Попытка
		Если НЕ ДокументОбъект = Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
			ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;														
		
		Если НЕ НаборВыполненные = Неопределено Тогда
			НаборВыполненные.Записать(ЗамещатьНаборВыполненные);
		КонецЕсли;
		
		Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
		Набор.ДополнительныеСвойства.Вставить("Район",				Район);
		Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
		Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор",		ТекЧастныйСектор);
		Набор.ДополнительныеСвойства.Вставить("Строение",			ТекМКД);
		Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);						
		Набор.Записать(Ложь);
		
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Организация",		Организация);
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Район",			Район);
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("ЧастныйСектор",	ТекЧастныйСектор);
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("Строение",			ТекМКД);
		НаборОбъемПомещений.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);						
		НаборОбъемПомещений.Записать(Ложь);						
		
		ЗафиксироватьТранзакцию();
	Исключение						
		ОтменитьТранзакцию();
		ИнформацияОбОшибке  					= ИнформацияОбОшибке();
		Ошибки 									= Ошибки +
		Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;

КонецПроцедуры

Процедура УстановитьСуммуПоПовышенномуКоэффициенту(СтрокНабора)
	
	ПовыщающийКоэффициент = Макс(0,СтрокНабора.ПовыщающийКоэффициент - 1);
	
	СтрокНабора.СуммаПоПовышенномуКоэффициенту = СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа * ПовыщающийКоэффициент;
	
КонецПроцедуры

#КонецОбласти

#Область НачислениеНаОДН_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаНачисленияНаОДН(Организация,ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде) 	
	МВТ  = Новый МенеджерВременныхТаблиц;
	ВспомогательныеДанныеНачисленияМКД(МВТ,Организация, ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде);
	ПолучитьСтабильныеПериодыМКД(МВТ,Ложь);
	ПолучитьДанныеДляРасчетаМКД(МВТ,"энргНачислениеМКД");
	Возврат РассчитатьОбъемПотребленияМКД(МВТ);
КонецФункции

Процедура ВспомогательныеДанныеНачисленияМКД(МВТ,Организация,ПериодНачисления,Район,МКД,НачалоПериодаРасчета,КонецПериодаРасчета,ДнейВПериоде)
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст  							= ТекстЗапросаВспомогательныеДанныеНачисленияМКД(МКД<>Неопределено);	
	Если МКД = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И энргМаксимальныеПоказанияСрезМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"МКД = &МКД","ИСТИНА");
		Текст 						= СтрЗаменить(Текст,"И энргПредоставленныеПоказанияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргВыводПриборовУчетаМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериодаМКД.МКД = &МКД)","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКД.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И энргСтабильныеПериодыШкалы.МКД = &МКД","");		
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли; 	
	
	Запрос.УстановитьПараметр("НачалоВеденияУчета",		Константы.энргДатаНачалаВеденияУчета.Получить());	 // Дата
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);	 // Дата
	Запрос.УстановитьПараметр("Организация",			Организация);	 // Дата
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	 // Дата
	Запрос.УстановитьПараметр("Район",					Район);	 // Районы
	Запрос.УстановитьПараметр("ДнейВПериоде",			ДнейВПериоде );
	Запрос.Текст 					= Текст;
	Запрос.Выполнить();
КонецПроцедуры

Процедура ПолучитьСтабильныеПериодыМКД(МВТ,ЭтоПерерасчет)
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст  							= ТекстЗапросаПолучитьСтабильныеПериодыМКД();	
	Запрос.УстановитьПараметр("НачалоВеденияУчета", Константы.энргДатаНачалаВеденияУчета.Получить()); 
	Запрос.Текст 					= Текст;
	Запрос.Выполнить();
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчетаМКД(МВТ,ИмяДокумента)
	Текст 							= ТекстЗапросаПолучитьДанныеДляРасчетаМКД(ИмяДокумента);
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= Текст;
	Запрос.Выполнить(); 	
КонецПроцедуры

Процедура ДобавитьСтрокиНачисленияМКДПоФормуле(ПериодНачисления, Организация, Район, МКД, ТочкаУчета, ОписаниеУслуг, НормативыПоУслугам, Набор)
	
	Для Каждого СтрокаФормулы Из ОписаниеУслуг Цикл			
		ТекФормулаОбъемУслуги	 					= СтрокаФормулы.ФормулаРасчета;
		
		Если Не ЗначениеЗаполнено(ТекФормулаОбъемУслуги) Тогда
			Продолжить;
		КонецЕсли;
		ТекФормулаОбъемУслугиПотребленный			= СтрокаФормулы.ФормулаРасчета;
		ПараметрыФормулы 							= СтрокаФормулы.ПараметрыФормулы;
		Для Каждого ПараметрФормулы Из ПараметрыФормулы Цикл
			ОписаниеОбъема 							= ПараметрФормулы.Значение;
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ПараметрФормулы.Ключ + "]",ОписаниеОбъема.ОбъемУслуги);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ПараметрФормулы.Ключ + "]",ОписаниеОбъема.ОбъемУслугиПотребленный);
		КонецЦикла;
		
		Для Каждого ПараметрФормулы Из НормативыПоУслугам Цикл
			ТекФормулаОбъемУслуги 					= СтрЗаменить(ТекФормулаОбъемУслуги,"[" + ПараметрФормулы.Ключ + "]",ПараметрФормулы.Значение);
			ТекФормулаОбъемУслугиПотребленный 		= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[" + ПараметрФормулы.Ключ + "]",ПараметрФормулы.Значение);
		КонецЦикла;
		
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги," ","");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,Символы.НПП,"");
		ТекФормулаОбъемУслуги						= СтрЗаменить(ТекФормулаОбъемУслуги,",",".");
		РезультатПоФормуламОбъемУслуги				= 0;
		ТекФормулаОбъемУслуги 						= СтрЗаменить(ТекФормулаОбъемУслуги,"[Результат]=","РезультатПоФормуламОбъемУслуги=");
		Выполнить ТекФормулаОбъемУслуги;
		
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный," ","");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,Символы.НПП,"");
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,",",".");
		РезультатПоФормуламОбъемУслугиПотребленный	= 0;
		ТекФормулаОбъемУслугиПотребленный			= СтрЗаменить(ТекФормулаОбъемУслугиПотребленный,"[Результат]=","РезультатПоФормуламОбъемУслугиПотребленный=");
		Выполнить ТекФормулаОбъемУслугиПотребленный;
		
		Если РезультатПоФормуламОбъемУслуги = 0 И РезультатПоФормуламОбъемУслугиПотребленный = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНабора 								= Набор.добавить();
		СтрокаНабора.Период 						= СтрокаФормулы.КонецПериодаРасчета-1;
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.Район 							= Район;
		СтрокаНабора.МКД 							= МКД;
		СтрокаНабора.Услуга 						= СтрокаФормулы.Услуга;
		СтрокаНабора.ТочкаУчета 					= ТочкаУчета;
		СтрокаНабора.ВидНачисления 					= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.СпособНачисления 				= СтрокаФормулы.СпособНачисления;
		СтрокаНабора.ПриборУчета 					= СтрокаФормулы.ПриборУчета;
		СтрокаНабора.ТарифнаяЗона 					= Справочники.энргТарифныеЗоны.ПустаяСсылка();
		СтрокаНабора.Поставщик 						= СтрокаФормулы.Поставщик;
		СтрокаНабора.ПериодРасчета 					= ПериодНачисления;
		СтрокаНабора.ПериодНачисления 				= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги 					= РезультатПоФормуламОбъемУслуги;		
		СтрокаНабора.ОбъемУслугиПотребленный 		= РезультатПоФормуламОбъемУслугиПотребленный;		
		СтрокаНабора.НачалоПериода 					= СтрокаФормулы.НачалоПериода;
		СтрокаНабора.КонецПериода 					= СтрокаФормулы.КонецПериода;
		СтрокаНабора.Регистратор 					= СтрокаФормулы.ДокументСсылка;	
		СтрокаНабора.НеПрименятьСезонность			= СтрокаФормулы.НеПрименятьСезонность;
	КонецЦикла;
	
КонецПроцедуры

Функция РассчитатьОбъемПотребленияМКД(МВТ); 
	Текст 							= ТекстЗапросаРассчитатьОбъемПотребленияМКД();
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 					= Текст;
	Возврат Запрос.Выполнить();	
КонецФункции

#КонецОбласти

#Область СнятьСредниеНачисления_ВспомогательныеПроцедурыИФункции

Процедура ПрочитатьНеСписанныйСредний(МВТ,Организация,Район,Строение,Помещение,НачалоПериодаРасчета,ТаблицаПриемник = Неопределено)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 							=
	"ВЫБРАТЬ
	|	энргНачисленныйСреднийОбъемОстатки.Район КАК Район,
	|	энргНачисленныйСреднийОбъемОстатки.ЧастныйСектор КАК ЧастныйСектор,
	|	энргНачисленныйСреднийОбъемОстатки.Строение КАК Строение,
	|	энргНачисленныйСреднийОбъемОстатки.Помещение КАК Помещение,
	|	энргНачисленныйСреднийОбъемОстатки.Абонент КАК Абонент,
	|	энргНачисленныйСреднийОбъемОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргНачисленныйСреднийОбъемОстатки.ТочкаУчета КАК ТочкаУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Услуга КАК Услуга,
	|	энргНачисленныйСреднийОбъемОстатки.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргНачисленныйСреднийОбъемОстатки.ПриборУчета КАК ПриборУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Шкала КАК Шкала,
	|	энргНачисленныйСреднийОбъемОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргНачисленныйСреднийОбъемОстатки.Поставщик КАК Поставщик,
	|	энргНачисленныйСреднийОбъемОстатки.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргНачисленныйСреднийОбъемОстатки.ПриборЗависимой КАК ПриборЗависимой,
	|	энргНачисленныйСреднийОбъемОстатки.СпособНачисления КАК СпособНачисления,
	|	энргНачисленныйСреднийОбъемОстатки.СуммаОстаток КАК Сумма,
	|	энргНачисленныйСреднийОбъемОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги
	|ПОМЕСТИТЬ НеСписанныйСредний
	|ИЗ
	|	РегистрНакопления.энргНачисленныйСреднийОбъем.Остатки(
	|			&НачалоПериодаРасчетаГраница,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ЧастныйСектор = &ЧастныйСектор
	|				И Строение = &Строение
	|				И Помещение = &Помещение) КАК энргНачисленныйСреднийОбъемОстатки";
	
	Если НЕ Помещение = Неопределено и ЗначениеЗаполнено(Помещение) тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",		Не ЗначениеЗаполнено(Строение));
		Запрос.УстановитьПараметр("Строение",			Строение);
		Запрос.УстановитьПараметр("Помещение",			Помещение);		
	ИначеЕсли НЕ Строение = Неопределено и ЗначениеЗаполнено(Строение) тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",		Ложь);
		Запрос.УстановитьПараметр("Строение",			Строение);
		Текст 		= СтрЗаменить(Текст,"И Помещение = &Помещение",""); 		
	ИначеЕсли НЕ Строение = Неопределено и Не ЗначениеЗаполнено(Строение) тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",		Истина);
		Текст 		= СтрЗаменить(Текст,"И Строение = &Строение","");
		Текст 		= СтрЗаменить(Текст,"И Помещение = &Помещение","");
	иначе 		
		Текст 		= СтрЗаменить(Текст,"И ЧастныйСектор = &ЧастныйСектор","");
		Текст 		= СтрЗаменить(Текст,"И Строение = &Строение","");		
		Текст 		= СтрЗаменить(Текст,"И Помещение = &Помещение",""); 	 
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаГраница",Новый Граница(НачалоПериодаРасчета,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район",							Район);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.Текст 			= Текст;
	
	Если ТаблицаПриемник = Неопределено тогда
		Запрос.Выполнить();
	иначе
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"ПОМЕСТИТЬ НеСписанныйСредний","");
		Результат  		= Запрос.Выполнить();
		Выборка 			= Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПриемник.добавить(),Выборка);
		КонецЦикла;  		 
	КонецЕсли; 
	
КонецПроцедуры

Функция РезультатЗапросаПерерасчетСреднего(МВТ,Организация,ПериодНачисления,НачалоПериодаРасчета, КонецПериодаРасчета,Район,Строение,Помещение,НачисленныйСреднийОбъем=Неопределено)
	ТекстРазделить 						= " 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Текст 	= "";
	Если НачисленныйСреднийОбъем <> Неопределено тогда
		Текст 	="ВЫБРАТЬ
		|	НеСписанныйСредний.Район,
		|	НеСписанныйСредний.МКД,
		|	НеСписанныйСредний.Абонент,
		|	НеСписанныйСредний.ПериодНачисления,
		|	НеСписанныйСредний.ТочкаУчета,
		|	НеСписанныйСредний.Услуга,
		|	НеСписанныйСредний.ЗначениеТарифа,
		|	НеСписанныйСредний.ПриборУчета,
		|	НеСписанныйСредний.Сумма,
		|	НеСписанныйСредний.ОбъемУслуги,
		|	НеСписанныйСредний.Поставщик,
		|	НеСписанныйСредний.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
		|	НеСписанныйСредний.ПриборЗависимой КАК ПриборЗависимой
		|ПОМЕСТИТЬ НеСписанныйСреднийБезГруппировки
		|ИЗ
		|	&НачисленныйСреднийОбъем КАК НеСписанныйСредний
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеСписанныйСреднийБезГруппировки.Район,
		|	НеСписанныйСреднийБезГруппировки.МКД,
		|	НеСписанныйСреднийБезГруппировки.Абонент,
		|	НеСписанныйСреднийБезГруппировки.ПериодНачисления,
		|	НеСписанныйСреднийБезГруппировки.ТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.Услуга,
		|	НеСписанныйСреднийБезГруппировки.ЗначениеТарифа,
		|	НеСписанныйСреднийБезГруппировки.ПриборУчета,
		|	СУММА(НеСписанныйСреднийБезГруппировки.Сумма) КАК Сумма,
		|	СУММА(НеСписанныйСреднийБезГруппировки.ОбъемУслуги) КАК ОбъемУслуги,
		|	НеСписанныйСреднийБезГруппировки.Поставщик,
		|	НеСписанныйСреднийБезГруппировки.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.ПриборЗависимой КАК ПриборЗависимой
		|ПОМЕСТИТЬ НеСписанныйСредний
		|ИЗ
		|	НеСписанныйСреднийБезГруппировки КАК НеСписанныйСреднийБезГруппировки
		|
		|СГРУППИРОВАТЬ ПО
		|	НеСписанныйСреднийБезГруппировки.Район,
		|	НеСписанныйСреднийБезГруппировки.МКД,
		|	НеСписанныйСреднийБезГруппировки.Абонент,
		|	НеСписанныйСреднийБезГруппировки.ПериодНачисления,
		|	НеСписанныйСреднийБезГруппировки.ТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.Услуга,
		|	НеСписанныйСреднийБезГруппировки.ЗначениеТарифа,
		|	НеСписанныйСреднийБезГруппировки.ПриборУчета,
		|	НеСписанныйСреднийБезГруппировки.Поставщик,
		|	НеСписанныйСреднийБезГруппировки.ЗависимаяТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.ПриборЗависимой";
		
		Текст 		= Текст + ТекстРазделить;
	КонецЕсли;  
	
	Текст 			= Текст + 
	"ВЫБРАТЬ
	|	НеСписанныйСредний.Район КАК Район,
	|	НеСписанныйСредний.ЧастныйСектор КАК ЧастныйСектор,
	|	НеСписанныйСредний.Строение КАК Строение,
	|	НеСписанныйСредний.Помещение КАК Помещение,
	|	НеСписанныйСредний.ПериодНачисления КАК ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета КАК ТочкаУчета,
	|	НеСписанныйСредний.Услуга КАК Услуга,
	|	НеСписанныйСредний.ЗначениеТарифа КАК ЗначениеТарифа,
	|	НеСписанныйСредний.ПриборУчета КАК ПриборУчета,
	|	НеСписанныйСредний.Шкала КАК Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НеСписанныйСредний.Абонент КАК Абонент,
	|	НеСписанныйСредний.Сумма КАК Сумма,
	|	НеСписанныйСредний.ОбъемУслуги КАК ОбъемУслуги,
	|	МИНИМУМ(энргПредоставленныеПоказания.ДатаРегистратора) КАК ДатаРегистратора,
	|	НеСписанныйСредний.Поставщик КАК Поставщик,
	|	НеСписанныйСредний.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	НеСписанныйСредний.ПриборЗависимой КАК ПриборЗависимой,
	|	НеСписанныйСредний.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДляСписанияМинДата
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НеСписанныйСредний КАК НеСписанныйСредний
	|		ПО энргПредоставленныеПоказания.Район = НеСписанныйСредний.Район
	|			И энргПредоставленныеПоказания.ЧастныйСектор = НеСписанныйСредний.ЧастныйСектор
	|			И энргПредоставленныеПоказания.Строение = НеСписанныйСредний.Строение
	|			И энргПредоставленныеПоказания.Помещение = НеСписанныйСредний.Помещение
	|			И энргПредоставленныеПоказания.ПриборУчета = НеСписанныйСредний.ПриборУчета
	|			И энргПредоставленныеПоказания.Шкала = НеСписанныйСредний.Шкала
	|			И энргПредоставленныеПоказания.ТарифнаяЗона = НеСписанныйСредний.ТарифнаяЗона
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПредоставленныеПоказания.Строение = &Строение)
	|			И (энргПредоставленныеПоказания.Помещение = &Помещение)
	|			И (энргПредоставленныеПоказания.ПоказанияТекущегоПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	НеСписанныйСредний.Район,
	|	НеСписанныйСредний.ЧастныйСектор,
	|	НеСписанныйСредний.Строение,
	|	НеСписанныйСредний.Помещение,
	|	НеСписанныйСредний.ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета,
	|	НеСписанныйСредний.Услуга,
	|	НеСписанныйСредний.ЗначениеТарифа,
	|	НеСписанныйСредний.ПриборУчета,
	|	НеСписанныйСредний.Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона,
	|	НеСписанныйСредний.Абонент,
	|	НеСписанныйСредний.Сумма,
	|	НеСписанныйСредний.ОбъемУслуги,
	|	НеСписанныйСредний.Поставщик,
	|	НеСписанныйСредний.ЗависимаяТочкаУчета,
	|	НеСписанныйСредний.ПриборЗависимой,
	|	НеСписанныйСредний.СпособНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписанияМинДата.Район КАК Район,
	|	ДанныеДляСписанияМинДата.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляСписанияМинДата.Строение КАК Строение,
	|	ДанныеДляСписанияМинДата.Помещение КАК Помещение,
	|	ДанныеДляСписанияМинДата.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписанияМинДата.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписанияМинДата.Услуга КАК Услуга,
	|	ДанныеДляСписанияМинДата.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ДанныеДляСписанияМинДата.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписанияМинДата.Шкала КАК Шкала,
	|	ДанныеДляСписанияМинДата.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписанияМинДата.Сумма КАК Сумма,
	|	ДанныеДляСписанияМинДата.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписанияМинДата.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(энргПредоставленныеПоказания.ДокРегистратор) КАК ДокРегистратор,
	|	ДанныеДляСписанияМинДата.Поставщик КАК Поставщик,
	|	ДанныеДляСписанияМинДата.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеДляСписанияМинДата.ПриборЗависимой КАК ПриборЗависимой,
	|	ДанныеДляСписанияМинДата.СпособНачисления КАК СпособНачисления,
	|	ДанныеДляСписанияМинДата.Абонент КАК Абонент
	|ПОМЕСТИТЬ ДанныеДляСписанияМинРегистратор
	|ИЗ
	|	ДанныеДляСписанияМинДата КАК ДанныеДляСписанияМинДата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|		ПО ДанныеДляСписанияМинДата.Район = энргПредоставленныеПоказания.Район
	|			И ДанныеДляСписанияМинДата.ЧастныйСектор = энргПредоставленныеПоказания.ЧастныйСектор
	|			И ДанныеДляСписанияМинДата.Строение = энргПредоставленныеПоказания.Строение
	|			И ДанныеДляСписанияМинДата.Помещение = энргПредоставленныеПоказания.Помещение
	|			И ДанныеДляСписанияМинДата.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И ДанныеДляСписанияМинДата.Шкала = энргПредоставленныеПоказания.Шкала
	|			И ДанныеДляСписанияМинДата.ТарифнаяЗона = энргПредоставленныеПоказания.ТарифнаяЗона
	|			И ДанныеДляСписанияМинДата.ДатаРегистратора = энргПредоставленныеПоказания.ДатаРегистратора
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПредоставленныеПоказания.Строение = &Строение)
	|			И (энргПредоставленныеПоказания.Помещение = &Помещение)
	|			И (энргПредоставленныеПоказания.ПоказанияТекущегоПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляСписанияМинДата.Район,
	|	ДанныеДляСписанияМинДата.ЧастныйСектор,
	|	ДанныеДляСписанияМинДата.Строение,
	|	ДанныеДляСписанияМинДата.Помещение,
	|	ДанныеДляСписанияМинДата.ПериодНачисления,
	|	ДанныеДляСписанияМинДата.ТочкаУчета,
	|	ДанныеДляСписанияМинДата.Услуга,
	|	ДанныеДляСписанияМинДата.ЗначениеТарифа,
	|	ДанныеДляСписанияМинДата.ПриборУчета,
	|	ДанныеДляСписанияМинДата.Шкала,
	|	ДанныеДляСписанияМинДата.ТарифнаяЗона,
	|	ДанныеДляСписанияМинДата.Сумма,
	|	ДанныеДляСписанияМинДата.ОбъемУслуги,
	|	ДанныеДляСписанияМинДата.ДатаРегистратора,
	|	ДанныеДляСписанияМинДата.Поставщик,
	|	ДанныеДляСписанияМинДата.ЗависимаяТочкаУчета,
	|	ДанныеДляСписанияМинДата.ПриборЗависимой,
	|	ДанныеДляСписанияМинДата.СпособНачисления,
	|	ДанныеДляСписанияМинДата.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Организация КАК Организация,
	|	энргОбъемНачисленийОбороты.Район КАК Район,
	|	энргОбъемНачисленийОбороты.Строение КАК Строение,
	|	энргОбъемНачисленийОбороты.Помещение КАК Помещение,
	|	энргОбъемНачисленийОбороты.Абонент КАК Абонент,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.Шкала КАК Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СУММА(энргОбъемНачисленийОбороты.СуммаОборот) КАК СуммаОборот,
	|	СУММА(энргОбъемНачисленийОбороты.ОбъемУслугиОборот) КАК ОбъемУслугиОборот,
	|	СУММА(энргОбъемНачисленийОбороты.ОбъемУслугиПотребленныйОборот) КАК ОбъемУслугиПотребленныйОборот,
	|	энргОбъемНачисленийОбороты.ЧастныйСектор КАК ЧастныйСектор,
	|	МАКСИМУМ(энргОбъемНачисленийОбороты.ЗначениеТарифа) КАК ЗначениеТарифа
	|ПОМЕСТИТЬ НачисленныйОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ПериодНачисления = &ПериодНачисления
	|				И ЧастныйСектор = &ЧастныйСектор
	|				И Строение = &Строение
	|				И Помещение = &Помещение) КАК энргОбъемНачисленийОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОбъемНачисленийОбороты.Организация,
	|	энргОбъемНачисленийОбороты.Район,
	|	энргОбъемНачисленийОбороты.Строение,
	|	энргОбъемНачисленийОбороты.Помещение,
	|	энргОбъемНачисленийОбороты.Абонент,
	|	энргОбъемНачисленийОбороты.Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета,
	|	энргОбъемНачисленийОбороты.Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона,
	|	энргОбъемНачисленийОбороты.ЧастныйСектор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписанияМинРегистратор.Район КАК Район,
	|	ВЫБОР
	|		КОГДА ДанныеДляСписанияМинРегистратор.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляСписанияМинРегистратор.Строение
	|	КОНЕЦ КАК МКД,
	|	ДанныеДляСписанияМинРегистратор.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляСписанияМинРегистратор.Строение КАК Строение,
	|	ДанныеДляСписанияМинРегистратор.Помещение КАК Помещение,
	|	ДанныеДляСписанияМинРегистратор.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписанияМинРегистратор.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.Услуга КАК Услуга,
	|	ДанныеДляСписанияМинРегистратор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ДанныеДляСписанияМинРегистратор.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписанияМинРегистратор.Шкала КАК Шкала,
	|	ДанныеДляСписанияМинРегистратор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписанияМинРегистратор.Сумма КАК Сумма,
	|	ДанныеДляСписанияМинРегистратор.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписанияМинРегистратор.ДокРегистратор КАК ДокументОснование,
	|	МАКСИМУМ(ЕСТЬNULL(энргПерерасчет.Ссылка, ЗНАЧЕНИЕ(Документ.энргПерерасчет.Пустаяссылка))) КАК ДокументПерерасчета,
	|	МАКСИМУМ(ЕСТЬNULL(энргПерерасчет.ПометкаУдаления, ЛОЖЬ)) КАК ДокументПерерасчетаПометкаУдаления,
	|	ДанныеДляСписанияМинРегистратор.Поставщик КАК Поставщик,
	|	ДанныеДляСписанияМинРегистратор.ДатаРегистратора КАК ДатаДокументаОснования,
	|	ДанныеДляСписанияМинРегистратор.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.ПриборЗависимой КАК ПриборЗависимой,
	|	ДанныеДляСписанияМинРегистратор.СпособНачисления КАК СпособНачисления,
	|	ДанныеДляСписанияМинРегистратор.Абонент КАК Абонент,
	|	НачисленныйОбъем.СуммаОборот КАК СуммаНачислено,
	|	НачисленныйОбъем.ОбъемУслугиОборот КАК ОбъемУслугиНачислено,
	|	НачисленныйОбъем.ОбъемУслугиПотребленныйОборот КАК ОбъемУслугиПотребленныйНачислено,
	|	НачисленныйОбъем.ЗначениеТарифа КАК ЗначениеТарифаНачислено
	|ИЗ
	|	ДанныеДляСписанияМинРегистратор КАК ДанныеДляСписанияМинРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|		ПО ДанныеДляСписанияМинРегистратор.Район = энргПерерасчет.Район
	|			И (энргПерерасчет.КлючПомещения = ЗНАЧЕНИЕ(Справочник.энргКлючиПомещений.ПустаяСсылка))
	|			И (ВЫБОР
	|				КОГДА ДанныеДляСписанияМинРегистратор.ЧастныйСектор
	|					ТОГДА энргПерерасчет.Строение = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				ИНАЧЕ ДанныеДляСписанияМинРегистратор.Строение = энргПерерасчет.Строение
	|			КОНЕЦ)
	|			И (энргПерерасчет.Организация = &Организация)
	|			И (НАЧАЛОПЕРИОДА(энргПерерасчет.Дата, МЕСЯЦ) = &ПериодНачисления)
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленныйОбъем КАК НачисленныйОбъем
	|		ПО ДанныеДляСписанияМинРегистратор.Район = НачисленныйОбъем.Район
	|			И ДанныеДляСписанияМинРегистратор.Строение = НачисленныйОбъем.Строение
	|			И ДанныеДляСписанияМинРегистратор.Помещение = НачисленныйОбъем.Помещение
	|			И ДанныеДляСписанияМинРегистратор.ЧастныйСектор = НачисленныйОбъем.ЧастныйСектор
	|			И ДанныеДляСписанияМинРегистратор.ТочкаУчета = НачисленныйОбъем.ТочкаУчета
	|			И ДанныеДляСписанияМинРегистратор.Услуга = НачисленныйОбъем.Услуга
	|			И ДанныеДляСписанияМинРегистратор.Шкала = НачисленныйОбъем.Шкала
	|			И ДанныеДляСписанияМинРегистратор.ТарифнаяЗона = НачисленныйОбъем.ТарифнаяЗона
	|			И ДанныеДляСписанияМинРегистратор.Абонент = НачисленныйОбъем.Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляСписанияМинРегистратор.Район,
	|	ДанныеДляСписанияМинРегистратор.ЧастныйСектор,
	|	ДанныеДляСписанияМинРегистратор.Строение,
	|	ДанныеДляСписанияМинРегистратор.Помещение,
	|	ДанныеДляСписанияМинРегистратор.ПериодНачисления,
	|	ДанныеДляСписанияМинРегистратор.ТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.Услуга,
	|	ДанныеДляСписанияМинРегистратор.ЗначениеТарифа,
	|	ДанныеДляСписанияМинРегистратор.ПриборУчета,
	|	ДанныеДляСписанияМинРегистратор.Шкала,
	|	ДанныеДляСписанияМинРегистратор.ТарифнаяЗона,
	|	ДанныеДляСписанияМинРегистратор.Сумма,
	|	ДанныеДляСписанияМинРегистратор.ОбъемУслуги,
	|	ДанныеДляСписанияМинРегистратор.ДокРегистратор,
	|	ДанныеДляСписанияМинРегистратор.Поставщик,
	|	ДанныеДляСписанияМинРегистратор.ДатаРегистратора,
	|	ДанныеДляСписанияМинРегистратор.ЗависимаяТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.ПриборЗависимой,
	|	ДанныеДляСписанияМинРегистратор.СпособНачисления,
	|	ДанныеДляСписанияМинРегистратор.Абонент,
	|	НачисленныйОбъем.СуммаОборот,
	|	НачисленныйОбъем.ОбъемУслугиОборот,
	|	НачисленныйОбъем.ОбъемУслугиПотребленныйОборот,
	|	НачисленныйОбъем.ЗначениеТарифа,
	|	ВЫБОР
	|		КОГДА ДанныеДляСписанияМинРегистратор.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляСписанияМинРегистратор.Строение
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД,
	|	ЧастныйСектор,
	|	Строение,
	|	Помещение";  	
	
	Если НачисленныйСреднийОбъем <> Неопределено тогда
		
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ ДанныеДляСписанияМинДата";
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ ДанныеДляСписанияМинРегистратор";
		
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ НеСписанныйСредний"; 						
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ НеСписанныйСреднийБезГруппировки"; 		
	КонецЕсли;  
	
	Если Строение = Неопределено Тогда
		Текст 						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)","");
		Текст						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		
		Текст 						= СтрЗаменить(Текст,"И ЧастныйСектор = &ЧастныйСектор","");
		Текст 						= СтрЗаменить(Текст,"И Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И Помещение = &Помещение","");

	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда
		Текст 						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		
		Текст 						= СтрЗаменить(Текст,"И Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И Помещение = &Помещение","");
	ИначеЕсли Помещение = Неопределено Тогда 
		Текст 						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И Помещение = &Помещение","");
	КонецЕсли;
	 
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодНачисления",			ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Район",						Район);
	Запрос.УстановитьПараметр("НачисленныйСреднийОбъем", 	НачисленныйСреднийОбъем);
	Запрос.УстановитьПараметр("НачалоПериода", 				НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода", 				КонецПериодаРасчета);	

	
	Если НЕ Строение = Неопределено И НЕ ЗначениеЗаполнено(Строение) Тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",		Истина);
	ИначеЕсли НЕ Строение = Неопределено И Помещение = Неопределено Тогда 
		Запрос.УстановитьПараметр("ЧастныйСектор",		Ложь);
		Запрос.УстановитьПараметр("Строение",			Строение);
	Иначе
		Запрос.УстановитьПараметр("ЧастныйСектор",		Ложь);
		Запрос.УстановитьПараметр("Строение",			Строение);
		Запрос.УстановитьПараметр("Помещение",			Помещение);		
	КонецЕсли;
	
	Запрос.Текст 					= Текст;
	Результат  						= Запрос.Выполнить();  
	Возврат Результат;
КонецФункции

Функция РезультатОтменитьСнятьСредниеНачисления(ПериодНачисления,Организация,Район,Строение)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Строение",			Строение);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргПерерасчет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Проведен
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)	
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Организация = &Организация	
	|	И энргПерерасчет.ПериодНачисления = &ПериодНачисления
	|	И энргПерерасчет.КлючПомещения.Строение = &Строение";
	
	Если Строение = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргПерерасчет.МКД = &Строение","");
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

#КонецОбласти

#Область СнятьСредниеНачисленияМКД_ВспомогательныеПроцедурыИФункции

Процедура ПрочитатьНеСписанныйСреднийМКД(МВТ,Организация,Район, МКД, НачалоПериодаРасчета,ТаблицаПриемник = Неопределено)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 	=
	"ВЫБРАТЬ
	|	энргНачисленныйСреднийОбъемОстатки.Район КАК Район,
	|	энргНачисленныйСреднийОбъемОстатки.МКД КАК МКД,
	|	энргНачисленныйСреднийОбъемОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргНачисленныйСреднийОбъемОстатки.ТочкаУчета КАК ТочкаУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Услуга КАК Услуга,
	|	энргНачисленныйСреднийОбъемОстатки.ПриборУчета КАК ПриборУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Шкала КАК Шкала,
	|	энргНачисленныйСреднийОбъемОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргНачисленныйСреднийОбъемОстатки.Поставщик КАК Поставщик,
	|	энргНачисленныйСреднийОбъемОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги,
	|	энргНачисленныйСреднийОбъемОстатки.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ НеСписанныйСредний
	|ИЗ
	|	РегистрНакопления.энргНачисленныйСреднийОбъемМКД.Остатки(
	|			&НачалоПериодаРасчетаГраница,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргНачисленныйСреднийОбъемОстатки";
	
	Если ЗначениеЗаполнено(МКД) тогда
		Запрос.УстановитьПараметр("МКД",				МКД);
	иначе 		
		Текст 		= СтрЗаменить(Текст,"И МКД = &МКД","");	
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаГраница",Новый Граница(НачалоПериодаРасчета,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район",							Район);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.Текст 			= Текст;
	
	Если ТаблицаПриемник = Неопределено тогда
		Запрос.Выполнить();
	иначе
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"ПОМЕСТИТЬ НеСписанныйСредний","");
		Результат  			= Запрос.Выполнить();
		Выборка 			= Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПриемник.добавить(),Выборка);
		КонецЦикла;  		 
	КонецЕсли;
КонецПроцедуры

Функция РезультатЗапросаПерерасчетСреднегоМКД(МВТ,Организация,ПериодНачисления,Район,МКД,НачисленныйСреднийОбъем=Неопределено)
	
	ТекстРазделить 						= " 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Текст 	= "";
	Если НачисленныйСреднийОбъем <> Неопределено тогда
		Текст 	=
		"ВЫБРАТЬ
		|	НеСписанныйСредний.Район,
		|	НеСписанныйСредний.МКД,
		|	НеСписанныйСредний.ПериодНачисления,
		|	НеСписанныйСредний.ТочкаУчета,
		|	НеСписанныйСредний.Услуга,
		|	НеСписанныйСредний.ПриборУчета,
		|	НеСписанныйСредний.ОбъемУслуги,
		|	НеСписанныйСредний.Поставщик
		|ПОМЕСТИТЬ НеСписанныйСреднийБезГруппировки
		|ИЗ
		|	&НачисленныйСреднийОбъем КАК НеСписанныйСредний
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеСписанныйСреднийБезГруппировки.Район,
		|	НеСписанныйСреднийБезГруппировки.МКД,
		|	НеСписанныйСреднийБезГруппировки.ПериодНачисления,
		|	НеСписанныйСреднийБезГруппировки.ТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.Услуга,
		|	НеСписанныйСреднийБезГруппировки.ПриборУчета,
		|	СУММА(НеСписанныйСреднийБезГруппировки.ОбъемУслуги) КАК ОбъемУслуги,
		|	НеСписанныйСреднийБезГруппировки.Поставщик
		|ПОМЕСТИТЬ НеСписанныйСредний
		|ИЗ
		|	НеСписанныйСреднийБезГруппировки КАК НеСписанныйСреднийБезГруппировки
		|
		|СГРУППИРОВАТЬ ПО
		|	НеСписанныйСреднийБезГруппировки.Район,
		|	НеСписанныйСреднийБезГруппировки.МКД,
		|	НеСписанныйСреднийБезГруппировки.ПериодНачисления,
		|	НеСписанныйСреднийБезГруппировки.ТочкаУчета,
		|	НеСписанныйСреднийБезГруппировки.Услуга,
		|	НеСписанныйСреднийБезГруппировки.ПриборУчета,
		|	НеСписанныйСреднийБезГруппировки.Поставщик";
		
		Текст = Текст + ТекстРазделить;
	КонецЕсли;  
	
	Текст 	=Текст + 
	"ВЫБРАТЬ
	|	НеСписанныйСредний.Район КАК Район,
	|	НеСписанныйСредний.МКД КАК МКД,
	|	НеСписанныйСредний.ПериодНачисления КАК ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета КАК ТочкаУчета,
	|	НеСписанныйСредний.Услуга КАК Услуга,
	|	НеСписанныйСредний.ПриборУчета КАК ПриборУчета,
	|	НеСписанныйСредний.Шкала КАК Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НеСписанныйСредний.ОбъемУслуги КАК ОбъемУслуги,
	|	МИНИМУМ(энргПредоставленныеПоказания.ДатаРегистратора) КАК ДатаРегистратора,
	|	НеСписанныйСредний.Поставщик КАК Поставщик,
	|	НеСписанныйСредний.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДляСписанияМинДата
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НеСписанныйСредний КАК НеСписанныйСредний
	|		ПО энргПредоставленныеПоказания.Район = НеСписанныйСредний.Район
	|			И энргПредоставленныеПоказания.МКД = НеСписанныйСредний.МКД
	|			И энргПредоставленныеПоказания.ПриборУчета = НеСписанныйСредний.ПриборУчета
	|			И энргПредоставленныеПоказания.Шкала = НеСписанныйСредний.Шкала
	|			И энргПредоставленныеПоказания.ТарифнаяЗона = НеСписанныйСредний.ТарифнаяЗона
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.МКД = &МКД)
	|			И (энргПредоставленныеПоказания.ПоказанияТекущегоПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	НеСписанныйСредний.Район,
	|	НеСписанныйСредний.МКД,
	|	НеСписанныйСредний.ПериодНачисления,
	|	НеСписанныйСредний.ТочкаУчета,
	|	НеСписанныйСредний.Услуга,
	|	НеСписанныйСредний.ПриборУчета,
	|	НеСписанныйСредний.Шкала,
	|	НеСписанныйСредний.ТарифнаяЗона,
	|	НеСписанныйСредний.ОбъемУслуги,
	|	НеСписанныйСредний.Поставщик,
	|	НеСписанныйСредний.СпособНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписанияМинДата.Район КАК Район,
	|	ДанныеДляСписанияМинДата.МКД КАК МКД,
	|	ДанныеДляСписанияМинДата.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписанияМинДата.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписанияМинДата.Услуга КАК Услуга,
	|	ДанныеДляСписанияМинДата.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписанияМинДата.Шкала КАК Шкала,
	|	ДанныеДляСписанияМинДата.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписанияМинДата.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписанияМинДата.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(энргПредоставленныеПоказания.ДокРегистратор) КАК ДокРегистратор,
	|	ДанныеДляСписанияМинДата.Поставщик КАК Поставщик,
	|	ДанныеДляСписанияМинДата.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДляСписанияМинРегистратор
	|ИЗ
	|	ДанныеДляСписанияМинДата КАК ДанныеДляСписанияМинДата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказания
	|		ПО ДанныеДляСписанияМинДата.Район = энргПредоставленныеПоказания.Район
	|			И ДанныеДляСписанияМинДата.МКД = энргПредоставленныеПоказания.МКД
	|			И ДанныеДляСписанияМинДата.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И ДанныеДляСписанияМинДата.Шкала = энргПредоставленныеПоказания.Шкала
	|			И ДанныеДляСписанияМинДата.ТарифнаяЗона = энргПредоставленныеПоказания.ТарифнаяЗона
	|			И ДанныеДляСписанияМинДата.ДатаРегистратора = энргПредоставленныеПоказания.ДатаРегистратора
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.МКД = &МКД)
	|			И (энргПредоставленныеПоказания.ПоказанияТекущегоПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляСписанияМинДата.Район,
	|	ДанныеДляСписанияМинДата.МКД,
	|	ДанныеДляСписанияМинДата.ПериодНачисления,
	|	ДанныеДляСписанияМинДата.ТочкаУчета,
	|	ДанныеДляСписанияМинДата.Услуга,
	|	ДанныеДляСписанияМинДата.ПриборУчета,
	|	ДанныеДляСписанияМинДата.Шкала,
	|	ДанныеДляСписанияМинДата.ТарифнаяЗона,
	|	ДанныеДляСписанияМинДата.ОбъемУслуги,
	|	ДанныеДляСписанияМинДата.ДатаРегистратора,
	|	ДанныеДляСписанияМинДата.Поставщик,
	|	ДанныеДляСписанияМинДата.СпособНачисления 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСписанияМинРегистратор.Район КАК Район,
	|	ДанныеДляСписанияМинРегистратор.МКД КАК МКД,
	|	ДанныеДляСписанияМинРегистратор.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляСписанияМинРегистратор.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.Услуга КАК Услуга,
	|	ДанныеДляСписанияМинРегистратор.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляСписанияМинРегистратор.Шкала КАК Шкала,
	|	ДанныеДляСписанияМинРегистратор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляСписанияМинРегистратор.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДляСписанияМинРегистратор.ДокРегистратор КАК ДокументОснование,
	|	МАКСИМУМ(ЕСТЬNULL(энргПерерасчет.Ссылка, ЗНАЧЕНИЕ(Документ.энргПерерасчетМКД.Пустаяссылка))) КАК ДокументПерерасчета,
	|	ДанныеДляСписанияМинРегистратор.Поставщик КАК Поставщик,
	|	ДанныеДляСписанияМинРегистратор.СпособНачисления КАК СпособНачисления,
	|	ДанныеДляСписанияМинРегистратор.ДатаРегистратора КАК ДатаДокументаОснования
	|ИЗ
	|	ДанныеДляСписанияМинРегистратор КАК ДанныеДляСписанияМинРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргПерерасчетМКД КАК энргПерерасчет
	|		ПО ДанныеДляСписанияМинРегистратор.Район = энргПерерасчет.Район
	|			И (НАЧАЛОПЕРИОДА(энргПерерасчет.Дата, МЕСЯЦ) = &ПериодНачисления)
	|			И (энргПерерасчет.Организация = &Организация)
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляСписанияМинРегистратор.Район,
	|	ДанныеДляСписанияМинРегистратор.МКД,
	|	ДанныеДляСписанияМинРегистратор.ПериодНачисления,
	|	ДанныеДляСписанияМинРегистратор.ТочкаУчета,
	|	ДанныеДляСписанияМинРегистратор.Услуга,
	|	ДанныеДляСписанияМинРегистратор.ПриборУчета,
	|	ДанныеДляСписанияМинРегистратор.Шкала,
	|	ДанныеДляСписанияМинРегистратор.ТарифнаяЗона,
	|	ДанныеДляСписанияМинРегистратор.ОбъемУслуги,
	|	ДанныеДляСписанияМинРегистратор.ДокРегистратор,
	|	ДанныеДляСписанияМинРегистратор.Поставщик,
	|	ДанныеДляСписанияМинРегистратор.СпособНачисления,
	|	ДанныеДляСписанияМинРегистратор.ДатаРегистратора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД"; 	
	
	Если НачисленныйСреднийОбъем <> Неопределено тогда
		
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ ДанныеДляСписанияМинДата";
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ ДанныеДляСписанияМинРегистратор";
		
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ НеСписанныйСредний"; 						
		Текст 						= Текст + ТекстРазделить + "УНИЧТОЖИТЬ НеСписанныйСреднийБезГруппировки"; 		
	КонецЕсли;  
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",			ПериодНачисления);
	Запрос.УстановитьПараметр("Район",						Район);
	Запрос.УстановитьПараметр("НачисленныйСреднийОбъем", 	НачисленныйСреднийОбъем);
	Если ЗначениеЗаполнено(МКД) тогда
		Запрос.УстановитьПараметр("МКД",					МКД);		
	иначе 		
		Текст 						= СтрЗаменить(Текст,"И МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.МКД = &МКД)","");
	КонецЕсли;
	
	Запрос.Текст 					= Текст;
	Результат  						= Запрос.Выполнить();  
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ДанныеПерерасчета_ВспомогательныеФункции

Функция ПерерасчетСреднегоПослеПерерасчета(ОбъемПерерасчета,Организация,Район,МКД,Абонент,НачалоПериодаРасчета,КонецПериодаРасчета)
	
	Запрос  					= Новый Запрос;
	Запрос.УстановитьПараметр("ОбъемПерерасчета",			ОбъемПерерасчета);
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Район",						Район);
	Запрос.УстановитьПараметр("МКД",						МКД);
	Запрос.УстановитьПараметр("Абонент",					Абонент);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериодаРасчетаГраница",	Новый Граница(КонецПериодаРасчета,ВидГраницы.Исключая));
	Запрос.Текст 				= "ВЫБРАТЬ
	|	ОбъемПерерасчета.Организация,
	|	ОбъемПерерасчета.ПериодНачисления,
	|	ОбъемПерерасчета.ТочкаУчета,
	|	ОбъемПерерасчета.Услуга,
	|	ОбъемПерерасчета.ЗначениеТарифа,
	|	ОбъемПерерасчета.ПриборУчета,
	|	ОбъемПерерасчета.Поставщик,
	|	ОбъемПерерасчета.ЗависимаяТочкаУчета,
	|	ОбъемПерерасчета.ПриборЗависимой,
	|	ОбъемПерерасчета.Сумма,
	|	ОбъемПерерасчета.ОбъемУслуги
	|ПОМЕСТИТЬ ОбъемПеререасчета
	|ИЗ
	|	&ОбъемПерерасчета КАК ОбъемПерерасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНачисленныйСреднийОбъемОбороты.Организация,
	|	энргНачисленныйСреднийОбъемОбороты.ПериодНачисления,
	|	энргНачисленныйСреднийОбъемОбороты.ТочкаУчета,
	|	энргНачисленныйСреднийОбъемОбороты.Услуга,
	|	энргНачисленныйСреднийОбъемОбороты.ЗначениеТарифа,
	|	энргНачисленныйСреднийОбъемОбороты.ПриборУчета,
	|	энргНачисленныйСреднийОбъемОбороты.Поставщик,
	|	энргНачисленныйСреднийОбъемОбороты.ЗависимаяТочкаУчета,
	|	энргНачисленныйСреднийОбъемОбороты.ПриборЗависимой,
	|	энргНачисленныйСреднийОбъемОбороты.СуммаОборот КАК Сумма,
	|	энргНачисленныйСреднийОбъемОбороты.ОбъемУслугиОборот КАК ОбъемУслуги
	|ПОМЕСТИТЬ НачислениеСреднего
	|ИЗ
	|	РегистрНакопления.энргНачисленныйСреднийОбъем.Обороты(
	|			&НачалоПериодаРасчета,
	|			&КонецПериодаРасчетаГраница,
	|			,
	|			Организация =&Организация И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргНачисленныйСреднийОбъемОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОбъемПеререасчета.Организация, НачислениеСреднего.Организация) КАК Организация,
	|	ЕСТЬNULL(ОбъемПеререасчета.ПериодНачисления, НачислениеСреднего.ПериодНачисления) КАК ПериодНачисления,
	|	ЕСТЬNULL(ОбъемПеререасчета.ТочкаУчета, НачислениеСреднего.ТочкаУчета) КАК ТочкаУчета,
	|	ЕСТЬNULL(ОбъемПеререасчета.Услуга, НачислениеСреднего.Услуга) КАК Услуга,
	|	ЕСТЬNULL(ОбъемПеререасчета.ЗначениеТарифа, НачислениеСреднего.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ОбъемПеререасчета.ПриборУчета, НачислениеСреднего.ПриборУчета) КАК ПриборУчета,
	|	ЕСТЬNULL(ОбъемПеререасчета.Поставщик, НачислениеСреднего.Поставщик) КАК Поставщик,
	|	ЕСТЬNULL(ОбъемПеререасчета.ЗависимаяТочкаУчета, НачислениеСреднего.ЗависимаяТочкаУчета) КАК ЗависимаяТочкаУчета,
	|	ЕСТЬNULL(ОбъемПеререасчета.ПриборЗависимой, НачислениеСреднего.ПриборЗависимой) КАК ПриборЗависимой,
	|	ЕСТЬNULL(НачислениеСреднего.Сумма, 0) КАК СуммаДо,
	|	ЕСТЬNULL(НачислениеСреднего.ОбъемУслуги, 0) КАК ОбъемУслугиДо,
	|	ЕСТЬNULL(ОбъемПеререасчета.Сумма, 0) КАК СуммаПосле,
	|	ЕСТЬNULL(ОбъемПеререасчета.ОбъемУслуги, 0) КАК ОбъемУслугиПосле
	|ИЗ
	|	ОбъемПеререасчета КАК ОбъемПеререасчета
	|		ПОЛНОЕ СОЕДИНЕНИЕ НачислениеСреднего КАК НачислениеСреднего
	|		ПО ОбъемПеререасчета.ПериодНачисления = НачислениеСреднего.ПериодНачисления
	|			И ОбъемПеререасчета.ТочкаУчета = НачислениеСреднего.ТочкаУчета
	|			И ОбъемПеререасчета.Услуга = НачислениеСреднего.Услуга
	|			И ОбъемПеререасчета.ЗначениеТарифа = НачислениеСреднего.ЗначениеТарифа
	|			И ОбъемПеререасчета.ПриборУчета = НачислениеСреднего.ПриборУчета
	|			И ОбъемПеререасчета.Поставщик = НачислениеСреднего.Поставщик
	|			И ОбъемПеререасчета.ЗависимаяТочкаУчета = НачислениеСреднего.ЗависимаяТочкаУчета
	|			И ОбъемПеререасчета.ПриборЗависимой = НачислениеСреднего.ПриборЗависимой"; 	
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ОбъемыНачисленийПослеПерерасчета(МВТ) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст = 
	"ВЫБРАТЬ
	|	ДанныеНачислений.Организация КАК Организация,
	|	ДанныеНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеНачислений.Услуга КАК Услуга,
	|	ДанныеНачислений.Поставщик КАК Поставщик,
	|	ДанныеНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеНачислений.ПриборУчета КАК ПриборУчета,
	|	СУММА(ДанныеНачислений.ОбъемУслуги) КАК ОбъемУслуги,
	|	ДанныеНачислений.СпособНачисления КАК СпособНачисления,
	|	ДанныеНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	СУММА(ДанныеНачислений.Сумма) КАК Сумма
	|ПОМЕСТИТЬ СвернутыеДанные
	|ИЗ
	|	ДанныеНачислений КАК ДанныеНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеНачислений.Организация,
	|	ДанныеНачислений.ПериодНачисления,
	|	ДанныеНачислений.Услуга,
	|	ДанныеНачислений.Поставщик,
	|	ДанныеНачислений.ТочкаУчета,
	|	ДанныеНачислений.ПриборУчета,
	|	ДанныеНачислений.СпособНачисления,
	|	ДанныеНачислений.ЗначениеТарифа
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДанныеНачислений.ОбъемУслуги) <> 0
	|		ИЛИ СУММА(ДанныеНачислений.Сумма) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОбъемДляКорректировки.Организация, СвернутыеДанные.Организация) КАК Организация,
	|	ЕСТЬNULL(ОбъемДляКорректировки.ПериодНачисления, СвернутыеДанные.ПериодНачисления) КАК ПериодНачисления,
	|	ЕСТЬNULL(ОбъемДляКорректировки.Услуга, СвернутыеДанные.Услуга) КАК Услуга,
	|	ЕСТЬNULL(ОбъемДляКорректировки.Поставщик, СвернутыеДанные.Поставщик) КАК Поставщик,
	|	ЕСТЬNULL(ОбъемДляКорректировки.ТочкаУчета, СвернутыеДанные.ТочкаУчета) КАК ТочкаУчета,
	|	ЕСТЬNULL(ОбъемДляКорректировки.ПриборУчета, СвернутыеДанные.ПриборУчета) КАК ПриборУчета,
	|	ЕСТЬNULL(ОбъемДляКорректировки.СпособНачисления, СвернутыеДанные.СпособНачисления) КАК СпособНачисления,
	|	ЕСТЬNULL(ОбъемДляКорректировки.ЗначениеТарифа, СвернутыеДанные.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ОбъемДляКорректировки.Сумма, 0) КАК СуммаДо,
	|	ЕСТЬNULL(ОбъемДляКорректировки.ОбъемУслуги, 0) КАК ОбъемУслугиДо,
	|	ЕСТЬNULL(СвернутыеДанные.Сумма, 0) КАК СуммаПосле,
	|	ЕСТЬNULL(СвернутыеДанные.ОбъемУслуги, 0) КАК ОбъемУслугиПосле
	|ИЗ
	|	ОбъемДляКорректировки КАК ОбъемДляКорректировки
	|		ПОЛНОЕ СОЕДИНЕНИЕ СвернутыеДанные КАК СвернутыеДанные
	|		ПО ОбъемДляКорректировки.Организация = СвернутыеДанные.Организация
	|			И ОбъемДляКорректировки.ПериодНачисления = СвернутыеДанные.ПериодНачисления
	|			И ОбъемДляКорректировки.Услуга = СвернутыеДанные.Услуга
	|			И ОбъемДляКорректировки.ТочкаУчета = СвернутыеДанные.ТочкаУчета
	|			И ОбъемДляКорректировки.ПриборУчета = СвернутыеДанные.ПриборУчета
	|			И ОбъемДляКорректировки.СпособНачисления = СвернутыеДанные.СпособНачисления
	|			И ОбъемДляКорректировки.ЗначениеТарифа = СвернутыеДанные.ЗначениеТарифа
	|			И ОбъемДляКорректировки.Поставщик = СвернутыеДанные.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления";
	Запрос.Текст 						= Текст;
	
	Возврат Запрос.Выполнить();   
КонецФункции       

// Вирутально проводит документ начисления. 
// Данные записываем в таблицу значений.
Функция ПрочитатьНачисленныйСреднийОбъем(МВТ,Организация,ПериодНачисления,НачислениеПоФормулам,НачисленияПоСреднемуФормулы)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодНачисления",			ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("НачислениеПоФормулам",		НачислениеПоФормулам);
	Запрос.УстановитьПараметр("НачисленияПоСреднемуФормулы",НачисленияПоСреднемуФормулы);
	Текст 							=
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачисленияПоСреднемуФормулы.ПериодНачисления КАК ПериодНачисления,
	|	НачисленияПоСреднемуФормулы.Абонент КАК Абонент,
	|	НачисленияПоСреднемуФормулы.ЗначениеТарифа КАК ЗначениеТарифа,
	|	НачисленияПоСреднемуФормулы.Поставщик КАК Поставщик,
	|	НачисленияПоСреднемуФормулы.ПриборУчета КАК ПриборУчета,
	|	НачисленияПоСреднемуФормулы.ТочкаУчета КАК ТочкаУчета,
	|	НачисленияПоСреднемуФормулы.Услуга КАК Услуга,
	|	НачисленияПоСреднемуФормулы.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	НачисленияПоСреднемуФормулы.ПриборЗависимой КАК ПриборЗависимой,
	|	НачисленияПоСреднемуФормулы.ОбъемУслуги КАК ОбъемУслуги,
	|	НачисленияПоСреднемуФормулы.Сумма КАК Сумма
	|ПОМЕСТИТЬ НачисленияПоСреднемуФормулы
	|ИЗ
	|	&НачисленияПоСреднемуФормулы КАК НачисленияПоСреднемуФормулы
	|ГДЕ
	|	НачисленияПоСреднемуФормулы.ПериодНачисления = &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	НачислениеПоФормулам.ПериодНачисления КАК ПериодНачисления,
	|	НачислениеПоФормулам.Абонент КАК Абонент,
	|	НачислениеПоФормулам.ТочкаУчета КАК ТочкаУчета,
	|	НачислениеПоФормулам.Услуга КАК Услуга,
	|	НачислениеПоФормулам.ЗначениеТарифа КАК ЗначениеТарифа,
	|	НачислениеПоФормулам.ПриборУчета КАК ПриборУчета,
	|	НачислениеПоФормулам.Поставщик КАК Поставщик,
	|	-НачислениеПоФормулам.Сумма КАК Сумма,
	|	-НачислениеПоФормулам.ОбъемУслуги КАК ОбъемУслуги
	|ПОМЕСТИТЬ НачислениеПоФормулам
	|ИЗ
	|	&НачислениеПоФормулам КАК НачислениеПоФормулам
	|ГДЕ
	|	НачислениеПоФормулам.ПериодНачисления = &ПериодНачисления
	|	И НачислениеПоФормулам.СписатьИзНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВложенныйЗапрос.ПриборЗависимой КАК ПриборЗависимой,
	|	СУММА(ВложенныйЗапрос.ОбъемУслуги) КАК ОбъемУслуги,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		НачисленияПоСреднемуФормулы.Организация КАК Организация,
	|		НачисленияПоСреднемуФормулы.ПериодНачисления КАК ПериодНачисления,
	|		НачисленияПоСреднемуФормулы.Абонент КАК Абонент,
	|		НачисленияПоСреднемуФормулы.ЗначениеТарифа КАК ЗначениеТарифа,
	|		НачисленияПоСреднемуФормулы.Поставщик КАК Поставщик,
	|		НачисленияПоСреднемуФормулы.ПриборУчета КАК ПриборУчета,
	|		НачисленияПоСреднемуФормулы.ТочкаУчета КАК ТочкаУчета,
	|		НачисленияПоСреднемуФормулы.Услуга КАК Услуга,
	|		НачисленияПоСреднемуФормулы.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|		НачисленияПоСреднемуФормулы.ПриборЗависимой КАК ПриборЗависимой,
	|		НачисленияПоСреднемуФормулы.ОбъемУслуги КАК ОбъемУслуги,
	|		НачисленияПоСреднемуФормулы.Сумма КАК Сумма
	|	ИЗ
	|		НачисленияПоСреднемуФормулы КАК НачисленияПоСреднемуФормулы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачислениеПоФормулам.Организация,
	|		НачислениеПоФормулам.ПериодНачисления,
	|		НачислениеПоФормулам.Абонент,
	|		НачислениеПоФормулам.ЗначениеТарифа,
	|		НачислениеПоФормулам.Поставщик,
	|		НачислениеПоФормулам.ПриборУчета,
	|		НачислениеПоФормулам.ТочкаУчета,
	|		НачислениеПоФормулам.Услуга,
	|		ЛОЖЬ,
	|		ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка),
	|		НачислениеПоФормулам.ОбъемУслуги,
	|		НачислениеПоФормулам.Сумма
	|	ИЗ
	|		НачислениеПоФормулам КАК НачислениеПоФормулам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеНачислений.Организация,
	|		ДанныеНачислений.ПериодНачисления,
	|		ДанныеНачислений.Абонент,
	|		ДанныеНачислений.ЗначениеТарифа,
	|		ДанныеНачислений.Поставщик,
	|		ДанныеНачислений.ПриборУчета,
	|		ДанныеНачислений.ТочкаУчета,
	|		ДанныеНачислений.Услуга,
	|		ЛОЖЬ,
	|		ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка),
	|		ДанныеНачислений.ОбъемУслуги,
	|		ДанныеНачислений.Сумма
	|	ИЗ
	|		ДанныеНачислений КАК ДанныеНачислений
	|	ГДЕ
	|		ДанныеНачислений.СпособНачисления В (ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему), ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу))
	|		И ДанныеНачислений.ПериодНачисления = &ПериодНачисления
	|		И ДанныеНачислений.Организация = &Организация) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.ЗначениеТарифа,
	|	ВложенныйЗапрос.Поставщик,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ЗависимаяТочкаУчета,
	|	ВложенныйЗапрос.ПриборЗависимой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НачислениеПоФормулам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НачисленияПоСреднемуФормулы";	
	
	Запрос.Текст 	= Текст;
	Возврат Запрос.Выполнить();
	
КонецФункции  

Функция ОписаниеРегистраНакопления(ИмяТаблицы)
	
	НачисленныйСреднийОбъем 	= Новый ТаблицаЗначений;	
	МетаданныеРегистра  		= Метаданные.РегистрыНакопления[ИмяТаблицы];
	
	для Каждого Измерение из МетаданныеРегистра.Измерения цикл
		НачисленныйСреднийОбъем.Колонки.Добавить(Измерение.имя,Измерение.Тип);
	КонецЦикла;
	
	для Каждого Ресурс из МетаданныеРегистра.Ресурсы цикл
		НачисленныйСреднийОбъем.Колонки.Добавить(Ресурс.имя,Ресурс.Тип);
	КонецЦикла;
	
	Возврат НачисленныйСреднийОбъем;
КонецФункции

Процедура ПрочитатьСтабильныеПериодыПерерасчет(МВТ,Организация,ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета,Район,ДанныеСтроения,Абонент)
	
	ТекстГраницОтчетногоПериода = энргНачисления.ТекстГраницОтчетногоПериода(ПериодНачисленияНачало,ПериодНачисленияКонец,Ложь);
	
	Объекты  					= Новый Структура;
	Объекты.Вставить("энргСостояниеЛС",									Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "Абонент = &Абонент", "ТаблицаРС.Абонент = &Абонент", НЕОПРЕДЕЛЕНО));
	
	Объекты.Вставить("энргГруппыПотребителейАбонентов",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО));
	
	Объекты.Вставить("энргВидБлагоустройствАбонента",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энргКоличествоКомнат",							Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энргЗначенияПлощадей",							Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО));
	
	Объекты.Вставить("энргКоличествоПрописанных",						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энргКоличествоСобственников",						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энргКоличествоПроживающих",						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энргАбонентыОтключаемыеВНеполивнойСезон",			Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "Абонент = &Абонент", "ТаблицаРС.Абонент = &Абонент", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энгрЗначенияНормативовПотребленияАбонентов",		Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энргТипСобственностиАбонентов",		Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", НЕОПРЕДЕЛЕНО ));
	
	Объекты.Вставить("энргВладельцыТочекУчета",							Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "АбонентВладелец = &КлючПомещения", "ТаблицаРС.АбонентВладелец = &КлючПомещения", "ТочкаУчета"));  	
	
	Объекты.Вставить("энргАктивностьТочекУчета",						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
	Объекты.Вставить("энргПриборыТочекУчета",							Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
	Объекты.Вставить("энргСостояниеПриборовУчетаАбонента",				Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета" ));
	
	Объекты.Вставить("энргУслугиТочекУчета",							Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
	Объекты.Вставить("энргРасчетныеСпособыТочекУчета",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
	Объекты.Вставить("энргФормулыРасчетаТочекУчета",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "РассчитываемаяТочка" ));
	
	Объекты.Вставить("энргПоставщикиУслугАбонента",						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
	Объекты.Вставить("энргКоэффциентыПриборовУчета",					Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета" ));
	
	Объекты.Вставить("энргДатыПоверкиПрибораУчета",						Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета" ));
			
	Объекты.Вставить("энргВидыДифференцированностиПриборовУчета",		Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
	Объекты.Вставить("энргНаправлениеИспользованияТочекУчета",			Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
	Объекты.Вставить("энргДиаметрСеченияТочекУчета",				Новый Структура("
	|Условие, УсловиеТаблицы, СвойствоТочки", "КлючПомещения = &КлючПомещения", "ТаблицаРС.КлючПомещения = &КлючПомещения", "ТочкаУчета"));
	
			
	ИтоговыйТекст  				= 
	"ВЫБРАТЬ * 
	|ПОМЕСТИТЬ ГраницыОтчетногоПериода
	|ИЗ 
	|	(" + ТекстГраницОтчетногоПериода + ") КАК ВложенныйЗапрос
	|;
	|///////////
	|";
	
	ТекстНаборПериодов 			= "";
	
	ШаблонНаборПериодов 		= 
	"ВЫБРАТЬ
	|	вТаблица.Регистратор КАК ДокРегистратор,
	|	вТаблица.Период КАК Период, 	
	|	ВЫБОР 
	|		КОГДА вТаблица.ПериодРегистрации > вТаблица.Период
	|			ТОГДА  вТаблица.Период
	|		ИНАЧЕ вТаблица.ПериодРегистрации
	|	КОНЕЦ  КАК ПериодРегистрации,
	|	вТаблица.ТочкаУчета КАК ТочкаУчета
	|ИЗ 
	|	Набор%%ИмяТаблицы%%  КАК вТаблица";
	
			
	ШаблонГраницыРС				= 
	"ВЫБРАТЬ
	|	%%СтрокаресурсыИзмерения%%
	|   , ТаблицаРС.Регистратор КАК ДокРегистратор
	|   , ТаблицаРС.Период КАК ПериодС
	|	, МИНИМУМ(ЕСТЬNULL(ТаблицаКонец.Период,ДОБАВИТЬКДАТЕ(&КонецПериода,СЕКУНДА,1))) КАК ПериодПо
	|ПОМЕСТИТЬ Набор%%ИмяТаблицы%%Границы
	|ИЗ
	|	Набор%%ИмяТаблицы%% КАК ТаблицаРС
	|		ЛЕВОЕ СОЕДИНЕНИЕ НАбор%%ИмяТаблицы%% КАК ТаблицаКонец
	|		ПО %%СтрокаСоединенения%%
	|		И (ВЫБОР
	|			КОГДА ТаблицаРС.Период < ТаблицаКонец.Период
	|				ТОГДА ИСТИНА
	|			КОГДА ТаблицаРС.Период = ТаблицаКонец.Период
	|					И ТаблицаРС.ПериодРегистрации < ТаблицаКонец.ПериодРегистрации
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаРС.Период = ТаблицаКонец.Период
	|					И ТаблицаРС.ПериодРегистрации = ТаблицаКонец.ПериодРегистрации
	|					И ТаблицаРС.Регистратор < ТаблицаКонец.Регистратор
	|		КОНЕЦ)	
	|СГРУППИРОВАТЬ ПО
	|   %%СтрокаресурсыИзмерения%%
	|	,ТаблицаРС.Регистратор
	|	,ТаблицаРС.Период";
	
	ШаблонЗаписиЗаПериод  		=
	"ВЫБРАТЬ
	|	%%СтрокаресурсыИзмерения%%
	|	,&НачалоПериода КАК Период
	|	,ТаблицаРС.Регистратор КАК Регистратор
	|	,ВЫБОР КОГДА ТаблицаРС.ПериодРегистрации < &НачалоПериода Тогда &НачалоПериода ИНАЧЕ ТаблицаРС.ПериодРегистрации КОНЕЦ КАК ПериодРегистрации
	|ПОМЕСТИТЬ Набор%%ИмяТаблицы%%
	|ИЗ
	|	РегистрСведений.%%ИмяТаблицы%%.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1),
	|			Организация = &Организация
	|				И Район = &Район
	|				И %%ДополнительноеУсловие%%) КАК ТаблицаРС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	%%СтрокаресурсыИзмерения%%
	|	,КОНЕЦПЕРИОДА(ТаблицаРС.Период,ДЕНЬ) КАК Период 
	|	,ТаблицаРС.Регистратор
	|	,ТаблицаРС.ПериодРегистрации
	|ИЗ
	|	РегистрСведений.%%ИмяТаблицы%% КАК ТаблицаРС
	|ГДЕ
	|	ТаблицаРС.Период >= &НачалоПериода
	|	И ТаблицаРС.Период < &КонецПериода
	|	И ТаблицаРС.Организация = &Организация
	|	И ТаблицаРС.Район = &Район
	|	И %%ДополнительноеУсловиеТаблица%%";
	
	ГлавСчетчик					= 0;
		
	для Каждого объект из Объекты цикл
		
		СтрокаСоединения  		= "";
		Метад 					= Метаданные.РегистрыСведений[объект.Ключ]; 
		Измерения  				= Метад.Измерения;
		Ресурсы 				= Метад.Ресурсы; 
		
		ТексПериода 			= "";
		Сч 						= 0;
		ИзмеренияРесурсы  		= "";
		
		СтрокаРесурсов 			= "";
		
		// Измерения		
		для Каждого Измерение из Измерения цикл
			ИзмеренияРесурсы	= ИзмеренияРесурсы 	+ ?(Сч > 0,Символы.ПС + ",","")  + " ТаблицаРС." +  Измерение.Имя +"";
			СтрокаСоединения 	= СтрокаСоединения 	+ ?(Сч > 0,Символы.ПС + "И ","")  + " %%ТаблицаИсточник%%." +  Измерение.Имя +" = %%ТаблицаПриемник%%." + Измерение.Имя; 
			Сч 					= Сч + 1;
		КонецЦикла;
		
		//  Ресурсы.
		для Каждого Ресурс из Ресурсы цикл
			ИзмеренияРесурсы	= ИзмеренияРесурсы 	+ Символы.ПС +?(Сч > 0,",","")  + " ТаблицаРС." +  Ресурс.Имя +"";
			Сч 					= Сч + 1;
		КонецЦикла; 
		
		Если НЕ объект.Значение.СвойствоТочки = Неопределено Тогда
			ИзмеренияРесурсы	= ИзмеренияРесурсы 	+ Символы.ПС +?(Сч > 0,",","")  + " ТаблицаРС." +  объект.Значение.СвойствоТочки +"";
		КонецЕсли;		
		
		ТексПериода 			= СтрЗаменить(ШаблонЗаписиЗаПериод,"%%СтрокаресурсыИзмерения%%", 	ИзмеренияРесурсы);
		ТексПериода 			= СтрЗаменить(ТексПериода,"%%ДополнительноеУсловие%%", 				объект.Значение.Условие);
		ТексПериода 			= СтрЗаменить(ТексПериода,"%%ДополнительноеУсловиеТаблица%%", 		объект.Значение.УсловиеТаблицы);
		ТексПериода 			= СтрЗаменить(ТексПериода,"%%ИмяТаблицы%%", 						объект.Ключ);
						
		// Сформировать границы регистра.		
		ТексПериода 			= ТексПериода + Символы.ПС + ";" + Символы.ПС + "//////////"+ Символы.ПС;
		
		ГраницыРС 				= ""; 		
		ГраницыРС 				= СтрЗаменить(ШаблонГраницыРС,"%%СтрокаресурсыИзмерения%%",ИзмеренияРесурсы);
		ГраницыРС 				= СтрЗаменить(ГраницыРС,"%%ИмяТаблицы%%",объект.Ключ);
		ГраницыРС 				= СтрЗаменить(ГраницыРС,"%%СтрокаСоединенения%%",СтрокаСоединения);
		ГраницыРС 				= СтрЗаменить(ГраницыРС,"%%ТаблицаИсточник%%","ТаблицаРС");
		ГраницыРС 				= СтрЗаменить(ГраницыРС,"%%ТаблицаПриемник%%","ТаблицаКонец");
		
		ИтоговыйТекст 			= ИтоговыйТекст + ?(ГлавСчетчик>0,Символы.ПС + ";" + Символы.ПС + "//////////"+ Символы.ПС,"")  + ТексПериода;
		
		ИтоговыйТекст 			= ИтоговыйТекст + ГраницыРС;
		
		ВрТекст 				= СтрЗаменить(ШаблонНаборПериодов,"%%ИмяТаблицы%%",объект.Ключ);
		
		Если объект.Значение.СвойствоТочки = Неопределено Тогда
			ВрТекст 			= СтрЗаменить(ВрТекст,"вТаблица.ТочкаУчета КАК ТочкаУчета","НЕОПРЕДЕЛЕНО КАК ТочкаУчета");
		Иначе
			ВрТекст 			= СтрЗаменить(ВрТекст,"вТаблица.ТочкаУчета КАК ТочкаУчета","вТаблица." + объект.Значение.СвойствоТочки + " КАК ТочкаУчета");
		КонецЕсли;
				
		ТекстНаборПериодов  	= ТекстНаборПериодов + ?(ГлавСчетчик>0,Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС ,"")  + ВрТекст;
		
		ГлавСчетчик 			= ГлавСчетчик + 1;				
	КонецЦикла;
	
	ТекстНаборПериодов  		=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ТочкаУчета
	|ПОМЕСТИТЬ НаборПериодов 
	|ИЗ 
	|	(" + ТекстНаборПериодов + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	| 	Значение(Документ.энргНачисление.ПустаяСсылка), 
	| 	ГраницыОтчетногоПериода.НачалоОП,
	| 	ГраницыОтчетногоПериода.НачалоОП,
	| 	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	| 	Значение(Документ.энргНачисление.ПустаяСсылка),
	|	ГраницыОтчетногоПериода.ЗавершениеОП,
	|	ГраницыОтчетногоПериода.ЗавершениеОП,
	| 	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода) КАК ВложенныйЗапрос";
	
	
	ИтоговыйТекст 				= ИтоговыйТекст + Символы.ПС + ";" + Символы.ПС + "//////////"+ Символы.ПС +ТекстНаборПериодов;
		
	ИтоговыйТекст 				= ИтоговыйТекст + Символы.ПС + ";" + Символы.ПС + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаборэнргАктивностьТочекУчета.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВсеТочкиУчета
	|ИЗ
	|	НаборэнргАктивностьТочекУчета КАК НаборэнргАктивностьТочекУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПериодов.ДокРегистратор КАК ДокРегистратор,
	|	НаборПериодов.Период КАК Период,
	|	НаборПериодов.ТочкаУчета КАК ТочкаУчета,
	|	НаборПериодов.ПериодРегистрации КАК ПериодРегистрации
	|ПОМЕСТИТЬ НаборПериодовТочкиУчета
	|ИЗ
	|	НаборПериодов КАК НаборПериодов
	|ГДЕ
	|	НЕ НаборПериодов.ТочкаУчета = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборПериодов.ДокРегистратор,
	|	НаборПериодов.Период,
	|	ВсеТочкиУчета.ТочкаУчета,
	|	НаборПериодов.ПериодРегистрации
	|ИЗ
	|	ВсеТочкиУчета КАК ВсеТочкиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПериодов КАК НаборПериодов
	|		ПО (НаборПериодов.ТочкаУчета = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|	энргПериодыПриемаПоказаний.ДатаС КАК ДатаС,
	|	энргПериодыПриемаПоказаний.ДатаПо КАК ДатаПо
	|ПОМЕСТИТЬ ПериодыПриемаПоказаний
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП,
	|		МАКСИМУМ(энргПериодыПриемаПоказаний.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПериодыПриемаПоказаний КАК энргПериодыПриемаПоказаний
	|			ПО ГраницыОтчетногоПериода.Организация = энргПериодыПриемаПоказаний.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргПериодыПриемаПоказаний.Период
	|				И (энргПериодыПриемаПоказаний.Организация = &Организация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		ГраницыОтчетногоПериода.НачалоОП) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПериодыПриемаПоказаний КАК энргПериодыПриемаПоказаний
	|		ПО ВложенныйЗапрос.Организация = энргПериодыПриемаПоказаний.Организация
	|			И ВложенныйЗапрос.Период = энргПериодыПриемаПоказаний.Период
	|			И (энргПериодыПриемаПоказаний.Организация = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	энргПоставщикиНеНачислять.Поставщик КАК Коэффициент
	|ПОМЕСТИТЬ ПоставщикиНеНачислять
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргПоставщикиНеНачислять.Район КАК Район,
	|		МАКСИМУМ(энргПоставщикиНеНачислять.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоставщикиНеНачислять КАК энргПоставщикиНеНачислять
	|			ПО ГраницыОтчетногоПериода.Организация = энргПоставщикиНеНачислять.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргПоставщикиНеНачислять.Период
	|				И (энргПоставщикиНеНачислять.Организация = &Организация)
	|				И (энргПоставщикиНеНачислять.Район = &Район)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргПоставщикиНеНачислять.Район) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоставщикиНеНачислять КАК энргПоставщикиНеНачислять
	|		ПО ВложенныйЗапрос.Организация = энргПоставщикиНеНачислять.Организация
	|			И ВложенныйЗапрос.Период = энргПоставщикиНеНачислять.Период
	|			И ВложенныйЗапрос.Район = энргПоставщикиНеНачислять.Район
	|			И (энргПоставщикиНеНачислять.Организация = &Организация)
	|			И (энргПоставщикиНеНачислять.Район = &Район)
	|			И (энргПоставщикиНеНачислять.Использование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	энгрЗначенияПовышающихКоэффициентов.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ЗначенияПовышающихКоэффициентов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энгрЗначенияПовышающихКоэффициентов.Район КАК Район,
	|		МАКСИМУМ(энгрЗначенияПовышающихКоэффициентов.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энгрЗначенияПовышающихКоэффициентов КАК энгрЗначенияПовышающихКоэффициентов
	|			ПО ГраницыОтчетногоПериода.Организация = энгрЗначенияПовышающихКоэффициентов.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энгрЗначенияПовышающихКоэффициентов.Период
	|				И (энгрЗначенияПовышающихКоэффициентов.Организация = &Организация)
	|				И (энгрЗначенияПовышающихКоэффициентов.Район = &Район)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энгрЗначенияПовышающихКоэффициентов.Район) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энгрЗначенияПовышающихКоэффициентов КАК энгрЗначенияПовышающихКоэффициентов
	|		ПО ВложенныйЗапрос.Организация = энгрЗначенияПовышающихКоэффициентов.Организация
	|			И ВложенныйЗапрос.Период = энгрЗначенияПовышающихКоэффициентов.Период
	|			И ВложенныйЗапрос.Район = энгрЗначенияПовышающихКоэффициентов.Район
	|			И (энгрЗначенияПовышающихКоэффициентов.Организация = &Организация)
	|			И (энгрЗначенияПовышающихКоэффициентов.Район = &Район)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючНорматива КАК КлючНорматива,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргЗначенияНормативовПотребления.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		энргЗначенияНормативовПотребления.Район КАК Район,
	|		энргЗначенияНормативовПотребления.КлючНорматива КАК КлючНорматива,
	|		энргЗначенияНормативовПотребления.ТипНачисления КАК ТипНачисления,
	|		энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		энргЗначенияНормативовПотребления.Услуга КАК Услуга,
	|		МАКСИМУМ(энргЗначенияНормативовПотребления.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|			ПО ГраницыОтчетногоПериода.Организация = энргЗначенияНормативовПотребления.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначенияНормативовПотребления.Период
	|				И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|				И (энргЗначенияНормативовПотребления.Район = &Район)
	|				И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		ГраницыОтчетногоПериода.Организация,
	|		энргЗначенияНормативовПотребления.Район,
	|		энргЗначенияНормативовПотребления.КлючНорматива,
	|		энргЗначенияНормативовПотребления.ТипНачисления,
	|		энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ,
	|		энргЗначенияНормативовПотребления.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|		ПО ВложенныйЗапрос.Организация = энргЗначенияНормативовПотребления.Организация
	|			И ВложенныйЗапрос.Район = энргЗначенияНормативовПотребления.Район
	|			И ВложенныйЗапрос.КлючНорматива = энргЗначенияНормативовПотребления.КлючНорматива
	|			И ВложенныйЗапрос.Услуга = энргЗначенияНормативовПотребления.Услуга
	|			И ВложенныйЗапрос.ТипНачисления = энргЗначенияНормативовПотребления.ТипНачисления
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.Период = энргЗначенияНормативовПотребления.Период
	|			И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|			И (энргЗначенияНормативовПотребления.Район = &Район)
	|			И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифов.Значение КАК Значение,
	|	энргЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифов.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифов.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргЗначенияТарифов.Район КАК Район,
	|		энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|		энргЗначенияТарифов.Услуга КАК Услуга,
	|		энргЗначенияТарифов.Поставщик КАК Поставщик,
	|		энргЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МАКСИМУМ(энргЗначенияТарифов.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|			ПО ГраницыОтчетногоПериода.Организация = энргЗначенияТарифов.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначенияТарифов.Период
	|				И (энргЗначенияТарифов.Организация = &Организация)
	|				И (энргЗначенияТарифов.Район = &Район)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргЗначенияТарифов.Район,
	|		энргЗначенияТарифов.ГруппаПотребителей,
	|		энргЗначенияТарифов.Услуга,
	|		энргЗначенияТарифов.Поставщик,
	|		энргЗначенияТарифов.ТарифнаяЗона) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ПО ВложенныйЗапрос.Организация = энргЗначенияТарифов.Организация
	|			И ВложенныйЗапрос.Район = энргЗначенияТарифов.Район
	|			И ВложенныйЗапрос.ГруппаПотребителей = энргЗначенияТарифов.ГруппаПотребителей
	|			И ВложенныйЗапрос.Услуга = энргЗначенияТарифов.Услуга
	|			И ВложенныйЗапрос.Поставщик = энргЗначенияТарифов.Поставщик
	|			И ВложенныйЗапрос.ТарифнаяЗона = энргЗначенияТарифов.ТарифнаяЗона
	|			И ВложенныйЗапрос.Период = энргЗначенияТарифов.Период
	|			И (энргЗначенияТарифов.Организация = &Организация)
	|			И (энргЗначенияТарифов.Район = &Район)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	энргНормаСкоростиДвиженияВоды.СкоростьДвижения КАК СкоростьДвижения
	|ПОМЕСТИТЬ НормаСкоростиДвиженияВоды
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		МАКСИМУМ(энргНормаСкоростиДвиженияВоды.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНормаСкоростиДвиженияВоды КАК энргНормаСкоростиДвиженияВоды
	|			ПО ГраницыОтчетногоПериода.Организация = энргНормаСкоростиДвиженияВоды.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргНормаСкоростиДвиженияВоды.Период
	|				И (энргНормаСкоростиДвиженияВоды.Организация = &Организация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНормаСкоростиДвиженияВоды КАК энргНормаСкоростиДвиженияВоды
	|		ПО ВложенныйЗапрос.Организация = энргНормаСкоростиДвиженияВоды.Организация
	|			И ВложенныйЗапрос.Период = энргНормаСкоростиДвиженияВоды.Период
	|			И (энргНормаСкоростиДвиженияВоды.Организация = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользования,
	|	ВложенныйЗапрос.МКД КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.Коэффициент КАК КоэффициентНорматива,
	|	НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность КАК КоэффициентНеПрименятьСезонность,
	|	НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	(ВЫБРАТЬ
	|		НастройкаСезонностиУслуг.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		НастройкаСезонностиУслуг.Район КАК Район,
	|		НастройкаСезонностиУслуг.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		НастройкаСезонностиУслуг.МКД КАК МКД,
	|		НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|		МАКСИМУМ(НастройкаСезонностиУслуг.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаСезонностиУслуг КАК НастройкаСезонностиУслуг
	|			ПО ГраницыОтчетногоПериода.Организация = НастройкаСезонностиУслуг.Организация
	|				И (НастройкаСезонностиУслуг.Организация = &Организация)
	|				И (НастройкаСезонностиУслуг.Район = &Район)
	|				И (НастройкаСезонностиУслуг.МКД = &МКД
	|					ИЛИ НастройкаСезонностиУслуг.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > НастройкаСезонностиУслуг.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НастройкаСезонностиУслуг.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		НастройкаСезонностиУслуг.Район,
	|		НастройкаСезонностиУслуг.НаправлениеИспользованияТУ,
	|		НастройкаСезонностиУслуг.МКД,
	|		НастройкаСезонностиУслуг.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаСезонностиУслуг КАК НастройкаСезонностиУслуг
	|		ПО ВложенныйЗапрос.Организация = НастройкаСезонностиУслуг.Организация
	|			И ВложенныйЗапрос.Район = НастройкаСезонностиУслуг.Район
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = НастройкаСезонностиУслуг.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.МКД = НастройкаСезонностиУслуг.МКД
	|			И ВложенныйЗапрос.Услуга = НастройкаСезонностиУслуг.Услуга
	|			И ВложенныйЗапрос.Период = НастройкаСезонностиУслуг.Период
	|			И (НастройкаСезонностиУслуг.Организация = &Организация)
	|			И (НастройкаСезонностиУслуг.Район = &Район)
	|			И (НастройкаСезонностиУслуг.МКД = &МКД
	|				ИЛИ НастройкаСезонностиУслуг.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТипСхемы КАК ТипСхемы,
	|	ВложенныйЗапрос.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКД.ПредставлениеУслуги КАК ПредставлениеУслуги,
	|	энргНастройкаНачисленияГВСМКД.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргНастройкаНачисленияГВСМКД.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргНастройкаНачисленияГВСМКД.Район КАК Район,
	|		энргНастройкаНачисленияГВСМКД.МКД КАК МКД,
	|		энргНастройкаНачисленияГВСМКД.Услуга КАК Услуга,
	|		энргНастройкаНачисленияГВСМКД.ТипСхемы КАК ТипСхемы,
	|		энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|		МАКСИМУМ(энргНастройкаНачисленияГВСМКД.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаНачисленияГВСМКД КАК энргНастройкаНачисленияГВСМКД
	|			ПО ГраницыОтчетногоПериода.Организация = энргНастройкаНачисленияГВСМКД.Организация
	|				И (энргНастройкаНачисленияГВСМКД.Организация = &Организация)
	|				И (энргНастройкаНачисленияГВСМКД.Район = &Район)
	|				И (энргНастройкаНачисленияГВСМКД.МКД = &МКД
	|					ИЛИ энргНастройкаНачисленияГВСМКД.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргНастройкаНачисленияГВСМКД.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргНастройкаНачисленияГВСМКД.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргНастройкаНачисленияГВСМКД.Район,
	|		энргНастройкаНачисленияГВСМКД.МКД,
	|		энргНастройкаНачисленияГВСМКД.Услуга,
	|		энргНастройкаНачисленияГВСМКД.ТипСхемы,
	|		энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаНачисленияГВСМКД КАК энргНастройкаНачисленияГВСМКД
	|		ПО ВложенныйЗапрос.Организация = энргНастройкаНачисленияГВСМКД.Организация
	|			И ВложенныйЗапрос.Район = энргНастройкаНачисленияГВСМКД.Район
	|			И ВложенныйЗапрос.МКД = энргНастройкаНачисленияГВСМКД.МКД
	|			И ВложенныйЗапрос.Услуга = энргНастройкаНачисленияГВСМКД.Услуга
	|			И ВложенныйЗапрос.ТипСхемы = энргНастройкаНачисленияГВСМКД.ТипСхемы
	|			И ВложенныйЗапрос.ПринадлежностьКТепловомуПункту = энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту
	|			И ВложенныйЗапрос.Период = энргНастройкаНачисленияГВСМКД.Период
	|			И (энргНастройкаНачисленияГВСМКД.Организация = &Организация)
	|			И (энргНастройкаНачисленияГВСМКД.Район = &Район)
	|			И (энргНастройкаНачисленияГВСМКД.МКД = &МКД
	|				ИЛИ энргНастройкаНачисленияГВСМКД.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК Строение,
	|	энргТипСхемыГВС.ТипСхемы КАК ТипСхемы
	|ПОМЕСТИТЬ ТипСхемыГВС
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргТипСхемыГВС.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргТипСхемыГВС.Район КАК Район,
	|		энргТипСхемыГВС.МКД КАК МКД,
	|		МАКСИМУМ(энргТипСхемыГВС.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргТипСхемыГВС КАК энргТипСхемыГВС
	|			ПО ГраницыОтчетногоПериода.Организация = энргТипСхемыГВС.Организация
	|				И (энргТипСхемыГВС.Организация = &Организация)
	|				И (энргТипСхемыГВС.Район = &Район)
	|				И (энргТипСхемыГВС.МКД = &МКД)
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргТипСхемыГВС.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргТипСхемыГВС.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргТипСхемыГВС.Район,
	|		энргТипСхемыГВС.МКД) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргТипСхемыГВС КАК энргТипСхемыГВС
	|		ПО ВложенныйЗапрос.Организация = энргТипСхемыГВС.Организация
	|			И ВложенныйЗапрос.Район = энргТипСхемыГВС.Район
	|			И ВложенныйЗапрос.МКД = энргТипСхемыГВС.МКД
	|			И ВложенныйЗапрос.Период = энргТипСхемыГВС.Период
	|			И (энргТипСхемыГВС.Организация = &Организация)
	|			И (энргТипСхемыГВС.Район = &Район)
	|			И (энргТипСхемыГВС.МКД = &МКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК Строение,
	|	энргТипПринадлежностиМКД.ВидТепловогоПункта КАК ВидТепловогоПункта
	|ПОМЕСТИТЬ ВидыТепловыхПунктов
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргТипПринадлежностиМКД.Организация КАК Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргТипПринадлежностиМКД.Район КАК Район,
	|		энргТипПринадлежностиМКД.МКД КАК МКД,
	|		МАКСИМУМ(энргТипПринадлежностиМКД.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргТипПринадлежностиМКД КАК энргТипПринадлежностиМКД
	|			ПО ГраницыОтчетногоПериода.Организация = энргТипПринадлежностиМКД.Организация
	|				И (энргТипПринадлежностиМКД.Организация = &Организация)
	|				И (энргТипПринадлежностиМКД.Район = &Район)
	|				И (энргТипПринадлежностиМКД.МКД = &МКД)
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргТипПринадлежностиМКД.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргТипПринадлежностиМКД.Организация,
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргТипПринадлежностиМКД.Район,
	|		энргТипПринадлежностиМКД.МКД) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргТипПринадлежностиМКД КАК энргТипПринадлежностиМКД
	|		ПО ВложенныйЗапрос.Организация = энргТипПринадлежностиМКД.Организация
	|			И ВложенныйЗапрос.Район = энргТипПринадлежностиМКД.Район
	|			И ВложенныйЗапрос.МКД = энргТипПринадлежностиМКД.МКД
	|			И ВложенныйЗапрос.Период = энргТипПринадлежностиМКД.Период
	|			И (энргТипПринадлежностиМКД.Организация = &Организация)
	|			И (энргТипПринадлежностиМКД.Район = &Район)
	|			И (энргТипПринадлежностиМКД.МКД = &МКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргВыводПриборовУчета.Организация КАК Организация,
	|	энргВыводПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргВыводПриборовУчета.Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	энргВыводПриборовУчета.Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	энргВыводПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргВыводПриборовУчета.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеВыводаПрибораУчета
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргВыводПриборовУчета КАК энргВыводПриборовУчета
	|		ПО ГраницыОтчетногоПериода.Организация = энргВыводПриборовУчета.Организация
	|			И (энргВыводПриборовУчета.Организация = &Организация)
	|			И (энргВыводПриборовУчета.Район = &Район)
	|			И (энргВыводПриборовУчета.Строение = &МКД)
	|			И (энргВыводПриборовУчета.КлючПомещения = &КлючПомещения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.НачПер КАК НачПер,
	|	ВложенныйЗапрос.КонПер КАК КонПер
	|ПОМЕСТИТЬ ГраницыПериодов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Начало.ДокРегистратор КАК ДокРегистратор,
	|		Начало.ТочкаУчета КАК ТочкаУчета,
	|		Начало.Период КАК НачПер,
	|		Начало.ПериодРегистрации КАК ПериодРегистрации,
	|		МИНИМУМ(КОНЕЦ.Период) КАК КонПер
	|	ИЗ
	|		НаборПериодовТочкиУчета КАК Начало
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПериодовТочкиУчета КАК КОНЕЦ
	|			ПО Начало.ТочкаУчета = КОНЕЦ.ТочкаУчета
	|				И (ВЫБОР
	|					КОГДА Начало.Период < КОНЕЦ.Период
	|						ТОГДА ИСТИНА
	|					КОГДА Начало.Период = КОНЕЦ.Период
	|							И Начало.ПериодРегистрации < КОНЕЦ.ПериодРегистрации
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Начало.Период = КОНЕЦ.Период
	|							И Начало.ПериодРегистрации = КОНЕЦ.ПериодРегистрации
	|							И Начало.ДокРегистратор < КОНЕЦ.ДокРегистратор
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Начало.ДокРегистратор,
	|		Начало.ТочкаУчета,
	|		Начало.ПериодРегистрации,
	|		Начало.Период) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.КонПер <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	&Абонент КАК Абонент,
	|	ГраницыОтчетногоПериода.НачалоОП КАК НачалоОП,
	|	ГраницыОтчетногоПериода.ЗавершениеОП КАК ЗавершениеОП,
	|	ГраницыОтчетногоПериода.ДнейВПериоде КАК ДнейВПериоде,
	|	ГраницыПериодов.ДокРегистратор КАК ДокРегистратор,
	|	ГраницыПериодов.ПериодРегистрации КАК ПериодРегистрации,
	|	ГраницыПериодов.НачПер КАК НачПер,
	|	ГраницыПериодов.КонПер КАК КонПер,
	|	ГраницыПериодов.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(НаборэнргСостояниеЛСГраницы.Состояние, ЛОЖЬ) КАК СостояниеЛС,
	|	ЕСТЬNULL(НаборэнргКоличествоКомнатГраницы.Количество, 0) КАК КоличествоКомнат,
	|	ЕСТЬNULL(НаборэнргКоличествоПрописанныхГраницы.Количество, 0) КАК КоличествоПрописанных,
	|	ЕСТЬNULL(НаборэнргКоличествоСобственниковГраницы.Количество, 1) КАК КоличествоСобственников,
	|	ЕСТЬNULL(НаборэнргКоличествоПроживающихГраницы.Количество, 0) КАК КоличествоПроживающих,
	|	ЕСТЬNULL(НаборэнргТипСобственностиАбонентовГраницы.ТипСобственности, ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ЧастнаяСобственность)) КАК ВидСобственности
	|ПОМЕСТИТЬ ОбщиеДанные
	|ИЗ
	|	ГраницыПериодов КАК ГраницыПериодов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргСостояниеЛСГраницы КАК НаборэнргСостояниеЛСГраницы
	|		ПО (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргСостояниеЛСГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргСостояниеЛСГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргСостояниеЛСГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргТипСобственностиАбонентовГраницы КАК НаборэнргТипСобственностиАбонентовГраницы
	|		ПО (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргТипСобственностиАбонентовГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргТипСобственностиАбонентовГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргТипСобственностиАбонентовГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргКоличествоКомнатГраницы КАК НаборэнргКоличествоКомнатГраницы
	|		ПО (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргКоличествоКомнатГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргКоличествоКомнатГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргКоличествоКомнатГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргКоличествоПрописанныхГраницы КАК НаборэнргКоличествоПрописанныхГраницы
	|		ПО (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргКоличествоПрописанныхГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргКоличествоПрописанныхГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргКоличествоПрописанныхГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргКоличествоСобственниковГраницы КАК НаборэнргКоличествоСобственниковГраницы
	|		ПО (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргКоличествоСобственниковГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргКоличествоСобственниковГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргКоличествоСобственниковГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргКоличествоПроживающихГраницы КАК НаборэнргКоличествоПроживающихГраницы
	|		ПО (ВЫБОР
	|				КОГДА ГраницыПериодов.НачПер = ГраницыПериодов.КонПер
	|					ТОГДА ГраницыПериодов.ДокРегистратор = НаборэнргКоличествоПроживающихГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргКоличествоПроживающихГраницы.ПериодС <= ГраницыПериодов.НачПер
	|						И НаборэнргКоличествоПроживающихГраницы.ПериодПо >= ГраницыПериодов.КонПер
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|		ПО ГраницыПериодов.НачПер >= ГраницыОтчетногоПериода.НачалоОП
	|			И ГраницыПериодов.КонПер <= ГраницыОтчетногоПериода.ЗавершениеОП
	|ГДЕ
	|	НЕ ГраницыОтчетногоПериода.ПериодНачисления ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеДанные.Организация КАК Организация,
	|	ОбщиеДанные.ПериодНачисления КАК ПериодНачисления,
	|	ОбщиеДанные.Район КАК Район,
	|	ОбщиеДанные.ЧастныйСектор КАК ЧастныйСектор,
	|	ОбщиеДанные.Строение КАК Строение,
	|	ОбщиеДанные.Помещение КАК Помещение,
	|	ОбщиеДанные.Абонент КАК Абонент,
	|	ОбщиеДанные.ДнейВПериоде КАК ДнейВПериоде,
	|	ОбщиеДанные.ПериодРегистрации КАК ПериодРегистрации,
	|	ОбщиеДанные.НачПер КАК НачПер,
	|	ОбщиеДанные.КонПер КАК КонПер,
	|	ОбщиеДанные.ДокРегистратор КАК ДокРегистратор,
	|	ОбщиеДанные.НачалоОП КАК НачалоОП,
	|	ОбщиеДанные.ЗавершениеОП КАК ЗавершениеОП,
	|	ОбщиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ОбщиеДанные.СостояниеЛС КАК СостояниеЛС,
	|	ВЫБОР
	|		КОГДА НаборэнргАктивностьТочекУчетаГраницы.Состояние ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НаборэнргАктивностьТочекУчетаГраницы.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УслугаПодключена,
	|	НаборэнргУслугиТочекУчетаГраницы.Услуга КАК Услуга,
	|	ОбщиеДанные.КоличествоКомнат КАК КоличествоКомнат,
	|	ОбщиеДанные.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ОбщиеДанные.КоличествоСобственников КАК КоличествоСобственников,
	|	ОбщиеДанные.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ОбщиеДанные.ВидСобственности КАК ВидСобственности,
	|	ЕСТЬNULL(НаборэнргПриборыТочекУчетаГраницы.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ПриборУчета,
	|	ЕСТЬNULL(НаборэнргРасчетныеСпособыТочекУчетаГраницы.РасчетныйСпособ, ЛОЖЬ) КАК РасчетПоФормуле,
	|	ЕСТЬNULL(НаборэнргФормулыРасчетаТочекУчетаГраницы.РассчитываемаяТочка, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ЗависимаяТочкаУчета,
	|	ЕСТЬNULL(НаборэнргФормулыРасчетаТочекУчетаГраницы.Коэффициент, 0) КАК КоэффициентРасчета,
	|	ЕСТЬNULL(НаборэнргНаправлениеИспользованияТочекУчетаГраницы.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ,
	|	ЕСТЬNULL(НаборэнргДиаметрСеченияТочекУчетаГраницы.Использовать, ЛОЖЬ) КАК ИспользоватьДиаметрСечения,
	|	ЕСТЬNULL(НаборэнргДиаметрСеченияТочекУчетаГраницы.ДиаметрСечения, 0) КАК ДиаметрСечения
	|ПОМЕСТИТЬ ДанныеПриборовУчета
	|ИЗ
	|	ОбщиеДанные КАК ОбщиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргАктивностьТочекУчетаГраницы КАК НаборэнргАктивностьТочекУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|					ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргАктивностьТочекУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргАктивностьТочекУчетаГраницы.ПериодС <= ОбщиеДанные.НачПер
	|						И НаборэнргАктивностьТочекУчетаГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|			КОНЕЦ)
	|			И ОбщиеДанные.ТочкаУчета = НаборэнргАктивностьТочекУчетаГраницы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргУслугиТочекУчетаГраницы КАК НаборэнргУслугиТочекУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|					ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргУслугиТочекУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргУслугиТочекУчетаГраницы.ПериодС <= ОбщиеДанные.НачПер
	|						И НаборэнргУслугиТочекУчетаГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|			КОНЕЦ)
	|			И ОбщиеДанные.ТочкаУчета = НаборэнргУслугиТочекУчетаГраницы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргПриборыТочекУчетаГраницы КАК НаборэнргПриборыТочекУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|					ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргПриборыТочекУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргПриборыТочекУчетаГраницы.ПериодС <= ОбщиеДанные.НачПер
	|						И НаборэнргПриборыТочекУчетаГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|			КОНЕЦ)
	|			И ОбщиеДанные.ТочкаУчета = НаборэнргПриборыТочекУчетаГраницы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргРасчетныеСпособыТочекУчетаГраницы КАК НаборэнргРасчетныеСпособыТочекУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|					ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргРасчетныеСпособыТочекУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргРасчетныеСпособыТочекУчетаГраницы.ПериодС <= ОбщиеДанные.НачПер
	|						И НаборэнргРасчетныеСпособыТочекУчетаГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|			КОНЕЦ)
	|			И ОбщиеДанные.ТочкаУчета = НаборэнргРасчетныеСпособыТочекУчетаГраницы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргФормулыРасчетаТочекУчетаГраницы КАК НаборэнргФормулыРасчетаТочекУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|					ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргФормулыРасчетаТочекУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргФормулыРасчетаТочекУчетаГраницы.ПериодС <= ОбщиеДанные.НачПер
	|						И НаборэнргФормулыРасчетаТочекУчетаГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|			КОНЕЦ)
	|			И ОбщиеДанные.ТочкаУчета = НаборэнргФормулыРасчетаТочекУчетаГраницы.ТочкаИсточник
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргНаправлениеИспользованияТочекУчетаГраницы КАК НаборэнргНаправлениеИспользованияТочекУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|					ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргНаправлениеИспользованияТочекУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргНаправлениеИспользованияТочекУчетаГраницы.ПериодС <= ОбщиеДанные.НачПер
	|						И НаборэнргНаправлениеИспользованияТочекУчетаГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|			КОНЕЦ)
	|			И ОбщиеДанные.ТочкаУчета = НаборэнргНаправлениеИспользованияТочекУчетаГраницы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргДиаметрСеченияТочекУчетаГраницы КАК НаборэнргДиаметрСеченияТочекУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ОбщиеДанные.НачПер = ОбщиеДанные.КонПер
	|					ТОГДА ОбщиеДанные.ДокРегистратор = НаборэнргДиаметрСеченияТочекУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргДиаметрСеченияТочекУчетаГраницы.ПериодС <= ОбщиеДанные.НачПер
	|						И НаборэнргДиаметрСеченияТочекУчетаГраницы.ПериодПо >= ОбщиеДанные.КонПер
	|			КОНЕЦ)
	|			И ОбщиеДанные.ТочкаУчета = НаборэнргДиаметрСеченияТочекУчетаГраницы.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПриборовУчета.Организация КАК Организация,
	|	ДанныеПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеПриборовУчета.Район КАК Район,
	|	ДанныеПриборовУчета.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеПриборовУчета.Строение КАК Строение,
	|	ДанныеПриборовУчета.Помещение КАК Помещение,
	|	ДанныеПриборовУчета.Абонент КАК Абонент,
	|	ДанныеПриборовУчета.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеПриборовУчета.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеПриборовУчета.НачПер КАК НачПер,
	|	ДанныеПриборовУчета.КонПер КАК КонПер,
	|	ДанныеПриборовУчета.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеПриборовУчета.НачалоОП КАК НачалоОП,
	|	ДанныеПриборовУчета.ЗавершениеОП КАК ЗавершениеОП,
	|	ДанныеПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПриборовУчета.СостояниеЛС КАК СостояниеЛС,
	|	ДанныеПриборовУчета.УслугаПодключена КАК УслугаПодключена,
	|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ДанныеПриборовУчета.Услуга) КАК Услуга,
	|	ДанныеПриборовУчета.КоличествоКомнат КАК КоличествоКомнат,
	|	ДанныеПриборовУчета.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ДанныеПриборовУчета.КоличествоСобственников КАК КоличествоСобственников,
	|	ДанныеПриборовУчета.ВидСобственности КАК ВидСобственности,
	|	ДанныеПриборовУчета.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ДанныеПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	ДанныеПриборовУчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВЫБОР
	|		КОГДА НаборэнргСостояниеПриборовУчетаАбонентаГраницы.Состояние ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НаборэнргСостояниеПриборовУчетаАбонентаГраницы.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПриборВведен,
	|	ЕСТЬNULL(НаборэнргКоэффциентыПриборовУчетаГраницы.Коэффициент, 0) КАК КоэффициентПУ,
	|	НаборэнргСостояниеПриборовУчетаАбонентаГраницы.ПериодС КАК ДатаСостоянияПрибора,
	|	ДанныеПриборовУчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеПриборовУчета.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ЕСТЬNULL(НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы.ОтключатьВНеполивнойСезон, ЛОЖЬ) КАК ОтключатьВНеполивнойСезон,
	|	ЕСТЬNULL(НаборэнргДатыПоверкиПрибораУчетаГраницы.ДатаПоверки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоверки,
	|	ДанныеПриборовУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Ссылка, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК СоставнаяУслуга,
	|	ДанныеПриборовУчета.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ДанныеПриборовУчета.ДиаметрСечения КАК ДиаметрСечения
	|ПОМЕСТИТЬ ВсеСведения
	|ИЗ
	|	ДанныеПриборовУчета КАК ДанныеПриборовУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргСостояниеПриборовУчетаАбонентаГраницы КАК НаборэнргСостояниеПриборовУчетаАбонентаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргСостояниеПриборовУчетаАбонентаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргСостояниеПриборовУчетаАбонентаГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргСостояниеПриборовУчетаАбонентаГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.ТочкаУчета = НаборэнргСостояниеПриборовУчетаАбонентаГраницы.ТочкаУчета
	|			И ДанныеПриборовУчета.ПриборУчета = НаборэнргСостояниеПриборовУчетаАбонентаГраницы.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргКоэффциентыПриборовУчетаГраницы КАК НаборэнргКоэффциентыПриборовУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргКоэффциентыПриборовУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргКоэффциентыПриборовУчетаГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргКоэффциентыПриборовУчетаГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.ПриборУчета = НаборэнргКоэффциентыПриборовУчетаГраницы.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы КАК НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы
	|		ПО (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.Услуга = НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы.Услуга
	|			И ДанныеПриборовУчета.ТочкаУчета = НаборэнргАбонентыОтключаемыеВНеполивнойСезонГраницы.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ДанныеПриборовУчета.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргДатыПоверкиПрибораУчетаГраницы КАК НаборэнргДатыПоверкиПрибораУчетаГраницы
	|		ПО (ВЫБОР
	|				КОГДА ДанныеПриборовУчета.НачПер = ДанныеПриборовУчета.КонПер
	|					ТОГДА ДанныеПриборовУчета.ДокРегистратор = НаборэнргДатыПоверкиПрибораУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ НаборэнргДатыПоверкиПрибораУчетаГраницы.ПериодС <= ДанныеПриборовУчета.НачПер
	|						И НаборэнргДатыПоверкиПрибораУчетаГраницы.ПериодПо >= ДанныеПриборовУчета.КонПер
	|			КОНЕЦ)
	|			И ДанныеПриборовУчета.ПриборУчета = НаборэнргДатыПоверкиПрибораУчетаГраницы.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСведения.Организация КАК Организация,
	|	ВсеСведения.ПериодНачисления КАК ПериодНачисления,
	|	ВсеСведения.Район КАК Район,
	|	ВсеСведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ВсеСведения.Строение КАК Строение,
	|	ВсеСведения.Помещение КАК Помещение,
	|	ВсеСведения.Абонент КАК Абонент,
	|	ВсеСведения.Услуга КАК Услуга,
	|	ВсеСведения.ТочкаУчета КАК ТочкаУчета,
	|	ВсеСведения.ДокРегистратор КАК ДокРегистратор,
	|	ВсеСведения.ПериодРегистрации КАК ПериодРегистрации,
	|	ВсеСведения.НачПер КАК НачПер,
	|	ВсеСведения.КонПер КАК КонПер,
	|	ВсеСведения.НачалоОП КАК НачалоОП,
	|	ВсеСведения.ЗавершениеОП КАК ЗавершениеОП,
	|	ВсеСведения.ДнейВПериоде КАК ДнейВПериоде,
	|	ВсеСведения.СостояниеЛС КАК ЛСОткрыт,
	|	ВсеСведения.УслугаПодключена КАК УслугаПодключена,
	|	ЕСТЬNULL(НаборэнргВидБлагоустройствАбонентаГраницы.ВидБлагоустройства, ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)) КАК ВидБлагоустройства,
	|	ЕСТЬNULL(НаборэнргГруппыПотребителейАбонентовГраницы.ГруппаПотребителей, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ТарифнаяГруппа,
	|	ВсеСведения.ПриборВведен КАК ПриборВведен,
	|	ВсеСведения.ПриборУчета КАК ПриборУчета,
	|	ВсеСведения.ВидСобственности КАК ВидСобственности,
	|	ВсеСведения.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВсеСведения.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВсеСведения.КоличествоСобственников КАК КоличествоСобственников,
	|	ВсеСведения.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВсеСведения.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВсеСведения.КоличествоКомнат КАК КоличествоКомнат,
	|	ВсеСведения.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВсеСведения.КоэффициентПУ КАК КоэффициентПУ,
	|	ВЫБОР
	|		КОГДА НЕ СпособыРасчетаПоНаправлениям.ВидПлощади ЕСТЬ NULL
	|			ТОГДА СпособыРасчетаПоНаправлениям.ВидПлощади
	|		КОГДА энргВидыУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)
	|		КОГДА энргВидыУслуг.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)
	|		ИНАЧЕ энргВидыУслуг.ВидПлощади
	|	КОНЕЦ КАК ВидПлощади,
	|	ВсеСведения.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВсеСведения.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ВсеСведения.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ЕСТЬNULL(НаборэнргПоставщикиУслугАбонентаГраницы.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК Поставщик,
	|	ВсеСведения.ДатаПоверки КАК ДатаПоверки,
	|	энргСтроения.ГодПостройки КАК ГодПостройки,
	|	энргСтроения.Этажность КАК КоличествоЭтажей,
	|	ВсеСведения.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВсеСведения.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ВсеСведения.ДиаметрСечения КАК ДиаметрСечения
	|ПОМЕСТИТЬ ДанныеНормТарифов
	|ИЗ
	|	ВсеСведения КАК ВсеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргПоставщикиУслугАбонентаГраницы КАК НаборэнргПоставщикиУслугАбонентаГраницы
	|		ПО (НаборэнргПоставщикиУслугАбонентаГраницы.ТочкаУчета = ВсеСведения.ТочкаУчета)
	|			И (НаборэнргПоставщикиУслугАбонентаГраницы.Услуга = ВсеСведения.Услуга)
	|			И (ВЫБОР
	|				КОГДА ВсеСведения.НачПер = ВсеСведения.КонПер
	|					ТОГДА ВсеСведения.ДокРегистратор = НаборэнргПоставщикиУслугАбонентаГраницы.ДокРегистратор
	|				ИНАЧЕ ВсеСведения.НачПер >= НаборэнргПоставщикиУслугАбонентаГраницы.ПериодС
	|						И ВсеСведения.КонПер <= НаборэнргПоставщикиУслугАбонентаГраницы.ПериодПо
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргВидБлагоустройствАбонентаГраницы КАК НаборэнргВидБлагоустройствАбонентаГраницы
	|		ПО (НаборэнргВидБлагоустройствАбонентаГраницы.Услуга = ВсеСведения.Услуга)
	|			И (ВЫБОР
	|				КОГДА ВсеСведения.НачПер = ВсеСведения.КонПер
	|					ТОГДА ВсеСведения.ДокРегистратор = НаборэнргВидБлагоустройствАбонентаГраницы.ДокРегистратор
	|				ИНАЧЕ ВсеСведения.НачПер >= НаборэнргВидБлагоустройствАбонентаГраницы.ПериодС
	|						И ВсеСведения.КонПер <= НаборэнргВидБлагоустройствАбонентаГраницы.ПериодПо
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргГруппыПотребителейАбонентовГраницы КАК НаборэнргГруппыПотребителейАбонентовГраницы
	|		ПО (НаборэнргГруппыПотребителейАбонентовГраницы.Услуга = ВсеСведения.Услуга)
	|			И (ВЫБОР
	|				КОГДА ВсеСведения.НачПер = ВсеСведения.КонПер
	|					ТОГДА ВсеСведения.ДокРегистратор = НаборэнргГруппыПотребителейАбонентовГраницы.ДокРегистратор
	|				ИНАЧЕ ВсеСведения.НачПер >= НаборэнргГруппыПотребителейАбонентовГраницы.ПериодС
	|						И ВсеСведения.КонПер <= НаборэнргГруппыПотребителейАбонентовГраницы.ПериодПо
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВсеСведения.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВсеСведения.Абонент = энргАбоненты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|		ПО ВсеСведения.Строение = энргСтроения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО ВсеСведения.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И ВсеСведения.НаправлениеИспользованияТУ = СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеНормТарифов.Организация КАК Организация,
	|	ДанныеНормТарифов.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеНормТарифов.Район КАК Район,
	|	ДанныеНормТарифов.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеНормТарифов.Строение КАК Строение,
	|	ДанныеНормТарифов.Помещение КАК Помещение,
	|	ДанныеНормТарифов.Абонент КАК Абонент,
	|	ДанныеНормТарифов.Услуга КАК Услуга,
	|	ДанныеНормТарифов.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеНормТарифов.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеНормТарифов.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеНормТарифов.НачПер КАК НачПер,
	|	ДанныеНормТарифов.КонПер КАК КонПер,
	|	ДанныеНормТарифов.НачалоОП КАК НачалоОП,
	|	ДанныеНормТарифов.ЗавершениеОП КАК ЗавершениеОП,
	|	ДанныеНормТарифов.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеНормТарифов.ЛСОткрыт КАК ЛСОткрыт,
	|	ДанныеНормТарифов.УслугаПодключена КАК УслугаПодключена,
	|	ДанныеНормТарифов.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ДанныеНормТарифов.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДанныеНормТарифов.ПриборВведен КАК ПриборВведен,
	|	ДанныеНормТарифов.ПриборУчета КАК ПриборУчета,
	|	ДанныеНормТарифов.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ДанныеНормТарифов.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ДанныеНормТарифов.КоличествоСобственников КАК КоличествоСобственников,
	|	ДанныеНормТарифов.ВидСобственности КАК ВидСобственности,
	|	ДанныеНормТарифов.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ДанныеНормТарифов.КоличествоКомнат КАК КоличествоКомнат,
	|	ДанныеНормТарифов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЕСТЬNULL(НаборэнргЗначенияПлощадейГраницы.Площадь, 0) КАК ЗначениеПлощади,
	|	ДанныеНормТарифов.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеНормТарифов.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеНормТарифов.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДанныеНормТарифов.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДанныеНормТарифов.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ДанныеНормТарифов.ДатаПоверки КАК ДатаПоверки,
	|	ДанныеНормТарифов.Поставщик КАК Поставщик,
	|	ДанныеНормТарифов.СоставнаяУслуга КАК СоставнаяУслуга,
	|	0 КАК ГодПостройки,
	|	0 КАК КоличествоЭтажей,
	|	ДанныеНормТарифов.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ДанныеНормТарифов.ДиаметрСечения КАК ДиаметрСечения
	|ПОМЕСТИТЬ ВсеПараметрыРасчета
	|ИЗ
	|	ДанныеНормТарифов КАК ДанныеНормТарифов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргЗначенияПлощадейГраницы КАК НаборэнргЗначенияПлощадейГраницы
	|		ПО (ВЫБОР
	|				КОГДА ДанныеНормТарифов.НачПер = ДанныеНормТарифов.КонПер
	|					ТОГДА ДанныеНормТарифов.ДокРегистратор = НаборэнргЗначенияПлощадейГраницы.ДокРегистратор
	|				ИНАЧЕ ДанныеНормТарифов.НачПер >= НаборэнргЗначенияПлощадейГраницы.ПериодС
	|						И ДанныеНормТарифов.КонПер <= НаборэнргЗначенияПлощадейГраницы.ПериодПо
	|			КОНЕЦ)
	|			И ДанныеНормТарифов.ВидПлощади = НаборэнргЗначенияПлощадейГраницы.ВидПлощади
	|ГДЕ
	|	НЕ ДанныеНормТарифов.Услуга ЕСТЬ NULL";
	
	ИтоговыйТекст = ИтоговыйТекст + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ИтоговыйТекст = ИтоговыйТекст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНормативаПерерасчет();
	
	ИтоговыйТекст = ИтоговыйТекст + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ИтоговыйТекст = ИтоговыйТекст + 
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.*,
	|	КлючиНорматива.КлючНорматива КАК КлючНорматива,
	|	КлючиНорматива.КлючСоцНорматива КАК КлючСоцНорматива
	|ПОМЕСТИТЬ СтабильныеПериодыБезНомера
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
	|		ПО ВсеПараметрыРасчета.ПериодНачисления = КлючиНорматива.ПериодНачисления
	|		И (ВсеПараметрыРасчета.НачалоОП = КлючиНорматива.НачалоОП)
	|		И (ВсеПараметрыРасчета.ЗавершениеОП = КлючиНорматива.ЗавершениеОП)
	|		И (ВсеПараметрыРасчета.НачПер = КлючиНорматива.НачПер)
	|		И (ВсеПараметрыРасчета.КонПер = КлючиНорматива.КонПер)
	|		И (ВсеПараметрыРасчета.ДокРегистратор = КлючиНорматива.ДокРегистратор)	
	|		И (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
	|		И (ВсеПараметрыРасчета.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ)
	|		И (КлючиНорматива.Измеритель = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))";
	
	ИтоговыйТекст = ИтоговыйТекст + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ИтоговыйТекст = ИтоговыйТекст +
	"ВЫБРАТЬ
	|	СтабильныеПериодыБезНомераНачало.Организация КАК Организация,
	|	СтабильныеПериодыБезНомераНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыБезНомераНачало.Район КАК Район,
	|	СтабильныеПериодыБезНомераНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыБезНомераНачало.Строение КАК Строение,
	|	СтабильныеПериодыБезНомераНачало.Помещение КАК Помещение,
	|	СтабильныеПериодыБезНомераНачало.Абонент КАК Абонент,
	|	СтабильныеПериодыБезНомераНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыБезНомераНачало.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыБезНомераНачало.ПериодРегистрации КАК ПериодРегистрации,
	|	СтабильныеПериодыБезНомераНачало.НачПер КАК НачПер,
	|	СтабильныеПериодыБезНомераНачало.КонПер КАК КонПер,
	|	СтабильныеПериодыБезНомераНачало.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыБезНомераНачало.НачПер КАК ДатаРегистратора,
	|	СтабильныеПериодыБезНомераНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыБезНомераНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыБезНомераНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыБезНомераНачало.ЛСОткрыт КАК ЛСОткрыт,
	|	СтабильныеПериодыБезНомераНачало.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериодыБезНомераНачало.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериодыБезНомераНачало.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	СтабильныеПериодыБезНомераНачало.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериодыБезНомераНачало.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыБезНомераНачало.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	СтабильныеПериодыБезНомераНачало.КоличествоПрописанных КАК КоличествоПрописанных,
	|	СтабильныеПериодыБезНомераНачало.КоличествоСобственников КАК КоличествоСобственников,
	|	СтабильныеПериодыБезНомераНачало.КоличествоПроживающих КАК КоличествоПроживающих,
	|	СтабильныеПериодыБезНомераНачало.КоличествоКомнат КАК КоличествоКомнат,
	|	СтабильныеПериодыБезНомераНачало.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериодыБезНомераНачало.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериодыБезНомераНачало.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериодыБезНомераНачало.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	СтабильныеПериодыБезНомераНачало.КоэффициентРасчета КАК КоэффициентРасчета,
	|	СтабильныеПериодыБезНомераНачало.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	СтабильныеПериодыБезНомераНачало.ДатаПоверки КАК ДатаПоверки,
	|	СтабильныеПериодыБезНомераНачало.Поставщик КАК Поставщик,
	|	СтабильныеПериодыБезНомераНачало.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	СтабильныеПериодыБезНомераНачало.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериодыБезНомераНачало.КлючСоцНорматива КАК КлючСоцНорматива,
	|	СтабильныеПериодыБезНомераНачало.СоставнаяУслуга КАК  СоставнаяУслуга,
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСЛицевымСчетом
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МенялосьСостояниеПУ,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСЛицевымСчетом
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргУстановитьФормулуРасчетаТочекУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МенялосьСостояниеФормулы,
	|	СУММА(ВЫБОР
	|			КОГДА СтабильныеПериодыБезНомераКонец.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК НомерПозиции,
	|	ЛОЖЬ КАК НетВозможностьУстановкиПУ,
	|	&МКД КАК МКД,
	|	0 КАК КоличествоЖильцов,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ПустаяСсылка)  КАК СпособРаспределенияОбъемаПомещения,
	|	0 КАК ФиксированныйОбъемПотребления,
	|	0 КАК ДоляПотребленияЧислитель,
	|	1 КАК ДоляПотребленияЗнаменатель,
	|	1 КАК КоэффициентРаспределенияОстатка,
	|	Ложь КАК ЯвляетсяПомещениемСРазделеннымиЛС,
	|	ЛОЖЬ КАК БлокировочныйАкт,
	|  	СтабильныеПериодыБезНомераНачало.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|   СтабильныеПериодыБезНомераНачало.ДиаметрСечения КАК ДиаметрСечения
	|ПОМЕСТИТЬ СтабильныеПериодыНачало
	|ИЗ
	|	СтабильныеПериодыБезНомера КАК СтабильныеПериодыБезНомераНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыБезНомера КАК СтабильныеПериодыБезНомераКонец
	|		ПО СтабильныеПериодыБезНомераНачало.Организация = СтабильныеПериодыБезНомераКонец.Организация
	|			И СтабильныеПериодыБезНомераНачало.ПериодНачисления = СтабильныеПериодыБезНомераКонец.ПериодНачисления
	|			И СтабильныеПериодыБезНомераНачало.Район = СтабильныеПериодыБезНомераКонец.Район
	|			И СтабильныеПериодыБезНомераНачало.ЧастныйСектор = СтабильныеПериодыБезНомераКонец.ЧастныйСектор
	|			И СтабильныеПериодыБезНомераНачало.Строение = СтабильныеПериодыБезНомераКонец.Строение
	|			И СтабильныеПериодыБезНомераНачало.Помещение = СтабильныеПериодыБезНомераКонец.Помещение
	|			И СтабильныеПериодыБезНомераНачало.Услуга = СтабильныеПериодыБезНомераКонец.Услуга
	|			И СтабильныеПериодыБезНомераНачало.ТочкаУчета = СтабильныеПериодыБезНомераКонец.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыБезНомераНачало.ПериодРегистрации = СтабильныеПериодыБезНомераКонец.ПериодРегистрации
	|					ТОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор > СтабильныеПериодыБезНомераКонец.ДокРегистратор
	|				ИНАЧЕ СтабильныеПериодыБезНомераНачало.ПериодРегистрации > СтабильныеПериодыБезНомераКонец.ПериодРегистрации
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыБезНомераНачало.Организация,
	|	СтабильныеПериодыБезНомераНачало.ПериодНачисления,
	|	СтабильныеПериодыБезНомераНачало.Район,
	|	СтабильныеПериодыБезНомераНачало.ЧастныйСектор,
	|	СтабильныеПериодыБезНомераНачало.Строение,
	|	СтабильныеПериодыБезНомераНачало.Помещение,
	|	СтабильныеПериодыБезНомераНачало.Абонент,
	|	СтабильныеПериодыБезНомераНачало.Услуга,
	|	СтабильныеПериодыБезНомераНачало.ТочкаУчета,
	|	СтабильныеПериодыБезНомераНачало.ДнейВПериоде,
	|	СтабильныеПериодыБезНомераНачало.ДокРегистратор,
	|	СтабильныеПериодыБезНомераНачало.НачалоОП,
	|	СтабильныеПериодыБезНомераНачало.ЗавершениеОП,
	|	СтабильныеПериодыБезНомераНачало.ЛСОткрыт,
	|	СтабильныеПериодыБезНомераНачало.УслугаПодключена,
	|	СтабильныеПериодыБезНомераНачало.ВидБлагоустройства,
	|	СтабильныеПериодыБезНомераНачало.ТарифнаяГруппа,
	|	СтабильныеПериодыБезНомераНачало.ПриборВведен,
	|	СтабильныеПериодыБезНомераНачало.ПриборУчета,
	|	СтабильныеПериодыБезНомераНачало.ДатаСостоянияПрибора,
	|	СтабильныеПериодыБезНомераНачало.КоличествоПрописанных,
	|	СтабильныеПериодыБезНомераНачало.КоличествоСобственников,
	|	СтабильныеПериодыБезНомераНачало.КоличествоПроживающих,
	|	СтабильныеПериодыБезНомераНачало.КоличествоКомнат,
	|	СтабильныеПериодыБезНомераНачало.ЗначениеПлощади,
	|	СтабильныеПериодыБезНомераНачало.КоэффициентПУ,
	|	СтабильныеПериодыБезНомераНачало.РасчетПоФормуле,
	|	СтабильныеПериодыБезНомераНачало.ЗависимаяТочкаУчета,
	|	СтабильныеПериодыБезНомераНачало.КоэффициентРасчета,
	|	СтабильныеПериодыБезНомераНачало.ОтключатьВНеполивнойСезон,
	|	СтабильныеПериодыБезНомераНачало.ДатаПоверки,
	|	СтабильныеПериодыБезНомераНачало.Поставщик,
	|	СтабильныеПериодыБезНомераНачало.НаправлениеИспользованияТУ,
	|	СтабильныеПериодыБезНомераНачало.КлючНорматива,
	|	СтабильныеПериодыБезНомераНачало.КлючСоцНорматива,
	|	СтабильныеПериодыБезНомераНачало.СоставнаяУслуга,
	|	СтабильныеПериодыБезНомераНачало.ПериодРегистрации,
	|	СтабильныеПериодыБезНомераНачало.НачПер,
	|	СтабильныеПериодыБезНомераНачало.КонПер,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСЛицевымСчетом
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСЛицевымСчетом
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериодыБезНомераНачало.ДокРегистратор ССЫЛКА Документ.энргУстановитьФормулуРасчетаТочекУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СтабильныеПериодыБезНомераНачало.НачПер,
	|  	СтабильныеПериодыБезНомераНачало.ИспользоватьДиаметрСечения,
	|   СтабильныеПериодыБезНомераНачало.ДиаметрСечения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение КАК Строение,
	|	СтабильныеПериодыНачало.Помещение КАК Помещение,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыНачало.НомерПозиции КАК НомерПозиции,
	|	ЕСТЬNULL(НаборэнргВидыДифференцированностиПриборовУчетаГраницы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(НаборэнргВидыДифференцированностиПриборовУчетаГраницы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности
	|ПОМЕСТИТЬ СтабильныеПериодыШкалы
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборэнргВидыДифференцированностиПриборовУчетаГраницы КАК НаборэнргВидыДифференцированностиПриборовУчетаГраницы
	|		ПО СтабильныеПериодыНачало.ПриборУчета = НаборэнргВидыДифференцированностиПриборовУчетаГраницы.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыНачало.НачПер = СтабильныеПериодыНачало.КонПер
	|					ТОГДА СтабильныеПериодыНачало.ДокРегистратор = НаборэнргВидыДифференцированностиПриборовУчетаГраницы.ДокРегистратор
	|				ИНАЧЕ СтабильныеПериодыНачало.НачПер >= НаборэнргВидыДифференцированностиПриборовУчетаГраницы.ПериодС
	|						И СтабильныеПериодыНачало.КонПер <= НаборэнргВидыДифференцированностиПриборовУчетаГраницы.ПериодПо
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение КАК Строение,
	|	СтабильныеПериодыНачало.Помещение КАК Помещение,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	0 КАК НомерПозиции,
	|	Значение(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка) КАК Измеритель,
	|	0 КАК Количество,
	|	ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяСсылка) КАК КлючНорматива,
	|	ЗНАЧЕНИЕ(Справочник.энргКлючиНормативов.ПустаяСсылка) КАК КлючСоцНорматива
	|ПОМЕСТИТЬ СтабильныеПериодыИзмерителиНаправлений
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|ГДЕ 
	|	ЛОЖЬ";
	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("ЧастныйСектор",	ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение",		ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("Помещение",		ДанныеСтроения.Помещение);
	Запрос.УстановитьПараметр("МКД",			?(ДанныеСтроения.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка(),ДанныеСтроения.Строение));
	Запрос.УстановитьПараметр("Абонент",		Абонент);
	Запрос.УстановитьПараметр("КлючПомещения",	ДанныеСтроения.КлючПомещения);
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериодаРасчета); 
	Запрос.УстановитьПараметр("ТипНачисления",	Перечисления.энргТипыНачислений.ИндивидуальныеНачисления); 
	Запрос.Текст 	= ИтоговыйТекст;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПересчитатьИндивидуальныйОбъем(МВТ,Организация,ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета,Район,ДанныеСтроения,Абонент,КорректировкаПоказаний,ПериодНовогоТарифа)
	
	ПрочитатьСтабильныеПериодыПерерасчет(МВТ,Организация, ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета,Район,ДанныеСтроения,Абонент);
	
	ПоказанияПерерасчет(МВТ,Организация, ПериодНачисленияНачало,ПериодНачисленияКонец,Район,ДанныеСтроения,КорректировкаПоказаний.выгрузить()); // Вспомогательные данные по показаниям
	
	ВспомогательныеДанныеПерерасчет(МВТ,Организация, ПериодНачисленияНачало,ПериодНачисленияКонец,НачалоПериодаРасчета,КонецПериодаРасчета,Район,ДанныеСтроения,Абонент,ПериодНовогоТарифа);
	
	ПолучитьСтабильныеПериоды(МВТ,Истина);
	
	// Рассчитываем индивидульный объем
	ПолучитьДанныеДляРасчета(МВТ,Ложь,Истина,"энргНачисление");
	Возврат РассчитатьИндивидуальныйОбъемПотребления(МВТ);
			
КонецФункции

#КонецОбласти

#Область НачислениеПоРассрочке_ВспомогательныеФункции

// Рассчет процентов происходит на остаток суммы
Процедура ДифференцированныйСпособРасчетаПроцентов(Организация, ПериодНачисления,Район,МКД,Документ,КонецПериодаРасчета)
	
	Запрос  								= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("КонецПериодаРасчета",КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Текст  									= ТекстЗапросаДифференцированныйСпособРасчетаПроцентов();
	
	Если МКД = Неопределено тогда
		Текст 								= СтрЗаменить(Текст,"И энргСтабильныеПериоды.МКД = &МКД","");
		Текст 								= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.МКД = &МКД)","");
		Текст 								= СтрЗаменить(Текст,"И МКД = &МКД","");
		Текст 								= СтрЗаменить(Текст,"И (энргНачислениеПоРассрочке.МКД = &МКД)","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 							= Текст;
	РезЗадолженность						= Запрос.Выполнить();
	
	// читаем ставку рефинансирования
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериодаРасчета",КонецПериодаРасчета);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент
	|ИЗ
	|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&КонецПериодаРасчета, ) КАК энргСтавкиРефинансированияСрезПоследних";
	Результат 								= Запрос.Выполнить();
	
	Если Результат.Пустой() тогда
		Возврат;
	иначе
		Выборка  							= Результат.Выбрать();
		Выборка.Следующий();
		СтРеф  								= Выборка.Коэффициент;
	КонецЕсли;
	
	Выборка  								= РезЗадолженность.Выбрать();
	ТекДом 									= Неопределено;
	ДокументОбъект 							= Неопределено;
	Пока Выборка.Следующий() цикл
		Если Документ = Неопределено тогда
			ТабЧасть 						= Документ.НачисленияАбонентам;			 
		иначеЕсли ТекДом <>  Выборка.МКД тогда // первая строка выборки
			
			Если ТекДом<>Неопределено тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 		
			
			Если ЗначениеЗаполнено(Выборка.ДокументНачисления) тогда
				ДокументОбъект  			= Выборка.ДокументНачисления.получитьОбъект();
			иначе
				ДокументОбъект  			= Документы.энргНачислениеПоРассрочке.СоздатьДокумент();
				ДокументОбъект.Дата 		= КонецПериодаРасчета;
			КонецЕсли;
			
			ДокументОбъект.ПометкаУдаления = ложь;
			ДокументОбъект.Район 			= Район;
			ДокументОбъект.МКД 			= Выборка.МКД;
			ТабЧасть 						= ДокументОбъект.НачисленияАбонентам
		КонецЕсли; 		
		СтрокаТЧ  							= ТабЧасть.Добавить();
		СтрокаТЧ.Абонент 					= Выборка.Абонент;
		СтрокаТЧ.СуммаНачисленныхПроцентов	= Выборка.Задолженность * СтРеф /(12* 100);
		ТекДом 								= Выборка.МКД;
	КонецЦикла;
	
	Если Документ = Неопределено и ДокументОбъект<>Неопределено тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	
КонецПроцедуры

// Применяется когда абонент платит одну и ту же сумму каждый месяц
Процедура АннуитетныйСпособРасчетаПроцентов(ПериодНачисления,Организация,Район,МКД)
	
	
	
КонецПроцедуры

Функция ТекстЗапросаДифференцированныйСпособРасчетаПроцентов()
	Текст 	=
	"ВЫБРАТЬ
	|	энргСтабильныеПериоды.Организация КАК Организация,
	|	энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериоды.Район КАК Район,
	|	энргСтабильныеПериоды.МКД КАК МКД,
	|	энргСтабильныеПериоды.Абонент КАК Абонент,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомерПозиций
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|ГДЕ
	|	энргСтабильныеПериоды.Организация = &Организация
	|	И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериоды.Район = &Район
	|	И энргСтабильныеПериоды.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Организация,
	|	энргСтабильныеПериоды.ПериодНачисления,
	|	энргСтабильныеПериоды.МКД,
	|	энргСтабильныеПериоды.Район,
	|	энргСтабильныеПериоды.Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета,
	|	энргСтабильныеПериоды.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргСтабильныеПериоды.МКД КАК МКД,
	|	энргСтабильныеПериоды.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОткрытыеЛС
	|ИЗ
	|	НомерПозиций КАК НомерПозиций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО НомерПозиций.Организация = энргСтабильныеПериоды.Организация
	|			И НомерПозиций.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И НомерПозиций.Район = энргСтабильныеПериоды.Район
	|			И НомерПозиций.МКД = энргСтабильныеПериоды.МКД
	|			И НомерПозиций.Абонент = энргСтабильныеПериоды.Абонент
	|			И НомерПозиций.Услуга = энргСтабильныеПериоды.Услуга
	|			И НомерПозиций.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И НомерПозиций.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			И (энргСтабильныеПериоды.ЛСОткрыт)
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (энргСтабильныеПериоды.МКД = &МКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗадолженностьПоРассрочкеОстатки.МКД КАК МКД,
	|	энргЗадолженностьПоРассрочкеОстатки.Абонент КАК Абонент,
	|	энргЗадолженностьПоРассрочкеОстатки.СуммаЗадолженностиОстаток КАК СуммаЗадолженностиОстаток
	|ПОМЕСТИТЬ ЗадолженностьПоРассрочке
	|ИЗ
	|	РегистрНакопления.энргЗадолженностьПоРассрочке.Остатки(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргЗадолженностьПоРассрочкеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьПоРассрочке.МКД КАК МКД,
	|	ЗадолженностьПоРассрочке.Абонент КАК Абонент,
	|	ЗадолженностьПоРассрочке.СуммаЗадолженностиОстаток КАК СуммаЗадолженностиОстаток
	|ПОМЕСТИТЬ ДанныеДляНачислений
	|ИЗ
	|	ОткрытыеЛС КАК ОткрытыеЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадолженностьПоРассрочке КАК ЗадолженностьПоРассрочке
	|		ПО ОткрытыеЛС.МКД = ЗадолженностьПоРассрочке.МКД
	|			И ОткрытыеЛС.Абонент = ЗадолженностьПоРассрочке.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляНачислений.МКД КАК МКД,
	|	ДанныеДляНачислений.Абонент КАК Абонент,
	|	ДанныеДляНачислений.СуммаЗадолженностиОстаток КАК Задолженность,
	|	ЕСТЬNULL(энргНачислениеПоРассрочке.Ссылка, ЗНАЧЕНИЕ(Документ.энргНачислениеПоРассрочке.ПустаяСсылка)) КАК ДокументНачисления
	|ИЗ
	|	ДанныеДляНачислений КАК ДанныеДляНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргНачислениеПоРассрочке КАК энргНачислениеПоРассрочке
	|		ПО ДанныеДляНачислений.МКД = энргНачислениеПоРассрочке.МКД
	|			И (энргНачислениеПоРассрочке.Организация = &Организация)
	|			И (энргНачислениеПоРассрочке.Район = &Район)
	|			И (энргНачислениеПоРассрочке.Дата = &КонецПериодаРасчета)
	|			И (энргНачислениеПоРассрочке.МКД = &МКД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКД
	|ИТОГИ
	|	МАКСИМУМ(ДокументНачисления)
	|ПО
	|	МКД";
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область ЗакрытьПериодДляРедактирования_ВспомогательныеФункции

Функция ДокуметЗакрытияПериода(Организация,ПериодНачисления,Район)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	НЕ энргЗакрытиеПериода.ПометкаУдаления
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.Организация = &Организация
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат  Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.энргЗакрытиеПериода.ПустаяСсылка();	
КонецФункции

#КонецОбласти

#Область РаспредениеОбъемаМКД_ВспомогательныеПроцедуры

Процедура РаспределитьОбъемПоУслугеМКД(ПериодНачисления, Организация, Район, МКД, Услуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, НаборЗаписей, НаборЗаписейПомещение,НаборЗаписейНП, НаборЗаписейСверхНорма)
	
	// УсловиеОтопления - если есть начисления по прибору
	// и всего абонентов = всего с прибором
	ПустаяТочкаУчета 										= Справочники.энргТочкиУчета.ПустаяСсылка();
	ВидНачисления 											= Перечисления.энргВидыНачислений.Начисление;
	
	ЕстьПотреблениеПоПрибору 								= ДанныеПоУслуге.ОбъемПоПрибору > 0;
	
	// TODO
	// FIX ME
	// Добавить распределение в разбивки тарифных зон
	
	НадоРаспределить 										= ДанныеПоУслуге.ОбъемПоПрибору + ДанныеПоУслуге.ОбъемБезПрибора;
	ВидНачисления 											= Перечисления.энргВидыНачислений.НачислениеОДН;	
	СпособНачисленияОДН 									= Перечисления.энргСпособНачислений.ПустаяСсылка();
	ОбщийОбъемНачислений 									= ДанныеПоУслуге.ОбщийОбъемНачислений;
	ОбщийОбъемНачисленийПомещений 							= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений;
	
	Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору И ДанныеПоУслуге.ВсеПоПрибору Тогда
		ОсталосьРаспределить 								= НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентов;
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и НЕ ЕстьПотреблениеПоПрибору Тогда
		// Списываем начисленный индивидуальный объем по прибору учета
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.ОбъемПоПриборуКорректировать Цикл 
			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
				яНабор 										= НаборЗаписей;
				яНаборОбщий 								= ОбщийОбъемНачислений;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;			
			
			Если СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам 
				ИЛИ СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
				Если НЕ СтрокаНачисленийАбонента.ОбъемУслуги = 0 ИЛИ НЕ СтрокаНачисленийАбонента.Сумма = 0 Тогда
					СтрокаНабора  				= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.ОбъемУслуги 				= -СтрокаНабора.ОбъемУслуги;
					СтрокаНабора.Сумма 						= -СтрокаНабора.Сумма;
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора);
				КонецЕсли;
				
				Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
					// добавляем новую строку начислений
					СтрокаНабора  							= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.СпособНачисления 			= Перечисления.энргСпособНачислений.ПоНормативу;
					ОбъемУслуги 							= СтрокаНабора.НормаПотребления * СтрокаНабора.ЗначениеПлощади * ((СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП)) * (СтрокаНабора.КонецПериода - СтрокаНабора.НачалоПериода) / (ГраницыПериода.ДнейВПериоде * 86400);
					СтрокаНабора.ОбъемУслуги 				= ОбъемУслуги;
					СтрокаНабора.Сумма 						= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора);
					РазделенныеЛицевыеСчета 				= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
					
					Если НЕ РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
						ОсталосьВнутриПомещения 			= ОбъемУслуги;
						ПомещенияПотомки					= РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение];
						СуммаПлощадейПомещения 				= 0;
						Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
							ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];
							СуммаПлощадейПомещения 			= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
						КонецЦикла;		
						
						ПереасчитатьСтроки 					= Новый Массив;
						
						Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
							ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];				                 		
							
							ХэшСтрокиТарифа 				= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
							ЗначениеТарифа 					= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
							СтрокаНабора  					= НаборЗаписей.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
							СтрокаНабора.Распределение 		= Истина;
							СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
							СтрокаНабора.Помещение			= ПомещениеПотомок.Ключ;
							СтрокаНабора.Абонент			= ДанныеПомещения.Абонент;						
							
							Если ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
								СтрокаНабора.ОбъемУслуги 	= ДанныеПомещения.ФиксированныйОбъемПотребления;
								ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
							ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
								СтрокаНабора.ОбъемУслуги = ОбъемУслуги * ДанныеПомещения.ДоляПотребленияЧислитель / ДанныеПомещения.ДоляПотребленияЗнаменатель;
								ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
							ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда	
								ПереасчитатьСтроки.Добавить(НаборЗаписей.Индекс(СтрокаНабора));
							Иначе
								Если ЗначениеЗаполнено(ДанныеПоУслуге.ВидПлощади) Тогда
									СтрокаНабора.ОбъемУслуги = ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслуги * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);
								Иначе
									СтрокаНабора.ОбъемУслуги = ?(НЕ СтрокаНачисленийАбонента.КоличествоЖильцов = 0, ОбъемУслуги * ДанныеПомещения.КоличествоПроживающих / СтрокаНачисленийАбонента.КоличествоЖильцов, 0);
								КонецЕсли;
								ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
							КонецЕсли;											
							
							СтрокаНабора.Сумма				= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;				
						КонецЦикла;
						
						Если ПереасчитатьСтроки.Количество() > 0 Тогда
							Для Сч = 0 По ПереасчитатьСтроки.ВГраница() Цикл
								СтрокаНабора 				= НаборЗаписей.Получить(ПереасчитатьСтроки[Сч]);
								СтрокаНабора.ОбъемУслуги 	= ОсталосьВнутриПомещения;
								СтрокаНабора.Сумма			= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;
							КонецЦикла;						
						КонецЕсли;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		// просто распределяем объем по нормативу
		ОсталосьРаспределить 								= НадоРаспределить;		
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору > 0 Тогда
		// Высчитываем потребление приборников на 1м2
		ОбъемНаКвМ 											= 0;
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
		Если  ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору <> 0 Тогда
			ОбъемНаКвМ 										= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору / ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору;
		КонецЕсли;
		// Высчитываем "виртуальный" расход абонентов без прибора и корректируем объем потребления абонентов без прибора
		ПотреблениеАбонентов								= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору;
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибора Цикл
			// снимаем начисленный ранее объем
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
			ЕстьСуммаНачислений 							= Ложь;
			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
				яНабор 										= НаборЗаписей;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;		
			
			Если НЕ СтрокаНачисленийАбонента.ОбъемУслуги = 0 ИЛИ НЕ СтрокаНачисленийАбонента.Сумма = 0 Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.ОбъемУслуги 					= -СтрокаНабора.ОбъемУслуги;
				Если ЕстьСуммаНачислений Тогда
					СтрокаНабора.Сумма 						= -СтрокаНабора.Сумма;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора);
			КонецЕсли;
									
			Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
				ЗначениеПлощади 							= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];			
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
				ОбъемУслуги 								= ЗначениеПлощади * ОбъемНаКвМ;
				СтрокаНабора.ОбъемУслуги 					= ОбъемУслуги;			
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;			
				ПотреблениеАбонентов 						= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслуги;
				
				Если ЕстьСуммаНачислений Тогда
					СтрокаНабора.Сумма 						= СтрокаНабора.ОбъемУслуги * СтрокаНачисленийАбонента.ЗначениеТарифа;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора);
				
				РазделенныеЛицевыеСчета 					= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
				
				Если НЕ РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
					ОсталосьВнутриПомещения 				= ОбъемУслуги;
					ПомещенияПотомки						= РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение];
					СуммаПлощадейПомещения 					= 0;
					Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
						ДанныеПомещения  					= ПомещениеПотомок.Значение[Услуга];
						СуммаПлощадейПомещения 				= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
					КонецЦикла;		
					
					ПереасчитатьСтроки 						= Новый Массив;
					
					Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
						ДанныеПомещения  					= ПомещениеПотомок.Значение[Услуга];				                 		
						
						ХэшСтрокиТарифа 					= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
						ЗначениеТарифа 						= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
						СтрокаНабора  						= НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
						СтрокаНабора.Распределение 			= Истина;
						СтрокаНабора.СпособНачисления		= СпособНачисленияОДН;
						СтрокаНабора.Период 				= ГраницыПериода.ЗавершениеОП-1;
						СтрокаНабора.Помещение				= ПомещениеПотомок.Ключ;
						СтрокаНабора.Абонент				= ДанныеПомещения.Абонент;						
						
						Если ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
							СтрокаНабора.ОбъемУслуги 		= ДанныеПомещения.ФиксированныйОбъемПотребления;
							ОсталосьВнутриПомещения 		= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
						ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
							СтрокаНабора.ОбъемУслуги = ОбъемУслуги * ДанныеПомещения.ДоляПотребленияЧислитель / ДанныеПомещения.ДоляПотребленияЗнаменатель;
							ОсталосьВнутриПомещения 		= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
						ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда	
							ПереасчитатьСтроки.Добавить(НаборЗаписей.Индекс(СтрокаНабора));
						Иначе
							Если ЗначениеЗаполнено(ДанныеПоУслуге.ВидПлощади) Тогда
								СтрокаНабора.ОбъемУслуги 	= ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслуги * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);
							Иначе
								СтрокаНабора.ОбъемУслуги 	= ?(НЕ СтрокаНачисленийАбонента.КоличествоЖильцов = 0, ОбъемУслуги * ДанныеПомещения.КоличествоПроживающих / СтрокаНачисленийАбонента.КоличествоЖильцов, 0);
							КонецЕсли;
							ОсталосьВнутриПомещения 		= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
						КонецЕсли;											
						
						СтрокаНабора.Сумма					= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;				
					КонецЦикла;
					
					Если ПереасчитатьСтроки.Количество() > 0 Тогда
						Для Сч = 0 По ПереасчитатьСтроки.ВГраница() Цикл
							СтрокаНабора 					= НаборЗаписей.Получить(ПереасчитатьСтроки[Сч]);
							СтрокаНабора.ОбъемУслуги 		= ОсталосьВнутриПомещения;
							СтрокаНабора.Сумма				= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;
						КонецЦикла;						
					КонецЕсли;					
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		ОсталосьРаспределить 								= НадоРаспределить - ПотреблениеАбонентов;
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору Тогда
		ОтапливаемаяПлощадь									= ДанныеПоУслуге.ВсегоПлощадьАбонентов - ДанныеПоУслуге.ВсегоПлощадьАбонентовСобственнаяПоставка + ДанныеПоУслуге.ПлощадьМОП;
		ОбъемНаКвМ 											= ?(ОтапливаемаяПлощадь = 0, 0, ДанныеПоУслуге.ОбъемПоПрибору / ОтапливаемаяПлощадь);
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
		ПотреблениеАбонентов								= 0;
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибора Цикл
			ЕстьСуммаНачислений 							= Ложь;
			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
				яНабор 										= НаборЗаписей;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;
			
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
			
			// снимаем начисленный ранее объем
			Если НЕ СтрокаНачисленийАбонента.ОбъемУслуги = 0 ИЛИ НЕ СтрокаНачисленийАбонента.Сумма = 0 Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.ОбъемУслуги 					= -СтрокаНабора.ОбъемУслуги;				
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				Если ЕстьСуммаНачислений Тогда
					СтрокаНабора.Сумма 						= -СтрокаНабора.Сумма;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора);
			КонецЕсли;
						
			Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда 			
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
				ОбъемУслуги 								= ЗначениеПлощади * ОбъемНаКвМ;
				СтрокаНабора.ОбъемУслуги 					= ОбъемУслуги;			
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;			
				ПотреблениеАбонентов 						= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслуги;
				Если ЕстьСуммаНачислений Тогда
					СтрокаНабора.Сумма 						= СтрокаНабора.ОбъемУслуги * СтрокаНачисленийАбонента.ЗначениеТарифа;
				КонецЕсли; 
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора);
				 
				РазделенныеЛицевыеСчета 					= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
				
				Если НЕ РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
					ОсталосьВнутриПомещения 				= ОбъемУслуги;
					ПомещенияПотомки						= РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение];
					СуммаПлощадейПомещения 					= 0;
					Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
						ДанныеПомещения  					= ПомещениеПотомок.Значение[Услуга];
						СуммаПлощадейПомещения 				= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
					КонецЦикла;		
					
					ПереасчитатьСтроки 						= Новый Массив;
					
					Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
						ДанныеПомещения  					= ПомещениеПотомок.Значение[Услуга];				                 		
						
						ХэшСтрокиТарифа 					= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
						ЗначениеТарифа 						= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
						СтрокаНабора  						= НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента);
						СтрокаНабора.Распределение 			= Истина;
						СтрокаНабора.СпособНачисления		= СпособНачисленияОДН;
						СтрокаНабора.Период 				= ГраницыПериода.ЗавершениеОП-1;
						СтрокаНабора.Помещение				= ПомещениеПотомок.Ключ;
						СтрокаНабора.Абонент				= ДанныеПомещения.Абонент;						
						
						Если ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
							СтрокаНабора.ОбъемУслуги 		= ДанныеПомещения.ФиксированныйОбъемПотребления;
							ОсталосьВнутриПомещения 		= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
						ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
							СтрокаНабора.ОбъемУслуги 		= ОбъемУслуги * ДанныеПомещения.ДоляПотребленияЧислитель / ДанныеПомещения.ДоляПотребленияЗнаменатель;
							ОсталосьВнутриПомещения 		= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
						ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда	
							ПереасчитатьСтроки.Добавить(НаборЗаписей.Индекс(СтрокаНабора));
						Иначе
							Если ЗначениеЗаполнено(ДанныеПоУслуге.ВидПлощади) Тогда
								СтрокаНабора.ОбъемУслуги	 = ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслуги * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);
							Иначе
								СтрокаНабора.ОбъемУслуги 	= ?(НЕ СтрокаНачисленийАбонента.КоличествоЖильцов = 0, ОбъемУслуги * ДанныеПомещения.КоличествоПроживающих / СтрокаНачисленийАбонента.КоличествоЖильцов, 0);
							КонецЕсли;
							ОсталосьВнутриПомещения 		= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
						КонецЕсли;											
						
						СтрокаНабора.Сумма					= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;				
					КонецЦикла;
					
					Если ПереасчитатьСтроки.Количество() > 0 Тогда
						Для Сч = 0 По ПереасчитатьСтроки.ВГраница() Цикл
							СтрокаНабора 					= НаборЗаписей.Получить(ПереасчитатьСтроки[Сч]);
							СтрокаНабора.ОбъемУслуги 		= ОсталосьВнутриПомещения;
							СтрокаНабора.Сумма				= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;
						КонецЦикла;						
					КонецЕсли;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ОсталосьРаспределить 								= НадоРаспределить - ПотреблениеАбонентов;
		
	ИначеЕсли ЕстьПотреблениеПоПрибору Тогда
		ОсталосьРаспределить 								= НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентов;
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
	Иначе
		ОсталосьРаспределить 								= НадоРаспределить;
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоНормативу;
	КонецЕсли;
	
	Если Не ДанныеПоУслуге.РаспределятьПолностью И Не ДанныеПоУслуге.НеРаспределятьСверхнорматив Тогда
		Если ОсталосьРаспределить > ДанныеПоУслуге.ОбъемУслугиНорматив  Тогда
			СверхнормативМКД 								= ОсталосьРаспределить - ДанныеПоУслуге.ОбъемУслугиНорматив;
			СпособНачисленияОДН 							= Перечисления.энргСпособНачислений.ПоНормативу;
			ОсталосьРаспределить 							= ДанныеПоУслуге.ОбъемУслугиНорматив;
			//добавить сверх в регистр
			
			СтрокаНабора  									= НаборЗаписейСверхНорма.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.МКД								= МКД;
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ОбъемУслуги						= СверхнормативМКД;			
		КонецЕсли; 
		
	КонецЕсли;  
	
	Если ОсталосьРаспределить <= 0 Тогда
		Возврат;
	КонецЕсли;	
	
	АбонентыДляРаспределения 								= ДанныеПоУслуге.АбонентыДляРаспределения;
	Распределили 											= 0;
	Для Сч = 0 По АбонентыДляРаспределения.ВГраница() Цикл
		ДанныеАбонента 										= АбонентыДляРаспределения[Сч];
		
		Если Сч = АбонентыДляРаспределения.ВГраница() Тогда
			ОбъемУслуги 									= ОсталосьРаспределить - Распределили;
		ИначеЕсли ДанныеПоУслуге.ВсегоПлощадьАбонентов = 0 Тогда
			ВызватьИсключение "Для МКД " + СокрЛП(МКД) + " не задана площадь помещений";	
		Иначе			
			кПлощади 										= ДанныеАбонента.ЗначениеПлощади / ДанныеПоУслуге.ВсегоПлощадьАбонентов;
			ОбъемУслуги 									= ОсталосьРаспределить * кПлощади;										
		КонецЕсли; 				
		
		Если ДанныеАбонента.НП Тогда 
			СтрокаНабора  									= НаборЗаписейНП.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.МКД 								= МКД;
			СтрокаНабора.Договор							= ДанныеАбонента.Договор;
			СтрокаНабора.ОбъектРасчета						= ДанныеАбонента.Абонент;
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.ВидНачисления 						= ВидНачисления;
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;			
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			СтрокаНабора.ОбъемУслуги						= ОбъемУслуги;
			СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
			Распределили 									= Распределили + СтрокаНабора.ОбъемУслуги;
		ИначеЕсли ЗначениеЗаполнено(ДанныеАбонента.Абонент) Тогда			
			ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа,Услуга,ДанныеАбонента.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
			ЗначениеТарифа 									= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
			СтрокаНабора  									= НаборЗаписей.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.ЧастныйСектор 						= Ложь;
			СтрокаНабора.Строение							= МКД;
			СтрокаНабора.Помещение							= ДанныеАбонента.Помещение;
			СтрокаНабора.Абонент							= ДанныеАбонента.Абонент;
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.ВидНачисления 						= ВидНачисления;
			СтрокаНабора.НаправлениеИспользованияТУ 		= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
			СтрокаНабора.Измеритель 						= Справочники.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка();
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
			
			СтрокаНабора.ЗначениеТарифа 					= ЗначениеТарифа.Значение;
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			СтрокаНабора.Сумма								= ОбъемУслуги * ЗначениеТарифа.Значение;
			СтрокаНабора.ОбъемУслуги						= ОбъемУслуги;
			СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
			Распределили 									= Распределили + СтрокаНабора.ОбъемУслуги;
			ЗаполнитьЗначенияСвойств(ОбщийОбъемНачислений.Добавить(), СтрокаНабора);			
		Иначе
			СтрокаНабора  									= НаборЗаписейПомещение.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.ЧастныйСектор 						= Ложь;
			СтрокаНабора.Строение							= МКД;
			СтрокаНабора.Помещение							= ДанныеАбонента.Помещение; // TODO FIX ME
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.ВидНачисления 						= ВидНачисления;
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			СтрокаНабора.ОбъемУслуги						= ОбъемУслуги;
			СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
			ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПомещений.Добавить(), СтрокаНабора);
			
			Распределили 									= Распределили + СтрокаНабора.ОбъемУслуги;
			
			РазделенныеЛицевыеСчета 						= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
			ПомещенияПотомки								= РазделенныеЛицевыеСчета[ДанныеАбонента.Помещение];
			СуммаПлощадейПомещения 							= 0;
			Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
				ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];
				СуммаПлощадейПомещения 						= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
			КонецЦикла;		
			
			Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
				ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];				                 		
				
				ХэшСтрокиТарифа 							= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
				ЗначениеТарифа 								= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
				СтрокаНабора  								= НаборЗаписей.Добавить();
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				СтрокаНабора.Район 							= Район;
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.Организация					= Организация;
				СтрокаНабора.ЧастныйСектор 					= Ложь;
				СтрокаНабора.Строение						= МКД;
				СтрокаНабора.Помещение						= ПомещениеПотомок.Ключ;
				СтрокаНабора.Абонент						= ДанныеПомещения.Абонент;
				СтрокаНабора.Услуга							= Услуга;
				СтрокаНабора.ТочкаУчета						= ПустаяТочкаУчета;
				СтрокаНабора.ВидНачисления 					= ВидНачисления;
				СтрокаНабора.СпособНачисления 				= СпособНачисленияОДН;
				СтрокаНабора.ЗначениеТарифа 				= ЗначениеТарифа.Значение;
				СтрокаНабора.Поставщик 						= ДанныеПомещения.Поставщик;
				СтрокаНабора.ПериодРасчета					= ПериодНачисления;
				СтрокаНабора.ПериодНачисления				= ПериодНачисления;
				СтрокаНабора.ЗначениеПлощади 				= ДанныеПомещения.ЗначениеПлощади;				
				СтрокаНабора.ОбъемУслуги 					= ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслуги * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);									
				СтрокаНабора.Сумма							= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;	  
	
	ДанныеПоУслуге.ОбщийОбъемНачислений						= ОбщийОбъемНачислений;
	ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений			= ОбщийОбъемНачисленийПомещений;
	
КонецПроцедуры

Процедура ПрочитатьВспомогательныеДанныеРаспределениеМКД(МВТ, Организация,ПериодНачисления,Район,Строение,ГраницыПериода )	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Строение",			Строение);
	Запрос.УстановитьПараметр("НачалоПериода",		ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",		ГраницыПериода.ЗавершениеОП);
	Запрос.УстановитьПараметр("Период",				ГраницыПериода.ЗавершениеОП - 1);
	Запрос.УстановитьПараметр("Поставщик",			Константы.энргПоставщикПоУмолчанию.Получить());
	Запрос.Текст 					= ТекстЗапросаВспомогательныеДанныеРаспределениеМКД(Строение);
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьРазделенныеЛицевыеСчета(КлючРазделенныеЛицевыеСчета, РазделенныеЛицевыеСчета, ВыборкаРазделенныеЛицевыеСчета, ВыборкаОбъемМКД)
	
	Пока ВыборкаРазделенныеЛицевыеСчета.Строение  = ВыборкаОбъемМКД.Строение Цикл
		
		Если ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель = null Тогда
			Если НЕ ВыборкаРазделенныеЛицевыеСчета.Следующий() Тогда
				Прервать;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель] = Неопределено Тогда													
			ЗначениеСоотвествия 			= Новый Структура(КлючРазделенныеЛицевыеСчета);
			ЗаполнитьЗначенияСвойств(ЗначениеСоотвествия,ВыборкаРазделенныеЛицевыеСчета);							
			СоотвествиеУслуга  				= Новый Соответствие;
			СоотвествиеУслуга.Вставить(ВыборкаРазделенныеЛицевыеСчета.Услуга,ЗначениеСоотвествия);
			СоотвествиеПомещение 			= Новый Соответствие;
			СоотвествиеПомещение.Вставить(ВыборкаРазделенныеЛицевыеСчета.Помещение,СоотвествиеУслуга);
			РазделенныеЛицевыеСчета.Вставить(ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель, СоотвествиеПомещение);
		ИначеЕсли РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель][ВыборкаРазделенныеЛицевыеСчета.Помещение] = Неопределено Тогда
			ЗначениеСоотвествия 			= Новый Структура(КлючРазделенныеЛицевыеСчета);
			ЗаполнитьЗначенияСвойств(ЗначениеСоотвествия,ВыборкаРазделенныеЛицевыеСчета);
			СоотвествиеУслуга  				= Новый Соответствие;
			СоотвествиеУслуга.Вставить(ВыборкаРазделенныеЛицевыеСчета.Услуга,ЗначениеСоотвествия);
			РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель].Вставить(ВыборкаРазделенныеЛицевыеСчета.Помещение,СоотвествиеУслуга);
		Иначе 	
			ЗначениеСоотвествия 			= Новый Структура(КлючРазделенныеЛицевыеСчета);
			ЗаполнитьЗначенияСвойств(ЗначениеСоотвествия,ВыборкаРазделенныеЛицевыеСчета);
			РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель][ВыборкаРазделенныеЛицевыеСчета.Помещение].Вставить(ВыборкаРазделенныеЛицевыеСчета.Услуга, ЗначениеСоотвествия);
		КонецЕсли;					
		
		Если НЕ ВыборкаРазделенныеЛицевыеСчета.Следующий() Тогда
			Прервать;
		КонецЕсли;						
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНаборыЗаписейПриРаспределении(Организация, ПериодНачисления, Район, Строение, Отказ, ДокументОбъект, ГраницыПериода, ТекстИсключения, НаборВыполненные, НаборЗаписей, НаборЗаписейНП, НаборЗаписейПомещений, НаборЗаписейСверхНорма, ЗамещатьНаборВыполненные)
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат
	КонецЕсли;
	
	Если (Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0) ИЛИ 
		(Не НаборЗаписейНП = Неопределено и НаборЗаписейНП.Количество() > 0) ИЛИ  
		(НЕ НаборЗаписейПомещений = Неопределено И НаборЗаписейПомещений.Количество() > 0) Или
		(НЕ НаборЗаписейСверхНорма = Неопределено И НаборЗаписейСверхНорма.Количество() > 0) Тогда
		
		НаборОтложенныхДвижений	= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
		НаборОтложенныхДвижений.Отбор.Организация.Установить(Организация);
		НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
		НаборОтложенныхДвижений.Отбор.Район.Установить(Район);
		НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.энргРазделыЗаписи.РаспределениеМКД);
		НаборОтложенныхДвижений.Отбор.ЧастныйСектор.Установить(Ложь);
		НаборОтложенныхДвижений.Отбор.Строение.Установить(Строение);
		НаборОтложенныхДвижений.Записать();					
		
		Попытка 					
			Если Не ДокументОбъект = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		Организация);
			НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				Район);
			НаборЗаписей.ДополнительныеСвойства.Вставить("Строение",    		Строение);
			НаборЗаписей.ДополнительныеСвойства.Вставить("ЧастныйСектор",  		Ложь);
			НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
			НаборЗаписей.Записать();
			
			НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("Организация", 		Организация);
			НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("Район",  			Район);
			НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("Строение",    		Строение);
			НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("ЧастныйСектор",  	Ложь);
			НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
			НаборЗаписейПомещений.Записать();						
			
			НаборЗаписейНП.ДополнительныеСвойства.Вставить("Организация", 		Организация);
			НаборЗаписейНП.ДополнительныеСвойства.Вставить("Район",  			Район);
			НаборЗаписейНП.ДополнительныеСвойства.Вставить("Строение",    		Строение);
			НаборЗаписейНП.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
			НаборЗаписейНП.Записать();  
			
			НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("Организация", 		Организация);
			НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("Район",  			Район);
			НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("Строение",    		Строение);
			НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
			НаборЗаписейСверхНорма.Записать();			
			
			Если НЕ НаборВыполненные = Неопределено Тогда
				НаборВыполненные.Записать(ЗамещатьНаборВыполненные);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			Отказ 									= Истина;
			ИнформацияОбОшибке 						= ИнформацияОбОшибке();
			ТекстИсключения 						= ТекстИсключения + ?(ПустаяСтрока(ТекстИсключения),"",Символы.ПС) + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеАбонентовДляРаспределения(ДанныеПоУслуге, ВыборкаАбоненты, ВыборкаОбъемМКД, ВыборкаОбъемПоПриборуКорректировать)
	перем ТекПомещение,ДанныеАбонента;
	
	мАбонентыДляРаспределения 								= ДанныеПоУслуге.АбонентыДляРаспределения;
	ПотреблениеАбонентов 									= ДанныеПоУслуге.ПотреблениеАбонентов;
	ПотреблениеАбонентовПоПрибору 							= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору;
	ВсегоПлощадьАбонентовПоПрибору 							= ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору;
	
	// Двигаем выборку абонентов
	Пока НЕ ВыборкаАбоненты.Строение = ВыборкаОбъемМКД.Строение ИЛИ НЕ ВыборкаАбоненты.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		Если НЕ ВыборкаАбоненты.Следующий() Тогда
			Прервать;
			ВыборкаАбоненты.сбросить();
		КонецЕсли;				
	КонецЦикла;
	
	ОбщийОбъемНачислений 									= ДанныеПоУслуге.ОбщийОбъемНачислений;
	ОбщийОбъемНачисленийПомещений							= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений;
	ВсеПоПрибору 											= ДанныеПоУслуге.УВсехАбонентовПоПрибору;
	ВсегоПлощадьАбонентовПоПрибору 							= ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору;
	ЕстьРасходПоПрибору 									= Ложь;
	
	Пока ВыборкаАбоненты.Строение = ВыборкаОбъемМКД.Строение и ВыборкаАбоненты.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		Если ЗначениеЗаполнено(ВыборкаАбоненты.Абонент) Тогда
			ЗаполнитьЗначенияСвойств(ОбщийОбъемНачислений.Добавить(), ВыборкаАбоненты);
		Иначе
			ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПомещений.Добавить(), ВыборкаАбоненты);
		КонецЕсли;
		
		Если НЕ ТекПомещение = ВыборкаАбоненты.Помещение Тогда
			Если Не ТекПомещение = Неопределено Тогда
				Если НЕ ДанныеАбонента.ПомещениеСРазделенными Тогда
					мАбонентыДляРаспределения.Добавить(ДанныеАбонента);
					ДанныеПоУслуге.ПлощадиАбонентов.Вставить(ТекПомещение,ДанныеАбонента.ЗначениеПлощади);
					Если ЕстьРасходПоПрибору Тогда
						ВсегоПлощадьАбонентовПоПрибору 		= ВсегоПлощадьАбонентовПоПрибору + ДанныеАбонента.ЗначениеПлощади; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ДанныеАбонента 									= Новый Структура("Договор, Абонент, Помещение,ЗначениеПлощади,
			|ТарифнаяГруппа, Поставщик, ОбъемУслуги, КоличествоЖильцов, НП, ПомещениеСРазделенными",
			ВыборкаАбоненты.Помещение, ВыборкаАбоненты.Абонент, ВыборкаАбоненты.Помещение, 
			ВыборкаАбоненты.ЗначениеПлощадиДляРаспределения,ВыборкаАбоненты.ТарифнаяГруппаДляРаспределения, 
			ВыборкаАбоненты.ПоставщикДляРаспределения, 0,ВыборкаАбоненты.КоличествоЖильцов, ВыборкаАбоненты.НП, ВыборкаАбоненты.ПомещениеСРазделенными);
			
			ЕстьРасходПоПрибору 							= Ложь;					
		КонецЕсли;				
		
		Если ВыборкаАбоненты.ЕстьИндивидуальныеНачисления Тогда 
			Если ВыборкаАбоненты.НП Тогда
				СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийДоговоров.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаАбоненты);						
				СтрокаСписатьИндивидуальные.ОбъектРасчета	= ВыборкаАбоненты.Абонент;
			Иначе
				СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийАбонентов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаАбоненты);
				
				Если НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
					И НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда							
					СтрокаНачисленияБезПрибора 				= ДанныеПоУслуге.НачисленияАбонентовБезПрибора.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты);							
				КонецЕсли;
				
				СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаАбоненты.ОбъемУслуги;
				СтрокаСписатьИндивидуальные.Сумма			= ВыборкаАбоненты.Сумма;
			КонецЕсли;
		Иначе
			СтрокаНачисленияБезПрибора 						= ДанныеПоУслуге.НачисленияАбонентовБезПрибора.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты);
		КонецЕсли;
		ДанныеАбонента.ОбъемУслуги 							= ДанныеАбонента.ОбъемУслуги + ВыборкаАбоненты.ОбъемУслуги; 
		
		Если НЕ ВыборкаАбоненты.ПомещениеСРазделенными Тогда 
			ПотреблениеАбонентов 							= ПотреблениеАбонентов + ВыборкаАбоненты.ОбъемУслуги;
		КонецЕсли;
		
		Если НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
			И НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему
			И НЕ ВыборкаАбоненты.ПомещениеСРазделенными Тогда
			ВсеПоПрибору 									= Ложь;
		ИначеЕсли НЕ ВыборкаАбоненты.ПомещениеСРазделенными Тогда
			ПотреблениеАбонентовПоПрибору 					= ПотреблениеАбонентовПоПрибору + ВыборкаАбоненты.ОбъемУслуги;
			ЕстьРасходПоПрибору 							= Истина;
		КонецЕсли;
		
		ТекПомещение 										= ВыборкаАбоненты.Помещение;
		
		Если НЕ ВыборкаАбоненты.Следующий() Тогда
			Прервать;
			ВыборкаАбоненты.сбросить();
		КонецЕсли; 				
	КонецЦикла; 			
	
	Если Не ТекПомещение = Неопределено Тогда
		Если НЕ ДанныеАбонента.ПомещениеСРазделенными Тогда
			мАбонентыДляРаспределения.Добавить(ДанныеАбонента);
			ДанныеПоУслуге.ПлощадиАбонентов.Вставить(ТекПомещение,ДанныеАбонента.ЗначениеПлощади);
			Если ЕстьРасходПоПрибору Тогда
				ВсегоПлощадьАбонентовПоПрибору 				= ВсегоПлощадьАбонентовПоПрибору + ДанныеАбонента.ЗначениеПлощади; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Пока ВыборкаОбъемПоПриборуКорректировать.Строение = ВыборкаОбъемМКД.Строение и ВыборкаОбъемПоПриборуКорректировать.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		Если НЕ ВыборкаОбъемПоПриборуКорректировать.Помещение = null Тогда
			ЗаполнитьЗначенияСвойств(ДанныеПоУслуге.ОбъемПоПриборуКорректировать.Добавить(), ВыборкаОбъемПоПриборуКорректировать);				
		КонецЕсли; 				
		Если НЕ ВыборкаОбъемПоПриборуКорректировать.Следующий() Тогда
			Прервать;
			ВыборкаОбъемПоПриборуКорректировать.сбросить();
		КонецЕсли; 				
	КонецЦикла;
	
	ДанныеПоУслуге.Вставить("ВсеПоПрибору", 				ВсеПоПрибору);
	ДанныеПоУслуге.ПотреблениеАбонентов 					= ПотреблениеАбонентов;
	ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору 			= ВсегоПлощадьАбонентовПоПрибору;
	ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору 			= ПотреблениеАбонентовПоПрибору;
	ДанныеПоУслуге.ОбщийОбъемНачислений						= ОбщийОбъемНачислений;
	ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений			= ОбщийОбъемНачисленийПомещений;
КонецПроцедуры

Процедура ПрочитатьНаборыДляЗаписиПриРаспределении(Организация, ПериодНачисления, Район, ВыборкаОбъемМКД, ГраницыПериода, ДокументОбъект, НаборВыполненные, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма, ЗамещатьНаборВыполненные)
	
	ДокументСсылка 								= ВыборкаОбъемМКД.ДокументРаспределения;			
	ЗамещатьНаборВыполненные 					= Истина;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
		ДокументСсылка 							= Документы.энргРаспределениеМКД.ПолучитьСсылку(Новый УникальныйИдентификатор());
		ДокументОбъект 							= Документы.энргРаспределениеМКД.СоздатьДокумент();
		ДокументОбъект.Район 					= Район;
		ДокументОбъект.МКД 						= ВыборкаОбъемМКД.Строение;
		ДокументОбъект.Дата 					= ГраницыПериода.ЗавершениеОП-1;
		ДокументОбъект.Организация				= Организация;
		ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
		
		НаборВыполненные 						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		ЗаписьВыполненные						= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 			= Организация;
		ЗаписьВыполненные.Район		 			= Район;
		ЗаписьВыполненные.ПериодНачисления 		= ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления	= Перечисления.энргВидыОперацийНачисления.РаспределениеМКД;
		ЗаписьВыполненные.МКД 					= ВыборкаОбъемМКД.Строение;
		ЗаписьВыполненные.ДокументНачисления 	= ДокументСсылка;
		ЗамещатьНаборВыполненные 				= Ложь;					
	Иначе
		ДокументОбъект 							= ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления 			= Ложь;
		
		НаборВыполненные 						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненные.Отбор.Организация.Установить(Организация);
		НаборВыполненные.Отбор.ПериодНачисления.Установить(ПериодНачисления);
		НаборВыполненные.Отбор.Район.Установить(Район);					
		НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.РаспределениеМКД);
		НаборВыполненные.Отбор.МКД.Установить(ВыборкаОбъемМКД.Строение);
		НаборВыполненные.Записать();
		
		ЗаписьВыполненные						= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 			= Организация;
		ЗаписьВыполненные.Район		 			= Район;
		ЗаписьВыполненные.ПериодНачисления 		= ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.РаспределениеМКД;
		ЗаписьВыполненные.МКД 					= ВыборкаОбъемМКД.Строение;
		ЗаписьВыполненные.ДокументНачисления 	= ДокументСсылка;
		ЗаписьВыполненные.ПометкаУдаления	 	= Ложь;
		
		НаборЗаписей 							= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Записать(); // очищаем набор записей
		
		НаборЗаписейПомещений					= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
		НаборЗаписейПомещений.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейПомещений.Записать(); // очищаем набор записей
		
		НаборЗаписейНП 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
		НаборЗаписейНП.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейНП.Записать(); // очищаем набор записей
		
		НаборЗаписейСверхНорма 					= РегистрыНакопления.энргОбъемНачисленийСверхнормативаМКД.СоздатьНаборЗаписей();
		НаборЗаписейСверхНорма.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейСверхНорма.Записать(); // очищаем набор записей
	КонецЕсли;
	
	НаборЗаписей 								= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	
	НаборЗаписейПомещений						= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
	НаборЗаписейПомещений.Отбор.Регистратор.Установить(ДокументСсылка);
	
	НаборЗаписейНП 								= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
	НаборЗаписейНП.Отбор.Регистратор.Установить(ДокументСсылка);
	
	НаборЗаписейСверхНорма 						= РегистрыНакопления.энргОбъемНачисленийСверхнормативаМКД.СоздатьНаборЗаписей();
	НаборЗаписейСверхНорма.Отбор.Регистратор.Установить(ДокументСсылка);
КонецПроцедуры

Процедура ЗаполнитьОбъемыМКДПриРаспределении(ВыборкаОбъемМКД, ДанныеПоУслуге)
	Если НЕ ВыборкаОбъемМКД.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам 
		И НЕ ВыборкаОбъемМКД.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
		
		Если ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = Неопределено Тогда
			ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны.Вставить(ВыборкаОбъемМКД.ТарифнаяЗона, ВыборкаОбъемМКД.ОбъемУслуги * ?(ВыборкаОбъемМКД.ПлощадьМОПУказана , 1 , ВыборкаОбъемМКД.ВсегоПлощадьАбонентов));
		Иначе
			ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] +  ВыборкаОбъемМКД.ОбъемУслуги * ?(ВыборкаОбъемМКД.ПлощадьМОПУказана , 1 , ВыборкаОбъемМКД.ВсегоПлощадьАбонентов);
		КонецЕсли;
		
		ДанныеПоУслуге.ОбъемБезПрибора		= ДанныеПоУслуге.ОбъемБезПрибора + ВыборкаОбъемМКД.ОбъемУслуги * ?(ВыборкаОбъемМКД.ПлощадьМОПУказана , 1 , ВыборкаОбъемМКД.ВсегоПлощадьАбонентов) ;
	Иначе
		
		Если ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = Неопределено Тогда
			ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны.Вставить(ВыборкаОбъемМКД.ТарифнаяЗона, ВыборкаОбъемМКД.ОбъемУслуги);
		Иначе
			ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] +  ВыборкаОбъемМКД.ОбъемУслуги;
		КонецЕсли;
		
		ДанныеПоУслуге.ОбъемПоПрибору 		= ДанныеПоУслуге.ОбъемПоПрибору + ВыборкаОбъемМКД.ОбъемУслуги;
	КонецЕсли;	
	ДанныеПоУслуге.ОбъемУслугиНорматив 		= ДанныеПоУслуге.ОбъемУслугиНорматив + ВыборкаОбъемМКД.ОбъемУслугиНорматив;
КонецПроцедуры

Процедура ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, Услуга, НачисленияПоУслугам) 
	СуммаРасходовПоУслуге  	= 0;
	
	Для Каждого СтрокаОбъема ИЗ ДанныеПоУслуге.ОбщийОбъемНачислений Цикл
		СуммаРасходовПоУслуге = СтрокаОбъема.ОбъемУслуги + СуммаРасходовПоУслуге;
	КонецЦикла;
	Для Каждого СтрокаОбъема ИЗ ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений Цикл
		СуммаРасходовПоУслуге = СтрокаОбъема.ОбъемУслуги + СуммаРасходовПоУслуге;
	КонецЦикла;
		
	ДанныеНачисленийПоУслуге = Новый Структура("ПотреблениеАбонентов,ПотреблениеПомещений",ДанныеПоУслуге.ОбщийОбъемНачислений,ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений);
	НачисленияПоУслугам.Вставить(Услуга, ДанныеНачисленийПоУслуге);
	
	Если ПараметрыРасчетаНорматива[Услуга] = Неопределено Тогда
		ОписаниеРасхода		= Новый Соответствие;
		ОписаниеРасхода.Вставить(ТипыНачислений["СуммаРасходовВсехПомещенийПоУслуге"], СуммаРасходовПоУслуге);
		ПараметрыРасчетаНорматива.Вставить(Услуга,ОписаниеРасхода);
	Иначе
		ПараметрыРасчетаНорматива[Услуга].Вставить(ТипыНачислений["СуммаРасходовВсехПомещенийПоУслуге"], СуммаРасходовПоУслуге);
	КонецЕсли;
	
	Если ПараметрыРасчетаНорматива[Услуга] = Неопределено Тогда
		ОписаниеРасхода		= Новый Соответствие;
		ОписаниеРасхода.Вставить(ТипыНачислений["РасходМКДПоУслуге"], ДанныеПоУслуге.ОбъемПоПрибору + ДанныеПоУслуге.ОбъемБезПрибора);
		ПараметрыРасчетаНорматива.Вставить(Услуга,ОписаниеРасхода);
	Иначе
		ПараметрыРасчетаНорматива[Услуга].Вставить(ТипыНачислений["РасходМКДПоУслуге"], ДанныеПоУслуге.ОбъемПоПрибору + ДанныеПоУслуге.ОбъемБезПрибора);
	КонецЕсли;
	
	Если ПараметрыРасчетаНорматива[Услуга] = Неопределено Тогда
		ОписаниеРасхода		= Новый Соответствие;
		ОписаниеРасхода.Вставить(ТипыНачислений["ЗначениеНормативаПоУслуге"], ДанныеПоУслуге.ЗначениеНорматива);
		ПараметрыРасчетаНорматива.Вставить(Услуга,ОписаниеРасхода);
	Иначе
		ПараметрыРасчетаНорматива[Услуга].Вставить(ТипыНачислений["ЗначениеНормативаПоУслуге"], ДанныеПоУслуге.ЗначениеНорматива);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда
		ФормулаРасчета 		= Новый Структура("Услуга, ФормулаРасчета, ЗависитОтУслуги", Услуга, ДанныеПоУслуге.ФормулаРасчетаНорматива, ДанныеПоУслуге.ЗависитОтУслуги);
		РассчитыватьНорматив.Добавить(ФормулаРасчета);
	КонецЕсли;
				
КонецПроцедуры

Процедура РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам, ЗначенияТарифов, ГраницыПериода,Отказ, НаборЗаписей, НаборЗаписейНП, НаборЗаписейПомещений)
	
	Для Сч = 0 По РассчитыватьНорматив.ВГраница() Цикл
		ЗначениеНорматива  									= Неопределено;
		ФормулаРасчета  									= РассчитыватьНорматив[Сч].ФормулаРасчета;
		Услуга 												= РассчитыватьНорматив[Сч].Услуга;
		ЗависитОтУслуги 									= РассчитыватьНорматив[Сч].ЗависитОтУслуги;
		Для Каждого КлючЗначение ИЗ ПараметрыРасчетаНорматива Цикл
			УслугаВФормуле									= КлючЗначение.Ключ;
			КлючУслуги 										= XMLСтрока(УслугаВФормуле);
			Для Каждого ТипыНачислений Из КлючЗначение.Значение Цикл
				ДанныеРасхода 								= "[" + ЗначениеВСтрокуВнутр(Новый Структура("ТипРасхода, Услуга", ТипыНачислений.Ключ, КлючУслуги)) + "]";
				ФормулаРасчета 								= СтрЗаменить(ФормулаРасчета,ДанныеРасхода,XMLСтрока(ТипыНачислений.Значение));
			КонецЦикла;			
		КонецЦикла;
		ФормулаРасчета 										= СтрЗаменить(ФормулаРасчета,"[Результат]","ЗначениеНорматива");
		Попытка
			Выполнить ФормулаРасчета;
		Исключение
			Отказ 											= Истина;			   
		КонецПопытки;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
		// Снимаем начисленные объемы потребления по услуге
		НачисленияПоУслуге	 								= НачисленияПоУслугам[Услуга].ПотреблениеАбонентов;
		Для Каждого СтрокаНачислений ИЗ НачисленияПоУслуге Цикл
			СтрокаСнимаем 									= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСнимаем, СтрокаНачислений);
			СтрокаСнимаем.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаСнимаем.Распределение 					= Истина;
			СтрокаСнимаем.Сумма 							= -СтрокаСнимаем.Сумма;
			СтрокаСнимаем.ОбъемУслуги 						= -СтрокаСнимаем.ОбъемУслуги;
			СтрокаСнимаем.ОбъемУслугиПотребленный 			= -СтрокаСнимаем.ОбъемУслугиПотребленный;
			СтрокаСнимаем.СуммаПоПовышенномуКоэффициенту 	= -СтрокаСнимаем.СуммаПоПовышенномуКоэффициенту;
		КонецЦикла;
		
		НачисленияПоУслуге	 								= НачисленияПоУслугам[ЗависитОтУслуги].ПотреблениеАбонентов;
		Для Каждого СтрокаНачислений ИЗ НачисленияПоУслуге Цикл
			ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(СтрокаНачислений.ТарифнаяГруппа,ЗависитОтУслуги,СтрокаНачислений.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки);
			ЗначениеТарифа 									= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
			
			СтрокаНачисляем									= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНачисляем, СтрокаНачислений);
			СтрокаНачисляем.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНачисляем.Распределение 					= Истина;
			СтрокаНачисляем.Услуга 							= Услуга;
			СтрокаНачисляем.НормаПотребления 				= ЗначениеНорматива;
			СтрокаНачисляем.ЗначениеТарифа 					= ?(ЗначениеТарифа.Значение = 0, СтрокаНачислений.ЗначениеТарифа, ЗначениеТарифа.Значение);
			СтрокаНачисляем.ОбъемУслуги 					= СтрокаНачислений.ОбъемУслуги * СтрокаНачисляем.НормаПотребления;
			СтрокаНачисляем.ОбъемУслугиПотребленный 		= СтрокаНачислений.ОбъемУслугиПотребленный* СтрокаНачисляем.НормаПотребления;
			СтрокаНачисляем.СуммаПоПовышенномуКоэффициенту 	= 0;
			СтрокаНачисляем.Сумма 							= СтрокаНачисляем.ЗначениеТарифа * СтрокаНачисляем.ОбъемУслуги;			
		КонецЦикла;		
	КонецЦикла;
		
КонецПроцедуры

Функция ХэшСтрокиТарифа(ТарифнаяГруппа,Услуга,Поставщик,ТарифнаяЗона)
	
	СтрокаХэш 				= "";
	СтрокаХэш 				= СтрокаХэш + ТарифнаяГруппа.УникальныйИдентификатор();
	СтрокаХэш 				= СтрокаХэш + Услуга.УникальныйИдентификатор();
	СтрокаХэш 				= СтрокаХэш + Поставщик.УникальныйИдентификатор();
	СтрокаХэш 				= СтрокаХэш + ТарифнаяЗона.УникальныйИдентификатор();
	
	Хэш 					= Новый ХешированиеДанных(ХешФункция.CRC32);
	Хэш.Добавить(СтрокаХэш);
	
	Возврат Хэш.ХешСумма;	
	
КонецФункции

Функция ДанныеПоУслугиДляРаспределения(ВыборкаОбъемМКД, РазделенныеЛицевыеСчета)
	ДанныеПоУслуге  									= Новый Структура;
	ДанныеПоУслуге.Вставить("ОбъемПоПрибору",								0);
	ДанныеПоУслуге.Вставить("ОбъемБезПрибора", 								0);
	ДанныеПоУслуге.Вставить("ОбъемУслугиНорматив", 							0);
	ДанныеПоУслуге.Вставить("РаспределятьПолностью", 						ВыборкаОбъемМКД.РаспределятьПолностью);
	ДанныеПоУслуге.Вставить("ЗначениеНорматива", 							ВыборкаОбъемМКД.ЗначениеНорматива);
	ДанныеПоУслуге.Вставить("ОбъемБезПрибораТарифныЗоны",					Новый Соответствие);
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуТарифныЗоны",					Новый Соответствие);
	ДанныеПоУслуге.Вставить("ПлощадиАбонентов",								Новый Соответствие);
	ДанныеПоУслуге.Вставить("ЗависитОтУслуги",								ВыборкаОбъемМКД.ЗависитОтУслуги);
	ДанныеПоУслуге.Вставить("ВидПлощади",									ВыборкаОбъемМКД.ВидПлощади);
	ДанныеПоУслуге.Вставить("РазделенныеЛицевыеСчета",						РазделенныеЛицевыеСчета);
	ДанныеПоУслуге.Вставить("АбонентыДляРаспределения", 					Новый Массив);
	ДанныеПоУслуге.Вставить("КорректироватьИндивидуальныйОбъемСУчетомОДПУ",	ВыборкаОбъемМКД.КорректироватьИндивидуальныйОбъемСУчетомОДПУ); 
	ДанныеПоУслуге.Вставить("ВсегоАбонентов", 								ВыборкаОбъемМКД.ВсегоАбонентов);
	ДанныеПоУслуге.Вставить("ВсегоСУстановелннымПриборомУчета", 			ВыборкаОбъемМКД.ВсегоСУстановелннымПриборомУчета);
	ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентов", 						ВыборкаОбъемМКД.ВсегоПлощадьАбонентов);
	ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентовПоПрибору", 				0);			
	ДанныеПоУслуге.Вставить("ПлощадьМОП", 									ВыборкаОбъемМКД.ПлощадьМОП);
	ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентовСобственнаяПоставка", 	ВыборкаОбъемМКД.ВсегоПлощадьАбонентовСобственнаяПоставка);
	ДанныеПоУслуге.Вставить("ДанныеНачисленийАбонентов", 					энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбщийОбъемНачислений", 						энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбщийОбъемНачисленийПомещений", 				энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("НачисленияАбонентовБезПрибора", 				энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуКорректировать", 				энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ДанныеНачисленийДоговоров", 					энргНачисления.ОписаниеТаблицыОбъемов("бестОбъемНачисленийНП"));
	ДанныеПоУслуге.Вставить("УВсехАбонентовПоПрибору", 						Истина);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентов", 						0);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовПоПрибору", 				0);
	ДанныеПоУслуге.Вставить("НеРаспределятьСверхнорматив", 					ВыборкаОбъемМКД.НеРаспределятьСверхнорматив);
	ДанныеПоУслуге.Вставить("ФормулаРасчетаНорматива",	 					ВыборкаОбъемМКД.ФормулаРасчетаНорматива);
	
	Возврат ДанныеПоУслуге;
КонецФункции

#КонецОбласти

